[
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.1581600504095778
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, one of the the worst, and still the most common, is the hapless father figure in sitcoms.  \n",
        "source": "user",
        "start_time": 11.0,
        "end_time": 54.0,
        "last_event_time": 54.0,
        "start_progress": 0.1581600504095778,
        "end_progress": 0.21613106490233144
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, one of the the worst, and still the most common, is the hapless father figure in sitcoms.   The dad who is a bumbling idiot, who can't do anything right, and is constantly being made fun of by his family.\n",
        "source": "api",
        "start_time": 72.0,
        "end_time": 72.0,
        "last_event_time": 72.0,
        "start_progress": 0.21613106490233144,
        "end_progress": 0.28733459357277885
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, one of the the worst, and still the most common, is the hapless father figure in sitcoms.   The dad who is a bumbling idiot, who can't do anything right, and is constantly being made fun of by his family.  The dad, that despite this, still has a younger, attractive, intelligent wife.  \n",
        "source": "user",
        "start_time": 74.0,
        "end_time": 105.0,
        "last_event_time": 105.0,
        "start_progress": 0.28733459357277885,
        "end_progress": 0.3390044108380592
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, one of the the worst, and still the most common, is the hapless father figure in sitcoms.   The dad who is a bumbling idiot, who can't do anything right, and is constantly being made fun of by his family.  The dad, that despite this, still has a younger, attractive, intelligent wife.   This is a stereotype that I think is still very much alive in today's sitcoms.\n",
        "source": "api",
        "start_time": 122.0,
        "end_time": 122.0,
        "last_event_time": 122.0,
        "start_progress": 0.3390044108380592,
        "end_progress": 0.38878386893509764
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, one of the the worst, and still the most common, is the hapless father figure in sitcoms.   The dad who is a bumbling idiot, who can't do anything right, and is constantly being made fun of by his family.  The dad, that despite this, still has a younger, attractive, intelligent wife.   This stereotype has been around almost since the advent of television, and certainly since the advent of sitcoms.  This is a stereotype that I think is still very much alive in today's sitcoms.  \n",
        "source": "user",
        "start_time": 124.0,
        "end_time": 213.0,
        "last_event_time": 213.0,
        "start_progress": 0.38878386893509764,
        "end_progress": 0.46250787649653435
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, one of the the worst, and still the most common, is the hapless father figure in sitcoms.   The dad who is a bumbling idiot, who can't do anything right, and is constantly being made fun of by his family.  The dad, that despite this, still has a younger, attractive, intelligent wife.   This stereotype has been around almost since the advent of television, and certainly since the advent of sitcoms.  This is a stereotype that I think is still very much alive in today's sitcoms.  It is such a common trope that there is even a new sitcom that plays with the idea and makes fun of it.\n",
        "source": "user",
        "start_time": 216.0,
        "end_time": 291.0,
        "last_event_time": 291.0,
        "start_progress": 0.46250787649653435,
        "end_progress": 0.5274102079395085
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, one of the the worst, and still the most common, is the hapless father figure in sitcoms.   The dad who is a bumbling idiot, who can't do anything right, and is constantly being made fun of by his family.  The dad, that despite this, still has a younger, attractive, intelligent wife.   This stereotype has been around almost since the advent of television, and certainly since the advent of sitcoms.  This is a stereotype that I think is still very much alive in today's sitcoms.  It is such a common trope that there is even a new sitcom that plays with the idea and makes fun of it.  For the most part it is harmless, \n",
        "source": "user",
        "start_time": 297.0,
        "end_time": 323.0,
        "last_event_time": 323.0,
        "start_progress": 0.5274102079395085,
        "end_progress": 0.5500945179584121
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, one of the the worst, and still the most common, is the hapless father figure in sitcoms.   The dad who is a bumbling idiot, who can't do anything right, and is constantly being made fun of by his family.  The dad, that despite this, still has a younger, attractive, intelligent wife.   This stereotype has been around almost since the advent of television, and certainly since the advent of sitcoms.  This is a stereotype that I think is still very much alive in today's sitcoms.  It is such a common trope that there is even a new sitcom that plays with the idea and makes fun of it.  For the most part it is harmless, but it is still a stereotype that I think is pretty bad.\n",
        "source": "api",
        "start_time": 332.0,
        "end_time": 332.0,
        "last_event_time": 332.0,
        "start_progress": 0.5500945179584121,
        "end_progress": 0.5853812224322621
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, one of the the worst, and still the most common, is the hapless father figure in sitcoms.   The dad who is a bumbling idiot, who can't do anything right, and is constantly being made fun of by his family.  The dad, that despite this, still has a younger, attractive, intelligent wife.   This stereotype has been around almost since the advent of television, and certainly since the advent of sitcoms.  This is a stereotype that I think is still very much alive in today's sitcoms.  It is such a common trope that there is even a new sitcom that plays with the idea and makes fun of it.  For the most part it is harmless, but it is still a stereotype that I think is pretty bad.  I suppose the figure must come from the writers and creators of the shows, typically men, and there must be some kind of wish fulfillment somewhere in its ever present appearance. \n",
        "source": "user",
        "start_time": 334.0,
        "end_time": 424.0,
        "last_event_time": 424.0,
        "start_progress": 0.5853812224322621,
        "end_progress": 0.7000630119722747
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, one of the the worst, and still the most common, is the hapless father figure in sitcoms.   The dad who is a bumbling idiot, who can't do anything right, and is constantly being made fun of by his family.  The dad, that despite this, still has a younger, attractive, intelligent wife.   This stereotype has been around almost since the advent of television, and certainly since the advent of sitcoms.  This is a stereotype that I think is still very much alive in today's sitcoms.  It is such a common trope that there is even a new sitcom that plays with the idea and makes fun of it.  For the most part it is harmless, but it is still a stereotype that I think is pretty bad.  I suppose the figure must come from the writers and creators of the shows, typically men, and there must be some kind of wish fulfillment somewhere in its ever present appearance.   Maybe it exists because of what people have been trained to expect, or it plays into the biases of the audience, or the person most likely to be picking what to watch.  \n",
        "source": "user",
        "start_time": 428.0,
        "end_time": 488.0,
        "last_event_time": 488.0,
        "start_progress": 0.7000630119722747,
        "end_progress": 0.8078134845620668
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, one of the the worst, and still the most common, is the hapless father figure in sitcoms.   The dad who is a bumbling idiot, who can't do anything right, and is constantly being made fun of by his family.  The dad, that despite this, still has a younger, attractive, intelligent wife.   This stereotype has been around almost since the advent of television, and certainly since the advent of sitcoms.  This is a stereotype that I think is still very much alive in today's sitcoms.  It is such a common trope that there is even a new sitcom that plays with the idea and makes fun of it.  For the most part it is harmless, but it is still a stereotype that I think is pretty bad.  I suppose the figure must come from the writers and creators of the shows, typically men, and there must be some kind of wish fulfillment somewhere in its ever present appearance.   Maybe it exists because of what people have been trained to expect, or it plays into the biases of the audience, or the person most likely to be picking what to watch.   I think it is a stereotype that is pretty bad, and I think it is one that should be retired.\n",
        "source": "api",
        "start_time": 504.0,
        "end_time": 504.0,
        "last_event_time": 504.0,
        "start_progress": 0.8078134845620668,
        "end_progress": 0.8664146187775678
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, one of the the worst, and still the most common, is the hapless father figure in sitcoms.   The dad who is a bumbling idiot, who can't do anything right, and is constantly being made fun of by his family.  The dad, that despite this, still has a younger, attractive, intelligent wife.   This stereotype has been around almost since the advent of television, and certainly since the advent of sitcoms.  This is a stereotype that I think is still very much alive in today's sitcoms.  It is such a common trope that there is even a new sitcom that plays with the idea and makes fun of it.  For the most part it is harmless, but it is still a stereotype that I think is pretty bad.  I suppose the figure must come from the writers and creators of the shows, typically men, and there must be some kind of wish fulfillment somewhere in its ever present appearance.   Maybe it exists because of what people have been trained to expect, or it plays into the biases of the audience, or the person most likely to be picking what to watch.   I think it is a stereotype that is pretty bad, and I think it is one that should be retired.  In this day and age, and with the progress many people in society want to soo happen, you would anticipate the end of this character.  However, here and now, this fictional character makes me cringe every time.\n",
        "source": "user",
        "start_time": 510.0,
        "end_time": 615.0,
        "last_event_time": 615.0,
        "start_progress": 0.8664146187775678,
        "end_progress": 1.0
    }
]