[
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.23247978436657682
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, absolutely, without a doubt being an active citenzen should involve relatively knowing about how the world works.\n",
        "source": "user",
        "start_time": 24.0,
        "end_time": 93.0,
        "last_event_time": 93.0,
        "start_progress": 0.23247978436657682,
        "end_progress": 0.30929919137466305
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, absolutely, without a doubt being an active citizen should involve relatively knowing about how the world works. Especially when you live in a democracy. In order to navigate the world and make rational descions you have to have knowledge of how certain things work. Right now there are a few ways to go about doing this and watching the news is a good way to learn about the world. \n",
        "source": "user",
        "start_time": 95.0,
        "end_time": 210.0,
        "last_event_time": 210.0,
        "start_progress": 0.30929919137466305,
        "end_progress": 0.4912398921832884
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, absolutely, without a doubt being an active citizen should involve relatively knowing about how the world works. Especially when you live in a democracy. In order to navigate the world and make rational descions you have to have knowledge of how certain things work. Right now there are a few ways to go about doing this and watching the news is a good way to learn about the world. It shows people the world outside their surrounding area. It gives insights into peoples lives that you would not normally have access to. It teaches us about our rights and options as a nation and civilization.\n",
        "source": "user",
        "start_time": 214.0,
        "end_time": 345.0,
        "last_event_time": 345.0,
        "start_progress": 0.4912398921832884,
        "end_progress": 0.633423180592992
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, absolutely, without a doubt being an active citizen should involve relatively knowing about how the world works. Especially when you live in a democracy. In order to navigate the world and make rational descions you have to have knowledge of how certain things work. Right now there are a few ways to go about doing this and watching the news is a good way to learn about the world. It shows people the world outside their surrounding area. It gives insights into peoples lives that you would not normally have access to. It teaches us about our rights and options as a nation and civilization. It shows us what is going on in the world and how it affects us.\n",
        "source": "api",
        "start_time": 368.0,
        "end_time": 368.0,
        "last_event_time": 368.0,
        "start_progress": 0.633423180592992,
        "end_progress": 0.6772237196765498
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, absolutely, without a doubt being an active citizen should involve relatively knowing about how the world works. Especially when you live in a democracy. In order to navigate the world and make rational descions you have to have knowledge of how certain things work. Right now there are a few ways to go about doing this and watching the news is a good way to learn about the world. It shows people the world outside their surrounding area. It gives insights into peoples lives that you would not normally have access to. It teaches us about our rights and options as a nation/civilization. The news shows us what is going on in the world in general and how it affects us. Without this information, we would not know about severe weather, local issues and especially international news and how it can affect us. \n",
        "source": "user",
        "start_time": 391.0,
        "end_time": 493.0,
        "last_event_time": 493.0,
        "start_progress": 0.6772237196765498,
        "end_progress": 0.7803234501347709
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, absolutely, without a doubt being an active citizen should involve relatively knowing about how the world works. Especially when you live in a democracy. In order to navigate the world and make rational desc ions you have to have knowledge of how certain things work. Right now there are a few ways to go about doing this and watching the news is a good way to learn about the world. It shows people the world outside their surrounding area. It gives insights into peoples lives that you would not normally have access to. It teaches us about our rights and options as a nation/civilization. The news shows us what is going on in the world in general and how it affects us. Without this information, we would not know about severe weather, local issues and especially international news and how it can affect us. \nI have to give this a hard yes, that in order to be a so called good citizen you need to stay informed atleast to some degree. Enough to know real news from fake news, what is subjective and objective and what is news and what is opinion. Once you have that, you have the tools to navigate life in a more informed, good way.\n",
        "source": "user",
        "start_time": 496.0,
        "end_time": 626.0,
        "last_event_time": 626.0,
        "start_progress": 0.7803234501347709,
        "end_progress": 1.0
    }
]