[
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.12067556524107872
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, I dont necessarily find it to be selfish to pursue risky sports like extreme mountain climbing. I think everyone who participates in a sport like that has their reasons why they do so. People who like these sort of extreme sports often have a need for that sort of adrenaline that they get when they participate in the sport. If they were not to be able to use the sport to get their adrenaline, i am sure they would just find another place to do it. Often times there are not many normal life events or activities that can fulfill this same purpose, and this is why people turn to these sports for that gap. While it can of course be very risky to do these types of activities, it is that person's choice at the end of the day. People are going to have the freedom to make their own choices regardless, and unless the mountain itself is closed down for climbing, i would assume people would engage in the activity. I think this can also give people a lot of fullfillment through the sport, and this in turn makes them a better person. People need a little risk in their lives sometimes to feel alive. If they have to climb a mountain to get their kick, or ride on a bike or skateboard really fast, why not let them do it? I am just not a big proponent on restricting anyones choice in this way, as long as they are not forcing other people to do the same activity or putting anyone into danger. Something like climbing, is an individual activity. If that person was to make the choice to go and do it, why not let them try? \n",
        "source": "user",
        "start_time": 6.0,
        "end_time": 287.0,
        "last_event_time": 287.0,
        "start_progress": 0.12067556524107872,
        "end_progress": 0.5363661127758104
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, I dont necessarily find it to be selfish to pursue risky sports like extreme mountain climbing. I think everyone who participates in a sport like that has their reasons why they do so. People who like these sort of extreme sports often have a need for that sort of adrenaline that they get when they participate in the sport. If they were not to be able to use the sport to get their adrenaline, i am sure they would just find another place to do it. Often times there are not many normal life events or activities that can fulfill this same purpose, and this is why people turn to these sports for that gap. While it can of course be very risky to do these types of activities, it is that person's choice at the end of the day. People are going to have the freedom to make their own choices regardless, and unless the mountain itself is closed down for climbing, i would assume people would engage in the activity. I think this can also give people a lot of fullfillment through the sport, and this in turn makes them a better person. People need a little risk in their lives sometimes to feel alive. If they have to climb a mountain to get their kick, or ride on a bike or skateboard really fast, why not let them do it? I am just not a big proponent on restricting anyones choice in this way, as long as they are not forcing other people to do the same activity or putting anyone into danger. Something like climbing, is an individual activity. If that person was to make the choice to go and do it, why not let them try? After all, they are trying to get some kind of fulfillment from doing this as opposed to doing other crazy stuff, and that seems like a positive thing\n",
        "source": "api",
        "start_time": 305.0,
        "end_time": 305.0,
        "last_event_time": 305.0,
        "start_progress": 0.5363661127758104,
        "end_progress": 0.5772269136475074
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, I dont necessarily find it to be selfish to pursue risky sports like extreme mountain climbing. I think everyone who participates in a sport like that has their reasons why they do so. People who like these sort of extreme sports often have a need for that sort of adrenaline that they get when they participate in the sport. If they were not to be able to use the sport to get their adrenaline, i am sure they would just find another place to do it. Often times there are not many normal life events or activities that can fulfill this same purpose, and this is why people turn to these sports for that gap. While it can of course be very risky to do these types of activities, it is that person's choice at the end of the day. People are going to have the freedom to make their own choices regardless, and unless the mountain itself is closed down for climbing, i would assume people would engage in the activity. I think this can also give people a lot of fullfillment through the sport, and this in turn makes them a better person. People need a little risk in their lives sometimes to feel alive. If they have to climb a mountain to get their kick, or ride on a bike or skateboard really fast, why not let them do it? I am just not a big proponent on restricting anyones choice in this way, as long as they are not forcing other people to do the same activity or putting anyone into danger. Something like climbing, is an individual activity. If that person was to make the choice to go and do it, why not let them try? After all, they are trying to get some kind of fulfillment from doing this as opposed to doing other crazy stuff, and that seems like a positive thing. In a way it is sort of like a coping mechanism. I am the same way to be honest. I played football all my life through college and when i stopped i realized how i had a gap in my life. I realized that i needed some sort of sport or something to keep my mind up, so i wouldnt feel like i was living some sort of monotonous life. Many times people who do sports like these have that sort of brain that needs this adrenaline rush. I got into boxing after college because i needed it. I needed something that challenged me both mentally and physically each and every day. It made me feel like i was growing, and made me feel like i was progressing as becoming a better person in life. \n",
        "source": "user",
        "start_time": 309.0,
        "end_time": 411.0,
        "last_event_time": 411.0,
        "start_progress": 0.5772269136475074,
        "end_progress": 0.763007354944157
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, I dont necessarily find it to be selfish to pursue risky sports like extreme mountain climbing. I think everyone who participates in a sport like that has their reasons why they do so. People who like these sort of extreme sports often have a need for that sort of adrenaline that they get when they participate in the sport. If they were not to be able to use the sport to get their adrenaline, i am sure they would just find another place to do it. Often times there are not many normal life events or activities that can fulfill this same purpose, and this is why people turn to these sports for that gap. While it can of course be very risky to do these types of activities, it is that person's choice at the end of the day. People are going to have the freedom to make their own choices regardless, and unless the mountain itself is closed down for climbing, i would assume people would engage in the activity. I think this can also give people a lot of fullfillment through the sport, and this in turn makes them a better person. People need a little risk in their lives sometimes to feel alive. If they have to climb a mountain to get their kick, or ride on a bike or skateboard really fast, why not let them do it? I am just not a big proponent on restricting anyones choice in this way, as long as they are not forcing other people to do the same activity or putting anyone into danger. Something like climbing, is an individual activity. If that person was to make the choice to go and do it, why not let them try? After all, they are trying to get some kind of fulfillment from doing this as opposed to doing other crazy stuff, and that seems like a positive thing. In a way it is sort of like a coping mechanism. I am the same way to be honest. I played football all my life through college and when i stopped i realized how i had a gap in my life. I realized that i needed some sort of sport or something to keep my mind up, so i wouldnt feel like i was living some sort of monotonous life. Many times people who do sports like these have that sort of brain that needs this adrenaline rush. I got into boxing after college because i needed it. I needed something that challenged me both mentally and physically each and every day. It made me feel like i was growing, and made me feel like i was progressing as becoming a better person in life. That is how these activities make us feel.\n",
        "source": "api",
        "start_time": 424.0,
        "end_time": 424.0,
        "last_event_time": 424.0,
        "start_progress": 0.763007354944157,
        "end_progress": 0.7744483791882321
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, I dont necessarily find it to be selfish to pursue risky sports like extreme mountain climbing. I think everyone who participates in a sport like that has their reasons why they do so. People who like these sort of extreme sports often have a need for that sort of adrenaline that they get when they participate in the sport. If they were not to be able to use the sport to get their adrenaline, i am sure they would just find another place to do it. Often times there are not many normal life events or activities that can fulfill this same purpose, and this is why people turn to these sports for that gap. While it can of course be very risky to do these types of activities, it is that person's choice at the end of the day. People are going to have the freedom to make their own choices regardless, and unless the mountain itself is closed down for climbing, i would assume people would engage in the activity. I think this can also give people a lot of fullfillment through the sport, and this in turn makes them a better person. People need a little risk in their lives sometimes to feel alive. If they have to climb a mountain to get their kick, or ride on a bike or skateboard really fast, why not let them do it? I am just not a big proponent on restricting anyones choice in this way, as long as they are not forcing other people to do the same activity or putting anyone into danger. Something like climbing, is an individual activity. If that person was to make the choice to go and do it, why not let them try? After all, they are trying to get some kind of fulfillment from doing this as opposed to doing other crazy stuff, and that seems like a positive thing. In a way it is sort of like a coping mechanism. I am the same way to be honest. I played football all my life through college and when i stopped i realized how i had a gap in my life. I realized that i needed some sort of sport or something to keep my mind up, so i wouldnt feel like i was living some sort of monotonous life. Many times people who do sports like these have that sort of brain that needs this adrenaline rush. I got into boxing after college because i needed it. I needed something that challenged me both mentally and physically each and every day. It made me feel like i was growing, and made me feel like i was progressing as becoming a better person in life. That is how these activities make us feel, and i dont think it is selfish whatsoever to take part in them. Now, depending on your skill level i would try to be smart about the challenge you take on. If you have never climbed a mountain before, and you want to try mount everest on a whim, and you have a family of eight back at home, and your a single parent. Well yea, this is probably selfish.  So every situation is different. If you are climbing for a positive reason than there is no issue with it at all. \n",
        "source": "user",
        "start_time": 426.0,
        "end_time": 500.0,
        "last_event_time": 500.0,
        "start_progress": 0.7744483791882321,
        "end_progress": 0.9022064832470716
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, I dont necessarily find it to be selfish to pursue risky sports like extreme mountain climbing. I think everyone who participates in a sport like that has their reasons why they do so. People who like these sort of extreme sports often have a need for that sort of adrenaline that they get when they participate in the sport. If they were not to be able to use the sport to get their adrenaline, i am sure they would just find another place to do it. Often times there are not many normal life events or activities that can fulfill this same purpose, and this is why people turn to these sports for that gap. While it can of course be very risky to do these types of activities, it is that person's choice at the end of the day. People are going to have the freedom to make their own choices regardless, and unless the mountain itself is closed down for climbing, i would assume people would engage in the activity. I think this can also give people a lot of fullfillment through the sport, and this in turn makes them a better person. People need a little risk in their lives sometimes to feel alive. If they have to climb a mountain to get their kick, or ride on a bike or skateboard really fast, why not let them do it? I am just not a big proponent on restricting anyones choice in this way, as long as they are not forcing other people to do the same activity or putting anyone into danger. Something like climbing, is an individual activity. If that person was to make the choice to go and do it, why not let them try? After all, they are trying to get some kind of fulfillment from doing this as opposed to doing other crazy stuff, and that seems like a positive thing. In a way it is sort of like a coping mechanism. I am the same way to be honest. I played football all my life through college and when i stopped i realized how i had a gap in my life. I realized that i needed some sort of sport or something to keep my mind up, so i wouldnt feel like i was living some sort of monotonous life. Many times people who do sports like these have that sort of brain that needs this adrenaline rush. I got into boxing after college because i needed it. I needed something that challenged me both mentally and physically each and every day. It made me feel like i was growing, and made me feel like i was progressing as becoming a better person in life. That is how these activities make us feel, and i dont think it is selfish whatsoever to take part in them. Now, depending on your skill level i would try to be smart about the challenge you take on. If you have never climbed a mountain before, and you want to try mount everest on a whim, and you have a family of eight back at home, and your a single parent. Well yea, this is probably selfish.  So every situation is different. If you are climbing for a positive reason than there is no issue with it at all. Selfishness in this sense would be selfishness because you are putting your own interests at the top of the ladder.\n",
        "source": "api",
        "start_time": 528.0,
        "end_time": 528.0,
        "last_event_time": 528.0,
        "start_progress": 0.9022064832470716,
        "end_progress": 0.933533097248706
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, I dont necessarily find it to be selfish to pursue risky sports like extreme mountain climbing. I think everyone who participates in a sport like that has their reasons why they do so. People who like these sort of extreme sports often have a need for that sort of adrenaline that they get when they participate in the sport. If they were not to be able to use the sport to get their adrenaline, i am sure they would just find another place to do it. Often times there are not many normal life events or activities that can fulfill this same purpose, and this is why people turn to these sports for that gap. While it can of course be very risky to do these types of activities, it is that person's choice at the end of the day. People are going to have the freedom to make their own choices regardless, and unless the mountain itself is closed down for climbing, i would assume people would engage in the activity. I think this can also give people a lot of fullfillment through the sport, and this in turn makes them a better person. People need a little risk in their lives sometimes to feel alive. If they have to climb a mountain to get their kick, or ride on a bike or skateboard really fast, why not let them do it? I am just not a big proponent on restricting anyones choice in this way, as long as they are not forcing other people to do the same activity or putting anyone into danger. Something like climbing, is an individual activity. If that person was to make the choice to go and do it, why not let them try? After all, they are trying to get some kind of fulfillment from doing this as opposed to doing other crazy stuff, and that seems like a positive thing. In a way it is sort of like a coping mechanism. I am the same way to be honest. I played football all my life through college and when i stopped i realized how i had a gap in my life. I realized that i needed some sort of sport or something to keep my mind up, so i wouldnt feel like i was living some sort of monotonous life. Many times people who do sports like these have that sort of brain that needs this adrenaline rush. I got into boxing after college because i needed it. I needed something that challenged me both mentally and physically each and every day. It made me feel like i was growing, and made me feel like i was progressing as becoming a better person in life. That is how these activities make us feel, and i dont think it is selfish whatsoever to take part in them. Now, depending on your skill level i would try to be smart about the challenge you take on. If you have never climbed a mountain before, and you want to try mount everest on a whim, and you have a family of eight back at home, and your a single parent. Well yea, this is probably selfish.  So every situation is different. If you are climbing for a positive reason than there is no issue with it at all. In the sense of putting climbing ahead of your family, this is selfish because you are putting your own interests at the top of the ladder. You know you need to support your family, and if you go who is going to. This is just not a realistic or smart risk. So in conclusion, i feel that it is not selfish to pursue risky sports like extreme mountain climbing.\n",
        "source": "user",
        "start_time": 544.0,
        "end_time": 603.0,
        "last_event_time": 603.0,
        "start_progress": 0.933533097248706,
        "end_progress": 1.0
    }
]