[
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.10676307954062102
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n Stereotypical characters in books, movies, or television shows that makes me cringe are ones that are bascially offensive \n",
        "source": "user",
        "start_time": 2.0,
        "end_time": 29.0,
        "last_event_time": 29.0,
        "start_progress": 0.10676307954062102,
        "end_progress": 0.15270097830710336
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n Stereotypical characters in books, movies, or television shows that makes me cringe are ones that are bascially offensive to a group of people in some way.\n",
        "source": "api",
        "start_time": 41.0,
        "end_time": 41.0,
        "last_event_time": 41.0,
        "start_progress": 0.15270097830710336,
        "end_progress": 0.16673755848575075
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n Stereotypical characters in books, movies, or television shows that makes me cringe are ones that are basically offensive to a group of people in some way. Especially characters that demean or reduce racial groups to negative traits, or even traits that puts them on a pedestal. I think especially that \n",
        "source": "user",
        "start_time": 43.0,
        "end_time": 89.0,
        "last_event_time": 89.0,
        "start_progress": 0.16673755848575075,
        "end_progress": 0.22968949383241175
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n Stereotypical characters in books, movies, or television shows that makes me cringe are ones that are basically offensive to a group of people in some way. Especially characters that demean or reduce racial groups to negative traits, or even traits that puts them on a pedestal. I think I especially cringe regarding many stereotypical characters that end up making fun of minorities, either based on race, gender, and sexuality. I think these characters effectively hurt others especially when they get compared to them by others, and in general I can empthasize with their struggles. \n",
        "source": "user",
        "start_time": 93.0,
        "end_time": 215.0,
        "last_event_time": 215.0,
        "start_progress": 0.22968949383241175,
        "end_progress": 0.3500638026371757
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n Stereotypical characters in books, movies, or television shows that makes me cringe are ones that are basically offensive to a group of people in some way. Especially characters that demean or reduce racial groups to negative traits, or even traits that puts them on a pedestal. I think I especially cringe regarding many stereotypical characters that end up making fun of minorities, either based on race, gender, and sexuality. I think these characters effectively hurt others especially when they get compared to them by others, and in general I can empthasize with their struggles. In terms of whether I would ever not watch or read something because of its offensive portrayal of someone, the answer would be effectively yes. While I can understand that some depictions in past movies are based on the era and mindsets that were prevalent in said time period, I would rather not watch it based on how uncomfortable and negative I would feel from watching such offensive portrayal of people. In addition, \n",
        "source": "user",
        "start_time": 218.0,
        "end_time": 326.0,
        "last_event_time": 326.0,
        "start_progress": 0.3500638026371757,
        "end_progress": 0.5299872394725649
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n Stereotypical characters in books, movies, or television shows that makes me cringe are ones that are basically offensive to a group of people in some way. Especially characters that demean or reduce racial groups to negative traits, or even traits that puts them on a pedestal. I think I especially cringe regarding many stereotypical characters that end up making fun of minorities, either based on race, gender, and sexuality. I think these characters effectively hurt others especially when they get compared to them by others, and in general I can empthasize with their struggles. In terms of whether I would ever not watch or read something because of its offensive portrayal of someone, the answer would be effectively yes. While I can understand that some depictions in past movies are based on the era and mindsets that were prevalent in said time period, I would rather not watch it based on how uncomfortable and negative I would feel from watching such offensive portrayal of people. In addition, I would say the same amount modern shows or content. I would rather stop watching a show or movie if I ended up feeling uncomfortable from watching it, more so if it stems from a stereotypical character. There is plenty of shows and movies I can watch that does not rely on stereotypes for its characters, and books I can read that do portray people in a negative manner. \n",
        "source": "user",
        "start_time": 328.0,
        "end_time": 442.0,
        "last_event_time": 442.0,
        "start_progress": 0.5299872394725649,
        "end_progress": 0.6882177796682263
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n Stereotypical characters in books, movies, or television shows that makes me cringe are ones that are basically offensive to a group of people in some way. Especially characters that demean or reduce racial groups to negative traits, or even traits that puts them on a pedestal. I think I especially cringe regarding many stereotypical characters that end up making fun of minorities, either based on race, gender, and sexuality. I think these characters effectively hurt others especially when they get compared to them by others, and in general I can empthasize with their struggles. In terms of whether I would ever not watch or read something because of its offensive portrayal of someone, the answer would be effectively yes. While I can understand that some depictions in past movies are based on the era and mindsets that were prevalent in said time period, I would rather not watch it based on how uncomfortable and negative I would feel from watching such offensive portrayal of people. In addition, I would say the same amount modern shows or content. I would rather stop watching a show or movie if I ended up feeling uncomfortable from watching it, more so if it stems from a stereotypical character. There is plenty of shows and movies I can watch that does not rely on stereotypes for its characters, and books I can read that do portray people in a negative manner. For the most part, authors, directors, and writers can make content for people that is respectful and depicts people in a realistic manner. That doesn't mean the content they write needs to not delve into serious topics or\n",
        "source": "user",
        "start_time": 444.0,
        "end_time": 506.0,
        "last_event_time": 506.0,
        "start_progress": 0.6882177796682263,
        "end_progress": 0.7826456826882178
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n Stereotypical characters in books, movies, or television shows that makes me cringe are ones that are basically offensive to a group of people in some way. Especially characters that demean or reduce racial groups to negative traits, or even traits that puts them on a pedestal. I think I especially cringe regarding many stereotypical characters that end up making fun of minorities, either based on race, gender, and sexuality. I think these characters effectively hurt others especially when they get compared to them by others, and in general I can empthasize with their struggles. In terms of whether I would ever not watch or read something because of its offensive portrayal of someone, the answer would be effectively yes. While I can understand that some depictions in past movies are based on the era and mindsets that were prevalent in said time period, I would rather not watch it based on how uncomfortable and negative I would feel from watching such offensive portrayal of people. In addition, I would say the same amount modern shows or content. I would rather stop watching a show or movie if I ended up feeling uncomfortable from watching it, more so if it stems from a stereotypical character. There is plenty of shows and movies I can watch that does not rely on stereotypes for its characters, and books I can read that do portray people in a negative manner. For the most part, authors, directors, and writers can make content for people that is respectful and depicts people in a realistic manner. That doesn't mean the content they write needs to not delve into serious topics or touch on controversial issues, but at the same time it does mean they should use characters that are relatable and realistic to their audience.\n",
        "source": "api",
        "start_time": 517.0,
        "end_time": 517.0,
        "last_event_time": 517.0,
        "start_progress": 0.7826456826882178,
        "end_progress": 0.8438962143768609
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n Stereotypical characters in books, movies, or television shows that makes me cringe are ones that are basically offensive to a group of people in some way. Especially characters that demean or reduce racial groups to negative traits, or even traits that puts them on a pedestal. I think I especially cringe regarding many stereotypical characters that end up making fun of minorities, either based on race, gender, and sexuality. I think these characters effectively hurt others especially when they get compared to them by others, and in general I can empthasize with their struggles. In terms of whether I would ever not watch or read something because of its offensive portrayal of someone, the answer would be effectively yes. While I can understand that some depictions in past movies are based on the era and mindsets that were prevalent in said time period, I would rather not watch it based on how uncomfortable and negative I would feel from watching such offensive portrayal of people. In addition, I would say the same amount modern shows or content. I would rather stop watching a show or movie if I ended up feeling uncomfortable from watching it, more so if it stems from a stereotypical character. There is plenty of shows and movies I can watch that does not rely on stereotypes for its characters, and books I can read that do portray people in a negative manner. For the most part, authors, directors, and writers can make content for people that is respectful and depicts people in a realistic manner. That doesn't mean the content they write needs cannot delve into serious topics or touch on controversial issues, but at the same time it does mean they should use characters that are relatable and realistic to their audience. Although stereotypes persist in society and are perpetuated by many, they do not need to be shown in the media people consume in their daily lives. \n",
        "source": "user",
        "start_time": 546.0,
        "end_time": 594.0,
        "last_event_time": 594.0,
        "start_progress": 0.8443215652913654,
        "end_progress": 0.9072735006380264
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n Stereotypical characters in books, movies, or television shows that makes me cringe are ones that are basically offensive to a group of people in some way. Especially characters that demean or reduce racial groups to negative traits, or even traits that puts them on a pedestal. I think I especially cringe regarding many stereotypical characters that end up making fun of minorities, either based on race, gender, and sexuality. I think these characters effectively hurt others especially when they get compared to them by others, and in general I can emphasize with their struggles. In terms of whether I would ever not watch or read something because of its offensive portrayal of someone, the answer would be effectively yes. While I can understand that some depictions in past movies are based on the era and mindsets that were prevalent in said time period, I would rather not watch it based on how uncomfortable and negative I would feel from watching such offensive portrayal of people. In addition, I would say the same amount modern shows or content. I would rather stop watching a show or movie if I ended up feeling uncomfortable from watching it, more so if it stems from a stereotypical character. There is plenty of shows and movies I can watch that does not rely on stereotypes for its characters, and books I can read that do portray people in a negative manner. For the most part, authors, directors, and writers can make content for people that is respectful and depicts people in a realistic manner. That doesn't mean the content they write needs cannot delve into serious topics or touch on controversial issues, but at the same time it does mean they should use characters that are relatable and realistic to their audience. Although stereotypes persist in society and are perpetuated by many, they do not need to be shown in the media people consume in their daily lives. Stereotypes ought to be confronted by people in society and reduced until it no longer affects the people in negative manners, this includes the ones that many pieces of media and entertainment still unfortunately show.\n",
        "source": "user",
        "start_time": 596.0,
        "end_time": 682.0,
        "last_event_time": 682.0,
        "start_progress": 0.9072735006380264,
        "end_progress": 1.0
    }
]