[
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.1236697247706422
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important thing that I learned in school was mathematics.  Mathematics helped lead me to computer science as I loved solving problems and learning formulas. I majored in Computer Science in college and work in that area now as a 30 year old.\n\nI knew that math was my favorite subject from a very early age. It was also one that came most naturally to me. I remember being in class and always finishing problems first. I remember never really struggling with anything math related besides artificial intelligence related calculus courses in college.\n\nSo while math was my favorite subject, I think the thing that I took from school is to figure out what you're passionate about. Some people are passionate about school. Some people are passionate about sports. Some people are passionate about television.\n\nWhatever it is that you're passionate about, try to find a job related to it. I know from first hand experience that when your job involves something you're passionate about and something you love...it never really feels like a job. I look forward to going to work each day and tackling new projects. Maybe I'll outgrow that one day but inside I'm still that little kid that loves the feeling of solving a problem and getting it right.\n\nI also think there are many things that school teaches us that have a major affect on the rest of our lives. For example, we'd be lost without learning the English language. We wouldn't be able to communicate with one another. Without science we wouldn't understand how so many different things work including the human body and the brain. Without history, we'd make mistakes that could have been prevented. \n\nSchool also teaches us how to respect others and how to socialize with others. When we're in school we are surrounded by hundreds of our peers. When one child is speaking to the class, you don't hear the other children yelling or screaming or interrupting. That's because they would get in trouble for doing so. That's teaching a child respect for others. It's one of the most important things that you can learn in life. Respect for yourself and respect for others. \n\nSchool is such a valuable place. You learn essential things, you meet essential people and you grow and mature over time. School is important, so if you are a student, make sure that you take it seriously and enjoy it because it's done before you know it. \n",
        "source": "user",
        "start_time": 21.0,
        "end_time": 547.0,
        "last_event_time": 547.0,
        "start_progress": 0.1236697247706422,
        "end_progress": 1.0
    }
]