[
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.15465810004589262
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important thing that you can learn from school is how you respond to the experience. Everyone's perception is different and each person takes something different away from the experience. I learned personally that school wasn't for me. I excelled in certain subjects and learned that I wanted to use those skills in my life. For example, I learned that I loved writing. Rather than going to college, I just decided to do write in my spare time. I've used it in many different areas through my life and that has worked out for me.\n\n\n",
        "source": "user",
        "start_time": 22.0,
        "end_time": 176.0,
        "last_event_time": 176.0,
        "start_progress": 0.15465810004589262,
        "end_progress": 0.40293712712253327
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important thing that you can learn from school is how you respond to the experience. Everyone's perception is different and each person takes something different away from the experience. I learned personally that school wasn't for me. I excelled in certain subjects and learned that I wanted to use those skills in my life. For example, I learned that I loved writing. Rather than going to college, I just decided to do write in my spare time. I've used it in many different areas through my life and that has worked out for me.\n\n\n\nI also learned that I didn't want to go to college.\n",
        "source": "api",
        "start_time": 193.0,
        "end_time": 193.0,
        "last_event_time": 193.0,
        "start_progress": 0.40293712712253327,
        "end_progress": 0.4272602111060119
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important thing that you can learn from school is how you respond to the experience. Everyone's perception is different and each person takes something different away from the experience. I learned personally that school wasn't for me. I excelled in certain subjects and learned that I wanted to use those skills in my life. For example, I learned that I loved writing. \n\nI also learned that I didn't want to go to college. Rather than going to college, I just decided to write in my spare time. I've used it in many different areas of my life and that has worked out for me. I think that school really is just a journey of figuring out what personally works for you. \n\nSome people will have the opposite experience and will learn that they have a love for learning. They want to continue to pursue learning and will go to college. For them, that is the best choice and makes them the happiest. \n\nThere is no set thing that one student should learn in school. The basics are already covered so you will know the basics to succeed in life by the time you leave high school. What really is unique to each student is where you want to go from there. That's why students need to just spend time trying to figure out if they like structured learning or if they want to be more of free spirits and pursue things on their own. \n\nWhat really ends up mattering is if students are happy with their decision. Their experiences should guide them to finding out who they really are. People often say that college is where you find yourself, but I do not think that is correct. College is where certain people find themselves. Other people who decided not to go already know that a different path is for them and are finding themselves in an entirely different way. No one way is correct, it all just comes down to finding your own path in life. \n",
        "source": "user",
        "start_time": 195.0,
        "end_time": 614.0,
        "last_event_time": 614.0,
        "start_progress": 0.4272602111060119,
        "end_progress": 1.0
    }
]