[
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.3138918345705196
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so? \n\n---\n\nIn my opinion, I believe that people think animals are so innocent and they cannot fend for themselves. Humans are a scum race and they are on top of the food chain and can actually protect themselves from abuse or beatings and can actually do something about it. \n",
        "source": "user",
        "start_time": 53.0,
        "end_time": 120.0,
        "last_event_time": 120.0,
        "start_progress": 0.3138918345705196,
        "end_progress": 0.4469777306468717
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so? \n\n---\n\nIn my opinion, I believe that people think animals are so innocent and they cannot fend for themselves. Humans are a scum race and they are on top of the food chain and can actually protect themselves from abuse or beatings and can actually do something about it. Sometimes and not always there is always the human is beaten and therefore deserved, but a dog is almost always innocent and cannot do anything about the beatings if its coming from the owner or an abusive person. \n",
        "source": "user",
        "start_time": 128.0,
        "end_time": 229.0,
        "last_event_time": 229.0,
        "start_progress": 0.4469777306468717,
        "end_progress": 0.5604453870625663
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so? \n\n---\n\nIn my opinion, I believe that people think animals are so innocent and they cannot fend for themselves. Humans are a scum race and they are on top of the food chain and can actually protect themselves from abuse or beatings and can actually do something about it. Sometimes and not always there is always the human is beaten and therefore deserved, but a dog is almost always innocent and cannot do anything about the beatings if its coming from the owner or an abusive person. There is also the saying that a dog is a mans best friend so that means that dogs are almost always innocent . But i believe that people should also be concerned about humans being beaten because sometimes it can come from a situation they cannot get out of like domestic violence and sometimes needs the help that they desire but cannot get it. People in the whole are scumbags and are not to be trusted so i could see why humans prefer a human to be beaten with a bat rather than a dog because dogs aver very defenseless. But i also believe if its gonna go both ways the government should also do more to protect humans the public as a whole. Like make public services easily available to those that are suffering from violence at home. Maybe set up an anonymous hotline where people can report or text and take it from there. \n",
        "source": "user",
        "start_time": 233.0,
        "end_time": 565.0,
        "last_event_time": 565.0,
        "start_progress": 0.5604453870625663,
        "end_progress": 1.0
    }
]