[
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.2734411085450346
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion, human's put too much human emotion onto their animals or other similar animals. They anthropomorphize them and think they hurt and suffer the way humans do. \n",
        "source": "user",
        "start_time": 20.0,
        "end_time": 78.0,
        "last_event_time": 78.0,
        "start_progress": 0.2734411085450346,
        "end_progress": 0.3464203233256351
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion, human's put too much human emotion onto their animals or other similar animals. They anthropomorphize them and think they hurt and suffer the way humans do. I think it is wrong to focus on animal welfare when humans are suffering because humans are more important.\n",
        "source": "api",
        "start_time": 94.0,
        "end_time": 94.0,
        "last_event_time": 94.0,
        "start_progress": 0.3464203233256351,
        "end_progress": 0.3958429561200924
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion, human's put too much human emotion onto their animals or other similar animals. They anthropomorphize them and think they hurt and suffer the way humans do. I think it is wrong to focus on animal welfare when humans are suffering because humans are more important. I could go into how God promotes this notion but that would end this debate in an instant and the atheist out there would dismiss it out of ignorance. I think people see their dogs and cats as part of the family when in reality they are just using us for food and shelter while we are the ones that give their actions purpose and most are geared towards us humans. Does a worm scream when you put a hook through it? No, it does not understand what it is feeling and does not understand the concept of death so its just an inconvenience until it is eaten by a fish in the natural cycle of things. Dogs came to be because we fed them when they came around and eventually the dogs realized it was in their best interest to co exist with man and they did not because they agreed upon it but because their instincts led them in that direction. \n",
        "source": "user",
        "start_time": 100.0,
        "end_time": 484.0,
        "last_event_time": 484.0,
        "start_progress": 0.3958429561200924,
        "end_progress": 0.7838337182448037
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion, human's put too much human emotion onto their animals or other similar animals. They anthropomorphize them and think they hurt and suffer the way humans do. I think it is wrong to focus on animal welfare when humans are suffering because humans are more important. I could go into how God promotes this notion but that would end this debate in an instant and the atheist out there would dismiss it out of ignorance. I think people see their dogs and cats as part of the family when in reality they are just using us for food and shelter while we are the ones that give their actions purpose and most are geared towards us humans. Does a worm scream when you put a hook through it? No, it does not understand what it is feeling and does not understand the concept of death so its just an inconvenience until it is eaten by a fish in the natural cycle of things. Dogs came to be because we fed them when they came around and eventually the dogs realized it was in their best interest to co exist with man and they did not because they agreed upon it but because their instincts led them in that direction. They are not our equals and they will never be.\n",
        "source": "api",
        "start_time": 499.0,
        "end_time": 499.0,
        "last_event_time": 499.0,
        "start_progress": 0.7838337182448037,
        "end_progress": 0.8055427251732101
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion, human's put too much human emotion onto their animals or other similar animals. They anthropomorphize them and think they hurt and suffer the way humans do. I think it is wrong to focus on animal welfare when humans are suffering because humans are more important. I could go into how God promotes this notion but that would end this debate in an instant and the atheist out there would dismiss it out of ignorance. I think people see their dogs and cats as part of the family when in reality they are just using us for food and shelter while we are the ones that give their actions purpose and most are geared towards us humans. Does a worm scream when you put a hook through it? No, it does not understand what it is feeling and does not understand the concept of death so its just an inconvenience until it is eaten by a fish in the natural cycle of things. Dogs came to be because we fed them when they came around and eventually the dogs realized it was in their best interest to co exist with man and they did not because they agreed upon it but because their instincts led them in that direction. They are not our equals and they will never be. It that simple. They do not feel as we feel, they do not suffer as we suffer and the circle of life has been going on since the creation of the earth. We kill and eat animals while other animals do the same to lesser creatures. Whether go or evolution is responsible for us being at the very top of the food chain is irrelevant, what counts is that we are there and it is our right to use animals in any way we see fit. \n",
        "source": "user",
        "start_time": 502.0,
        "end_time": 647.0,
        "last_event_time": 647.0,
        "start_progress": 0.8055427251732101,
        "end_progress": 1.0
    }
]