[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.14896650035637918
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. The film is your life, and you are the star.\n",
        "source": "api",
        "start_time": 37.0,
        "end_time": 37.0,
        "last_event_time": 37.0,
        "start_progress": 0.1496792587312901,
        "end_progress": 0.1810406272273699
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. The film is your life, and you are the star. You see yourself as a baby, as a child, as a teenager, as a young adult, and so on.\n",
        "source": "api",
        "start_time": 56.0,
        "end_time": 56.0,
        "last_event_time": 56.0,
        "start_progress": 0.18175338560228083,
        "end_progress": 0.24091233071988596
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \nThe film is my life, and I am the star. I see myself as a baby, as a child, as a teenager, as a young adult, and so on. When I am an adult, I am a woman who  \n",
        "source": "user",
        "start_time": 60.0,
        "end_time": 139.0,
        "last_event_time": 139.0,
        "start_progress": 0.24091233071988596,
        "end_progress": 0.26300784034212404
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \nThe film is my life, and I am the star. I see myself as a baby, as a child, as a teenager, as a young adult, and so on. When I am an adult, I am a woman who is a movie star in real life.   \n",
        "source": "user",
        "start_time": 147.0,
        "end_time": 184.0,
        "last_event_time": 184.0,
        "start_progress": 0.26300784034212404,
        "end_progress": 0.2851033499643621
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \nThe film is my life, and I am the star. I see myself as a baby, as a child, as a teenager, as a young adult, and so on. When I am an adult, I am a woman who is a movie star in real life.    I am very famous and very rich.\n",
        "source": "api",
        "start_time": 195.0,
        "end_time": 195.0,
        "last_event_time": 195.0,
        "start_progress": 0.2851033499643621,
        "end_progress": 0.30791161796151106
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \nThe film is my life, and I am the star. I see myself as a baby, as a child, as a teenager, as a young adult, and so on. When I am an adult, I am a woman who is a movie star in real life.  I am very famous and very rich. I own a jet and a helicopter and have a huge mansion. \n",
        "source": "user",
        "start_time": 199.0,
        "end_time": 217.0,
        "last_event_time": 217.0,
        "start_progress": 0.30791161796151106,
        "end_progress": 0.34568781183178904
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \nThe film is my life, and I am the star. I see myself as a baby, as a child, as a teenager, as a young adult, and so on. When I am an adult, I am a woman who is a movie star in real life.  I am very famous and very rich. I own a jet and a helicopter and have a huge mansion. I have all the fame and material things I want, but I am still not happy in this life. \n",
        "source": "user",
        "start_time": 220.0,
        "end_time": 267.0,
        "last_event_time": 267.0,
        "start_progress": 0.34568781183178904,
        "end_progress": 0.40769779044903776
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \nThe film is my life, and I am the star. I see myself as a baby, as a child, as a teenager, as a young adult, and so on. When I am an adult, I am a woman who is a movie star in real life.  I am very famous and very rich. I own a jet and a helicopter and have a huge mansion. I have all the fame and material things I want, but I am still not happy in this life. I am lonely.\n",
        "source": "api",
        "start_time": 278.0,
        "end_time": 278.0,
        "last_event_time": 278.0,
        "start_progress": 0.40769779044903776,
        "end_progress": 0.41625089094796863
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \nThe film is my life, and I am the star. I see myself as a baby, as a child, as a teenager, as a young adult, and so on. When I am an adult, I am a woman who is a movie star in real life.  I am very famous and very rich. I own a jet and a helicopter and have a huge mansion. I have all the fame and material things I want, but I am still not happy in this life. I am lonely because all of my friends just love me for the fame. So I quit being a movie star and set out on an adventure. \n",
        "source": "user",
        "start_time": 283.0,
        "end_time": 317.0,
        "last_event_time": 317.0,
        "start_progress": 0.41625089094796863,
        "end_progress": 0.4953670705630791
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \nThe film is my life, and I am the star. I see myself as a baby, as a child, as a teenager, as a young adult, and so on. When I am an adult, I am a woman who is a movie star in real life.  I am very famous and very rich. I own a jet and a helicopter and have a huge mansion. I have all the fame and material things I want, but I am still not happy in this life. I am lonely because all of my friends just love me for the fame. So I quit being a movie star and set out on an adventure. I travel to many places and meet many people.\n",
        "source": "api",
        "start_time": 331.0,
        "end_time": 331.0,
        "last_event_time": 331.0,
        "start_progress": 0.4953670705630791,
        "end_progress": 0.5274411974340698
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \nThe film is my life, and I am the star. I see myself as a baby, as a child, as a teenager, as a young adult, and so on. When I am an adult, I am a woman who is a movie star in real life.  I am very famous and very rich. I own a jet and a helicopter and have a huge mansion. I have all the fame and material things I want, but I am still not happy in this life. I am lonely because all of my friends just love me for the fame. So I quit being a movie star and set out on an adventure. I traveled to many places and met many people. In Japan, they didn't even know who I was so I made true friends who loved me for me instead of the fame. \n",
        "source": "user",
        "start_time": 335.0,
        "end_time": 418.0,
        "last_event_time": 418.0,
        "start_progress": 0.5274411974340698,
        "end_progress": 0.6044191019244476
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \nThe film is my life, and I am the star. I see myself as a baby, as a child, as a teenager, as a young adult, and so on. When I am an adult, I am a woman who is a movie star in real life.  I am very famous and very rich. I own a jet and a helicopter and have a huge mansion. I have all the fame and material things I want, but I am still not happy in this life. I am lonely because all of my friends just love me for the fame. So I quit being a movie star and set out on an adventure. I traveled to many places and met many people. In Japan, they didn't even know who I was so I made true friends who loved me for me instead of the fame. I also met a man who I fell in love with.\n",
        "source": "api",
        "start_time": 437.0,
        "end_time": 437.0,
        "last_event_time": 437.0,
        "start_progress": 0.6044191019244476,
        "end_progress": 0.6336421952957947
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \nThe film is my life, and I am the star. I see myself as a baby, as a child, as a teenager, as a young adult, and so on. When I am an adult, I am a woman who is a movie star in real life.  I am very famous and very rich. I own a jet and a helicopter and have a huge mansion. I have all the fame and material things I want, but I am still not happy in this life. I am lonely because all of my friends just love me for the fame. So I quit being a movie star and set out on an adventure. I traveled to many places and met many people. In Japan, they didn't even know who I was so I made true friends who loved me for me instead of the fame. I even got a simple job tending to a large garden. \n",
        "source": "user",
        "start_time": 439.0,
        "end_time": 477.0,
        "last_event_time": 477.0,
        "start_progress": 0.6336421952957947,
        "end_progress": 0.6407697790449037
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \nThe film is my life, and I am the star. I see myself as a baby, as a child, as a teenager, as a young adult, and so on. When I am an adult, I am a woman who is a movie star in real life.  I am very famous and very rich. I own a jet and a helicopter and have a huge mansion. I have all the fame and material things I want, but I am still not happy in this life. I am lonely because all of my friends just love me for the fame. So I quit being a movie star and set out on an adventure. I traveled to many places and met many people. In Japan, they didn't even know who I was so I made true friends who loved me for me instead of the fame. I even got a simple job tending to a large garden. I was happy.\n",
        "source": "api",
        "start_time": 485.0,
        "end_time": 485.0,
        "last_event_time": 485.0,
        "start_progress": 0.6407697790449037,
        "end_progress": 0.6493228795438346
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \nThe film is my life, and I am the star. I see myself as a baby, as a child, as a teenager, as a young adult, and so on. When I am an adult, I am a woman who is a movie star in real life.  I am very famous and very rich. I own a jet and a helicopter and have a huge mansion. I have all the fame and material things I want, but I am still not happy in this life. I am lonely because all of my friends just love me for the fame. So I quit being a movie star and set out on an adventure. I traveled to many places and met many people. In Japan, they didn't even know who I was so I made true friends who loved me for me instead of the fame. I even got a simple job tending to a large garden. I was happy. But before long one of the people in my town recognized me from my movie star days. \n",
        "source": "user",
        "start_time": 491.0,
        "end_time": 513.0,
        "last_event_time": 513.0,
        "start_progress": 0.6493228795438346,
        "end_progress": 0.7099073414112615
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \nThe film is my life, and I am the star. I see myself as a baby, as a child, as a teenager, as a young adult, and so on. When I am an adult, I am a woman who is a movie star in real life.  I am very famous and very rich. I own a jet and a helicopter and have a huge mansion. I have all the fame and material things I want, but I am still not happy in this life. I am lonely because all of my friends just love me for the fame. So I quit being a movie star and set out on an adventure. I traveled to many places and met many people. In Japan, they didn't even know who I was so I made true friends who loved me for me instead of the fame. I even got a simple job tending to a large garden. I was happy. But before long one of the people in my town recognized me from my movie star days. He was a big fan of mine and was very excited to see me.\n",
        "source": "api",
        "start_time": 534.0,
        "end_time": 534.0,
        "last_event_time": 534.0,
        "start_progress": 0.7099073414112615,
        "end_progress": 0.7498218104062723
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \nThe film is my life, and I am the star. I see myself as a baby, as a child, as a teenager, as a young adult, and so on. When I am an adult, I am a woman who is a movie star in real life.  I am very famous and very rich. I own a jet and a helicopter and have a huge mansion. I have all the fame and material things I want, but I am still not happy in this life. I am lonely because all of my friends just love me for the fame. So I quit being a movie star and set out on an adventure. I traveled to many places and met many people. In Japan, they didn't even know who I was so I made true friends who loved me for me instead of the fame. I even got a simple job tending to a large garden. I was happy. But before long one of the people in my town recognized me from my movie star days. He was a big fan of mine and was very excited to see me. Then everyone found out who I used to be. I explained that I wasn't happy in that life so I came here and I want to stay here. The townspeople were happy for me and agreed not to tell my secret to the world so that I could continue living in peace with no one following me because of the fame. I remained happy and at peace for the rest of that life.\n",
        "source": "user",
        "start_time": 537.0,
        "end_time": 658.0,
        "last_event_time": 658.0,
        "start_progress": 0.7498218104062723,
        "end_progress": 1.0
    }
]