[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.14708835341365462
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. The ones who got the immortality drug started to change. \n",
        "source": "user",
        "start_time": 31.0,
        "end_time": 98.0,
        "last_event_time": 98.0,
        "start_progress": 0.14708835341365462,
        "end_progress": 0.17620481927710843
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. The ones who got the immortality drug started to change. At first they got mentally slower, their bodies then began to decompose. No matter how much of a person decomposed they still lived. Then a bystander caught one of the decomposing immortals eating an old man from the lost generation. After, the immortal seemed reinvigorated and runs off instead of hobbling. Videos like this were popping up all over the internet. It seemed that if these immortals ate the flesh of a member of the lost generation, they start to heal and become mobile again. If an immortal eats enough of these regular people, they will revert completely back to the way they were before they became deformed. \n",
        "source": "user",
        "start_time": 101.0,
        "end_time": 356.0,
        "last_event_time": 356.0,
        "start_progress": 0.17620481927710843,
        "end_progress": 0.49146586345381527
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. The ones who got the immortality drug started to change. At first they got mentally slower, their bodies then began to decompose. No matter how much of a person decomposed they still lived. Then a bystander caught one of the decomposing immortals eating an old man from the lost generation. After, the immortal seemed reinvigorated and runs off instead of hobbling. Videos like this were popping up all over the internet. It seemed that if these immortals ate the flesh of a member of the lost generation, they start to heal and become mobile again. If an immortal eats enough of these regular people, they will revert completely back to the way they were before they became deformed. This was very bad news for the remaining lost generation. They were the cure for the dying immortals. The immortals started to hurd up the lost generations and kept them in cages, slowly draining them of their blood and fluids. This was enough to reguvinate an immortal without killing the regular person. \n",
        "source": "user",
        "start_time": 360.0,
        "end_time": 480.0,
        "last_event_time": 480.0,
        "start_progress": 0.49146586345381527,
        "end_progress": 0.6450803212851406
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. The ones who got the immortality drug started to change. At first they got mentally slower, their bodies then began to decompose. No matter how much of a person decomposed they still lived. Then a bystander caught one of the decomposing immortals eating an old man from the lost generation. After, the immortal seemed reinvigorated and runs off instead of hobbling. Videos like this were popping up all over the internet. It seemed that if these immortals ate the flesh of a member of the lost generation, they start to heal and become mobile again. If an immortal eats enough of these regular people, they will revert completely back to the way they were before they became deformed. This was very bad news for the remaining lost generation. They were the cure for the dying immortals. The immortals started to herd up the lost generations and kept them in cages, slowly draining them of their blood and fluids. This was enough to regurgitate an immortal without killing the regular person. Soon farms of the lost generations were everywhere. It seemed nothing could stop the immortals from rounding up the remain old and frail to herd then like cattle into farms. One young boy who was born naturally long after immortality became a thing and ended up in one of these human farms. They drained him of his blood and sent it on its way. What they did not know was that the boy had a genetic anomaly that would essentially neutralize the immortals original treatment. It was and the new genes took hold, spread to each immortal turning them all into mortals again. It also healed them of any zombie like issues. The world recovered and vowed to learn from this mistake and never let it happen again.\n",
        "source": "user",
        "start_time": 483.0,
        "end_time": 899.0,
        "last_event_time": 899.0,
        "start_progress": 0.6450803212851406,
        "end_progress": 1.0
    }
]