[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.04638982416760194
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. The alien takes Damon to another planet, where he is promptly rescued by some aliens who speak perfect English.\n",
        "source": "api",
        "start_time": 45.0,
        "end_time": 45.0,
        "last_event_time": 45.0,
        "start_progress": 0.046763935652824544,
        "end_progress": 0.08829031051253274
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. The alien takes Damon to another planet, where he is promptly rescued by some aliens who speak perfect English. They explain that they understand humans' obsession with Damon and agree to trade him for the aliens' prince, who has been on Earth for 3 years.\n",
        "source": "api",
        "start_time": 81.0,
        "end_time": 90.0,
        "last_event_time": 90.0,
        "start_progress": 0.08829031051253274,
        "end_progress": 0.1425364758698092
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. The alien takes Damon to another planet, where he is promptly rescued by some aliens who speak perfect English. \n\nThey explain that they understand humans' obsession with Damon and agree to trade him for the aliens' prince, who has been on Earth for 3 years.  \n",
        "source": "user",
        "start_time": 92.0,
        "end_time": 109.0,
        "last_event_time": 109.0,
        "start_progress": 0.1425364758698092,
        "end_progress": 0.1440329218106996
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. The alien takes Damon to another planet, where he is promptly rescued by some aliens who speak perfect English. \n\nThey explain that they understand humans' obsession with Damon and agree to trade him for the aliens' prince, who has been on Earth for 3 years.   Once the prince is safely returned to his home planet, the aliens will return Damon.\n",
        "source": "api",
        "start_time": 141.0,
        "end_time": 141.0,
        "last_event_time": 141.0,
        "start_progress": 0.1440329218106996,
        "end_progress": 0.17583239805462028
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. The alien takes Damon to another planet, where he is promptly rescued by some aliens who speak perfect English. \n\nThey explain that they understand humans' obsession with Damon and agree to trade him for the aliens' prince, who has been on Earth for 3 years. \n",
        "source": "user",
        "start_time": 157.0,
        "end_time": 157.0,
        "last_event_time": 157.0,
        "start_progress": 0.17583239805462028,
        "end_progress": 0.143658810325477
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. The alien takes Damon to another planet, where he is promptly rescued by some aliens who speak perfect English. \n\nThey explain that they understand humans' obsession with Damon and agree to trade him for the aliens' prince, who has been on Earth for 3 years. They reveal that the reason aliens cannot speak English is because their mouths are not capable of pronouncing vowels, and as a result, they employ humans\n",
        "source": "api",
        "start_time": 182.0,
        "end_time": 182.0,
        "last_event_time": 182.0,
        "start_progress": 0.143658810325477,
        "end_progress": 0.20127197904975683
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. The alien takes Damon to another planet, where he is promptly rescued by some aliens who speak perfect English. \n\nThey explain that they understand humans' obsession with Damon and agree to trade him for the aliens' prince, who has been on Earth for 3 years. They reveal that the reason aliens cannot speak English is because their mouths are not capable of pronouncing vowels, and as a result, they employ humans to speak for them.\n\nMatt Damon is shocked by all of this and obviously doesn't want to be involved with aliens. He tells that aliens that he wants to be traded back for the alien prince so he can return to the United States.\n\nThe aliens explain that there is a possibility of that but it's going to cost the United States a big time price. The aliens work out a deal and tell Matt Damon that they want to live in the United States. They don't want to live with humans and instead want to live in their own community.\n\nMatt Damon has no idea how he can make that happen but again, Damon is loved by the United States and all of it's people. He calls the President of the United States and the President tells him there is no possible place for the aliens to go. The country has 50 states and humans inhabit all of those states.\n\nDamon tells the aliens the bad news and they explain to him that he's stuck with them. The interesting thing is that as Damon continued to live with the aliens, the more he started to enjoy it.\n\nThe alien world didn't treat him like a famous actor. He didn't have to deal with the constant stress and scrutiny of being a Hollywood star. The aliens treated him well. He explained to the aliens how great their planet was. But he was very upset about one thing. He wanted to see his family. \n\nHe asked the aliens if there was any possibility that he could go back to the United States so he could see his family. They told him that he couldn't but they could abduct his family and bring them to their home planet.\n\nDamon thought long and hard about that and accepted the offer. The aliens ended up abducting Matt Damon's family and brought them to him. They were extremely happy to see him but also wanted to go home. The issue is that they were stuck there like Damon as well.\n\nBut just like Matt, the more time they spent on the aliens planet, the more they enjoyed it. They were treated extremely well and had fun learning about the alien's culture and all of the technology they had access to. They're stuck on that planet to this day, but they enjoy living there much more than they thought they would. \n",
        "source": "user",
        "start_time": 188.0,
        "end_time": 585.0,
        "last_event_time": 585.0,
        "start_progress": 0.20127197904975683,
        "end_progress": 1.0
    }
]