[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.12560128273650453
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time. The shapeshifter named John has been in love with the same girl for years. He has tried over and over again to try and woo her with a different appearance but after a date or two she always decided to end the relationship. \n",
        "source": "user",
        "start_time": 13.0,
        "end_time": 88.0,
        "last_event_time": 88.0,
        "start_progress": 0.12560128273650453,
        "end_progress": 0.24532335649385356
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time. The shapeshifter named John has been in love with the same girl for years. He has tried over and over again to try and woo her with a different appearance but after a date or two she always decided to end the relationship. He is determined to win her over and make her his.\n",
        "source": "api",
        "start_time": 109.0,
        "end_time": 109.0,
        "last_event_time": 109.0,
        "start_progress": 0.24532335649385356,
        "end_progress": 0.27204703367183325
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time. The shapeshifter named John has been in love with the same girl for years. He has tried over and over again to try and woo her with a different appearance but after a date or two she always decided to end the relationship, however, he is determined to win her over and make her his. John is at home thinking about his situation and why no matter how good looking or in shape he becomes, he just cannot seem to connect with this women that he loves so much. \n",
        "source": "user",
        "start_time": 123.0,
        "end_time": 199.0,
        "last_event_time": 199.0,
        "start_progress": 0.27204703367183325,
        "end_progress": 0.3703901656867985
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time. The shapeshifter named John has been in love with the same girl for years. He has tried over and over again to try and woo her with a different appearance but after a date or two she always decided to end the relationship, however, he is determined to win her over and make her his. John is at home thinking about his situation and why no matter how good looking or in shape he becomes, he just cannot seem to connect with this women that he loves so much. He is about to give up when he hears a knock at the door.\n",
        "source": "api",
        "start_time": 220.0,
        "end_time": 220.0,
        "last_event_time": 220.0,
        "start_progress": 0.3703901656867985,
        "end_progress": 0.40085515766969537
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time. The shapeshifter named John has been in love with the same girl for years. He has tried over and over again to try and woo her with a different appearance but after a date or two she always decided to end the relationship, however, he is determined to win her over and make her his. John is at home thinking about his situation and why no matter how good looking or in shape he becomes, he just cannot seem to connect with this women that he loves so much. He is about to give up when he hears a knock at the door. Its delivery guy with my food. He is an odd looking fellow but not in a bad way. He had a symmetrical face but with many noticeable flaws. Like his nose was uneven and crooked but added to his appeal. His eyes were a little far apart but his cheek bones more then compensated for it. Most of all though, it was his personality and mannerisms that was the most attractive thing about him. A lightbulb went off over John's head. It was not his looks that were the issue as he had thought all along but it was his personality. He was constantly trying to change it everytime he shapeshifted. This time John changed into a man who was only slightly better looking then the rest and decided he would just be himself.   \n",
        "source": "user",
        "start_time": 224.0,
        "end_time": 565.0,
        "last_event_time": 565.0,
        "start_progress": 0.40085515766969537,
        "end_progress": 0.7830037413148049
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time. The shapeshifter named John has been in love with the same girl for years. He has tried over and over again to try and woo her with a different appearance but after a date or two she always decided to end the relationship, however, he is determined to win her over and make her his. John is at home thinking about his situation and why no matter how good looking or in shape he becomes, he just cannot seem to connect with this women that he loves so much. He is about to give up when he hears a knock at the door. Its delivery guy with my food. He is an odd looking fellow but not in a bad way. He had a symmetrical face but with many noticeable flaws. Like his nose was uneven and crooked but added to his appeal. His eyes were a little far apart but his cheek bones more then compensated for it. Most of all though, it was his personality and mannerisms that was the most attractive thing about him. A lightbulb went off over John's head. It was not his looks that were the issue as he had thought all along but it was his personality. He was constantly trying to change it everytime he shapeshifted. This time John changed into a man who was only slightly better looking then the rest and decided he would just be himself.    He would be the man he was and not try to be someone else.\n",
        "source": "api",
        "start_time": 580.0,
        "end_time": 580.0,
        "last_event_time": 580.0,
        "start_progress": 0.7830037413148049,
        "end_progress": 0.814537680384821
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time. The shapeshifter named John has been in love with the same girl for years. He has tried over and over again to try and woo her with a different appearance but after a date or two she always decided to end the relationship, however, he is determined to win her over and make her his. John is at home thinking about his situation and why no matter how good looking or in shape he becomes, he just cannot seem to connect with this women that he loves so much. He is about to give up when he hears a knock at the door. Its delivery guy with my food. He is an odd looking fellow but not in a bad way. He had a symmetrical face but with many noticeable flaws. Like his nose was uneven and crooked but added to his appeal. His eyes were a little far apart but his cheek bones more then compensated for it. Most of all though, it was his personality and mannerisms that was the most attractive thing about him. A light bulb went off over John's head. It was not his looks that were the issue as he had thought all along but it was his personality. He was constantly trying to change it every time he shapeshifted. This time John changed into a man who was only slightly better looking then the rest and decided he would just be himself.    He would be the man he was and not try to be someone else. He approaches the women and gets her to agree to a date. He then has dinner with her and she seems to be enjoying john's company this time. They have the dreaded second date and this time it went fantastically. John was asked by her to go on a third date and from there they were eventually married and in this case did live happily ever after.\n",
        "source": "user",
        "start_time": 582.0,
        "end_time": 675.0,
        "last_event_time": 675.0,
        "start_progress": 0.814537680384821,
        "end_progress": 1.0
    }
]