[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.18698149329929803
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. After decades of debate and conflicting edvidence, the world has finally come to the consensus that the immortality drug given roughly 60 years ago and to billions of people worldwide is a complete success without any adverse effects. \n",
        "source": "user",
        "start_time": 13.0,
        "end_time": 100.0,
        "last_event_time": 100.0,
        "start_progress": 0.18698149329929803,
        "end_progress": 0.3375877472878111
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. After decades of debate and conflicting edvidence, the world has finally come to the consensus that the immortality drug given roughly 60 years ago and to billions of people worldwide is a complete success without any adverse effects. The last living members of the lost generations start petitioning the governments to find a cure for them. They said it was too risky all thoes years ago but it turned out to be just fine. \n",
        "source": "user",
        "start_time": 191.0,
        "end_time": 255.0,
        "last_event_time": 255.0,
        "start_progress": 0.3375877472878111,
        "end_progress": 0.4582003828972559
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. After decades of debate and conflicting edvidence, the world has finally come to the consensus that the immortality drug given roughly 60 years ago and to billions of people worldwide is a complete success without any adverse effects. The last living members of the lost generations start petitioning the governments to find a cure for them. They said it was too risky all thoes years ago but it turned out to be just fine. The governments of the world are now faced with a difficult decision.\n",
        "source": "api",
        "start_time": 272.0,
        "end_time": 272.0,
        "last_event_time": 272.0,
        "start_progress": 0.4582003828972559,
        "end_progress": 0.5022335673261008
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. After decades of debate and conflicting edvidence, the world has finally come to the consensus that the immortality drug given roughly 60 years ago and to billions of people worldwide is a complete success without any adverse effects. The last living members of the lost generations start petitioning the governments to find a cure for them. They said it was too risky all thoes years ago but it turned out to be just fine. The governments of the world are now faced with a difficult decision, do they tell the lost generations that they have the cure and have had it for 20 years now or do they let them slowly die off, riding the world of the old ways of thinking. \n",
        "source": "user",
        "start_time": 274.0,
        "end_time": 347.0,
        "last_event_time": 347.0,
        "start_progress": 0.5022335673261008,
        "end_progress": 0.6132737715379707
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. After decades of debate and conflicting edvidence, the world has finally come to the consensus that the immortality drug given roughly 60 years ago and to billions of people worldwide is a complete success without any adverse effects. The last living members of the lost generations start petitioning the governments to find a cure for them. They said it was too risky all thoes years ago but it turned out to be just fine. The governments of the world are now faced with a difficult decision, do they tell the lost generations that they have the cure and have had it for 20 years now or do they let them slowly die off, riding the world of the old ways of thinking. The leaders who thought they were in total control of this information actually did not. \n",
        "source": "user",
        "start_time": 353.0,
        "end_time": 408.0,
        "last_event_time": 408.0,
        "start_progress": 0.6132737715379707,
        "end_progress": 0.6700701978302489
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. After decades of debate and conflicting edvidence, the world has finally come to the consensus that the immortality drug given roughly 60 years ago and to billions of people worldwide is a complete success without any adverse effects. The last living members of the lost generations start petitioning the governments to find a cure for them. They said it was too risky all thoes years ago but it turned out to be just fine. The governments of the world are now faced with a difficult decision, do they tell the lost generations that they have the cure and have had it for 20 years now or do they let them slowly die off, riding the world of the old ways of thinking. The leaders who thought they were in total control of this information actually did not. The lost generations have found out that they have the cure and are now demanding it.\n",
        "source": "api",
        "start_time": 426.0,
        "end_time": 426.0,
        "last_event_time": 426.0,
        "start_progress": 0.6700701978302489,
        "end_progress": 0.7243139757498405
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. After decades of debate and conflicting edvidence, the world has finally come to the consensus that the immortality drug given roughly 60 years ago and to billions of people worldwide is a complete success without any adverse effects. The last living members of the lost generations start petitioning the governments to find a cure for them. They said it was too risky all thoes years ago but it turned out to be just fine. The governments of the world are now faced with a difficult decision, do they tell the lost generations that they have the cure and have had it for 20 years now or do they let them slowly die off, riding the world of the old ways of thinking. The leaders who thought they were in total control of this information actually did not. The lost generations have found out that they have the cure and are now demanding it. One of the techs managed to sneak a vile out of the lab and sent it to the university to confirm its contents. \n",
        "source": "user",
        "start_time": 430.0,
        "end_time": 467.0,
        "last_event_time": 467.0,
        "start_progress": 0.7243139757498405,
        "end_progress": 0.795788130185067
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. After decades of debate and conflicting edvidence, the world has finally come to the consensus that the immortality drug given roughly 60 years ago and to billions of people worldwide is a complete success without any adverse effects. The last living members of the lost generations start petitioning the governments to find a cure for them. They said it was too risky all thoes years ago but it turned out to be just fine. The governments of the world are now faced with a difficult decision, do they tell the lost generations that they have the cure and have had it for 20 years now or do they let them slowly die off, riding the world of the old ways of thinking. The leaders who thought they were in total control of this information actually did not. The lost generations have found out that they have the cure and are now demanding it. One of the techs managed to sneak a vile out of the lab and sent it to the university to confirm its contents. The university confirms that the vile does indeed contain the cure.\n",
        "source": "api",
        "start_time": 488.0,
        "end_time": 488.0,
        "last_event_time": 488.0,
        "start_progress": 0.795788130185067,
        "end_progress": 0.8385449904275686
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. After decades of debate and conflicting evidence, the world has finally come to the consensus that the immortality drug given roughly 60 years ago and to billions of people worldwide is a complete success without any adverse effects. The last living members of the lost generations start petitioning the governments to find a cure for them. They said it was too risky all those years ago but it turned out to be just fine. The governments of the world are now faced with a difficult decision, do they tell the lost generations that they have the cure and have had it for 20 years now or do they let them slowly die off, riding the world of the old ways of thinking. The leaders who thought they were in total control of this information actually did not. The lost generations have found out that they have the cure and are now demanding it. One of the techs managed to sneak a vile out of the lab and sent it to the university to confirm its contents. The university confirms that the vile does indeed contain the cure. The news instantly goes viral and within two weeks the lost generations started recieving the new immortality drug. Over the course of a year, the old morphed back into their prime years and rejoined the world as productive, average, immortal citizens. \n",
        "source": "user",
        "start_time": 490.0,
        "end_time": 607.0,
        "last_event_time": 607.0,
        "start_progress": 0.8385449904275686,
        "end_progress": 1.0
    }
]