[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.10072289156626506
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. \n",
        "source": "user",
        "start_time": 10.0,
        "end_time": 42.0,
        "last_event_time": 42.0,
        "start_progress": 0.10072289156626506,
        "end_progress": 0.15566265060240964
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died.\n",
        "source": "api",
        "start_time": 49.0,
        "end_time": 49.0,
        "last_event_time": 49.0,
        "start_progress": 0.15566265060240964,
        "end_progress": 0.18602409638554218
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema.\n",
        "source": "api",
        "start_time": 83.0,
        "end_time": 87.0,
        "last_event_time": 87.0,
        "start_progress": 0.18602409638554218,
        "end_progress": 0.22987951807228915
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life.\n",
        "source": "api",
        "start_time": 99.0,
        "end_time": 132.0,
        "last_event_time": 132.0,
        "start_progress": 0.22987951807228915,
        "end_progress": 0.2549397590361446
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. \n\n\n\nI was born in a small town in the middle of nowhere.\n",
        "source": "api",
        "start_time": 146.0,
        "end_time": 146.0,
        "last_event_time": 146.0,
        "start_progress": 0.25542168674698795,
        "end_progress": 0.28240963855421686
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. \n\n\n\nI was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children.\n",
        "source": "api",
        "start_time": 155.0,
        "end_time": 157.0,
        "last_event_time": 157.0,
        "start_progress": 0.28240963855421686,
        "end_progress": 0.3132530120481928
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children.\n",
        "source": "user",
        "start_time": 162.0,
        "end_time": 163.0,
        "last_event_time": 163.0,
        "start_progress": 0.3132530120481928,
        "end_progress": 0.31132530120481927
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me.\n",
        "source": "api",
        "start_time": 181.0,
        "end_time": 181.0,
        "last_event_time": 181.0,
        "start_progress": 0.31132530120481927,
        "end_progress": 0.35855421686746985
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me. I had a normal childhood, and I had a normal life.\n",
        "source": "api",
        "start_time": 184.0,
        "end_time": 209.0,
        "last_event_time": 209.0,
        "start_progress": 0.35855421686746985,
        "end_progress": 0.38313253012048193
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me. I had a normal childhood, and I had a normal life. I went to school, I did my homework, and I had friends.\n",
        "source": "api",
        "start_time": 212.0,
        "end_time": 218.0,
        "last_event_time": 218.0,
        "start_progress": 0.38313253012048193,
        "end_progress": 0.41012048192771083
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me. I had a normal childhood, and I had a normal life. I went to school, I did my homework, and I had friends. I was a happy kid, but I was also a lonely kid.\n",
        "source": "api",
        "start_time": 222.0,
        "end_time": 228.0,
        "last_event_time": 228.0,
        "start_progress": 0.41012048192771083,
        "end_progress": 0.4332530120481928
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me. I had a normal childhood, and I had a normal life. I went to school, I did my homework, and I had friends. I was a happy kid, but I was also a lonely kid. I had no friends at school, and I had no friends at home.\n",
        "source": "api",
        "start_time": 232.0,
        "end_time": 263.0,
        "last_event_time": 263.0,
        "start_progress": 0.4332530120481928,
        "end_progress": 0.46120481927710844
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me. I had a normal childhood, and I had a normal life. I went to school, I did my homework, and I had friends. I was a happy kid, but I was also a lonely kid. I had no friends at school, and I had no friends at home. I was always alone.\n",
        "source": "api",
        "start_time": 269.0,
        "end_time": 278.0,
        "last_event_time": 278.0,
        "start_progress": 0.46120481927710844,
        "end_progress": 0.4708433734939759
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me. I had a normal childhood, and I had a normal life. I went to school, I did my homework, and I had friends. I was a happy kid, but I was also a lonely kid. I had no friends at school, and I had no friends at home. I was always alone. I had no one to talk to, and I had no one to play with.\n",
        "source": "api",
        "start_time": 282.0,
        "end_time": 289.0,
        "last_event_time": 289.0,
        "start_progress": 0.4708433734939759,
        "end_progress": 0.49783132530120483
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me. I had a normal childhood, and I had a normal life. I went to school, I did my homework, and I had friends. I was a happy kid, but I was also a lonely kid. I had no friends at school, and I had no friends at home. I was always alone. I had no one to talk to, and I had no one to play with. I was alone, and I was always alone.\n",
        "source": "api",
        "start_time": 292.0,
        "end_time": 300.0,
        "last_event_time": 300.0,
        "start_progress": 0.49783132530120483,
        "end_progress": 0.5156626506024097
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me. I had a normal childhood, and I had a normal life. I went to school, I did my homework, and I had friends. I was a happy kid, but I was also a lonely kid. I had no friends at school, and I had no friends at home. I was always alone. I had no one to talk to, and I had no one to play with. I had gotten so use to it that i did not really need friends anymore. \n",
        "source": "user",
        "start_time": 303.0,
        "end_time": 321.0,
        "last_event_time": 321.0,
        "start_progress": 0.5156626506024097,
        "end_progress": 0.5320481927710843
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me. I had a normal childhood, and I had a normal life. I went to school, I did my homework, and I had friends. I was a happy kid, but I was also a lonely kid. I had no friends at school, and I had no friends at home. I was always alone. I had no one to talk to, and I had no one to play with. I had gotten so use to it that i did not really need friends anymore. I was happy with my life, and I was happy with my family.\n",
        "source": "api",
        "start_time": 332.0,
        "end_time": 332.0,
        "last_event_time": 332.0,
        "start_progress": 0.5320481927710843,
        "end_progress": 0.5595180722891566
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me. I had a normal childhood, and I had a normal life. I went to school, I did my homework, and I had friends. I was a happy kid, but I was also a lonely kid. I had no friends at school, and I had no friends at home. I was always alone. I had no one to talk to, and I had no one to play with. I had gotten so use to it that i did not really need friends anymore. I was happy with my life, and I was happy with my family. There was always drama it seems when i got a new friend and they would not stick around for long so i eventually let them go. As time went on and i met my  college sweetheart in my 2nd year of college we clicked right away and was always inseparable.\n",
        "source": "user",
        "start_time": 360.0,
        "end_time": 430.0,
        "last_event_time": 430.0,
        "start_progress": 0.5595180722891566,
        "end_progress": 0.6804819277108434
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me. I had a normal childhood, and I had a normal life. I went to school, I did my homework, and I had friends. I was a happy kid, but I was also a lonely kid. I had no friends at school, and I had no friends at home. I was always alone. I had no one to talk to, and I had no one to play with. I had gotten so use to it that i did not really need friends anymore. I was happy with my life, and I was happy with my family. There was always drama it seems when i got a new friend and they would not stick around for long so i eventually let them go. As time went on and i met my  college sweetheart in my 2nd year of college we clicked right away and was always inseparable. We were each others first love and first kiss.\n",
        "source": "api",
        "start_time": 437.0,
        "end_time": 437.0,
        "last_event_time": 437.0,
        "start_progress": 0.6804819277108434,
        "end_progress": 0.7031325301204819
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me. I had a normal childhood, and I had a normal life. I went to school, I did my homework, and I had friends. I was a happy kid, but I was also a lonely kid. I had no friends at school, and I had no friends at home. I was always alone. I had no one to talk to, and I had no one to play with. I had gotten so use to it that i did not really need friends anymore. I was happy with my life, and I was happy with my family. There was always drama it seems when i got a new friend and they would not stick around for long so i eventually let them go. As time went on and i met my  college sweetheart in my 2nd year of college we clicked right away and was always inseparable. We were each others first love and first kiss. After we graduated we got married and had 3 lovely kids, a boy and 2 girls. \n",
        "source": "user",
        "start_time": 442.0,
        "end_time": 459.0,
        "last_event_time": 459.0,
        "start_progress": 0.7031325301204819,
        "end_progress": 0.7402409638554217
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me. I had a normal childhood, and I had a normal life. I went to school, I did my homework, and I had friends. I was a happy kid, but I was also a lonely kid. I had no friends at school, and I had no friends at home. I was always alone. I had no one to talk to, and I had no one to play with. I had gotten so use to it that i did not really need friends anymore. I was happy with my life, and I was happy with my family. There was always drama it seems when i got a new friend and they would not stick around for long so i eventually let them go. As time went on and i met my  college sweetheart in my 2nd year of college we clicked right away and was always inseparable. We were each others first love and first kiss. After we graduated we got married and had 3 lovely kids, a boy and 2 girls. We were happy and we were a happy family.\n",
        "source": "api",
        "start_time": 468.0,
        "end_time": 468.0,
        "last_event_time": 468.0,
        "start_progress": 0.7402409638554217,
        "end_progress": 0.76
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me. I had a normal childhood, and I had a normal life. I went to school, I did my homework, and I had friends. I was a happy kid, but I was also a lonely kid. I had no friends at school, and I had no friends at home. I was always alone. I had no one to talk to, and I had no one to play with. I had gotten so use to it that i did not really need friends anymore. I was happy with my life, and I was happy with my family. There was always drama it seems when i got a new friend and they would not stick around for long so i eventually let them go. As time went on and i met my  college sweetheart in my 2nd year of college we clicked right away and was always inseparable. We were each others first love and first kiss. After we graduated we got married and had 3 lovely kids, a boy and 2 girls. We were happy and we were a happy family. We both had great jobs and great income, took a few vacations a year and always had money for extra things. Our kids grew up and went to college as we went on with our lives. \n",
        "source": "user",
        "start_time": 478.0,
        "end_time": 509.0,
        "last_event_time": 509.0,
        "start_progress": 0.76,
        "end_progress": 0.8448192771084337
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me. I had a normal childhood, and I had a normal life. I went to school, I did my homework, and I had friends. I was a happy kid, but I was also a lonely kid. I had no friends at school, and I had no friends at home. I was always alone. I had no one to talk to, and I had no one to play with. I had gotten so use to it that i did not really need friends anymore. I was happy with my life, and I was happy with my family. There was always drama it seems when i got a new friend and they would not stick around for long so i eventually let them go. As time went on and i met my  college sweetheart in my 2nd year of college we clicked right away and was always inseparable. We were each others first love and first kiss. After we graduated we got married and had 3 lovely kids, a boy and 2 girls. We were happy and we were a happy family. We both had great jobs and great income, took a few vacations a year and always had money for extra things. Our kids grew up and went to college as we went on with our lives. We were happy, we were content, and we were living the American dream.\n",
        "source": "api",
        "start_time": 531.0,
        "end_time": 531.0,
        "last_event_time": 531.0,
        "start_progress": 0.8448192771084337,
        "end_progress": 0.8785542168674699
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  As we all stared at the screen we started to relive our lives. The good and the bad we have done in this world. We watched as we grew up, got married, had kids, and then died. We watched as our bodies were buried, and we watched as our souls were sent to the cinema. We watched as we were reincarnated into a new life. I was born in a small town in the middle of nowhere. My parents were poor, and I was the youngest of three children. I had a sister who was five years older than me, and a brother who was seven years older than me. I had a normal childhood, and I had a normal life. I went to school, I did my homework, and I had friends. I was a happy kid, but I was also a lonely kid. I had no friends at school, and I had no friends at home. I was always alone. I had no one to talk to, and I had no one to play with. I had gotten so use to it that i did not really need friends anymore. I was happy with my life, and I was happy with my family. There was always drama it seems when i got a new friend and they would not stick around for long so i eventually let them go. As time went on and i met my  college sweetheart in my 2nd year of college we clicked right away and was always inseparable. We were each others first love and first kiss. After we graduated we got married and had 3 lovely kids, a boy and 2 girls. We were happy and we were a happy family. We both had great jobs and great income, took a few vacations a year and always had money for extra things. Our kids grew up and went to college as we went on with our lives. We were happy, we were content, and we were living the American dream. As time went on i got sick first and then my wife. We passed away 2 years apart from each other. We always said that we would not want to live without each other and would like to pass with each other at old age and that is exactly what has happened. \n",
        "source": "user",
        "start_time": 532.0,
        "end_time": 583.0,
        "last_event_time": 583.0,
        "start_progress": 0.8785542168674699,
        "end_progress": 1.0
    }
]