[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.11821266968325791
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.\n\nThe film is a comedy, but it is also a drama about the choices we make in our lives and the consequences of those choices.\n",
        "source": "api",
        "start_time": 52.0,
        "end_time": 54.0,
        "last_event_time": 54.0,
        "start_progress": 0.11821266968325791,
        "end_progress": 0.18834841628959276
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.\n\nThe film is a comedy, but it is also a drama about the choices we make in our lives and the consequences of those choices. At the start of the film we see our entire life flash before our eyes. All of the great things that we have accomplished, all of the mistakes that we have made and all of the loved ones we have love. \n",
        "source": "user",
        "start_time": 58.0,
        "end_time": 107.0,
        "last_event_time": 107.0,
        "start_progress": 0.18834841628959276,
        "end_progress": 0.3020361990950226
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.\n\nThe film is a comedy, but it is also a drama about the choices we make in our lives and the consequences of those choices. At the start of the film we see our entire life flash before our eyes. All of the great things that we have accomplished, all of the mistakes that we have made and all of the loved ones we have love. \n\nThe comedy aspects of the film are simply your realization that the things you thought were important at different stages in your life really weren't that important at all. At points in our lives most of us put materialistic things on a pedestal. Money, cars, accessories, clothing, etc. The really important things are family, friends and the relationships that we have with them .\n\nLuckily, since you're being reincarnated and have the ability to see these movies you are able to learn from your mistakes. You are then able to live a life where you know what really matters. What really should be prioritized. What really makes life valuable and meaningful.\n\nReincarnation is a gift. It allows us a second chance and more at life. If you had a second chance at life, what things would you change? What would you do differently?\n\nReincarnation can also be a bit scary. Those same friends and family that we once had won't be in our new, reincarnated life. We'll have to make new relationships, meet new friends and live with a new family. Our new family may not be as good as our old one.\n\nThat is why to me, reincarnation is actually a Catch 22, because many things about it really are reliant on the situation you're born into. \n\n",
        "source": "user",
        "start_time": 128.0,
        "end_time": 568.0,
        "last_event_time": 568.0,
        "start_progress": 0.3020361990950226,
        "end_progress": 1.0
    }
]