[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.15666666666666668
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time. Every time they start to date things go well for a while but soon enough she grows tired of him. \n",
        "source": "user",
        "start_time": 11.0,
        "end_time": 66.0,
        "last_event_time": 66.0,
        "start_progress": 0.15666666666666668,
        "end_progress": 0.222
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time. Every time they start to date things go well for a while but soon enough she grows tired of him. He's not sure what he's doing wrong, but he's determined to find out.\n",
        "source": "api",
        "start_time": 90.0,
        "end_time": 90.0,
        "last_event_time": 90.0,
        "start_progress": 0.222,
        "end_progress": 0.268
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time. Every time they start to date things go well for a while but soon enough she grows tired of him. He's not sure what he's doing wrong, but he's determined to find out. He keeps a careful journal of everything he does while they date and carefully analyzes his actions right before she breaks up with him. When he starts to date her in a new form he tries doing things differently. He spends hours and hours trying to figure what she really wants in a man. \n",
        "source": "user",
        "start_time": 92.0,
        "end_time": 274.0,
        "last_event_time": 274.0,
        "start_progress": 0.268,
        "end_progress": 0.46066666666666667
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time. Every time they start to date things go well for a while but soon enough she grows tired of him. He's not sure what he's doing wrong, but he's determined to find out. He keeps a careful journal of everything he does while they date and carefully analyzes his actions right before she breaks up with him. When he starts to date her in a new form he tries doing things differently. He spends hours and hours trying to figure what she really wants in a man. He's certain that he's going to get it right this time, but she still breaks up with him.\n",
        "source": "api",
        "start_time": 293.0,
        "end_time": 293.0,
        "last_event_time": 293.0,
        "start_progress": 0.46066666666666667,
        "end_progress": 0.52
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time. Every time they start to date things go well for a while but soon enough she grows tired of him. He's not sure what he's doing wrong, but he's determined to find out. He keeps a careful journal of everything he does while they date and carefully analyzes his actions right before she breaks up with him. When he starts to date her in a new form he tries doing things differently. He spends hours and hours trying to figure what she really wants in a man. He's certain that he's going to get it right this time, but she still breaks up with him. The man is emotionally distraught and really at wits end. He decides to spy on her secretly, he is really obsessed with her by this point. \n",
        "source": "user",
        "start_time": 294.0,
        "end_time": 372.0,
        "last_event_time": 372.0,
        "start_progress": 0.52,
        "end_progress": 0.6133333333333333
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time. Every time they start to date things go well for a while but soon enough she grows tired of him. He's not sure what he's doing wrong, but he's determined to find out. He keeps a careful journal of everything he does while they date and carefully analyzes his actions right before she breaks up with him. When he starts to date her in a new form he tries doing things differently. He spends hours and hours trying to figure what she really wants in a man. He's certain that he's going to get it right this time, but she still breaks up with him. The man is emotionally distraught and really at wits end. He decides to spy on her secretly, he is really obsessed with her by this point. He follows her to work and sees her with a guy, and he's certain that she's cheating on him.\n",
        "source": "api",
        "start_time": 392.0,
        "end_time": 392.0,
        "last_event_time": 392.0,
        "start_progress": 0.6133333333333333,
        "end_progress": 0.6746666666666666
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time. Every time they start to date things go well for a while but soon enough she grows tired of him. He's not sure what he's doing wrong, but he's determined to find out. He keeps a careful journal of everything he does while they date and carefully analyzes his actions right before she breaks up with him. When he starts to date her in a new form he tries doing things differently. He spends hours and hours trying to figure what she really wants in a man. He's certain that he's going to get it right this time, but she still breaks up with him. The man is emotionally distraught and really at wits end. He decides to spy on her secretly, he is really obsessed with her by this point. He follows her to work and sees her with a guy, and he's certain that she's cheating on him.  Soon he sees her with another guy, then another. She goes through a seemingly endless series of men , dating each for a short time then breaking up with them. Finally he feels that he must confront her about this. He wants to know why she can't just settle with one person. \n",
        "source": "user",
        "start_time": 394.0,
        "end_time": 509.0,
        "last_event_time": 509.0,
        "start_progress": 0.6746666666666666,
        "end_progress": 0.8586666666666667
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time. Every time they start to date things go well for a while but soon enough she grows tired of him. He's not sure what he's doing wrong, but he's determined to find out. He keeps a careful journal of everything he does while they date and carefully analyzes his actions right before she breaks up with him. When he starts to date her in a new form he tries doing things differently. He spends hours and hours trying to figure what she really wants in a man. He's certain that he's going to get it right this time, but she still breaks up with him. The man is emotionally distraught and really at wits end. He decides to spy on her secretly, he is really obsessed with her by this point. He follows her to work and sees her with a guy, and he's certain that she's cheating on him.  Soon he sees her with another guy, then another. She goes through a seemingly endless series of men , dating each for a short time then breaking up with them. Finally he feels that he must confront her about this. He wants to know why she can't just settle with one person. She tells him that she's not interested in any of them.\n",
        "source": "api",
        "start_time": 534.0,
        "end_time": 534.0,
        "last_event_time": 534.0,
        "start_progress": 0.8586666666666667,
        "end_progress": 0.8953333333333333
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time. Every time they start to date things go well for a while but soon enough she grows tired of him. He's not sure what he's doing wrong, but he's determined to find out. He keeps a careful journal of everything he does while they date and carefully analyzes his actions right before she breaks up with him. When he starts to date her in a new form he tries doing things differently. He spends hours and hours trying to figure what she really wants in a man. He's certain that he's going to get it right this time, but she still breaks up with him. The man is emotionally distraught and really at wits end. He decides to spy on her secretly, he is really obsessed with her by this point. He follows her to work and sees her with a guy, and he's certain that she's cheating on him.  Soon he sees her with another guy, then another. She goes through a seemingly endless series of men , dating each for a short time then breaking up with them. Finally he feels that he must confront her about this. He wants to know why she can't just settle with one person. She tells him that she's not interested in any of them. The truth is that she is an alien from another planet on a mission to earth to find out as much as she can about the differences in earth's male population.\n",
        "source": "user",
        "start_time": 537.0,
        "end_time": 662.0,
        "last_event_time": 662.0,
        "start_progress": 0.8953333333333333,
        "end_progress": 1.0
    }
]