[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.04807692307692308
    },
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.\n\nMy first thought was to simply try and find my name. Hold up, do step dads make it on the cup? Without a doubt i would think. We do the same things, love the same way. Just with different variables i assume.\n",
        "source": "user",
        "start_time": 6.0,
        "end_time": 41.0,
        "last_event_time": 41.0,
        "start_progress": 0.04807692307692308,
        "end_progress": 0.1597222222222222
    },
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.\n\nMy first thought was to simply try and find my name. Hold up, do step dads make it on the cup? Without a doubt i would think. We do the same things, love the same way. Just with different variables i assume. I started scanning down the list of names and my eyes stopped on the very first entry.\n",
        "source": "api",
        "start_time": 97.0,
        "end_time": 97.0,
        "last_event_time": 97.0,
        "start_progress": 0.1597222222222222,
        "end_progress": 0.20619658119658119
    },
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.\n\nMy first thought was to simply try and find my name. Hold up, do step dads make it on the cup? Without a doubt i would think. We do the same things, love the same way. Just with different variables i assume. I started scanning down the list of names and my eyes stopped on the very first entry. Simply because there was no first entry. The first line was just as if a name was being written but it would stop a quarter of the way, erase, and than write another name. This told me that the rankings were not in at this point yet. \n",
        "source": "user",
        "start_time": 102.0,
        "end_time": 229.0,
        "last_event_time": 229.0,
        "start_progress": 0.20619658119658119,
        "end_progress": 0.3317307692307692
    },
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.\n\nMy first thought was to simply try and find my name. Hold up, do step dads make it on the cup? Without a doubt i would think. We do the same things, love the same way. Just with different variables i assume. I started scanning down the list of names and my eyes stopped on the very first entry. Simply because there was no first entry. The first line was just as if a name was being written but it would stop a quarter of the way, erase, and than write another name. This told me that the rankings were not in at this point yet. Which was probably the first step to realizing that this wasn't a ranking at all.\n",
        "source": "api",
        "start_time": 263.0,
        "end_time": 263.0,
        "last_event_time": 263.0,
        "start_progress": 0.3317307692307692,
        "end_progress": 0.375
    },
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.\n\nMy first thought was to simply try and find my name. Hold up, do step dads make it on the cup? Without a doubt i would think. We do the same things, love the same way. Just with different variables i assume. I started scanning down the list of names and my eyes stopped on the very first entry. Simply because there was no first entry. The first line was just as if a name was being written but it would stop a quarter of the way, erase, and than write another name. This told me that the rankings were not in at this point yet. This was probably the first step to realizing that this wasn't a ranking at all. This was just a decorative mug, maybe with some sort of sentimental meaning, or a project that hasnt been finished. It was very futuristic looking, and it was very interesting how the names would continue to write and erase repeatedly. Who made this thing, and was it even safe? Anyway, i went about my day as I normally would. Today was a weekend day and we were all spending it together. \n",
        "source": "user",
        "start_time": 269.0,
        "end_time": 374.0,
        "last_event_time": 374.0,
        "start_progress": 0.375,
        "end_progress": 0.5833333333333334
    },
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.\n\nMy first thought was to simply try and find my name. Hold up, do step dads make it on the cup? Without a doubt i would think. We do the same things, love the same way. Just with different variables i assume. I started scanning down the list of names and my eyes stopped on the very first entry. Simply because there was no first entry. The first line was just as if a name was being written but it would stop a quarter of the way, erase, and than write another name. This told me that the rankings were not in at this point yet. This was probably the first step to realizing that this wasn't a ranking at all. This was just a decorative mug, maybe with some sort of sentimental meaning, or a project that hasnt been finished. It was very futuristic looking, and it was very interesting how the names would continue to write and erase repeatedly. Who made this thing, and was it even safe? Anyway, i went about my day as I normally would. Today was a weekend day and we were all spending it together. My wife and I would take our kids to the park, than have lunch together.\n",
        "source": "api",
        "start_time": 483.0,
        "end_time": 483.0,
        "last_event_time": 483.0,
        "start_progress": 0.5833333333333334,
        "end_progress": 0.6217948717948718
    },
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.\n\nMy first thought was to simply try and find my name. Hold up, do step dads make it on the cup? Without a doubt i would think. We do the same things, love the same way. Just with different variables i assume. I started scanning down the list of names and my eyes stopped on the very first entry. Simply because there was no first entry. The first line was just as if a name was being written but it would stop a quarter of the way, erase, and than write another name. This told me that the rankings were not in at this point yet. This was probably the first step to realizing that this wasn't a ranking at all. This was just a decorative mug, maybe with some sort of sentimental meaning, or a project that hasnt been finished. It was very futuristic looking, and it was very interesting how the names would continue to write and erase repeatedly. Who made this thing, and was it even safe? Anyway, i went about my day as I normally would. Today was a weekend day and we were all spending it together. My wife and I would take our kids to the park, than have lunch together. We finished the evening with a board game and just had a terrific day in general.\n\nI came back into the room where the cup was. The mug had more writing on it. This time it was the first couple letters of my name. Ok now this was sort of weird. Did i have a good day as a dad and was this mug trying to tell me this? I am not sure what is going on.  Either way whatever it was, it gave me more confidence as a father in general. I needed to know more about this mystical mug, and after finding it, it motivated me to be the best father i could be. I always felt i did my best, but for some reason now i wanted to get my name on this mug more than ever. Just as i thought this thought, i awoke from my dream.\n",
        "source": "user",
        "start_time": 484.0,
        "end_time": 615.0,
        "last_event_time": 615.0,
        "start_progress": 0.6217948717948718,
        "end_progress": 1.0
    }
]