[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\"\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.10080961086445547
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" \n",
        "source": "user",
        "start_time": 3.0,
        "end_time": 18.0,
        "last_event_time": 18.0,
        "start_progress": 0.10080961086445547,
        "end_progress": 0.12144162966832071
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. \n",
        "source": "user",
        "start_time": 21.0,
        "end_time": 41.0,
        "last_event_time": 41.0,
        "start_progress": 0.12144162966832071,
        "end_progress": 0.13502219900757378
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. \n",
        "source": "user",
        "start_time": 44.0,
        "end_time": 57.0,
        "last_event_time": 57.0,
        "start_progress": 0.13502219900757378,
        "end_progress": 0.15382606424653958
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends.\n",
        "source": "api",
        "start_time": 66.0,
        "end_time": 66.0,
        "last_event_time": 66.0,
        "start_progress": 0.15382606424653958,
        "end_progress": 0.161399843301123
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \n",
        "source": "user",
        "start_time": 68.0,
        "end_time": 89.0,
        "last_event_time": 89.0,
        "start_progress": 0.161399843301123,
        "end_progress": 0.20684251762862366
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\"\n",
        "source": "api",
        "start_time": 94.0,
        "end_time": 94.0,
        "last_event_time": 94.0,
        "start_progress": 0.20684251762862366,
        "end_progress": 0.2172891094280491
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but \n",
        "source": "user",
        "start_time": 96.0,
        "end_time": 109.0,
        "last_event_time": 109.0,
        "start_progress": 0.2172891094280491,
        "end_progress": 0.24157743536171325
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why.\n",
        "source": "api",
        "start_time": 113.0,
        "end_time": 113.0,
        "last_event_time": 113.0,
        "start_progress": 0.24157743536171325,
        "end_progress": 0.24810655523635414
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. \n",
        "source": "user",
        "start_time": 114.0,
        "end_time": 120.0,
        "last_event_time": 120.0,
        "start_progress": 0.24810655523635414,
        "end_progress": 0.25985897101070776
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf.\n",
        "source": "api",
        "start_time": 124.0,
        "end_time": 124.0,
        "last_event_time": 124.0,
        "start_progress": 0.25985897101070776,
        "end_progress": 0.2653434317054061
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and \n",
        "source": "user",
        "start_time": 125.0,
        "end_time": 132.0,
        "last_event_time": 132.0,
        "start_progress": 0.2653434317054061,
        "end_progress": 0.28179681378950117
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf.\n",
        "source": "api",
        "start_time": 138.0,
        "end_time": 138.0,
        "last_event_time": 138.0,
        "start_progress": 0.28179681378950117,
        "end_progress": 0.2943327239488117
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and \n",
        "source": "user",
        "start_time": 142.0,
        "end_time": 147.0,
        "last_event_time": 147.0,
        "start_progress": 0.2943327239488117,
        "end_progress": 0.30268999738835206
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift.\n",
        "source": "api",
        "start_time": 150.0,
        "end_time": 150.0,
        "last_event_time": 150.0,
        "start_progress": 0.30268999738835206,
        "end_progress": 0.3105249412379211
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. \n",
        "source": "user",
        "start_time": 151.0,
        "end_time": 159.0,
        "last_event_time": 159.0,
        "start_progress": 0.3105249412379211,
        "end_progress": 0.3230608513972317
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift.\n",
        "source": "api",
        "start_time": 164.0,
        "end_time": 164.0,
        "last_event_time": 164.0,
        "start_progress": 0.3230608513972317,
        "end_progress": 0.3337686079916427
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, \n",
        "source": "user",
        "start_time": 165.0,
        "end_time": 166.0,
        "last_event_time": 166.0,
        "start_progress": 0.3337686079916427,
        "end_progress": 0.33638025594149906
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity.\n",
        "source": "api",
        "start_time": 171.0,
        "end_time": 171.0,
        "last_event_time": 171.0,
        "start_progress": 0.33638025594149906,
        "end_progress": 0.34761034212588143
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, \n",
        "source": "user",
        "start_time": 171.0,
        "end_time": 186.0,
        "last_event_time": 186.0,
        "start_progress": 0.34761034212588143,
        "end_progress": 0.3799947767041003
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced.\n",
        "source": "api",
        "start_time": 190.0,
        "end_time": 190.0,
        "last_event_time": 190.0,
        "start_progress": 0.3799947767041003,
        "end_progress": 0.38965787411856884
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, \n",
        "source": "user",
        "start_time": 196.0,
        "end_time": 220.0,
        "last_event_time": 220.0,
        "start_progress": 0.38965787411856884,
        "end_progress": 0.42099764951684515
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries\n",
        "source": "api",
        "start_time": 227.0,
        "end_time": 227.0,
        "last_event_time": 227.0,
        "start_progress": 0.42099764951684515,
        "end_progress": 0.4680073126142596
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. \n",
        "source": "user",
        "start_time": 228.0,
        "end_time": 337.0,
        "last_event_time": 337.0,
        "start_progress": 0.4680073126142596,
        "end_progress": 0.6129537738312876
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard.\n",
        "source": "api",
        "start_time": 342.0,
        "end_time": 342.0,
        "last_event_time": 342.0,
        "start_progress": 0.6129537738312876,
        "end_progress": 0.6202663880908853
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had brought a whole picnic basket full of treats.\n",
        "source": "api",
        "start_time": 351.0,
        "end_time": 351.0,
        "last_event_time": 351.0,
        "start_progress": 0.620527552885871,
        "end_progress": 0.646382867589449
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, potato chips, \n",
        "source": "user",
        "start_time": 352.0,
        "end_time": 382.0,
        "last_event_time": 382.0,
        "start_progress": 0.646382867589449,
        "end_progress": 0.6691042047531993
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, potato chips, and chocolate cake.\n",
        "source": "api",
        "start_time": 388.0,
        "end_time": 388.0,
        "last_event_time": 388.0,
        "start_progress": 0.6691042047531993,
        "end_progress": 0.6740663358579263
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, potato chips, and chocolate cake. Not only that, but the basket also had \n",
        "source": "user",
        "start_time": 390.0,
        "end_time": 394.0,
        "last_event_time": 394.0,
        "start_progress": 0.6740663358579263,
        "end_progress": 0.6845129276573518
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne.\n",
        "source": "api",
        "start_time": 400.0,
        "end_time": 400.0,
        "last_event_time": 400.0,
        "start_progress": 0.6845129276573518,
        "end_progress": 0.6957430138417341
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \n",
        "source": "user",
        "start_time": 401.0,
        "end_time": 412.0,
        "last_event_time": 412.0,
        "start_progress": 0.6957430138417341,
        "end_progress": 0.6988769913815618
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \"Wow,\" the little pig said.\n",
        "source": "api",
        "start_time": 417.0,
        "end_time": 417.0,
        "last_event_time": 417.0,
        "start_progress": 0.6988769913815618,
        "end_progress": 0.7059284408461739
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \"Wow,\" the little pig said. \"You really went all out.\"\n",
        "source": "api",
        "start_time": 422.0,
        "end_time": 422.0,
        "last_event_time": 422.0,
        "start_progress": 0.7061896056411596,
        "end_progress": 0.7129798903107861
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \"Wow,\" the little pig said. \"You really went all out.\" The two animals snacked and wined and dined on the food that Anders had brought. \n",
        "source": "user",
        "start_time": 423.0,
        "end_time": 433.0,
        "last_event_time": 433.0,
        "start_progress": 0.7129798903107861,
        "end_progress": 0.7343954034996083
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \"Wow,\" the little pig said. \"You really went all out.\" The two animals snacked and wined and dined on the food that Anders had brought. The little pig was very impressed.\n",
        "source": "api",
        "start_time": 438.0,
        "end_time": 438.0,
        "last_event_time": 438.0,
        "start_progress": 0.7343954034996083,
        "end_progress": 0.7432750065291198
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \"Wow,\" the little pig said. \"You really went all out.\" The two animals snacked and wined and dined on the food that Anders had brought. The little pig was very impressed. He realized that Anders was actually a very good conversation partner. \n",
        "source": "user",
        "start_time": 441.0,
        "end_time": 449.0,
        "last_event_time": 449.0,
        "start_progress": 0.7432750065291198,
        "end_progress": 0.7620788717680856
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \"Wow,\" the little pig said. \"You really went all out.\" The two animals snacked and wined and dined on the food that Anders had brought. The little pig was very impressed. He realized that Anders was actually a very good conversation partner. He was well-read and had a lot of interesting things to say.\n",
        "source": "api",
        "start_time": 454.0,
        "end_time": 454.0,
        "last_event_time": 454.0,
        "start_progress": 0.7620788717680856,
        "end_progress": 0.7777487594672238
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \"Wow,\" the little pig said. \"You really went all out.\" The two animals snacked and wined and dined on the food that Anders had brought. The little pig was very impressed. He realized that Anders was actually a very good conversation partner. He was well-read and had a lot of interesting things to say. He was also very funny.\n",
        "source": "api",
        "start_time": 459.0,
        "end_time": 459.0,
        "last_event_time": 459.0,
        "start_progress": 0.7780099242622095,
        "end_progress": 0.784016714546879
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \"Wow,\" the little pig said. \"You really went all out.\" The two animals snacked and wined and dined on the food that Anders had brought. The little pig was very impressed. He realized that Anders was actually a very good conversation partner. He was well-read and had a lot of interesting things to say. He was also very funny. The little pig was having a great time.\n",
        "source": "api",
        "start_time": 463.0,
        "end_time": 463.0,
        "last_event_time": 463.0,
        "start_progress": 0.7842778793418648,
        "end_progress": 0.7944633063463045
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \"Wow,\" the little pig said. \"You really went all out.\" The two animals snacked and wined and dined on the food that Anders had brought. The little pig was very impressed. He realized that Anders was actually a very good conversation partner. He was well-read and had a lot of interesting things to say. He was also very funny. The little pig was having a great time. \"I'm so glad that I decided to meet you,\" the little pig said.\n",
        "source": "api",
        "start_time": 469.0,
        "end_time": 469.0,
        "last_event_time": 469.0,
        "start_progress": 0.7947244711412902,
        "end_progress": 0.8109166884303995
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \"Wow,\" the little pig said. \"You really went all out.\" The two animals snacked and wined and dined on the food that Anders had brought. The little pig was very impressed. He realized that Anders was actually a very good conversation partner. He was well-read and had a lot of interesting things to say. He was also very funny. The little pig was having a great time. \"I'm so glad that I decided to meet you,\" the little pig said. \"I had no idea that you were such a great guy.\"\n",
        "source": "api",
        "start_time": 474.0,
        "end_time": 474.0,
        "last_event_time": 474.0,
        "start_progress": 0.8111778532253853,
        "end_progress": 0.8234525985897101
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \"Wow,\" the little pig said. \"You really went all out.\" The two animals snacked and wined and dined on the food that Anders had brought. The little pig was very impressed. He realized that Anders was actually a very good conversation partner. He was well-read and had a lot of interesting things to say. He was also very funny. The little pig was having a great time. \"I'm so glad that I decided to meet you,\" the little pig said. \"I had no idea that you were such a great guy.\" Anders nodded. \"I'm sorry that some wolves have a bad reputation,\" he said. \"But I promise I just want to be friends. Maybe we could hang out again sometime.\" \n",
        "source": "user",
        "start_time": 475.0,
        "end_time": 496.0,
        "last_event_time": 496.0,
        "start_progress": 0.8234525985897101,
        "end_progress": 0.8652389657874119
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \"Wow,\" the little pig said. \"You really went all out.\" The two animals snacked and wined and dined on the food that Anders had brought. The little pig was very impressed. He realized that Anders was actually a very good conversation partner. He was well-read and had a lot of interesting things to say. He was also very funny. The little pig was having a great time. \"I'm so glad that I decided to meet you,\" the little pig said. \"I had no idea that you were such a great guy.\" Anders nodded. \"I'm sorry that some wolves have a bad reputation,\" he said. \"But I promise I just want to be friends. Maybe we could hang out again sometime.\" The little pig smiled.\n",
        "source": "api",
        "start_time": 504.0,
        "end_time": 504.0,
        "last_event_time": 504.0,
        "start_progress": 0.8652389657874119,
        "end_progress": 0.8709845912770958
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \"Wow,\" the little pig said. \"You really went all out.\" The two animals snacked and wined and dined on the food that Anders had brought. The little pig was very impressed. He realized that Anders was actually a very good conversation partner. He was well-read and had a lot of interesting things to say. He was also very funny. The little pig was having a great time. \"I'm so glad that I decided to meet you,\" the little pig said. \"I had no idea that you were such a great guy.\" Anders nodded. \"I'm sorry that some wolves have a bad reputation,\" he said. \"But I promise I just want to be friends. Maybe we could hang out again sometime.\" The little pig smiled. \"I'd like that,\" he said.\n",
        "source": "api",
        "start_time": 508.0,
        "end_time": 508.0,
        "last_event_time": 508.0,
        "start_progress": 0.8712457560720814,
        "end_progress": 0.8777748759467224
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \"Wow,\" the little pig said. \"You really went all out.\" The two animals snacked and wined and dined on the food that Anders had brought. The little pig was very impressed. He realized that Anders was actually a very good conversation partner. He was well-read and had a lot of interesting things to say. He was also very funny. The little pig was having a great time. \"I'm so glad that I decided to meet you,\" the little pig said. \"I had no idea that you were such a great guy.\" Anders nodded. \"I'm sorry that some wolves have a bad reputation,\" he said. \"But I promise I just want to be friends. Maybe we could hang out again sometime.\" The little pig smiled. \"I'd like that,\" he said. After all, he could use a friend or two, and regardless it would be good to be friends with a wolf so Anders could scare away any mean, bad wolves that might come around. \n",
        "source": "user",
        "start_time": 509.0,
        "end_time": 526.0,
        "last_event_time": 526.0,
        "start_progress": 0.8777748759467224,
        "end_progress": 0.9226952206842518
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \"Wow,\" the little pig said. \"You really went all out.\" The two animals snacked and wined and dined on the food that Anders had brought. The little pig was very impressed. He realized that Anders was actually a very good conversation partner. He was well-read and had a lot of interesting things to say. He was also very funny. The little pig was having a great time. \"I'm so glad that I decided to meet you,\" the little pig said. \"I had no idea that you were such a great guy.\" Anders nodded. \"I'm sorry that some wolves have a bad reputation,\" he said. \"But I promise I just want to be friends. Maybe we could hang out again sometime.\" The little pig smiled. \"I'd like that,\" he said. After all, he could use a friend or two, and regardless it would be good to be friends with a wolf so Anders could scare away any mean, bad wolves that might come around. The two animals exchanged phone numbers and parted ways.\n",
        "source": "api",
        "start_time": 534.0,
        "end_time": 534.0,
        "last_event_time": 534.0,
        "start_progress": 0.9226952206842518,
        "end_progress": 0.9373204492034474
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The little pig saw the wolf and said \"Anders, don't you dare try to come in!\" Anders was surprised by the little pig's hostility. He was a friendly wolf and had no intentions of harming the little pig. He just wanted to be friends. Anders asked the little pig if the little pig would be interested in a sleepover, but the little pig would have none of it. \"I'm smarter than that,\" the little pig scoffed. \"There's no way you're getting in here.\" Anders was sad. He didn't have many friends. He knew that many animals despised wolves, but he didn't understand why. Anders didn't have a mean bone in his body. He was a gentle wolf. So he was determined to make friends with the little wolf and prove to the little pig that he was a good wolf. He dropped by the next day and offered the little pig a gift. The gift was a tin full of cookies and treats. The little pig was surprised by the gift. However, he was not swayed by the wolf's generosity. He was immediately suspicious that the wolf must have an ulterior motive. \"There is no ulterior motive,\" Anders protested, but the little pig was not convinced. Anders began to describe the treats that were in the tin: \"Look,\" he said. \"I've brought you some homemade lemon bars, some chocolate chip cookies, some brownies, some chocolate covered strawberries, some chocolate covered bananas, some chocolate covered cherries, some chocolate covered blueberries... who doesn't like these treats?\" The little pig was intrigued. He was always a sucker for good dessert. Even if Anders was a wolf, it was a nice gesture for him to bring desserts. So the little wolf agreed to meet Anders and share the treats, though the little pig insisted that they meet outside of the house. \"We can meet in my backyard,\" the little pig said. He was going to take every precaution with this wolf. Anders relented. He could make friends with the pig regardless of the location, even if the little pig wasn't being totally hospitable. So they met in the backyard. The little pig was surprised to see that the wolf had also brought a whole picnic basket full of delicacies, including cheese sandwiches, cold fried chicken, potato salad, egg salad, potato chips, and chocolate cake. Not only that, but the basket also had a bottle of wine and a bottle of champagne. \"Wow,\" the little pig said. \"You really went all out.\" The two animals snacked and wined and dined on the food that Anders had brought. The little pig was very impressed. He realized that Anders was actually a very good conversation partner. He was well-read and had a lot of interesting things to say. He was also very funny. The little pig was having a great time. \"I'm so glad that I decided to meet you,\" the little pig said. \"I had no idea that you were such a great guy.\" Anders nodded. \"I'm sorry that some wolves have a bad reputation,\" he said. \"But I promise I just want to be friends. Maybe we could hang out again sometime.\" The little pig smiled. \"I'd like that,\" he said. After all, he could use a friend or two, and regardless it would be good to be friends with a wolf so Anders could scare away any mean, bad wolves that might come around. The two animals exchanged phone numbers and parted ways. But from then on, they stayed in close touch with each other and became lifelong friends. The moral of the story is that you should always be open and receptive to kindness! You never know when that might lead to an unexpected friendship. \n",
        "source": "user",
        "start_time": 535.0,
        "end_time": 561.0,
        "last_event_time": 561.0,
        "start_progress": 0.9373204492034474,
        "end_progress": 1.0
    }
]