[
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.21864951768488747
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. The surviving humans can fly and go to anywhere they like. \n",
        "source": "user",
        "start_time": 48.0,
        "end_time": 86.0,
        "last_event_time": 86.0,
        "start_progress": 0.21864951768488747,
        "end_progress": 0.26688102893890675
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. The surviving humans can fly and go to anywhere they like. The world is once again full of magic.\n",
        "source": "api",
        "start_time": 104.0,
        "end_time": 104.0,
        "last_event_time": 104.0,
        "start_progress": 0.26688102893890675,
        "end_progress": 0.297427652733119
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. The surviving humans can fly and go to anywhere they like. The world is once again full of magic. In this way, most of the commercial airplanes are no longer required because humans can fly themselves. \n",
        "source": "user",
        "start_time": 108.0,
        "end_time": 223.0,
        "last_event_time": 223.0,
        "start_progress": 0.2982315112540193,
        "end_progress": 0.38183279742765275
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. The surviving humans can fly and go to anywhere they like. The world is once again full of magic. In this way, most of the commercial airplanes are no longer required because humans can fly themselves. The airplanes are now used as a means of transportation for the various factions of humans.\n",
        "source": "api",
        "start_time": 238.0,
        "end_time": 238.0,
        "last_event_time": 238.0,
        "start_progress": 0.38183279742765275,
        "end_progress": 0.454983922829582
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. The surviving humans can fly and go to anywhere they like. The world is once again full of magic. In this way, most of the commercial airplanes are no longer required because humans can fly themselves. The airplanes are now used mainly as a means of transportation for goods. This results in a greener earth due to less carbon footprints. The hostile aliens don't like fresh air! \n",
        "source": "user",
        "start_time": 250.0,
        "end_time": 328.0,
        "last_event_time": 328.0,
        "start_progress": 0.454983922829582,
        "end_progress": 0.52491961414791
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. The surviving humans can fly and go to anywhere they like. The world is once again full of magic. In this way, most of the commercial airplanes are no longer required because humans can fly themselves. The airplanes are now used mainly as a means of transportation for goods. This results in a greener earth due to less carbon footprints. The hostile aliens don't like fresh air! They love air pollution because they need intake of a variety of gases for survival. \n",
        "source": "user",
        "start_time": 332.0,
        "end_time": 421.0,
        "last_event_time": 421.0,
        "start_progress": 0.52491961414791,
        "end_progress": 0.5932475884244373
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. The surviving humans can fly and go to anywhere they like. The world is once again full of magic. In this way, most of the commercial airplanes are no longer required because humans can fly themselves. The airplanes are now used mainly as a means of transportation for goods. This results in a greener earth due to less carbon footprints. The hostile aliens don't like fresh air! They love air pollution because they need intake of a variety of gases for survival. The aliens have invaded the earth because they want to take over the planet and make it their own.\n",
        "source": "api",
        "start_time": 439.0,
        "end_time": 439.0,
        "last_event_time": 439.0,
        "start_progress": 0.5932475884244373,
        "end_progress": 0.6720257234726688
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. The surviving humans can fly and go to anywhere they like. The world is once again full of magic. In this way, most of the commercial airplanes are no longer required because humans can fly themselves. The airplanes are now used mainly as a means of transportation for goods. This results in a greener earth due to less carbon footprints. The hostile aliens don't like fresh air! They love air pollution because they need intake of a variety of gases for survival. The aliens have invaded the earth because they know that the earth is highly polluted and they want to make it their own. \n",
        "source": "user",
        "start_time": 451.0,
        "end_time": 479.0,
        "last_event_time": 479.0,
        "start_progress": 0.6720257234726688,
        "end_progress": 0.6913183279742765
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. The surviving humans can fly and go to anywhere they like. The world is once again full of magic. In this way, most of the commercial airplanes are no longer required because humans can fly themselves. The airplanes are now used mainly as a means of transportation for goods. This results in a greener earth due to less carbon footprints. The hostile aliens don't like fresh air! They love air pollution because they need intake of a variety of gases for survival. The aliens have invaded the earth because they know that the earth is highly polluted and they want to make it their own. The aliens have a special ability to absorb the pollution in the air and use it to grow stronger.\n",
        "source": "api",
        "start_time": 499.0,
        "end_time": 499.0,
        "last_event_time": 499.0,
        "start_progress": 0.6913183279742765,
        "end_progress": 0.7692926045016077
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. The surviving humans can fly and go to anywhere they like. The world is once again full of magic. In this way, most of the commercial airplanes are no longer required because humans can fly themselves. The airplanes are now used mainly as a means of transportation for goods. This results in a greener earth due to less carbon footprints. The hostile aliens don't like fresh air! They love air pollution because they need intake of a variety of gases for survival. The aliens have invaded the earth because they know that the earth is highly polluted and they want to make it their own. The aliens have a special ability to absorb the pollution in the air and use it to grow stronger. They want to destroy the human race and take over the earth.\n",
        "source": "api",
        "start_time": 518.0,
        "end_time": 518.0,
        "last_event_time": 518.0,
        "start_progress": 0.770096463022508,
        "end_progress": 0.8183279742765274
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. The surviving humans can fly and go to anywhere they like. The world is once again full of magic. In this way, most of the commercial airplanes are no longer required because humans can fly themselves. The airplanes are now used mainly as a means of transportation for goods. This results in a greener earth due to less carbon footprints. The hostile aliens don't like fresh air! They love air pollution because they need intake of a variety of gases for survival. The aliens have invaded the earth because they know that the earth is highly polluted and they want to make it their own. The aliens have a special ability to absorb the pollution in the air and use it to grow stronger. They want to destroy the human race through pollution and take over the earth. \n",
        "source": "user",
        "start_time": 524.0,
        "end_time": 533.0,
        "last_event_time": 533.0,
        "start_progress": 0.8183279742765274,
        "end_progress": 0.8336012861736335
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. The surviving humans can fly and go to anywhere they like. The world is once again full of magic. In this way, most of the commercial airplanes are no longer required because humans can fly themselves. The airplanes are now used mainly as a means of transportation for goods. This results in a greener earth due to less carbon footprints. The hostile aliens don't like fresh air! They love air pollution because they need intake of a variety of gases for survival. The aliens have invaded the earth because they know that the earth is highly polluted and they want to make it their own. The aliens have a special ability to absorb the pollution in the air and use it to grow stronger. They want to destroy the human race through pollution and take over the earth. The human race is now in a battle for survival.\n",
        "source": "api",
        "start_time": 541.0,
        "end_time": 541.0,
        "last_event_time": 541.0,
        "start_progress": 0.8336012861736335,
        "end_progress": 0.8713826366559485
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. The surviving humans can fly and go to anywhere they like. The world is once again full of magic. In this way, most of the commercial airplanes are no longer required because humans can fly themselves. The airplanes are now used mainly as a means of transportation for goods. This results in a greener earth due to less carbon footprints. The hostile aliens don't like fresh air! They love air pollution because they need intake of a variety of poisonous gases for survival. The aliens have invaded the earth because they know that the earth is highly polluted and they want to make it their own. The aliens have a special ability to absorb the pollution in the air and use it to grow stronger. They want to destroy the human race through pollution and take over the earth. The human race's new flying power now makes the earth a difficult place for the aliens to live in. Gradually, the aliens die of breathing in fresh air and become extinct from the earth. Humans win!\n",
        "source": "user",
        "start_time": 549.0,
        "end_time": 720.0,
        "last_event_time": 720.0,
        "start_progress": 0.8713826366559485,
        "end_progress": 1.0
    }
]