[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the \"Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.11312741312741313
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the \"Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. You're now a young adult, but you're going to die.\n",
        "source": "api",
        "start_time": 46.0,
        "end_time": 57.0,
        "last_event_time": 57.0,
        "start_progress": 0.11312741312741313,
        "end_progress": 0.13281853281853281
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the \"Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. \n\nYou're now a young adult, but you're going to die. Now you might be thinking what's the big deal, everyone dies. Remember these people were given a drug that is supposed to grant them immortality. You were too high risk because you were too old. \n\nThe problem is, the people given the immortality drug were sold a bill of goods. The drug didn't actually produce immortality. It doesn't prevent people from aging. It actually does the opposite.\n\nPeople who are 40 years old look 80. They have wrinkled skin, muscle atrophy and are becoming very forgetful. The scientists simply got this one wrong. This was an experiment after all. There was no guarantee. But the researchers dangled immortality over those young and impressionable adults like a carrot. Most humans would take a drug if they were told they would be immortal if they did so.\n\nHow could the researchers get something so wrong? That's a great question. The answer would be greed. The researchers figured that this experiment would go well and they would be sitting on a gold mine. And they were. For about 10 years there weren't any issues. Now the side effects are starting to show and those researchers who are now rich are public enemy number one.\n\nPeople are throwing bricks at their homes, defacing their property, breaking their car windows and more. The researchers basically exploited the human mind in order to make a huge amount of money. What once was an experiment turned into a business. Again, if there is an immortality drug...there's no price you can pay that would make it a rip off. Immortality is priceless.\n\nI feel horrible for these people. I don't think the researchers did this maliciously. But when it comes to a human beings life, you can't be taking risks and shortcuts in order to profit. Those researchers ended up getting killed by a mob of previous patients. There was no real way to escape. They were the most wanted people in the world. \n\nThis should serve as a life lesson for society. There are always going to be greedy people in this world. People who try to use you in order to profit. People who try to take advantage of you for their benefit.\n\nThe most important thing you can do as a human is always rely on your gut. Your gut and your instincts will never steer you in the wrong direction. \n",
        "source": "user",
        "start_time": 60.0,
        "end_time": 556.0,
        "last_event_time": 556.0,
        "start_progress": 0.13281853281853281,
        "end_progress": 1.0
    }
]