[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.16188769414575865
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" \n",
        "source": "user",
        "start_time": 42.0,
        "end_time": 75.0,
        "last_event_time": 75.0,
        "start_progress": 0.16188769414575865,
        "end_progress": 0.18518518518518517
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and you say \"I'm not going to let you die, my Queen.\n",
        "source": "api",
        "start_time": 93.0,
        "end_time": 93.0,
        "last_event_time": 93.0,
        "start_progress": 0.18518518518518517,
        "end_progress": 0.2162485065710872
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" \n",
        "source": "user",
        "start_time": 105.0,
        "end_time": 126.0,
        "last_event_time": 126.0,
        "start_progress": 0.2162485065710872,
        "end_progress": 0.23357228195937874
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee, your Majesty.\n",
        "source": "api",
        "start_time": 178.0,
        "end_time": 178.0,
        "last_event_time": 178.0,
        "start_progress": 0.23357228195937874,
        "end_progress": 0.26881720430107525
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" \n",
        "source": "user",
        "start_time": 186.0,
        "end_time": 198.0,
        "last_event_time": 198.0,
        "start_progress": 0.26881720430107525,
        "end_progress": 0.2747909199522103
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I'm like \"A bee servant?\n",
        "source": "api",
        "start_time": 204.0,
        "end_time": 204.0,
        "last_event_time": 204.0,
        "start_progress": 0.2747909199522103,
        "end_progress": 0.2891278375149343
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" \n",
        "source": "user",
        "start_time": 217.0,
        "end_time": 223.0,
        "last_event_time": 223.0,
        "start_progress": 0.2891278375149343,
        "end_progress": 0.2897252090800478
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" and the bee says \"Yes, I'm a bee that was born with the ability to understand human speech.\n",
        "source": "api",
        "start_time": 234.0,
        "end_time": 234.0,
        "last_event_time": 234.0,
        "start_progress": 0.2897252090800478,
        "end_progress": 0.34408602150537637
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" and the bee says \"Yes, I'm a bee that was born with the ability to understand human speech. Just give me commands\" \n",
        "source": "user",
        "start_time": 243.0,
        "end_time": 261.0,
        "last_event_time": 261.0,
        "start_progress": 0.34408602150537637,
        "end_progress": 0.35842293906810035
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" and the bee says \"Yes, I'm a bee that was born with the ability to understand human speech. Just give me commands\" I'm like \"I don't know what to say\" and the bee says \"Just say anything, my Queen.\n",
        "source": "api",
        "start_time": 275.0,
        "end_time": 275.0,
        "last_event_time": 275.0,
        "start_progress": 0.35842293906810035,
        "end_progress": 0.4074074074074074
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" and the bee says \"Yes, I'm a bee that was born with the ability to understand human speech. Just give me commands\" I'm like \"I don't know what to say\" and the bee says \"Just say anything, my Queen.\" I'm like \"Okay, I want a sandwich\" and the bee says \"Yes, my Queen.\n",
        "source": "api",
        "start_time": 296.0,
        "end_time": 296.0,
        "last_event_time": 296.0,
        "start_progress": 0.40860215053763443,
        "end_progress": 0.4486260454002389
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" and the bee says \"Yes, I'm a bee that was born with the ability to understand human speech. Just give me commands\" I'm like \"I don't know what to say\" and the bee says \"Just say anything, my Queen.\" I'm excited and say \"Okay, I want a sandwich\" and the bee says \"Yes, my Queen.\" It then flips its wings many times and a delicious sandwich appears before me. \n",
        "source": "user",
        "start_time": 309.0,
        "end_time": 390.0,
        "last_event_time": 390.0,
        "start_progress": 0.4486260454002389,
        "end_progress": 0.503584229390681
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" and the bee says \"Yes, I'm a bee that was born with the ability to understand human speech. Just give me commands\" I'm like \"I don't know what to say\" and the bee says \"Just say anything, my Queen.\" I'm excited and say \"Okay, I want a sandwich\" and the bee says \"Yes, my Queen.\" It then flips its wings many times and a delicious sandwich appears before me. I eat it and it tastes like the best sandwich I've ever had.\n",
        "source": "api",
        "start_time": 413.0,
        "end_time": 413.0,
        "last_event_time": 413.0,
        "start_progress": 0.503584229390681,
        "end_progress": 0.5394265232974911
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" and the bee says \"Yes, I'm a bee that was born with the ability to understand human speech. Just give me commands\" I'm like \"I don't know what to say\" and the bee says \"Just say anything, my Queen.\" I'm excited and say \"Okay, I want a sandwich\" and the bee says \"Yes, my Queen.\" It then flips its wings many times and a delicious sandwich appears before me. I eat it and it tastes like the best sandwich I've ever had. I'm like \"This is amazing!\" and the bee says \"I'm glad you like it, my Queen.\"\n",
        "source": "api",
        "start_time": 423.0,
        "end_time": 423.0,
        "last_event_time": 423.0,
        "start_progress": 0.5400238948626045,
        "end_progress": 0.5866188769414575
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" and the bee says \"Yes, I'm a bee that was born with the ability to understand human speech. Just give me commands\" I'm like \"I don't know what to say\" and the bee says \"Just say anything, my Queen.\" I'm excited and say \"Okay, I want a sandwich\" and the bee says \"Yes, my Queen.\" It then flips its wings many times and a delicious sandwich appears before me. I eat it and it tastes like the best sandwich I've ever had. I'm like \"This is amazing!\" and the bee says \"I'm glad you like it, my Queen.\"\n\nThe next day, I give another command to the bee, \"Cure my deadly allergy to bees!\" \n",
        "source": "user",
        "start_time": 438.0,
        "end_time": 618.0,
        "last_event_time": 618.0,
        "start_progress": 0.5866188769414575,
        "end_progress": 0.6373954599761051
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" and the bee says \"Yes, I'm a bee that was born with the ability to understand human speech. Just give me commands\" I'm like \"I don't know what to say\" and the bee says \"Just say anything, my Queen.\" I'm excited and say \"Okay, I want a sandwich\" and the bee says \"Yes, my Queen.\" It then flips its wings many times and a delicious sandwich appears before me. I eat it and it tastes like the best sandwich I've ever had. I'm like \"This is amazing!\" and the bee says \"I'm glad you like it, my Queen.\"\n\nThe next day, I give another command to the bee, \"Cure my deadly allergy to bees!\" The bee says \"Yes, my Queen.\"\n",
        "source": "api",
        "start_time": 625.0,
        "end_time": 625.0,
        "last_event_time": 625.0,
        "start_progress": 0.6373954599761051,
        "end_progress": 0.6547192353643967
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" and the bee says \"Yes, I'm a bee that was born with the ability to understand human speech. Just give me commands\" I'm like \"I don't know what to say\" and the bee says \"Just say anything, my Queen.\" I'm excited and say \"Okay, I want a sandwich\" and the bee says \"Yes, my Queen.\" It then flips its wings many times and a delicious sandwich appears before me. I eat it and it tastes like the best sandwich I've ever had. I'm like \"This is amazing!\" and the bee says \"I'm glad you like it, my Queen.\"\n\nThe next day, I give another command to the bee, \"Cure my deadly allergy to bees!\" The bee hesitates for a while and says \"Yes, my Queen.\" \n",
        "source": "user",
        "start_time": 627.0,
        "end_time": 636.0,
        "last_event_time": 636.0,
        "start_progress": 0.6547192353643967,
        "end_progress": 0.6708482676224612
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" and the bee says \"Yes, I'm a bee that was born with the ability to understand human speech. Just give me commands\" I'm like \"I don't know what to say\" and the bee says \"Just say anything, my Queen.\" I'm excited and say \"Okay, I want a sandwich\" and the bee says \"Yes, my Queen.\" It then flips its wings many times and a delicious sandwich appears before me. I eat it and it tastes like the best sandwich I've ever had. I'm like \"This is amazing!\" and the bee says \"I'm glad you like it, my Queen.\"\n\nThe next day, I give another command to the bee, \"Cure my deadly allergy to bees!\" The bee hesitates for a while and says \"Yes, my Queen.\" It then flips its wings many times and I feel a tingling sensation.\n",
        "source": "api",
        "start_time": 687.0,
        "end_time": 687.0,
        "last_event_time": 687.0,
        "start_progress": 0.6708482676224612,
        "end_progress": 0.7108721624850657
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" and the bee says \"Yes, I'm a bee that was born with the ability to understand human speech. Just give me commands\" I'm like \"I don't know what to say\" and the bee says \"Just say anything, my Queen.\" I'm excited and say \"Okay, I want a sandwich\" and the bee says \"Yes, my Queen.\" It then flips its wings many times and a delicious sandwich appears before me. I eat it and it tastes like the best sandwich I've ever had. I'm like \"This is amazing!\" and the bee says \"I'm glad you like it, my Queen.\"\n\nThe next day, I give another command to the bee, \"Cure my deadly allergy to bees!\" The bee hesitates for a while and says \"Yes, my Queen.\" It then flips its wings many times and I feel a tingling sensation. I thinks the bee tricks me and wants to hurt me. But the bee says \"I've injected millions of antibodies into your body such that it will be immune from allergy to bees.\" I doubt and say \"Really?\" \n",
        "source": "user",
        "start_time": 691.0,
        "end_time": 785.0,
        "last_event_time": 785.0,
        "start_progress": 0.7108721624850657,
        "end_progress": 0.8285543608124253
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" and the bee says \"Yes, I'm a bee that was born with the ability to understand human speech. Just give me commands\" I'm like \"I don't know what to say\" and the bee says \"Just say anything, my Queen.\" I'm excited and say \"Okay, I want a sandwich\" and the bee says \"Yes, my Queen.\" It then flips its wings many times and a delicious sandwich appears before me. I eat it and it tastes like the best sandwich I've ever had. I'm like \"This is amazing!\" and the bee says \"I'm glad you like it, my Queen.\"\n\nThe next day, I give another command to the bee, \"Cure my deadly allergy to bees!\" The bee hesitates for a while and says \"Yes, my Queen.\" It then flips its wings many times and I feel a tingling sensation. I thinks the bee tricks me and wants to hurt me. But the bee says \"I've injected millions of antibodies into your body such that it will be immune from allergy to bees.\" I doubt and say \"Really?\" The bee says \"Yes, my Queen.\"\n",
        "source": "api",
        "start_time": 791.0,
        "end_time": 791.0,
        "last_event_time": 791.0,
        "start_progress": 0.8285543608124253,
        "end_progress": 0.8458781362007168
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" and the bee says \"Yes, I'm a bee that was born with the ability to understand human speech. Just give me commands\" I'm like \"I don't know what to say\" and the bee says \"Just say anything, my Queen.\" I'm excited and say \"Okay, I want a sandwich\" and the bee says \"Yes, my Queen.\" It then flips its wings many times and a delicious sandwich appears before me. I eat it and it tastes like the best sandwich I've ever had. I'm like \"This is amazing!\" and the bee says \"I'm glad you like it, my Queen.\"\n\nThe next day, I give another command to the bee, \"Cure my deadly allergy to bees!\" The bee hesitates for a while and says \"Yes, my Queen.\" It then flips its wings many times and I feel a tingling sensation. I thinks the bee tricks me and wants to hurt me. But the bee says \"I've injected millions of antibodies into your body such that it will be immune from allergy to bees.\" I doubt and say \"Really?\" The bee says \"Yes, my Queen.\" I then go to the doctor to check for my allergy symptom. The doctor does some test and confirms I am not allergic to bees anymore. \n",
        "source": "user",
        "start_time": 796.0,
        "end_time": 862.0,
        "last_event_time": 862.0,
        "start_progress": 0.8458781362007168,
        "end_progress": 0.9247311827956989
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" and the bee says \"Yes, I'm a bee that was born with the ability to understand human speech. Just give me commands\" I'm like \"I don't know what to say\" and the bee says \"Just say anything, my Queen.\" I'm excited and say \"Okay, I want a sandwich\" and the bee says \"Yes, my Queen.\" It then flips its wings many times and a delicious sandwich appears before me. I eat it and it tastes like the best sandwich I've ever had. I'm like \"This is amazing!\" and the bee says \"I'm glad you like it, my Queen.\"\n\nThe next day, I give another command to the bee, \"Cure my deadly allergy to bees!\" The bee hesitates for a while and says \"Yes, my Queen.\" It then flips its wings many times and I feel a tingling sensation. I thinks the bee tricks me and wants to hurt me. But the bee says \"I've injected millions of antibodies into your body such that it will be immune from allergy to bees.\" I doubt and say \"Really?\" The bee says \"Yes, my Queen.\" I then go to the doctor to check for my allergy symptom. The doctor does some test and confirms I am not allergic to bees anymore. I am so happy and I hug the bee.\n",
        "source": "api",
        "start_time": 876.0,
        "end_time": 876.0,
        "last_event_time": 876.0,
        "start_progress": 0.9247311827956989,
        "end_progress": 0.9438470728793309
    },
    {
        "text": "Your entire life, you've been told you're deadly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am like \"What the hack? I'm dying!\" and the bee says \"I'm not going to let you die, my Queen. I'm here to save you.\" I'm like \"What?\" and the bee says \"I'm a bee servant, your Majesty.\" I asked \"A bee servant?\" and the bee says \"Yes, I'm a bee that was born with the ability to understand human speech. Just give me commands\" I'm like \"I don't know what to say\" and the bee says \"Just say anything, my Queen.\" I'm excited and say \"Okay, I want a sandwich\" and the bee says \"Yes, my Queen.\" It then flips its wings many times and a delicious sandwich appears before me. I eat it and it tastes like the best sandwich I've ever had. I'm like \"This is amazing!\" and the bee says \"I'm glad you like it, my Queen.\"\n\nThe next day, I give another command to the bee, \"Cure my deadly allergy to bees!\" The bee hesitates for a while and says \"Yes, my Queen.\" It then flips its wings many times and I feel a tingling sensation. I thinks the bee tricks me and wants to hurt me. But the bee says \"I've injected millions of antibodies into your body such that it will be immune from allergy to bees.\" I doubt and say \"Really?\" The bee says \"Yes, my Queen.\" I then go to the doctor to check for my allergy symptom. The doctor does some tests and confirms I am not allergic to bees anymore. I am so happy and I want to hug the bee. But the bee disappears! I'm so sad because I'm grateful for and miss the bee so much!\n",
        "source": "user",
        "start_time": 880.0,
        "end_time": 1032.0,
        "last_event_time": 1032.0,
        "start_progress": 0.9438470728793309,
        "end_progress": 1.0
    }
]