[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.17015098722415795
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. People are living forever but they are still aging. The aging process was slowed but not stopped. It was found after testing on mice that the body will continue to deteriorate but never actually die. \n",
        "source": "user",
        "start_time": 15.0,
        "end_time": 83.0,
        "last_event_time": 83.0,
        "start_progress": 0.17015098722415795,
        "end_progress": 0.2868757259001161
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. People are living forever but they are still aging. The aging process was slowed but not stopped. It was found after testing on mice that the body will continue to deteriorate but never actually die. One scientist sees a solution. We must freeze all the immortals until we have a cure. \n",
        "source": "user",
        "start_time": 87.0,
        "end_time": 141.0,
        "last_event_time": 141.0,
        "start_progress": 0.2868757259001161,
        "end_progress": 0.33681765389082463
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. People are living forever but they are still aging. The aging process was slowed but not stopped. It was found after testing on mice that the body will continue to deteriorate but never actually die. One scientist sees a solution. We must freeze all the immortals until we have a cure. The world is plunged into a manmade ice age, plunging everyone under 26 into a frozen state.\n",
        "source": "api",
        "start_time": 163.0,
        "end_time": 163.0,
        "last_event_time": 163.0,
        "start_progress": 0.33681765389082463,
        "end_progress": 0.3902439024390244
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. People are living forever but they are still aging. The aging process was slowed but not stopped. It was found after testing on mice that the body will continue to deteriorate but never actually die. One scientist sees a solution. We must freeze all the immortals until we have a cure. The world is plunged into a manmade ice age, freezing all immortals except for a couple dozen who will work on an antidote. By this time the lost generations are all older but certain treatments have increased their lifespan as well so instead of a 100 year old person they are more like 50 year olds. \n",
        "source": "user",
        "start_time": 168.0,
        "end_time": 264.0,
        "last_event_time": 264.0,
        "start_progress": 0.3902439024390244,
        "end_progress": 0.5121951219512195
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. People are living forever but they are still aging. The aging process was slowed but not stopped. It was found after testing on mice that the body will continue to deteriorate but never actually die. One scientist sees a solution. We must freeze all the immortals until we have a cure. The world is plunged into a manmade ice age, freezing all immortals except for a couple dozen who will work on an antidote. By this time the lost generations are all older but certain treatments have increased their lifespan as well so instead of a 100 year old person they are more like 50 year olds. \nThen it is found out that the mass chambers of cryogenicly frozen bodies are starting to fail. They are unthawing and we are not done. Just then one of the lost generation's older scientists sneeze right onto a petri-dish. \n",
        "source": "user",
        "start_time": 267.0,
        "end_time": 400.0,
        "last_event_time": 400.0,
        "start_progress": 0.5121951219512195,
        "end_progress": 0.6422764227642277
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. People are living forever but they are still aging. The aging process was slowed but not stopped. It was found after testing on mice that the body will continue to deteriorate but never actually die. One scientist sees a solution. We must freeze all the immortals until we have a cure. The world is plunged into a manmade ice age, freezing all immortals except for a couple dozen who will work on an antidote. By this time the lost generations are all older but certain treatments have increased their lifespan as well so instead of a 100 year old person they are more like 50 year olds. \nThen it is found out that the mass chambers of cryogenicly frozen bodies are starting to fail. They are unthawing and we are not done. Just then one of the lost generation's older scientists sneeze right onto a petri-dish. His snot had a latent virus, the same one he caught as a child.\n",
        "source": "api",
        "start_time": 415.0,
        "end_time": 415.0,
        "last_event_time": 415.0,
        "start_progress": 0.6422764227642277,
        "end_progress": 0.6788617886178862
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. People are living forever but they are still aging. The aging process was slowed but not stopped. It was found after testing on mice that the body will continue to deteriorate but never actually die. One scientist sees a solution. We must freeze all the immortals until we have a cure. The world is plunged into a man made ice age, freezing all immortals except for a couple dozen who will work on an antidote. By this time the lost generations are all older but certain treatments have increased their lifespan as well so instead of a 100 year old person they are more like 50 year olds. \nThen it is found out that the mass chambers of cryogenicly frozen bodies are starting to fail. They are unthawing and we are not done. Just then one of the lost generation's older scientists sneeze right onto a petri-dish. His snot had a latent virus, the same one he caught as a child. It kills the cells that are attacking the immortals. This rare virus that does no harm to the body and just lies dormant for the entire life span of the host is the solution to all of our problems. Then the old man chimes in and says \"well, not everybody's problems\". We will still die. Yes but humanity will live said the scientist. That gave the old man solace and he accepted his fate. He would die but the human race would go on living because of him. He would be remembered as the old man who saved humanity. One of the last old men to ever live.\n",
        "source": "user",
        "start_time": 417.0,
        "end_time": 682.0,
        "last_event_time": 682.0,
        "start_progress": 0.6788617886178862,
        "end_progress": 1.0
    }
]