[
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.14035087719298245
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. \nBut can this new power save humanity from total extinction?\n",
        "source": "api",
        "start_time": 46.0,
        "end_time": 46.0,
        "last_event_time": 46.0,
        "start_progress": 0.14138286893704852,
        "end_progress": 0.17182662538699692
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. But can this new power save humanity from total extinction? Nobody knows. What they know for sure is that for the humans to have any chance to survive, they are going to have to be creative. \n",
        "source": "user",
        "start_time": 50.0,
        "end_time": 77.0,
        "last_event_time": 77.0,
        "start_progress": 0.17182662538699692,
        "end_progress": 0.239422084623323
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. But can this new power save humanity from total extinction? Nobody knows. What they know for sure is that for the humans to have any chance to survive, they are going to have to be creative. And that is a frightening proposition indeed.\n",
        "source": "api",
        "start_time": 92.0,
        "end_time": 92.0,
        "last_event_time": 92.0,
        "start_progress": 0.239422084623323,
        "end_progress": 0.2626418988648091
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. But can this new power save humanity from total extinction? Nobody knows. What they know for sure is that for the humans to have any chance to survive, they are going to have to be creative. And that is a frightening proposition indeed given the circumstances. In this case, the strong have been the ones that have survived, so the survivors are without a doubt up to the test. \n",
        "source": "user",
        "start_time": 93.0,
        "end_time": 145.0,
        "last_event_time": 145.0,
        "start_progress": 0.2626418988648091,
        "end_progress": 0.33591331269349844
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. But can this new power save humanity from total extinction? Nobody knows. What they know for sure is that for the humans to have any chance to survive, they are going to have to be creative. And that is a frightening proposition indeed given the circumstances. In this case, the strong have been the ones that have survived, so the survivors are without a doubt up to the test. They must undergo intense training and hard work to master this new power, but once they do, the results will be devastating.\n",
        "source": "api",
        "start_time": 189.0,
        "end_time": 189.0,
        "last_event_time": 189.0,
        "start_progress": 0.33591331269349844,
        "end_progress": 0.4004127966976264
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. But can this new power save humanity from total extinction? Nobody knows. What they know for sure is that for the humans to have any chance to survive, they are going to have to be creative. And that is a frightening proposition indeed given the circumstances. In this case, the strong have been the ones that have survived, so the survivors are without a doubt up to the test. They must undergo intense training and hard work to master this new power, but once they do, the results will be devastating. The power itself goes by the name of short interval time travel. \n",
        "source": "user",
        "start_time": 196.0,
        "end_time": 244.0,
        "last_event_time": 244.0,
        "start_progress": 0.4004127966976264,
        "end_progress": 0.434468524251806
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. But can this new power save humanity from total extinction? Nobody knows. What they know for sure is that for the humans to have any chance to survive, they are going to have to be creative. And that is a frightening proposition indeed given the circumstances. In this case, the strong have been the ones that have survived, so the survivors are without a doubt up to the test. They must undergo intense training and hard work to master this new power, but once they do, the results will be devastating. The power itself goes by the name of short interval time travel. It involves being able to send physical objects back in time, a method that isn’t as risky as sending people, but is still a lot\n",
        "source": "api",
        "start_time": 280.0,
        "end_time": 280.0,
        "last_event_time": 280.0,
        "start_progress": 0.434468524251806,
        "end_progress": 0.500515995872033
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. But can this new power save humanity from total extinction? Nobody knows. What they know for sure is that for the humans to have any chance to survive, they are going to have to be creative. And that is a frightening proposition indeed given the circumstances. In this case, the strong have been the ones that have survived, so the survivors are without a doubt up to the test. They must undergo intense training and hard work to master this new power, but once they do, the results will be devastating. The power itself goes by the name of short interval time travel. It involves being able to send physical objects back in time, a method that isn’t as risky as sending people. This is simply a way to alter the future without going about it in too dangerous a way. The survivors studied this skill for as long as they could and used it in order to survive the attack from the aliens. Although the skill has yet to be perfected, those who are best at it ultimately have the best chance of survival. \n",
        "source": "user",
        "start_time": 293.0,
        "end_time": 413.0,
        "last_event_time": 413.0,
        "start_progress": 0.500515995872033,
        "end_progress": 0.6568627450980392
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. But can this new power save humanity from total extinction? Nobody knows. What they know for sure is that for the humans to have any chance to survive, they are going to have to be creative. And that is a frightening proposition indeed given the circumstances. In this case, the strong have been the ones that have survived, so the survivors are without a doubt up to the test. They must undergo intense training and hard work to master this new power, but once they do, the results will be devastating. The power itself goes by the name of short interval time travel. It involves being able to send physical objects back in time, a method that isn’t as risky as sending people. This is simply a way to alter the future without going about it in too dangerous a way. The survivors studied this skill for as long as they could and used it in order to survive the attack from the aliens. Although the skill has yet to be perfected, those who are best at it ultimately have the best chance of survival. As such, each survivor is encouraged to master this skill in order to have the best chance of survival.\n",
        "source": "api",
        "start_time": 439.0,
        "end_time": 439.0,
        "last_event_time": 439.0,
        "start_progress": 0.6568627450980392,
        "end_progress": 0.7100103199174407
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. But can this new power save humanity from total extinction? Nobody knows. What they know for sure is that for the humans to have any chance to survive, they are going to have to be creative. And that is a frightening proposition indeed given the circumstances. In this case, the strong have been the ones that have survived, so the survivors are without a doubt up to the test. They must undergo intense training and hard work to master this new power, but once they do, the results will be devastating. The power itself goes by the name of short interval time travel. It involves being able to send physical objects back in time, a method that isn’t as risky as sending people. This is simply a way to alter the future without going about it in too dangerous a way. The survivors studied this skill for as long as they could and used it in order to survive the attack from the aliens. Although the skill has yet to be perfected, those who are best at it ultimately have the best chance of survival. As such, each survivor is encouraged to master this skill in order to have the best chance of survival.  The aliens are not a violent species to begin with but were forced into fighting when the humans became frightened and starting shooting and sending off explosions. The aliens from their point of view came from peace, and only wanted peace from the interaction. When provoked however, the aliens knew they had to fight, but still are not interested in war even after wiping out much of the human species. Is it still a war of both sides are not fighting for something?\n",
        "source": "user",
        "start_time": 466.0,
        "end_time": 588.0,
        "last_event_time": 588.0,
        "start_progress": 0.7100103199174407,
        "end_progress": 0.9525283797729618
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. But can this new power save humanity from total extinction? Nobody knows. What they know for sure is that for the humans to have any chance to survive, they are going to have to be creative. And that is a frightening proposition indeed given the circumstances. In this case, the strong have been the ones that have survived, so the survivors are without a doubt up to the test. They must undergo intense training and hard work to master this new power, but once they do, the results will be devastating. The power itself goes by the name of short interval time travel. It involves being able to send physical objects back in time, a method that isn’t as risky as sending people. This is simply a way to alter the future without going about it in too dangerous a way. The survivors studied this skill for as long as they could and used it in order to survive the attack from the aliens. Although the skill has yet to be perfected, those who are best at it ultimately have the best chance of survival. As such, each survivor is encouraged to master this skill in order to have the best chance of survival.  The aliens are not a violent species to begin with but were forced into fighting when the humans became frightened and starting shooting and sending off explosions. The aliens from their point of view came from peace, and only wanted peace from the interaction. When provoked however, the aliens knew they had to fight, but still are not interested in war even after wiping out much of the human species. Is it still a war of both sides are not fighting for something? So the aliens have decided not to look for any more humans, letting them die out on their own.\n",
        "source": "api",
        "start_time": 625.0,
        "end_time": 625.0,
        "last_event_time": 625.0,
        "start_progress": 0.9525283797729618,
        "end_progress": 1.001547987616099
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. But can this new power save humanity from total extinction? Nobody knows. What they know for sure is that for the humans to have any chance to survive, they are going to have to be creative. And that is a frightening proposition indeed given the circumstances. In this case, the strong have been the ones that have survived, so the survivors are without a doubt up to the test. They must undergo intense training and hard work to master this new power, but once they do, the results will be devastating. The power itself goes by the name of short interval time travel. It involves being able to send physical objects back in time, a method that isn’t as risky as sending people. This is simply a way to alter the future without going about it in too dangerous a way. The survivors studied this skill for as long as they could and used it in order to survive the attack from the aliens. Although the skill has yet to be perfected, those who are best at it ultimately have the best chance of survival. As such, each survivor is encouraged to master this skill in order to have the best chance of survival.  The aliens are not a violent species to begin with but were forced into fighting when the humans became frightened and starting shooting and sending off explosions. The aliens from their point of view came from peace, and only wanted peace from the interaction. When provoked however, the aliens knew they had to fight, but still are not interested in war even after wiping out much of the human species. Is it still a war of both sides are not fighting for something? The aliens have decided not to look for any more humans, letting them die out on their own.\n",
        "source": "user",
        "start_time": 628.0,
        "end_time": 630.0,
        "last_event_time": 630.0,
        "start_progress": 1.001547987616099,
        "end_progress": 1.0
    }
]