[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.11643454038997214
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. It's your life, and you are watching it from beginning to end.\n",
        "source": "api",
        "start_time": 16.0,
        "end_time": 38.0,
        "last_event_time": 38.0,
        "start_progress": 0.11643454038997214,
        "end_progress": 0.15153203342618385
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  It's your life, and you are watching it from beginning to end.  Is this what heaven is like, or maybe hell, to witness everything that you are missing out on. \n",
        "source": "user",
        "start_time": 45.0,
        "end_time": 90.0,
        "last_event_time": 90.0,
        "start_progress": 0.15153203342618385,
        "end_progress": 0.20612813370473537
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  It's your life, and you are watching it from beginning to end.  Is this what heaven is like, or maybe hell, to witness everything that you are missing out on.   Then you look at your other lifves, those that lived before you, have they had to watch your just concluded life?  \n",
        "source": "user",
        "start_time": 106.0,
        "end_time": 161.0,
        "last_event_time": 161.0,
        "start_progress": 0.20612813370473537,
        "end_progress": 0.2713091922005571
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  It's your life, and you are watching it from beginning to end.  Is this what heaven is like, or maybe hell, to witness everything that you are missing out on.   Then you look at your other lives, those that lived before you, have they had to watch your just concluded life?  \n",
        "source": "user",
        "start_time": 164.0,
        "end_time": 166.0,
        "last_event_time": 166.0,
        "start_progress": 0.2713091922005571,
        "end_progress": 0.27075208913649024
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  It's your life, and you are watching it from beginning to end.  Is this what heaven is like, or maybe hell, to witness everything that you are missing out on.   Then you look at your other lives, those that lived before you, have they had to watch your just concluded life? You think back on the things you did in your life, the things you did when you thought no one was watching.  \n",
        "source": "user",
        "start_time": 225.0,
        "end_time": 271.0,
        "last_event_time": 271.0,
        "start_progress": 0.27075208913649024,
        "end_progress": 0.3309192200557103
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  It's your life, and you are watching it from beginning to end.  Is this what heaven is like, or maybe hell, to witness everything that you are missing out on.   Then you look at your other lives, those that lived before you, have they had to watch your just concluded life? You think back on the things you did in your life, the things you did when you thought no one was watching.   You were the worst, you realise now.\n",
        "source": "api",
        "start_time": 314.0,
        "end_time": 314.0,
        "last_event_time": 314.0,
        "start_progress": 0.3309192200557103,
        "end_progress": 0.35153203342618383
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  It's your life, and you are watching it from beginning to end.  Is this what heaven is like, or maybe hell, to witness everything that you are missing out on.   Then you look at your other lives, those that lived before you, have they had to watch your just concluded life? You think back on the things you did in your life, the things you did when you thought no one was watching.   You were the worst, you realize now, well, maybe not the worst, but that is how you feel when you think of those dirty little secrets.  But, was is the purpose of this? \n",
        "source": "user",
        "start_time": 318.0,
        "end_time": 373.0,
        "last_event_time": 373.0,
        "start_progress": 0.35153203342618383,
        "end_progress": 0.4256267409470752
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  It's your life, and you are watching it from beginning to end.  Is this what heaven is like, or maybe hell, to witness everything that you are missing out on.   Then you look at your other lives, those that lived before you, have they had to watch your just concluded life? You think back on the things you did in your life, the things you did when you thought no one was watching.   You were the worst, you realize now, well, maybe not the worst, but that is how you feel when you think of those dirty little secrets.  But, was is the purpose of this? Is this just some cruel joke?\n",
        "source": "api",
        "start_time": 385.0,
        "end_time": 385.0,
        "last_event_time": 385.0,
        "start_progress": 0.4256267409470752,
        "end_progress": 0.44178272980501393
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  It's your life, and you are watching it from beginning to end.  Is this what heaven is like, or maybe hell, to witness everything that you are missing out on.   Then you look at your other lives, those that lived before you, have they had to watch your just concluded life? You think back on the things you did in your life, the things you did when you thought no one was watching.   You were the worst, you realize now, well, maybe not the worst, but that is how you feel when you think of those dirty little secrets.  But, was is the purpose of this? Is this just some cruel joke? Or is this the way you are supposed to learn from your mistakes.\n",
        "source": "api",
        "start_time": 412.0,
        "end_time": 412.0,
        "last_event_time": 412.0,
        "start_progress": 0.4423398328690808,
        "end_progress": 0.47799442896935934
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  It's your life, and you are watching it from beginning to end.  Is this what heaven is like, or maybe hell, to witness everything that you are missing out on.   Then you look at your other lives, those that lived before you, have they had to watch your just concluded life? You think back on the things you did in your life, the things you did when you thought no one was watching.   You were the worst, you realize now, well, maybe not the worst, but that is how you feel when you think of those dirty little secrets.  But, was is the purpose of this? Is this just some cruel joke? Or is this the way you are supposed to learn from your mistakes. Or, perhaps, you are being prepared to live this next life, \n",
        "source": "user",
        "start_time": 454.0,
        "end_time": 486.0,
        "last_event_time": 486.0,
        "start_progress": 0.4785515320334262,
        "end_progress": 0.5119777158774373
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  It's your life, and you are watching it from beginning to end.  Is this what heaven is like, or maybe hell, to witness everything that you are missing out on.   Then you look at your other lives, those that lived before you, have they had to watch your just concluded life? You think back on the things you did in your life, the things you did when you thought no one was watching.   You were the worst, you realize now, well, maybe not the worst, but that is how you feel when you think of those dirty little secrets.  But, was is the purpose of this? Is this just some cruel joke? Or is this the way you are supposed to learn from your mistakes. Or, perhaps, you are being prepared to live this next life, could this be where deja vu originates?  Well, if this is the reason, it must be, it has to be, you are going to be a ready as possible.  \n",
        "source": "user",
        "start_time": 491.0,
        "end_time": 596.0,
        "last_event_time": 596.0,
        "start_progress": 0.5119777158774373,
        "end_progress": 0.588857938718663
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  It's your life, and you are watching it from beginning to end.  Is this what heaven is like, or maybe hell, to witness everything that you are missing out on.   Then you look at your other lives, those that lived before you, have they had to watch your just concluded life? You think back on the things you did in your life, the things you did when you thought no one was watching.   You were the worst, you realize now, well, maybe not the worst, but that is how you feel when you think of those dirty little secrets.  But, was is the purpose of this? Is this just some cruel joke? Or is this the way you are supposed to learn from your mistakes. Or, perhaps, you are being prepared to live this next life, could this be where deja vu originates?  Well, if this is the reason, it must be, it has to be, you are going to be a ready as possible.  You are going to make sure that this next life is the best possible.\n",
        "source": "api",
        "start_time": 609.0,
        "end_time": 609.0,
        "last_event_time": 609.0,
        "start_progress": 0.588857938718663,
        "end_progress": 0.6267409470752089
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  It's your life, and you are watching it from beginning to end.  Is this what heaven is like, or maybe hell, to witness everything that you are missing out on.   Then you look at your other lives, those that lived before you, have they had to watch your just concluded life? You think back on the things you did in your life, the things you did when you thought no one was watching.   You were the worst, you realize now, well, maybe not the worst, but that is how you feel when you think of those dirty little secrets.  But, was is the purpose of this? Is this just some cruel joke? Or is this the way you are supposed to learn from your mistakes. Or, perhaps, you are being prepared to live this next life, could this be where deja vu originates?  Well, if this is the reason, it must be, it has to be, you are going to be a ready as possible.  You are going to make sure that this next life is the best possible.  You sit, you watch every misstep, every wrong turn, every missed opportunity, every sliding door that led you down the wrong path.  \n",
        "source": "user",
        "start_time": 622.0,
        "end_time": 695.0,
        "last_event_time": 695.0,
        "start_progress": 0.6267409470752089,
        "end_progress": 0.7013927576601672
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  It's your life, and you are watching it from beginning to end.  Is this what heaven is like, or maybe hell, to witness everything that you are missing out on.   Then you look at your other lives, those that lived before you, have they had to watch your just concluded life? You think back on the things you did in your life, the things you did when you thought no one was watching.   You were the worst, you realize now, well, maybe not the worst, but that is how you feel when you think of those dirty little secrets.  But, was is the purpose of this? Is this just some cruel joke? Or is this the way you are supposed to learn from your mistakes. Or, perhaps, you are being prepared to live this next life, could this be where deja vu originates?  Well, if this is the reason, it must be, it has to be, you are going to be a ready as possible.  You are going to make sure that this next life is the best possible.  You sit, you watch every misstep, every wrong turn, every missed opportunity, every sliding door that led you down the wrong path.   You watch for hours, maybe days, or years.\n",
        "source": "api",
        "start_time": 704.0,
        "end_time": 704.0,
        "last_event_time": 704.0,
        "start_progress": 0.7013927576601672,
        "end_progress": 0.7253481894150418
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  It's your life, and you are watching it from beginning to end.  Is this what heaven is like, or maybe hell, to witness everything that you are missing out on.   Then you look at your other lives, those that lived before you, have they had to watch your just concluded life? You think back on the things you did in your life, the things you did when you thought no one was watching.   You were the worst, you realize now, well, maybe not the worst, but that is how you feel when you think of those dirty little secrets.  But, was is the purpose of this? Is this just some cruel joke? Or is this the way you are supposed to learn from your mistakes. Or, perhaps, you are being prepared to live this next life, could this be where deja vu originates?  Well, if this is the reason, it must be, it has to be, you are going to be a ready as possible.  You are going to make sure that this next life is the best possible.  You sit, you watch every misstep, every wrong turn, every missed opportunity, every sliding door that led you down the wrong path.   You watch for hours, maybe days, or years.  The screen fades to, the words 'are you ready' appear in big bold font.  \n",
        "source": "user",
        "start_time": 706.0,
        "end_time": 749.0,
        "last_event_time": 749.0,
        "start_progress": 0.7253481894150418,
        "end_progress": 0.7671309192200557
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  It's your life, and you are watching it from beginning to end.  Is this what heaven is like, or maybe hell, to witness everything that you are missing out on.   Then you look at your other lives, those that lived before you, have they had to watch your just concluded life? You think back on the things you did in your life, the things you did when you thought no one was watching.   You were the worst, you realize now, well, maybe not the worst, but that is how you feel when you think of those dirty little secrets.  But, was is the purpose of this? Is this just some cruel joke? Or is this the way you are supposed to learn from your mistakes. Or, perhaps, you are being prepared to live this next life, could this be where deja vu originates?  Well, if this is the reason, it must be, it has to be, you are going to be a ready as possible.  You are going to make sure that this next life is the best possible.  You sit, you watch every misstep, every wrong turn, every missed opportunity, every sliding door that led you down the wrong path.   You watch for hours, maybe days, or years.  The screen fades to, the words 'are you ready' appear in big bold font.  You look at your former selves, most of them are nodding their heads and saying, yes.\n",
        "source": "api",
        "start_time": 762.0,
        "end_time": 762.0,
        "last_event_time": 762.0,
        "start_progress": 0.7671309192200557,
        "end_progress": 0.8144846796657381
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.  It's your life, and you are watching it from beginning to end.  Is this what heaven is like, or maybe hell, to witness everything that you are missing out on.   Then you look at your other lives, those that lived before you, have they had to watch your just concluded life? You think back on the things you did in your life, the things you did when you thought no one was watching.   You were the worst, you realize now, well, maybe not the worst, but that is how you feel when you think of those dirty little secrets.  But, was is the purpose of this? Is this just some cruel joke? Or is this the way you are supposed to learn from your mistakes. Or, perhaps, you are being prepared to live this next life, could this be where deja vu originates?  Well, if this is the reason, it must be, it has to be, you are going to be a ready as possible.  You are going to make sure that this next life is the best possible.  You sit, you watch every misstep, every wrong turn, every missed opportunity, every sliding door that led you down the wrong path.   You watch for hours, maybe days, or years.  The screen fades to, the words 'are you ready' appear in big bold font.  You look at your former selves, most of them are nodding their heads and saying, yes. You yell, 'I'm ready.'  You are born, you blink in the sudden light, your eyes see this new world for the first time, your thoughts are simple, not even words, just a need to be held by your mom, but somewhere in the back of you mind a feeling that you've seen this from afar, only later, older will this feeling get a name deja vu.\n",
        "source": "user",
        "start_time": 765.0,
        "end_time": 1022.0,
        "last_event_time": 1022.0,
        "start_progress": 0.8144846796657381,
        "end_progress": 1.0
    }
]