[
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that \n",
        "source": "user",
        "start_time": 0.0,
        "end_time": 117.0,
        "last_event_time": 117.0,
        "start_progress": 0,
        "end_progress": 0.10261374636979671
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society.\n",
        "source": "api",
        "start_time": 128.0,
        "end_time": 128.0,
        "last_event_time": 128.0,
        "start_progress": 0.10261374636979671,
        "end_progress": 0.14101323007421748
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law, but \n",
        "source": "user",
        "start_time": 131.0,
        "end_time": 161.0,
        "last_event_time": 161.0,
        "start_progress": 0.14101323007421748,
        "end_progress": 0.16327847692804132
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power.\n",
        "source": "api",
        "start_time": 168.0,
        "end_time": 172.0,
        "last_event_time": 172.0,
        "start_progress": 0.16327847692804132,
        "end_progress": 0.19393352694417554
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. \n",
        "source": "user",
        "start_time": 172.0,
        "end_time": 218.0,
        "last_event_time": 218.0,
        "start_progress": 0.19393352694417554,
        "end_progress": 0.24136818328493062
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens.\n",
        "source": "api",
        "start_time": 229.0,
        "end_time": 229.0,
        "last_event_time": 229.0,
        "start_progress": 0.24136818328493062,
        "end_progress": 0.2758954501452081
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve \n",
        "source": "user",
        "start_time": 234.0,
        "end_time": 285.0,
        "last_event_time": 285.0,
        "start_progress": 0.2758954501452081,
        "end_progress": 0.34494998386576314
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve Ultimately, we must find a balance where corporations serve society rather than dictate its direction.\n",
        "source": "api",
        "start_time": 294.0,
        "end_time": 294.0,
        "last_event_time": 294.0,
        "start_progress": 0.34494998386576314,
        "end_progress": 0.377863827040981
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve.  Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to \n",
        "source": "user",
        "start_time": 299.0,
        "end_time": 325.0,
        "last_event_time": 325.0,
        "start_progress": 0.377863827040981,
        "end_progress": 0.3962568570506615
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve.  Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity.\n",
        "source": "api",
        "start_time": 337.0,
        "end_time": 337.0,
        "last_event_time": 337.0,
        "start_progress": 0.3962568570506615,
        "end_progress": 0.430784123910939
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve.  Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. \n",
        "source": "user",
        "start_time": 342.0,
        "end_time": 402.0,
        "last_event_time": 402.0,
        "start_progress": 0.430784123910939,
        "end_progress": 0.4672474991932882
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve.  Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly.\n",
        "source": "api",
        "start_time": 419.0,
        "end_time": 419.0,
        "last_event_time": 419.0,
        "start_progress": 0.4672474991932882,
        "end_progress": 0.5037108744756373
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve.  Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote \n",
        "source": "user",
        "start_time": 423.0,
        "end_time": 469.0,
        "last_event_time": 469.0,
        "start_progress": 0.5037108744756373,
        "end_progress": 0.5437237818651178
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve.  Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens.\n",
        "source": "api",
        "start_time": 495.0,
        "end_time": 495.0,
        "last_event_time": 495.0,
        "start_progress": 0.5437237818651178,
        "end_progress": 0.5847047434656341
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve.  Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it allows corporations too many loopholes and opportunities for businessmen to exploit their workers $rewrite the sentence$\n",
        "source": "user",
        "start_time": 500.0,
        "end_time": 574.0,
        "last_event_time": 574.0,
        "start_progress": 0.5847047434656341,
        "end_progress": 0.6611810261374637
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve.  Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation.\n",
        "source": "api",
        "start_time": 596.0,
        "end_time": 617.0,
        "last_event_time": 617.0,
        "start_progress": 0.6611810261374637,
        "end_progress": 0.6379477250726041
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve.  Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. Knowing that civilians have less and less say in what goes on in their own country and that businesses obtain more and more is frightening $rewrite the sentence$\n",
        "source": "user",
        "start_time": 621.0,
        "end_time": 708.0,
        "last_event_time": 708.0,
        "start_progress": 0.6379477250726041,
        "end_progress": 0.6969990319457889
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve.  Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country\n",
        "source": "api",
        "start_time": 728.0,
        "end_time": 743.0,
        "last_event_time": 743.0,
        "start_progress": 0.6969990319457889,
        "end_progress": 0.6786060019361084
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve.  Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country, and the truth is that we probably only know a small fraction of the truth \n",
        "source": "user",
        "start_time": 743.0,
        "end_time": 770.0,
        "last_event_time": 770.0,
        "start_progress": 0.6786060019361084,
        "end_progress": 0.7031300419490158
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve.  Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country, and the truth is that we probably only know a small fraction of the truth Ultimately, we must advocate for stronger regulations that ensure corporations prioritize societal well-being over their profit-driven motives.\n",
        "source": "api",
        "start_time": 778.0,
        "end_time": 778.0,
        "last_event_time": 778.0,
        "start_progress": 0.7031300419490158,
        "end_progress": 0.7492739593417231
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve.  Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country, and the truth is that we probably only know a small fraction of the truth. Ultimately, we must advocate for stronger regulations that ensure corporations prioritize societal well-being over their profit-driven motives. \n",
        "source": "user",
        "start_time": 780.0,
        "end_time": 873.0,
        "last_event_time": 873.0,
        "start_progress": 0.7492739593417231,
        "end_progress": 0.749919328815747
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve.  Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country, and the truth is that we probably only know a small fraction of the truth. Ultimately, we must advocate for stronger regulations that ensure corporations prioritize societal well-being over their profit-driven motives. $write a good conclusion sentence$\n",
        "source": "user",
        "start_time": 875.0,
        "end_time": 896.0,
        "last_event_time": 896.0,
        "start_progress": 0.749919328815747,
        "end_progress": 0.7608906098741529
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve.  Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country, and the truth is that we probably only know a small fraction of the truth. Ultimately, we must advocate for stronger regulations that ensure corporations prioritize societal well-being over their profit-driven motives.To restore democracy, we must reclaim our voices and hold corporations accountable for their actions.\n",
        "source": "api",
        "start_time": 907.0,
        "end_time": 917.0,
        "last_event_time": 917.0,
        "start_progress": 0.7608906098741529,
        "end_progress": 0.782187802516941
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. $add a fact about corporate exploitation$ It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve.  Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country, and the truth is that we probably only know a small fraction of the truth. Ultimately, we must advocate for stronger regulations that ensure corporations prioritize societal well-being over their profit-driven motives. To restore democracy, we must reclaim our voices and hold corporations accountable for their actions.\n",
        "source": "user",
        "start_time": 920.0,
        "end_time": 993.0,
        "last_event_time": 993.0,
        "start_progress": 0.782187802516941,
        "end_progress": 0.7960632462084544
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. Many corporations prioritize profit over ethics, leading to worker exploitation and harmful environmental practices. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve. Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country, and the truth is that we probably only know a small fraction of the truth. Ultimately, we must advocate for stronger regulations that ensure corporations prioritize societal well-being over their profit-driven motives. To restore democracy, we must reclaim our voices and hold corporations accountable for their actions.\n",
        "source": "api",
        "start_time": 1003.0,
        "end_time": 1028.0,
        "last_event_time": 1028.0,
        "start_progress": 0.7960632462084544,
        "end_progress": 0.8199419167473379
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. Many corporations prioritize profit over ethics, leading to worker exploitation and harmful environmental practices. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve. $write a sentence about how companies profit off workers$ Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country, and the truth is that we probably only know a small fraction of the truth. Ultimately, we must advocate for stronger regulations that ensure corporations prioritize societal well-being over their profit-driven motives. To restore democracy, we must reclaim our voices and hold corporations accountable for their actions.\n",
        "source": "user",
        "start_time": 1030.0,
        "end_time": 1056.0,
        "last_event_time": 1056.0,
        "start_progress": 0.8199419167473379,
        "end_progress": 0.8386576314940304
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. Many corporations prioritize profit over ethics, leading to worker exploitation and harmful environmental practices. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve. Companies often maximize profits by paying workers low wages while increasing their productivity and workload. Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country, and the truth is that we probably only know a small fraction of the truth. Ultimately, we must advocate for stronger regulations that ensure corporations prioritize societal well-being over their profit-driven motives. To restore democracy, we must reclaim our voices and hold corporations accountable for their actions.\n",
        "source": "api",
        "start_time": 1068.0,
        "end_time": 1075.0,
        "last_event_time": 1075.0,
        "start_progress": 0.8386576314940304,
        "end_progress": 0.8557599225556631
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. Many corporations prioritize profit over ethics, leading to worker exploitation and harmful environmental practices. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve. Companies often maximize profits by paying workers low wages while increasing their productivity and workload. Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. We need stronger regulations to ensure corporations prioritize people over profits and uphold democratic values.This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country, and the truth is that we probably only know a small fraction of the truth. Ultimately, we must advocate for stronger regulations that ensure corporations prioritize societal well-being over their profit-driven motives. To restore democracy, we must reclaim our voices and hold corporations accountable for their actions.\n",
        "source": "api",
        "start_time": 1084.0,
        "end_time": 1096.0,
        "last_event_time": 1096.0,
        "start_progress": 0.8557599225556631,
        "end_progress": 0.8919006131010003
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. Many corporations prioritize profit over ethics, leading to worker exploitation and harmful environmental practices. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve. Companies often maximize profits by paying workers low wages while increasing their productivity and workload. Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. We need stronger regulations to ensure corporations prioritize people over profits and uphold democratic values. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country, and the truth is that we probably only know a small fraction of the truth. Ultimately, we must advocate for stronger regulations that ensure corporations prioritize societal well-being over their profit-driven motives. To restore democracy, we must reclaim our voices and hold corporations accountable for their actions.\n",
        "source": "user",
        "start_time": 1099.0,
        "end_time": 1099.0,
        "last_event_time": 1099.0,
        "start_progress": 0.8919006131010003,
        "end_progress": 0.8922232978380122
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. It shapes our economy and influences the way businesses interact with consumers every single day.Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. Many corporations prioritize profit over ethics, leading to worker exploitation and harmful environmental practices. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve. Companies often maximize profits by paying workers low wages while increasing their productivity and workload. Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. We need stronger regulations to ensure corporations prioritize people over profits and uphold democratic values. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country, and the truth is that we probably only know a small fraction of the truth. Ultimately, we must advocate for stronger regulations that ensure corporations prioritize societal well-being over their profit-driven motives. To restore democracy, we must reclaim our voices and hold corporations accountable for their actions.\n",
        "source": "api",
        "start_time": 1123.0,
        "end_time": 1123.0,
        "last_event_time": 1123.0,
        "start_progress": 0.8922232978380122,
        "end_progress": 0.9235237173281704
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. It shapes our economy and influences the way businesses interact with consumers every single day. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. Many corporations prioritize profit over ethics, leading to worker exploitation and harmful environmental practices. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve. Companies often maximize profits by paying workers low wages while increasing their productivity and workload. Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. We need stronger regulations to ensure corporations prioritize people over profits and uphold democratic values. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country, and the truth is that we probably only know a small fraction of the truth. Ultimately, we must advocate for stronger regulations that ensure corporations prioritize societal well-being over their profit-driven motives. To restore democracy, we must reclaim our voices and hold corporations accountable for their actions.\n",
        "source": "user",
        "start_time": 1125.0,
        "end_time": 1125.0,
        "last_event_time": 1125.0,
        "start_progress": 0.9235237173281704,
        "end_progress": 0.9238464020651823
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. It shapes our economy and influences the way businesses interact with consumers every single day. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. This complex relationship raises questions about accountability and the impact on everyday people's lives.Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. Many corporations prioritize profit over ethics, leading to worker exploitation and harmful environmental practices. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve. Companies often maximize profits by paying workers low wages while increasing their productivity and workload. Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. We need stronger regulations to ensure corporations prioritize people over profits and uphold democratic values. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country, and the truth is that we probably only know a small fraction of the truth. Ultimately, we must advocate for stronger regulations that ensure corporations prioritize societal well-being over their profit-driven motives. To restore democracy, we must reclaim our voices and hold corporations accountable for their actions.\n",
        "source": "api",
        "start_time": 1138.0,
        "end_time": 1138.0,
        "last_event_time": 1138.0,
        "start_progress": 0.9238464020651823,
        "end_progress": 0.9580509841884479
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. It shapes our economy and influences the way businesses interact with consumers every single day. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. This complex relationship raises questions about accountability and the impact on everyday people's lives. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. Many corporations prioritize profit over ethics, leading to worker exploitation and harmful environmental practices. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve. Companies often maximize profits by paying workers low wages while increasing their productivity and workload. Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. We need stronger regulations to ensure corporations prioritize people over profits and uphold democratic values. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country, and the truth is that we probably only know a small fraction of the truth. $expand on this last sentence$ Ultimately, we must advocate for stronger regulations that ensure corporations prioritize societal well-being over their profit-driven motives. To restore democracy, we must reclaim our voices and hold corporations accountable for their actions.\n",
        "source": "user",
        "start_time": 1140.0,
        "end_time": 1167.0,
        "last_event_time": 1167.0,
        "start_progress": 0.9580509841884479,
        "end_progress": 0.9683768957728299
    },
    {
        "text": "Corporate personhood, whether we know it or not, is all around us. It's in the stores we buy our groceries at, and the politicians we vote for on the ballot. It shapes our economy and influences the way businesses interact with consumers every single day. Although this concept can be beneficial in some settings, it can many times be harmful to others, especially when it comes to politics. This complex relationship raises questions about accountability and the impact on everyday people's lives. Knowing the power that corporations wield over political decisions raises serious questions about democracy and accountability in our society. As individuals, we are held to a high standard against the law. Yet, corporations often escape those same standards, leaving us to wonder who truly holds the power. Many corporations prioritize profit over ethics, leading to worker exploitation and harmful environmental practices. It is truly saddening thinking of the fact that our states and countries are run not by the people we elect, but by the companies who back them. This imbalance creates a skewed system where economic interests overshadow the voices of everyday citizens. Capitalism is not inherently bad, just as communism is not - both can be taken to an extreme to hurt citizens. In capitalism, however, it is important that we do not give corporations more power than they deserve. Companies often maximize profits by paying workers low wages while increasing their productivity and workload. Ultimately, we must find a balance where corporations serve society rather than dictate its direction. In my opinion, corporate personhood poses a threat to society, as it blurs the lines between business interests and public welfare, risking democratic integrity. Anyone minorly in tune with recent politics is aware of how much power businesses hold within political office. We need stronger regulations to ensure corporations prioritize people over profits and uphold democratic values. This power imbalance makes it harder for regular citizens to influence policies that affect their lives directly. Treating businesses as individuals is nonsensical, especially when considering the fact that they are not eligible to vote and often prioritize profit over people’s needs, further widening the gap between wealthy corporations and struggling citizens. This is not to say that each business utilizes their power of corporate personhood for malicious intent; rather, it often creates too many chances for exploitation within the workplace. It's scary how everyday citizens have less influence while businesses gain more control over our country, and the truth is that we probably only know a small fraction of the truth. We might be missing hidden connections between corporate actions and real-life consequences affecting our communities every day. Ultimately, we must advocate for stronger regulations that ensure corporations prioritize societal well-being over their profit-driven motives. To restore democracy, we must reclaim our voices and hold corporations accountable for their actions.\n",
        "source": "api",
        "start_time": 1179.0,
        "end_time": 1184.0,
        "last_event_time": 1184.0,
        "start_progress": 0.9683768957728299,
        "end_progress": 1.0
    }
]