[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.08338937457969066
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. \n\nThe aliens have no idea what they’re in for.\n",
        "source": "api",
        "start_time": 26.0,
        "end_time": 26.0,
        "last_event_time": 26.0,
        "start_progress": 0.08338937457969066,
        "end_progress": 0.11499663752521856
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. \n\nThe aliens have no idea what they’re in for. Immediately, Matt Damon's security, which calls themselves the Ninja Rescue Team, realizes he is missing and is ready to take action.\n",
        "source": "user",
        "start_time": 29.0,
        "end_time": 96.0,
        "last_event_time": 96.0,
        "start_progress": 0.11499663752521856,
        "end_progress": 0.2051109616677875
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. \n\nThe aliens have no idea what they’re in for. Immediately, Matt Damon's security, which calls themselves the Ninja Rescue Team, realizes he is missing and is ready to take action. The aliens are not ready for the Ninja Rescue Team, as they are a group of ninjas who are ready to fight to the death to get Matt\n",
        "source": "api",
        "start_time": 116.0,
        "end_time": 116.0,
        "last_event_time": 116.0,
        "start_progress": 0.2051109616677875,
        "end_progress": 0.2925353059852051
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. \n\nThe aliens have no idea what they’re in for. Immediately, Matt Damon's security, which calls themselves the Ninja Rescue Team, realizes he is missing and is ready to take action. The aliens are not ready for the Ninja Rescue Team, as they are a group of ninjas who are ready to fight to the death to get Matt Damon back to safety. The Ninja Rescue Team first had to find where the alien is hiding. \n",
        "source": "user",
        "start_time": 122.0,
        "end_time": 198.0,
        "last_event_time": 198.0,
        "start_progress": 0.2925353059852051,
        "end_progress": 0.3530598520511096
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. \n\nThe aliens have no idea what they’re in for. Immediately, Matt Damon's security, which calls themselves the Ninja Rescue Team, realizes he is missing and is ready to take action. The aliens are not ready for the Ninja Rescue Team, as they are a group of ninjas who are ready to fight to the death to get Matt Damon back to safety. The Ninja Rescue Team first had to find where the alien is hiding. They knew that the alien would be hiding in a place that was not easy to find, so they had to think of a plan.\n",
        "source": "api",
        "start_time": 211.0,
        "end_time": 211.0,
        "last_event_time": 211.0,
        "start_progress": 0.3530598520511096,
        "end_progress": 0.4270342972427707
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. \n\nThe aliens have no idea what they’re in for. Immediately, Matt Damon's security, which calls themselves the Ninja Rescue Team, realizes he is missing and is ready to take action. The aliens are not ready for the Ninja Rescue Team, as they are a group of ninjas who are ready to fight to the death to get Matt Damon back to safety. The Ninja Rescue Team first had to find where the alien is hiding. They knew that the alien would be hiding in a place that was not easy to find, so they had to think of a plan.   They decided to split up and search for the alien.\n",
        "source": "api",
        "start_time": 270.0,
        "end_time": 270.0,
        "last_event_time": 270.0,
        "start_progress": 0.4270342972427707,
        "end_progress": 0.46267652992602554
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. \n\nThe aliens have no idea what they’re in for. Immediately, Matt Damon's security, which calls themselves the Ninja Rescue Team, realizes he is missing and is ready to take action. The aliens are not ready for the Ninja Rescue Team, as they are a group of ninjas who are ready to fight to the death to get Matt Damon back to safety. The Ninja Rescue Team first had to find where the alien is hiding. They knew that the alien would be hiding in a place that was not easy to find, so they had to think of a plan. They decided to split up and search for the alien. Eventually one of the Ninjas found him hiding in a cave in the wilderness. \n",
        "source": "user",
        "start_time": 273.0,
        "end_time": 294.0,
        "last_event_time": 294.0,
        "start_progress": 0.46267652992602554,
        "end_progress": 0.5124411566913248
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. \n\nThe aliens have no idea what they’re in for. Immediately, Matt Damon's security, which calls themselves the Ninja Rescue Team, realizes he is missing and is ready to take action. The aliens are not ready for the Ninja Rescue Team, as they are a group of ninjas who are ready to fight to the death to get Matt Damon back to safety. The Ninja Rescue Team first had to find where the alien is hiding. They knew that the alien would be hiding in a place that was not easy to find, so they had to think of a plan. They decided to split up and search for the alien. Eventually one of the Ninjas found him hiding in a cave in the wilderness. The Ninja then had to fight the alien to get Matt Damon back.\n",
        "source": "api",
        "start_time": 307.0,
        "end_time": 307.0,
        "last_event_time": 307.0,
        "start_progress": 0.5124411566913248,
        "end_progress": 0.5534633490248824
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. \n\nThe aliens have no idea what they’re in for. Immediately, Matt Damon's security, which calls themselves the Ninja Rescue Team, realizes he is missing and is ready to take action. The aliens are not ready for the Ninja Rescue Team, as they are a group of ninjas who are ready to fight to the death to get Matt Damon back to safety. The Ninja Rescue Team first had to find where the alien is hiding. They knew that the alien would be hiding in a place that was not easy to find, so they had to think of a plan. They decided to split up and search for the alien. Eventually one of the Ninjas found him hiding in a cave in the wilderness. He had Mr. Damon with him in the cave. The Ninja then had to fight the alien to get Matt Damon back. The alien was really strong so he shouted his special call to get the rest of the Ninjas there to help him. \n",
        "source": "user",
        "start_time": 311.0,
        "end_time": 387.0,
        "last_event_time": 387.0,
        "start_progress": 0.5534633490248824,
        "end_progress": 0.6529926025554809
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. \n\nThe aliens have no idea what they’re in for. Immediately, Matt Damon's security, which calls themselves the Ninja Rescue Team, realizes he is missing and is ready to take action. The aliens are not ready for the Ninja Rescue Team, as they are a group of ninjas who are ready to fight to the death to get Matt Damon back to safety. The Ninja Rescue Team first had to find where the alien is hiding. They knew that the alien would be hiding in a place that was not easy to find, so they had to think of a plan. They decided to split up and search for the alien. Eventually one of the Ninjas found him hiding in a cave in the wilderness. He had Mr. Damon with him in the cave. The Ninja then had to fight the alien to get Matt Damon back. The alien was really strong so he shouted his special call to get the rest of the Ninjas there to help him. The Ninjas then all came and fought the alien.\n",
        "source": "api",
        "start_time": 399.0,
        "end_time": 399.0,
        "last_event_time": 399.0,
        "start_progress": 0.6529926025554809,
        "end_progress": 0.683927370544721
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. \n\nThe aliens have no idea what they’re in for. Immediately, Matt Damon's security, which calls themselves the Ninja Rescue Team, realizes he is missing and is ready to take action. The aliens are not ready for the Ninja Rescue Team, as they are a group of ninjas who are ready to fight to the death to get Matt Damon back to safety. The Ninja Rescue Team first had to find where the alien is hiding. They knew that the alien would be hiding in a place that was not easy to find, so they had to think of a plan. They decided to split up and search for the alien. Eventually one of the Ninjas found him hiding in a cave in the wilderness. He had Mr. Damon with him in the cave. The Ninja then had to fight the alien to get Matt Damon back. The alien was really strong so he shouted his special call to get the rest of the Ninjas there to help him. The Ninjas then all came and fought the alien. When the alien was almost defeated, he surrendered. \n",
        "source": "user",
        "start_time": 406.0,
        "end_time": 436.0,
        "last_event_time": 436.0,
        "start_progress": 0.683927370544721,
        "end_progress": 0.7195696032279758
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. \n\nThe aliens have no idea what they’re in for. Immediately, Matt Damon's security, which calls themselves the Ninja Rescue Team, realizes he is missing and is ready to take action. The aliens are not ready for the Ninja Rescue Team, as they are a group of ninjas who are ready to fight to the death to get Matt Damon back to safety. The Ninja Rescue Team first had to find where the alien is hiding. They knew that the alien would be hiding in a place that was not easy to find, so they had to think of a plan. They decided to split up and search for the alien. Eventually one of the Ninjas found him hiding in a cave in the wilderness. He had Mr. Damon with him in the cave. The Ninja then had to fight the alien to get Matt Damon back. The alien was really strong so he shouted his special call to get the rest of the Ninjas there to help him. The Ninjas then all came and fought the alien. When the alien was almost defeated, he surrendered. The Ninjas then took Matt Damon back to the Ninja Rescue Center, where he was safe and sound.\n",
        "source": "api",
        "start_time": 447.0,
        "end_time": 447.0,
        "last_event_time": 447.0,
        "start_progress": 0.7195696032279758,
        "end_progress": 0.7821116341627438
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. \n\nThe aliens have no idea what they’re in for. Immediately, Matt Damon's security, which calls themselves the Ninja Rescue Team, realizes he is missing and is ready to take action. The aliens are not ready for the Ninja Rescue Team, as they are a group of ninjas who are ready to fight to the death to get Matt Damon back to safety. The Ninja Rescue Team first had to find where the alien is hiding. They knew that the alien would be hiding in a place that was not easy to find, so they had to think of a plan. They decided to split up and search for the alien. Eventually one of the Ninjas found him hiding in a cave in the wilderness. He had Mr. Damon with him in the cave. The Ninja then had to fight the alien to get Matt Damon back. The alien was really strong so he shouted his special call to get the rest of the Ninjas there to help him. The Ninjas then all came and fought the alien. When the alien was almost defeated, he surrendered. The Ninjas then took Matt Damon back to the Ninja Rescue Center, where he was safe and sound. The alien thought he could hold a human hostage that day and get what he wanted from the humans, but it did not work out that way this time. The alien learned his lesson for sure. \n",
        "source": "user",
        "start_time": 453.0,
        "end_time": 534.0,
        "last_event_time": 534.0,
        "start_progress": 0.7821116341627438,
        "end_progress": 0.9038332212508406
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. \n\nThe aliens have no idea what they’re in for. Immediately, Matt Damon's security, which calls themselves the Ninja Rescue Team, realizes he is missing and is ready to take action. The aliens are not ready for the Ninja Rescue Team, as they are a group of ninjas who are ready to fight to the death to get Matt Damon back to safety. The Ninja Rescue Team first had to find where the alien is hiding. They knew that the alien would be hiding in a place that was not easy to find, so they had to think of a plan. They decided to split up and search for the alien. Eventually one of the Ninjas found him hiding in a cave in the wilderness. He had Mr. Damon with him in the cave. The Ninja then had to fight the alien to get Matt Damon back. The alien was really strong so he shouted his special call to get the rest of the Ninjas there to help him. The Ninjas then all came and fought the alien. When the alien was almost defeated, he surrendered. The Ninjas then took Matt Damon back to the Ninja Rescue Center, where he was safe and sound. The alien thought he could hold a human hostage that day and get what he wanted from the humans, but it did not work out that way this time. The alien learned his lesson for sure. He also learned that the Ninja Rescue Team is not a team to mess with.\n",
        "source": "api",
        "start_time": 546.0,
        "end_time": 546.0,
        "last_event_time": 546.0,
        "start_progress": 0.9038332212508406,
        "end_progress": 0.9509078681909886
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. \n\nThe aliens have no idea what they’re in for. Immediately, Matt Damon's security, which calls themselves the Ninja Rescue Team, realizes he is missing and is ready to take action. The aliens are not ready for the Ninja Rescue Team, as they are a group of ninjas who are ready to fight to the death to get Matt Damon back to safety. The Ninja Rescue Team first had to find where the alien is hiding. They knew that the alien would be hiding in a place that was not easy to find, so they had to think of a plan. They decided to split up and search for the alien. Eventually one of the Ninjas found him hiding in a cave in the wilderness. He had Mr. Damon with him in the cave. The Ninja then had to fight the alien to get Matt Damon back. The alien was really strong so he shouted his special call to get the rest of the Ninjas there to help him. The Ninjas then all came and fought the alien. When the alien was almost defeated, he surrendered. The Ninjas then took Matt Damon back to the Ninja Rescue Center, where he was safe and sound. The alien thought he could hold a human hostage that day and get what he wanted from the humans, but it did not work out that way this time. The alien learned his lesson for sure. He also learned that the Ninja Rescue Team is not a team to mess with. He will definitely not be abducting any more humans from this day forth.\n",
        "source": "user",
        "start_time": 550.0,
        "end_time": 585.0,
        "last_event_time": 585.0,
        "start_progress": 0.9509078681909886,
        "end_progress": 1.0
    }
]