[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.18520859671302148
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  But, they are being kept secret from the world.  Word is starting to filter out, a leak here a leak there, \n",
        "source": "user",
        "start_time": 93.0,
        "end_time": 250.0,
        "last_event_time": 250.0,
        "start_progress": 0.18520859671302148,
        "end_progress": 0.25410872313527183
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  But, they are being kept secret from the world.  Word is starting to filter out, a leak here a leak there, just rumors - then, the festering truth comes pouring out.\n",
        "source": "api",
        "start_time": 264.0,
        "end_time": 264.0,
        "last_event_time": 264.0,
        "start_progress": 0.25410872313527183,
        "end_progress": 0.29077117572692796
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  But, they are being kept secret from the world.  Word is starting to filter out, a leak here a leak there, just rumors, no knows what to believe.  Still, a consensus is starting to form around a single idea, and you are grateful you didn't get the drug.  The truth seems to be that  when those that took the drug hit 85 \n",
        "source": "user",
        "start_time": 267.0,
        "end_time": 477.0,
        "last_event_time": 477.0,
        "start_progress": 0.29077117572692796,
        "end_progress": 0.3887484197218711
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  But, they are being kept secret from the world.  Word is starting to filter out, a leak here a leak there, just rumors, no knows what to believe.  Still, a consensus is starting to form around a single idea, and you are grateful you didn't get the drug.  The truth seems to be that  when those that took the drug hit 85 , they start to lose their minds, and end up in a vegetative state.\n",
        "source": "api",
        "start_time": 494.0,
        "end_time": 494.0,
        "last_event_time": 494.0,
        "start_progress": 0.3887484197218711,
        "end_progress": 0.4310998735777497
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  But, they are being kept secret from the world.  Word is starting to filter out, a leak here a leak there, just rumors, no knows what to believe.  Still, a consensus is starting to form around a single idea, and you are grateful you didn't get the drug.  The truth seems to be that  when those that took the drug hit 85, they start to lose their minds, and end up in a vegetative state.  It's like Alzheimer's overnight.  You're in fairly good condition, but it seems this is lie a ticking clock for them. \n",
        "source": "user",
        "start_time": 498.0,
        "end_time": 620.0,
        "last_event_time": 620.0,
        "start_progress": 0.4310998735777497,
        "end_progress": 0.5063211125158028
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  But, they are being kept secret from the world.  Word is starting to filter out, a leak here a leak there, just rumors, no knows what to believe.  Still, a consensus is starting to form around a single idea, and you are grateful you didn't get the drug.  The truth seems to be that  when those that took the drug hit 85, they start to lose their minds, and end up in a vegetative state.  It's like Alzheimer's overnight.  You're in fairly good condition, but it seems this is lie a ticking clock for them.  They will soon start to lose their minds and be stuck in a vegetative state.\n",
        "source": "api",
        "start_time": 636.0,
        "end_time": 636.0,
        "last_event_time": 636.0,
        "start_progress": 0.5063211125158028,
        "end_progress": 0.5549936788874842
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  But, they are being kept secret from the world.  Word is starting to filter out, a leak here a leak there, just rumors, no knows what to believe.  Still, a consensus is starting to form around a single idea, and you are grateful you didn't get the drug.  The truth seems to be that  sixty years after they took the drug they start to lose their minds, and end up in a vegetative state.  It's like Alzheimer's overnight.  The people that took the trial drug, before FDA approval all seem to be exhibiting this zombie like state.  And now this is the destiny for everyone that was given it before their twenty-eighth birthday.  We, the \"Lost Generation\", have age, but we don't have this doom hanging over us.  In fact because of our status we have been cared for by those that did get the drug, we get the best health care, the best medicines, the best treatment, since those others feel a guilt towards us.\n",
        "source": "user",
        "start_time": 650.0,
        "end_time": 975.0,
        "last_event_time": 975.0,
        "start_progress": 0.5549936788874842,
        "end_progress": 0.7591656131479141
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  But, they are being kept secret from the world.  Word is starting to filter out, a leak here a leak there, just rumors, no knows what to believe.  Still, a consensus is starting to form around a single idea, and you are grateful you didn't get the drug.  The truth seems to be that  sixty years after they took the drug they start to lose their minds, and end up in a vegetative state.  It's like Alzheimer's overnight.  The people that took the trial drug, before FDA approval all seem to be exhibiting this zombie like state.  And now this is the destiny for everyone that was given it before their twenty-eighth birthday.  We, the \"Lost Generation\", have age, but we don't have this doom hanging over us.  In fact because of our status we have been cared for by those that did get the drug, we get the best health care, the best medicines, the best treatment, since those others feel a guilt towards us.  So, it's not so bad being a Lost Generation.\n",
        "source": "api",
        "start_time": 983.0,
        "end_time": 983.0,
        "last_event_time": 983.0,
        "start_progress": 0.7591656131479141,
        "end_progress": 0.7882427307206068
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  But, they are being kept secret from the world.  Word is starting to filter out, a leak here a leak there, just rumors, no knows what to believe.  Still, a consensus is starting to form around a single idea, and you are grateful you didn't get the drug.  The truth seems to be that  sixty years after they took the drug they start to lose their minds, and end up in a vegetative state.  It's like Alzheimer's overnight.  The people that took the trial drug, before FDA approval all seem to be exhibiting this zombie like state.  And now this is the destiny for everyone that was given it before their twenty-eighth birthday.  We, the \"Lost Generation\", have age, but we don't have this doom hanging over us.  In fact because of our status we have been cared for by those that did get the drug, we get the best health care, the best medicines, the best treatments, since those others feel a guilt towards us.  So, it's not so bad being a Lost Generation, most of us feel as if we are still in our forties.  But, the world is doomed, those that care for us will soon be unable to take care of themselves, and we are in no position to repopulate the world.  This is truly the end of man kind, and we brought it on ourselves. \n",
        "source": "user",
        "start_time": 1021.0,
        "end_time": 1205.0,
        "last_event_time": 1205.0,
        "start_progress": 0.7882427307206068,
        "end_progress": 0.9589127686472819
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  But, they are being kept secret from the world.  Word is starting to filter out, a leak here a leak there, just rumors, no knows what to believe.  Still, a consensus is starting to form around a single idea, and you are grateful you didn't get the drug.  The truth seems to be that  sixty years after they took the drug they start to lose their minds, and end up in a vegetative state.  It's like Alzheimer's overnight.  The people that took the trial drug, before FDA approval all seem to be exhibiting this zombie like state.  And now this is the destiny for everyone that was given it before their twenty-eighth birthday.  We, the \"Lost Generation\", have age, but we don't have this doom hanging over us.  In fact because of our status we have been cared for by those that did get the drug, we get the best health care, the best medicines, the best treatments, since those others feel a guilt towards us.  So, it's not so bad being a Lost Generation, most of us feel as if we are still in our forties.  But, the world is doomed, those that care for us will soon be unable to take care of themselves, and we are in no position to repopulate the world.  This is truly the end of man kind, and we brought it on ourselves.  The only thing left to do is try to enjoy the time we have left.\n",
        "source": "api",
        "start_time": 1214.0,
        "end_time": 1214.0,
        "last_event_time": 1214.0,
        "start_progress": 0.9589127686472819,
        "end_progress": 1.0
    }
]