[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.13770325203252032
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. \n",
        "source": "user",
        "start_time": 2.0,
        "end_time": 154.0,
        "last_event_time": 154.0,
        "start_progress": 0.13770325203252032,
        "end_progress": 0.21392276422764228
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable.\n",
        "source": "api",
        "start_time": 160.0,
        "end_time": 160.0,
        "last_event_time": 160.0,
        "start_progress": 0.21392276422764228,
        "end_progress": 0.27235772357723576
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. \n",
        "source": "user",
        "start_time": 161.0,
        "end_time": 176.0,
        "last_event_time": 176.0,
        "start_progress": 0.27235772357723576,
        "end_progress": 0.3053861788617886
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. They could not fight bees from beyond the grave, anyway.\n",
        "source": "api",
        "start_time": 185.0,
        "end_time": 185.0,
        "last_event_time": 185.0,
        "start_progress": 0.3053861788617886,
        "end_progress": 0.33384146341463417
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. They could not fight bees from beyond the grave, anyway. They bargained for the bee's to have dominion over their backyard and forest behind their house. \n",
        "source": "user",
        "start_time": 186.0,
        "end_time": 206.0,
        "last_event_time": 206.0,
        "start_progress": 0.33384146341463417,
        "end_progress": 0.38363821138211385
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. They could not fight bees from beyond the grave, anyway. They bargained for the bee's to have dominion over their backyard and forest behind their house. They would be allowed to set up a hive of their own, as long as they did not bother them.\n",
        "source": "api",
        "start_time": 212.0,
        "end_time": 212.0,
        "last_event_time": 212.0,
        "start_progress": 0.38363821138211385,
        "end_progress": 0.42886178861788615
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. They could not fight bees from beyond the grave, anyway. They bargained for the bees to have dominion over their backyard and the forest behind their house. They would be allowed to set up a hive of their own, as long as they did not bother them. This agreement would protect both the bees and the allergic man and his family. \n",
        "source": "user",
        "start_time": 214.0,
        "end_time": 236.0,
        "last_event_time": 236.0,
        "start_progress": 0.42886178861788615,
        "end_progress": 0.4715447154471545
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. They could not fight bees from beyond the grave, anyway. They bargained for the bees to have dominion over their backyard and the forest behind their house. They would be allowed to set up a hive of their own, as long as they did not bother them. This agreement would protect both the bees and the allergic man and his family. The bees would have a home and the allergic man could continue on with his life without worrying about being stung.\n",
        "source": "api",
        "start_time": 251.0,
        "end_time": 251.0,
        "last_event_time": 251.0,
        "start_progress": 0.4715447154471545,
        "end_progress": 0.529979674796748
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. They could not fight bees from beyond the grave, anyway. They bargained for the bees to have dominion over their backyard and the forest behind their house. They would be allowed to set up a hive of their own, as long as they did not bother them. This agreement would protect both the bees and the allergic man and his family. The bees would have a home and the allergic man could continue on with his life without worrying about being stung. This was a fair agreement and had a winning situation for both sides. The bees reluctantly agreed on the truce. \n",
        "source": "user",
        "start_time": 251.0,
        "end_time": 273.0,
        "last_event_time": 273.0,
        "start_progress": 0.529979674796748,
        "end_progress": 0.5873983739837398
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. They could not fight bees from beyond the grave, anyway. They bargained for the bees to have dominion over their backyard and the forest behind their house. They would be allowed to set up a hive of their own, as long as they did not bother them. This agreement would protect both the bees and the allergic man and his family. The bees would have a home and the allergic man could continue on with his life without worrying about being stung. This was a fair agreement and had a winning situation for both sides. The bees reluctantly agreed on the truce. The allergic man and his family were relieved to be able to live free of worry.\n",
        "source": "api",
        "start_time": 283.0,
        "end_time": 283.0,
        "last_event_time": 283.0,
        "start_progress": 0.5873983739837398,
        "end_progress": 0.6275406504065041
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. They could not fight bees from beyond the grave, anyway. They bargained for the bees to have dominion over their backyard and the forest behind their house. They would be allowed to set up a hive of their own, as long as they did not bother them. This agreement would protect both the bees and the allergic man and his family. The bees would have a home and the allergic man could continue on with his life without worrying about being stung. This was a fair agreement and had a winning situation for both sides. The bees reluctantly agreed on the truce. The allergic man and his family were relieved to be able to live free of worry. They fenced off the area and let the bees live in peace. This went on for many years to come until the great war of 2050. \n",
        "source": "user",
        "start_time": 284.0,
        "end_time": 313.0,
        "last_event_time": 313.0,
        "start_progress": 0.6275406504065041,
        "end_progress": 0.6900406504065041
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. They could not fight bees from beyond the grave, anyway. They bargained for the bees to have dominion over their backyard and the forest behind their house. They would be allowed to set up a hive of their own, as long as they did not bother them. This agreement would protect both the bees and the allergic man and his family. The bees would have a home and the allergic man could continue on with his life without worrying about being stung. This was a fair agreement and had a winning situation for both sides. The bees reluctantly agreed on the truce. The allergic man and his family were relieved to be able to live free of worry. They fenced off the area and let the bees live in peace. This went on for many years to come until the great war of 2050. \n\nAs the bees grew in number, and as they were a part of the family now, they knew there was something that would threaten their way\n",
        "source": "api",
        "start_time": 325.0,
        "end_time": 325.0,
        "last_event_time": 325.0,
        "start_progress": 0.6900406504065041,
        "end_progress": 0.7571138211382114
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. They could not fight bees from beyond the grave, anyway. They bargained for the bees to have dominion over their backyard and the forest behind their house. They would be allowed to set up a hive of their own, as long as they did not bother them. This agreement would protect both the bees and the allergic man and his family. The bees would have a home and the allergic man could continue on with his life without worrying about being stung. This was a fair agreement and had a winning situation for both sides. The bees reluctantly agreed on the truce. The allergic man and his family were relieved to be able to live free of worry. They fenced off the area and let the bees live in peace. This went on for many years to come until the great war of 2050. As the bees grew in number, and as they were a part of the family now, they knew there was something that would threaten their way. They decided to strike the family and kill half of all people. \n",
        "source": "user",
        "start_time": 328.0,
        "end_time": 347.0,
        "last_event_time": 347.0,
        "start_progress": 0.7571138211382114,
        "end_progress": 0.7891260162601627
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. They could not fight bees from beyond the grave, anyway. They bargained for the bees to have dominion over their backyard and the forest behind their house. They would be allowed to set up a hive of their own, as long as they did not bother them. This agreement would protect both the bees and the allergic man and his family. The bees would have a home and the allergic man could continue on with his life without worrying about being stung. This was a fair agreement and had a winning situation for both sides. The bees reluctantly agreed on the truce. The allergic man and his family were relieved to be able to live free of worry. They fenced off the area and let the bees live in peace. This went on for many years to come until the great war of 2050. As the bees grew in number, and as they were a part of the family now, they knew there was something that would threaten their way. They decided to strike the family and kill half of all people. They would finally have their freedom to rule over all that they could see.\n",
        "source": "api",
        "start_time": 354.0,
        "end_time": 354.0,
        "last_event_time": 354.0,
        "start_progress": 0.7891260162601627,
        "end_progress": 0.8272357723577236
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. They could not fight bees from beyond the grave, anyway. They bargained for the bees to have dominion over their backyard and the forest behind their house. They would be allowed to set up a hive of their own, as long as they did not bother them. This agreement would protect both the bees and the allergic man and his family. The bees would have a home and the allergic man could continue on with his life without worrying about being stung. This was a fair agreement and had a winning situation for both sides. The bees reluctantly agreed on the truce. The allergic man and his family were relieved to be able to live free of worry. They fenced off the area and let the bees live in peace. This went on for many years to come until the great war of 2050. As the bees grew in number, and as they were a part of the family now, they knew there was something that would threaten their way. They decided to strike the family and kill half of all people. They would finally have the freedom to rule over all that they could see.\n\nThe family had to retreat to another land as the bees had grown to a massive army. \n",
        "source": "user",
        "start_time": 357.0,
        "end_time": 380.0,
        "last_event_time": 380.0,
        "start_progress": 0.8272357723577236,
        "end_progress": 0.869410569105691
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. They could not fight bees from beyond the grave, anyway. They bargained for the bees to have dominion over their backyard and the forest behind their house. They would be allowed to set up a hive of their own, as long as they did not bother them. This agreement would protect both the bees and the allergic man and his family. The bees would have a home and the allergic man could continue on with his life without worrying about being stung. This was a fair agreement and had a winning situation for both sides. The bees reluctantly agreed on the truce. The allergic man and his family were relieved to be able to live free of worry. They fenced off the area and let the bees live in peace. This went on for many years to come until the great war of 2050. As the bees grew in number, and as they were a part of the family now, they knew there was something that would threaten their way. They decided to strike the family and kill half of all people. They would finally have the freedom to rule over all that they could see.\n\nThe family had to retreat to another land as the bees had grown to a massive army. They were a scourge upon the land and would not stop until they had complete control.\n",
        "source": "api",
        "start_time": 386.0,
        "end_time": 386.0,
        "last_event_time": 386.0,
        "start_progress": 0.869410569105691,
        "end_progress": 0.9126016260162602
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. They could not fight bees from beyond the grave, anyway. They bargained for the bees to have dominion over their backyard and the forest behind their house. They would be allowed to set up a hive of their own, as long as they did not bother them. This agreement would protect both the bees and the allergic man and his family. The bees would have a home and the allergic man could continue on with his life without worrying about being stung. This was a fair agreement and had a winning situation for both sides. The bees reluctantly agreed on the truce. The allergic man and his family were relieved to be able to live free of worry. They fenced off the area and let the bees live in peace. This went on for many years to come until the great war of 2050. As the bees grew in number, and as they were a part of the family now, they knew there was something that would threaten their way. They decided to strike the family and kill half of all people. They would finally have the freedom to rule over all that they could see.\n\nThe family had to retreat to another land as the bees had grown to a massive army. They were a scourge upon the land and would not stop until they had complete control. They would decimate the land and kill off all wildlife until there was nothing left at all. \n",
        "source": "user",
        "start_time": 387.0,
        "end_time": 494.0,
        "last_event_time": 494.0,
        "start_progress": 0.9126016260162602,
        "end_progress": 0.9598577235772358
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. They could not fight bees from beyond the grave, anyway. They bargained for the bees to have dominion over their backyard and the forest behind their house. They would be allowed to set up a hive of their own, as long as they did not bother them. This agreement would protect both the bees and the allergic man and his family. The bees would have a home and the allergic man could continue on with his life without worrying about being stung. This was a fair agreement and had a winning situation for both sides. The bees reluctantly agreed on the truce. The allergic man and his family were relieved to be able to live free of worry. They fenced off the area and let the bees live in peace. This went on for many years to come until the great war of 2050. As the bees grew in number, and as they were a part of the family now, they knew there was something that would threaten their way. They decided to strike the family and kill half of all people. They would finally have the freedom to rule over all that they could see.\n\nThe family had to retreat to another land as the bees had grown to a massive army. They were a scourge upon the land and would not stop until they had complete control. They would decimate the land and kill off all wildlife until there was nothing left at all. The family settled down in the land of the ice and snow.\n",
        "source": "api",
        "start_time": 534.0,
        "end_time": 534.0,
        "last_event_time": 534.0,
        "start_progress": 0.9598577235772358,
        "end_progress": 0.9883130081300813
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"    \n\nIt was almost as if the bee had caused them to be frozen in time. They had no idea what to do and were completely at the whim of the bee force. They had never been aware of it before, but the process of a bee whispering into your ear was fairly uncomfortable. They decided to plea with the bee and try and agree on a truce. They could not fight bees from beyond the grave, anyway. They bargained for the bees to have dominion over their backyard and the forest behind their house. They would be allowed to set up a hive of their own, as long as they did not bother them. This agreement would protect both the bees and the allergic man and his family. The bees would have a home and the allergic man could continue on with his life without worrying about being stung. This was a fair agreement and had a winning situation for both sides. The bees reluctantly agreed on the truce. The allergic man and his family were relieved to be able to live free of worry. They fenced off the area and let the bees live in peace. This went on for many years to come until the great war of 2050. As the bees grew in number, and as they were a part of the family now, they knew there was something that would threaten their way. They decided to strike the family and kill half of all people. They would finally have the freedom to rule over all that they could see.\n\nThe family had to retreat to another land as the bees had grown to a massive army. They were a scourge upon the land and would not stop until they had complete control. They would decimate the land and kill off all wildlife until there was nothing left at all. The family settled down in the land of ice and snow for no bees could survive. \n",
        "source": "user",
        "start_time": 536.0,
        "end_time": 577.0,
        "last_event_time": 577.0,
        "start_progress": 0.9883130081300813,
        "end_progress": 1.0
    }
]