[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\"\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.2326702833031947
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The wolf shook his head, why bother, things had started going wrong after the second pig. \n",
        "source": "user",
        "start_time": 54.0,
        "end_time": 109.0,
        "last_event_time": 109.0,
        "start_progress": 0.2326702833031947,
        "end_progress": 0.2875226039783002
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The wolf shook his head, why bother, things had started going wrong after the second pig. The wolf had been planning to eat the third pig, but he was like, \"this is getting ridiculous.\"\n",
        "source": "api",
        "start_time": 141.0,
        "end_time": 141.0,
        "last_event_time": 141.0,
        "start_progress": 0.2875226039783002,
        "end_progress": 0.3447860156720916
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The wolf shook his head, why bother, things had started going wrong after the second pig.   The wolf had been planning to eat the third pig, but he was like, \"this is getting ridiculous.\"  he knew there were one hundred of the, all on the same street.  He looked up and don the road, in the distance the straw and wood houses were flattened, \n",
        "source": "user",
        "start_time": 143.0,
        "end_time": 223.0,
        "last_event_time": 223.0,
        "start_progress": 0.3447860156720916,
        "end_progress": 0.4394213381555154
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The wolf shook his head, why bother, things had started going wrong after the second pig.   The wolf had been planning to eat the third pig, but he was like, \"this is getting ridiculous.\"  he knew there were one hundred of the, all on the same street.  He looked up and don the road, in the distance the straw and wood houses were flattened, and the brick house was still standing.\n",
        "source": "api",
        "start_time": 229.0,
        "end_time": 229.0,
        "last_event_time": 229.0,
        "start_progress": 0.4394213381555154,
        "end_progress": 0.4629294755877034
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The wolf shook his head, why bother, things had started going wrong after the second pig.   The wolf had been planning to eat the third pig, but he was like, \"this is getting ridiculous.\"  he knew there were one hundred of the, all on the same street.  He looked up and don the road, in the distance the straw and wood houses were flattened, and the brick house was still standing.  From there on he could see his failure, one house after another.  In the other direction were just a few more houses, each looked different from the next, he was no expert, \n",
        "source": "user",
        "start_time": 231.0,
        "end_time": 383.0,
        "last_event_time": 383.0,
        "start_progress": 0.4629294755877034,
        "end_progress": 0.568414707655214
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The wolf shook his head, why bother, things had started going wrong after the second pig.   The wolf had been planning to eat the third pig, but he was like, \"this is getting ridiculous.\"  he knew there were one hundred of the, all on the same street.  He looked up and don the road, in the distance the straw and wood houses were flattened, and the brick house was still standing.  From there on he could see his failure, one house after another.  In the other direction were just a few more houses, each looked different from the next, he was no expert, but he could tell they were made of different materials.\n",
        "source": "api",
        "start_time": 392.0,
        "end_time": 392.0,
        "last_event_time": 392.0,
        "start_progress": 0.568414707655214,
        "end_progress": 0.6021699819168174
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The wolf shook his head, why bother, things had started going wrong after the second pig.   The wolf had been planning to eat the third pig, but he was like, \"this is getting ridiculous.\"  he knew there were one hundred of the, all on the same street.  He looked up and don the road, in the distance the straw and wood houses were flattened, and the brick house was still standing.  From there on he could see his failure, one house after another.  In the other direction were just a few more houses, each looked different from the next, he was no expert, but he could tell they were made of different materials.  Based on the last ninety experiences he suspected the future was not promising, was that last one diamond!  It had taken him to this point, but he started to realize he needed a change of career. \n",
        "source": "user",
        "start_time": 396.0,
        "end_time": 530.0,
        "last_event_time": 530.0,
        "start_progress": 0.6021699819168174,
        "end_progress": 0.7215189873417721
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The wolf shook his head, why bother, things had started going wrong after the second pig.   The wolf had been planning to eat the third pig, but he was like, \"this is getting ridiculous.\"  he knew there were one hundred of the, all on the same street.  He looked up and don the road, in the distance the straw and wood houses were flattened, and the brick house was still standing.  From there on he could see his failure, one house after another.  In the other direction were just a few more houses, each looked different from the next, he was no expert, but he could tell they were made of different materials.  Based on the last ninety experiences he suspected the future was not promising, was that last one diamond!  It had taken him to this point, but he started to realize he needed a change of career. \n\nThe wolf was not a stupid wolf, he was a wolf of many talents.\n",
        "source": "api",
        "start_time": 551.0,
        "end_time": 551.0,
        "last_event_time": 551.0,
        "start_progress": 0.7215189873417721,
        "end_progress": 0.7600964436407475
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The wolf shook his head, why bother, things had started going wrong after the second pig.   The wolf had been planning to eat the third pig, but he was like, \"this is getting ridiculous.\"  he knew there were one hundred of the, all on the same street.  He looked up and don the road, in the distance the straw and wood houses were flattened, and the brick house was still standing.  From there on he could see his failure, one house after another.  In the other direction were just a few more houses, each looked different from the next, he was no expert, but he could tell they were made of different materials.  Based on the last ninety experiences he suspected the future was not promising, was that last one diamond!  It had taken him to this point, but he started to realize he needed a change in approach.  The wolf was not a stupid wolf, he was a wolf of many talents.  His friends had told him he had a talent for role play and disguise, could he put this to good use? \n",
        "source": "user",
        "start_time": 554.0,
        "end_time": 641.0,
        "last_event_time": 641.0,
        "start_progress": 0.7600964436407475,
        "end_progress": 0.8221820373719108
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The wolf shook his head, why bother, things had started going wrong after the second pig.   The wolf had been planning to eat the third pig, but he was like, \"this is getting ridiculous.\"  he knew there were one hundred of the, all on the same street.  He looked up and don the road, in the distance the straw and wood houses were flattened, and the brick house was still standing.  From there on he could see his failure, one house after another.  In the other direction were just a few more houses, each looked different from the next, he was no expert, but he could tell they were made of different materials.  Based on the last ninety experiences he suspected the future was not promising, was that last one diamond!  It had taken him to this point, but he started to realize he needed a change in approach.  The wolf was not a stupid wolf, he was a wolf of many talents.  His friends had told him he had a talent for role play and disguise, could he put this to good use?  He had been thinking about this for a while, but he had not come up with a plan.\n",
        "source": "api",
        "start_time": 665.0,
        "end_time": 665.0,
        "last_event_time": 665.0,
        "start_progress": 0.8221820373719108,
        "end_progress": 0.8710066305003014
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The wolf shook his head, why bother, things had started going wrong after the second pig.   The wolf had been planning to eat the third pig, but he was like, \"this is getting ridiculous.\"  he knew there were one hundred of the, all on the same street.  He looked up and don the road, in the distance the straw and wood houses were flattened, and the brick house was still standing.  From there on he could see his failure, one house after another.  In the other direction were just a few more houses, each looked different from the next, he was no expert, but he could tell they were made of different materials.  Based on the last ninety experiences he suspected the future was not promising, was that last one diamond!  It had taken him to this point, but he started to realize he needed a change in approach.  The wolf was not a stupid wolf, he was a wolf of many talents.  His friends had told him he had a talent for role play and disguise, could he put this to good use?  He had been thinking about this for a while, but he had not come up with a plan.  Then off in the distance he saw a girl heading into the forest, easy to spot with that red hooded cloak.  Now, where was that granny costume he used to entertain his friends? \n",
        "source": "user",
        "start_time": 668.0,
        "end_time": 776.0,
        "last_event_time": 776.0,
        "start_progress": 0.8710066305003014,
        "end_progress": 0.9776974080771549
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The wolf shook his head, why bother, things had started going wrong after the second pig.   The wolf had been planning to eat the third pig, but he was like, \"this is getting ridiculous.\"  he knew there were one hundred of the, all on the same street.  He looked up and don the road, in the distance the straw and wood houses were flattened, and the brick house was still standing.  From there on he could see his failure, one house after another.  In the other direction were just a few more houses, each looked different from the next, he was no expert, but he could tell they were made of different materials.  Based on the last ninety experiences he suspected the future was not promising, was that last one diamond!  It had taken him to this point, but he started to realize he needed a change in approach.  The wolf was not a stupid wolf, he was a wolf of many talents.  His friends had told him he had a talent for role play and disguise, could he put this to good use?  He had been thinking about this for a while, but he had not come up with a plan.  Then off in the distance he saw a girl heading into the forest, easy to spot with that red hooded cloak.  Now, where was that granny costume he used to entertain his friends?  He had a plan.\n",
        "source": "api",
        "start_time": 781.0,
        "end_time": 781.0,
        "last_event_time": 781.0,
        "start_progress": 0.9776974080771549,
        "end_progress": 0.9867389993972272
    },
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\" The wolf shook his head, why bother, things had started going wrong after the second pig.   The wolf had been planning to eat the third pig, but he was like, \"this is getting ridiculous.\"  He knew there were one hundred of the, all on the same street.  He looked up and down the road, in the distance the straw and wood houses were flattened, but the brick house was still standing.  From there on he could see his failure, one house after another.  In the other direction were just a few more houses, each looked different from the next, he was no expert, but he could tell they were made of different materials.  Based on the last ninety experiences he suspected the future was not promising, was that last one diamond!  It had taken him to this point, but he started to realize he needed a change in approach.  The wolf was not a stupid wolf, he was a wolf of many talents.  His friends had told him he had a talent for role play and disguise, could he put this to good use?  He had been thinking about this for a while, but he had not come up with a plan.  Then off in the distance he saw a girl heading into the forest, easy to spot with that red hooded cloak.  Now, where was that granny costume he used to entertain his friends?  He had a plan. What could go wrong.\n",
        "source": "user",
        "start_time": 785.0,
        "end_time": 828.0,
        "last_event_time": 828.0,
        "start_progress": 0.9867389993972272,
        "end_progress": 1.0
    }
]