[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.13028846153846155
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I screamed for my mom, 'HELP'! I then whacked him with my hand not thinking about it when the stinger was thrust into my hand as the bee was crushed underneath. It was a bee mom and I'm stung. She quickly grabbed an Epi pen and jabbed it in my leg and rushed me straight to the hospital. While \n",
        "source": "user",
        "start_time": 3.0,
        "end_time": 228.0,
        "last_event_time": 228.0,
        "start_progress": 0.13028846153846155,
        "end_progress": 0.2721153846153846
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I screamed for my mom, 'HELP'! I then whacked him with my hand not thinking about it when the stinger was thrust into my hand as the bee was crushed underneath. It was a bee mom and I'm stung. She quickly grabbed an Epi pen and jabbed it in my leg and rushed me straight to the hospital. While there, I was told I was allergic to bees and that I would have to be kept in the hospital for a few days.\n",
        "source": "api",
        "start_time": 254.0,
        "end_time": 254.0,
        "last_event_time": 254.0,
        "start_progress": 0.2721153846153846,
        "end_progress": 0.32259615384615387
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I screamed for my mom, 'HELP'! I then whacked him with my hand not thinking about it when the stinger was thrust into my hand as the bee was crushed underneath. It was a bee mom and I'm stung. She quickly grabbed an Epi pen and jabbed it in my leg and rushed me straight to the hospital. There, I was told I was allergic to bees and that I would have to be kept in the hospital for a few days. I was just relieved to be alive. What I did not know if that a platoon of bees had followed me to the hospital knowing that is where people go to die. The General leading the army said we must get the boy out to safety before he parrishes in building of the dead. The bees had no clue that most people go there to get better not die. They have only witnessed the dead leaving because that is where their hive is at. \n",
        "source": "user",
        "start_time": 259.0,
        "end_time": 453.0,
        "last_event_time": 453.0,
        "start_progress": 0.32259615384615387,
        "end_progress": 0.5201923076923077
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I screamed for my mom, 'HELP'! I then whacked him with my hand not thinking about it when the stinger was thrust into my hand as the bee was crushed underneath. It was a bee mom and I'm stung. She quickly grabbed an Epi pen and jabbed it in my leg and rushed me straight to the hospital. There, I was told I was allergic to bees and that I would have to be kept in the hospital for a few days. I was just relieved to be alive. What I did not know if that a platoon of bees had followed me to the hospital knowing that is where people go to die. The General leading the army said we must get the boy out to safety before he parrishes in building of the dead. The bees had no clue that most people go there to get better not die. They have only witnessed the dead leaving because that is where their hive is at. The General ordered the troops to attack the hospital and get the boy out.\n",
        "source": "api",
        "start_time": 472.0,
        "end_time": 472.0,
        "last_event_time": 472.0,
        "start_progress": 0.5201923076923077,
        "end_progress": 0.5557692307692308
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I screamed for my mom, 'HELP'! I then whacked him with my hand not thinking about it when the stinger was thrust into my hand as the bee was crushed underneath. It was a bee mom and I'm stung. She quickly grabbed an Epi pen and jabbed it in my leg and rushed me straight to the hospital. There, I was told I was allergic to bees and that I would have to be kept in the hospital for a few days. I was just relieved to be alive. What I did not know if that a platoon of bees had followed me to the hospital knowing that is where people go to die. The General leading the army said we must get the boy out to safety before he parrishes in building of the dead. The bees had no clue that most people go there to get better not die. They have only witnessed the dead leaving because that is where their hive is at. \nThe General ordered the troops to attack the hospital and get the boy out. The had a coordinated assult where they went through every air vent in the hospital and came out stinging anybody and everybody. It was chaos in the hospital. Doctors and patients alike are being stung. Then through all the chaos a team of bees led by the general approached me and told me how my body is a robot being controlled by a bee in its head. A mole was then gently pushed by one of the bees and all my memories came rushing back and I was aware of my bee body again. \n",
        "source": "user",
        "start_time": 475.0,
        "end_time": 639.0,
        "last_event_time": 639.0,
        "start_progress": 0.5557692307692308,
        "end_progress": 0.7860576923076923
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I screamed for my mom, 'HELP'! I then whacked him with my hand not thinking about it when the stinger was thrust into my hand as the bee was crushed underneath. It was a bee mom and I'm stung. She quickly grabbed an Epi pen and jabbed it in my leg and rushed me straight to the hospital. There, I was told I was allergic to bees and that I would have to be kept in the hospital for a few days. I was just relieved to be alive. What I did not know if that a platoon of bees had followed me to the hospital knowing that is where people go to die. The General leading the army said we must get the boy out to safety before he parrishes in building of the dead. The bees had no clue that most people go there to get better not die. They have only witnessed the dead leaving because that is where their hive is at. \nThe General ordered the troops to attack the hospital and get the boy out. The had a coordinated assult where they went through every air vent in the hospital and came out stinging anybody and everybody. It was chaos in the hospital. Doctors and patients alike are being stung. Then through all the chaos a team of bees led by the general approached me and told me how my body is a robot being controlled by a bee in its head. A mole was then gently pushed by one of the bees and all my memories came rushing back and I was aware of my bee body again. I was then told that I had been chosen to be the leader of the bees and that I must go to the hive and lead them to victory.\n",
        "source": "api",
        "start_time": 663.0,
        "end_time": 663.0,
        "last_event_time": 663.0,
        "start_progress": 0.7860576923076923,
        "end_progress": 0.8456730769230769
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I screamed for my mom, 'HELP'! I then whacked him with my hand not thinking about it when the stinger was thrust into my hand as the bee was crushed underneath. It was a bee mom and I'm stung. She quickly grabbed an Epi pen and jabbed it in my leg and rushed me straight to the hospital. There, I was told I was allergic to bees and that I would have to be kept in the hospital for a few days. I was just relieved to be alive. What I did not know if that a platoon of bees had followed me to the hospital knowing that is where people go to die. The General leading the army said we must get the boy out to safety before he parishes in building of the dead. The bees had no clue that most people go there to get better not die. They have only witnessed the dead leaving because that is where their hive is at. \nThe General ordered the troops to attack the hospital and get the boy out. The had a coordinated assult where they went through every air vent in the hospital and came out stinging anybody and everybody. It was chaos in the hospital. Doctors and patients alike are being stung. Then through all the chaos a team of bees led by the general approached me and told me how my body is a robot being controlled by a bee in its head. A mole was then gently pushed by one of the bees and all my memories came rushing back and I was aware of my bee body again. I was then told that I had been chosen to be the leader of the bees and that I must go to the hive and lead them to victory. I told them with a familar confidence that I would but I would also be utilizing the body at times to advance our goals against the humans who are killing us off. \n",
        "source": "user",
        "start_time": 667.0,
        "end_time": 727.0,
        "last_event_time": 727.0,
        "start_progress": 0.8456730769230769,
        "end_progress": 0.9240384615384616
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I screamed for my mom, 'HELP'! I then whacked him with my hand not thinking about it when the stinger was thrust into my hand as the bee was crushed underneath. It was a bee mom and I'm stung. She quickly grabbed an Epi pen and jabbed it in my leg and rushed me straight to the hospital. There, I was told I was allergic to bees and that I would have to be kept in the hospital for a few days. I was just relieved to be alive. What I did not know if that a platoon of bees had followed me to the hospital knowing that is where people go to die. The General leading the army said we must get the boy out to safety before he parishes in building of the dead. The bees had no clue that most people go there to get better not die. They have only witnessed the dead leaving because that is where their hive is at. \nThe General ordered the troops to attack the hospital and get the boy out. The had a coordinated assult where they went through every air vent in the hospital and came out stinging anybody and everybody. It was chaos in the hospital. Doctors and patients alike are being stung. Then through all the chaos a team of bees led by the general approached me and told me how my body is a robot being controlled by a bee in its head. A mole was then gently pushed by one of the bees and all my memories came rushing back and I was aware of my bee body again. I was then told that I had been chosen to be the leader of the bees and that I must go to the hive and lead them to victory. I told them with a familar confidence that I would but I would also be utilizing the body at times to advance our goals against the humans who are killing us off. The bees were pleased with my answer and told me that I must go to the hive now.\n",
        "source": "api",
        "start_time": 737.0,
        "end_time": 737.0,
        "last_event_time": 737.0,
        "start_progress": 0.9240384615384616,
        "end_progress": 0.9625
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I screamed for my mom, 'HELP'! I then whacked him with my hand not thinking about it when the stinger was thrust into my hand as the bee was crushed underneath. It was a bee mom and I'm stung. She quickly grabbed an Epi pen and jabbed it in my leg and rushed me straight to the hospital. There, I was told I was allergic to bees and that I would have to be kept in the hospital for a few days. I was just relieved to be alive. What I did not know if that a platoon of bees had followed me to the hospital knowing that is where people go to die. The General leading the army said we must get the boy out to safety before he parishes in building of the dead. The bees had no clue that most people go there to get better not die. They have only witnessed the dead leaving because that is where their hive is at. \nThe General ordered the troops to attack the hospital and get the boy out. The had a coordinated assult where they went through every air vent in the hospital and came out stinging anybody and everybody. It was chaos in the hospital. Doctors and patients alike are being stung. Then through all the chaos a team of bees led by the general approached me and told me how my body is a robot being controlled by a bee in its head. A mole was then gently pushed by one of the bees and all my memories came rushing back and I was aware of my bee body again. I was then told that I had been chosen to be the leader of the bees and that I must go to the hive and lead them to victory. I told them with a familar confidence that I would but I would also be utilizing the body at times to advance our goals against the humans who are killing us off. The bees were pleased with my answer and told me that I must go to the hive now. I did and we began the final plan to save all the bees from the evil humans. \n",
        "source": "user",
        "start_time": 739.0,
        "end_time": 767.0,
        "last_event_time": 767.0,
        "start_progress": 0.9625,
        "end_progress": 1.0
    }
]