[
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.1530669667979741
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  \n",
        "source": "user",
        "start_time": 28.0,
        "end_time": 191.0,
        "last_event_time": 191.0,
        "start_progress": 0.1530669667979741,
        "end_progress": 0.26955543050084413
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.\n",
        "source": "api",
        "start_time": 206.0,
        "end_time": 206.0,
        "last_event_time": 206.0,
        "start_progress": 0.26955543050084413,
        "end_progress": 0.32189082723691614
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.  Using just their mind, people can now manipulate objects, moving them, changing their shape, exerting force on them. \n",
        "source": "user",
        "start_time": 210.0,
        "end_time": 278.0,
        "last_event_time": 278.0,
        "start_progress": 0.32189082723691614,
        "end_progress": 0.38885762521102984
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.  Using just their mind, people can now manipulate objects, moving them, changing their shape, exerting force on them.  The world is now full of possibilities, and with the right training, anything is possible.\n",
        "source": "api",
        "start_time": 286.0,
        "end_time": 286.0,
        "last_event_time": 286.0,
        "start_progress": 0.38885762521102984,
        "end_progress": 0.44006752954417555
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.  Using just their mind, people can now manipulate objects, moving them, changing their shape, exerting force on them.  The world is now full of possibilities, and with the right training, anything is possible.  We start to come to the conclusion that this could be a weapon, \n",
        "source": "user",
        "start_time": 291.0,
        "end_time": 326.0,
        "last_event_time": 326.0,
        "start_progress": 0.44006752954417555,
        "end_progress": 0.4772087788407428
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.  Using just their mind, people can now manipulate objects, moving them, changing their shape, exerting force on them.  The world is now full of possibilities, and with the right training, anything is possible.  We start to come to the conclusion that this could be a weapon, and we could use it to fight back against the aliens.\n",
        "source": "api",
        "start_time": 335.0,
        "end_time": 335.0,
        "last_event_time": 335.0,
        "start_progress": 0.4772087788407428,
        "end_progress": 0.5070343275182893
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.  Using just their mind, people can now manipulate objects, moving them, changing their shape, exerting force on them.  The world is now full of possibilities, and with the right training, anything is possible.  We start to come to the conclusion that this could be a weapon, and we could use it to fight back against the aliens.  But who will be the first to try, its a dangerous proposition, the aliens kill as soon as they see us, if it doesn't work there is great peril.  \n",
        "source": "user",
        "start_time": 340.0,
        "end_time": 400.0,
        "last_event_time": 400.0,
        "start_progress": 0.5070343275182893,
        "end_progress": 0.5897580191333709
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.  Using just their mind, people can now manipulate objects, moving them, changing their shape, exerting force on them.  The world is now full of possibilities, and with the right training, anything is possible.  We start to come to the conclusion that this could be a weapon, and we could use it to fight back against the aliens.  But who will be the first to try, its a dangerous proposition, the aliens kill as soon as they see us, if it doesn't work there is great peril.  But if it does, we could have a chance at winning.\n",
        "source": "api",
        "start_time": 414.0,
        "end_time": 414.0,
        "last_event_time": 414.0,
        "start_progress": 0.5897580191333709,
        "end_progress": 0.6178953292065279
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.  Using just their mind, people can now manipulate objects, moving them, changing their shape, exerting force on them.  The world is now full of possibilities, and with the right training, anything is possible.  We start to come to the conclusion that this could be a weapon, and we could use it to fight back against the aliens.  But who will be the first to try, its a dangerous proposition, the aliens kill as soon as they see us, if it doesn't work there is great peril.  But if it does, we could have a chance at winning.  No one wants to be the first, \n",
        "source": "user",
        "start_time": 418.0,
        "end_time": 434.0,
        "last_event_time": 434.0,
        "start_progress": 0.6178953292065279,
        "end_progress": 0.6359032076533483
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.  Using just their mind, people can now manipulate objects, moving them, changing their shape, exerting force on them.  The world is now full of possibilities, and with the right training, anything is possible.  We start to come to the conclusion that this could be a weapon, and we could use it to fight back against the aliens.  But who will be the first to try, its a dangerous proposition, the aliens kill as soon as they see us, if it doesn't work there is great peril.  But if it does, we could have a chance at winning.  No one wants to be the first, but someone has to be, and it might as well be me.\n",
        "source": "api",
        "start_time": 457.0,
        "end_time": 457.0,
        "last_event_time": 457.0,
        "start_progress": 0.6359032076533483,
        "end_progress": 0.6640405177265053
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.  Using just their mind, people can now manipulate objects, moving them, changing their shape, exerting force on them.  The world is now full of possibilities, and with the right training, anything is possible.  We start to come to the conclusion that this could be a weapon, and we could use it to fight back against the aliens.  But who will be the first to try, its a dangerous proposition, the aliens kill as soon as they see us, if it doesn't work there is great peril.  But if it does, we could have a chance at winning.  No one wants to be the first, but someone has to be, and it might as well be me.  I've been practicing, day after day, \n",
        "source": "user",
        "start_time": 461.0,
        "end_time": 507.0,
        "last_event_time": 507.0,
        "start_progress": 0.6640405177265053,
        "end_progress": 0.6859876195835678
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.  Using just their mind, people can now manipulate objects, moving them, changing their shape, exerting force on them.  The world is now full of possibilities, and with the right training, anything is possible.  We start to come to the conclusion that this could be a weapon, and we could use it to fight back against the aliens.  But who will be the first to try, its a dangerous proposition, the aliens kill as soon as they see us, if it doesn't work there is great peril.  But if it does, we could have a chance at winning.  No one wants to be the first, but someone has to be, and it might as well be me.  I've been practicing, day after day, night after night, I'm ready, I'm going to do it.\n",
        "source": "api",
        "start_time": 513.0,
        "end_time": 513.0,
        "last_event_time": 513.0,
        "start_progress": 0.6859876195835678,
        "end_progress": 0.7135621834552617
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.  Using just their mind, people can now manipulate objects, moving them, changing their shape, exerting force on them.  The world is now full of possibilities, and with the right training, anything is possible.  We start to come to the conclusion that this could be a weapon, and we could use it to fight back against the aliens.  But who will be the first to try, its a dangerous proposition, the aliens kill as soon as they see us, if it doesn't work there is great peril.  But if it does, we could have a chance at winning.  No one wants to be the first, but someone has to be, and it might as well be me.  I've been practicing, day after day, night after night, I'm ready, I'm going to do it.  But I'm filled with doubts, it's okay practicing on rocks, there is no peril, but in front of the aliens I have seconds to succeed.\n",
        "source": "user",
        "start_time": 516.0,
        "end_time": 570.0,
        "last_event_time": 570.0,
        "start_progress": 0.7135621834552617,
        "end_progress": 0.7884074282498593
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.  Using just their mind, people can now manipulate objects, moving them, changing their shape, exerting force on them.  The world is now full of possibilities, and with the right training, anything is possible.  We start to come to the conclusion that this could be a weapon, and we could use it to fight back against the aliens.  But who will be the first to try, its a dangerous proposition, the aliens kill as soon as they see us, if it doesn't work there is great peril.  But if it does, we could have a chance at winning.  No one wants to be the first, but someone has to be, and it might as well be me.  I've been practicing, day after day, night after night, I'm ready, I'm going to do it.  But I'm filled with doubts, it's okay practicing on rocks, there is no peril, but in front of the aliens I have seconds to succeed.  I'm scared, but I have to do this, I have to try.\n",
        "source": "api",
        "start_time": 577.0,
        "end_time": 577.0,
        "last_event_time": 577.0,
        "start_progress": 0.7884074282498593,
        "end_progress": 0.8171074845244795
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.  Using just their mind, people can now manipulate objects, moving them, changing their shape, exerting force on them.  The world is now full of possibilities, and with the right training, anything is possible.  We start to come to the conclusion that this could be a weapon, and we could use it to fight back against the aliens.  But who will be the first to try, its a dangerous proposition, the aliens kill as soon as they see us, if it doesn't work there is great peril.  But if it does, we could have a chance at winning.  No one wants to be the first, but someone has to be, and it might as well be me.  I've been practicing, day after day, night after night, I'm ready, I'm going to do it.  But I'm filled with doubts, it's okay practicing on rocks, there is no peril, but in front of the aliens I have seconds to succeed.  I'm scared, but I have to do this, I have to try.  Now or never, I step out from behind the wall, I see the first alien, I concentrate all my powers.  \n",
        "source": "user",
        "start_time": 581.0,
        "end_time": 614.0,
        "last_event_time": 614.0,
        "start_progress": 0.8171074845244795,
        "end_progress": 0.8745075970737197
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.  Using just their mind, people can now manipulate objects, moving them, changing their shape, exerting force on them.  The world is now full of possibilities, and with the right training, anything is possible.  We start to come to the conclusion that this could be a weapon, and we could use it to fight back against the aliens.  But who will be the first to try, its a dangerous proposition, the aliens kill as soon as they see us, if it doesn't work there is great peril.  But if it does, we could have a chance at winning.  No one wants to be the first, but someone has to be, and it might as well be me.  I've been practicing, day after day, night after night, I'm ready, I'm going to do it.  But I'm filled with doubts, it's okay practicing on rocks, there is no peril, but in front of the aliens I have seconds to succeed.  I'm scared, but I have to do this, I have to try.  Now or never, I step out from behind the wall, I see the first alien, I concentrate all my powers.  I feel the energy flowing through me, I feel the power, I feel the magic.\n",
        "source": "api",
        "start_time": 624.0,
        "end_time": 624.0,
        "last_event_time": 624.0,
        "start_progress": 0.8745075970737197,
        "end_progress": 0.915588069780529
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.  Using just their mind, people can now manipulate objects, moving them, changing their shape, exerting force on them.  The world is now full of possibilities, and with the right training, anything is possible.  We start to come to the conclusion that this could be a weapon, and we could use it to fight back against the aliens.  But who will be the first to try, its a dangerous proposition, the aliens kill as soon as they see us, if it doesn't work there is great peril.  But if it does, we could have a chance at winning.  No one wants to be the first, but someone has to be, and it might as well be me.  I've been practicing, day after day, night after night, I'm ready, I'm going to do it.  But I'm filled with doubts, it's okay practicing on rocks, there is no peril, but in front of the aliens I have seconds to succeed.  I'm scared, but I have to do this, I have to try.  Now or never, I step out from behind the wall, I see the first alien, I concentrate all my powers.  I feel the energy flowing through me, I feel the power, I feel the magic.  The alien pops out of existence.  There's a cheer from behind me.  We can do this, the tide has turned.\n",
        "source": "user",
        "start_time": 627.0,
        "end_time": 655.0,
        "last_event_time": 655.0,
        "start_progress": 0.915588069780529,
        "end_progress": 0.9746764209341587
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.  Slowly , those that are left become aware of abilities they never thought possible.  With practice and concentration people start to realize they can do things that they thought only happened in stories.  The world is changing, and the people that remain must decide what to do with this new power.  Using just their mind, people can now manipulate objects, moving them, changing their shape, exerting force on them.  The world is now full of possibilities, and with the right training, anything is possible.  We start to come to the conclusion that this could be a weapon, and we could use it to fight back against the aliens.  But who will be the first to try, its a dangerous proposition, the aliens kill as soon as they see us, if it doesn't work there is great peril.  But if it does, we could have a chance at winning.  No one wants to be the first, but someone has to be, and it might as well be me.  I've been practicing, day after day, night after night, I'm ready, I'm going to do it.  But I'm filled with doubts, it's okay practicing on rocks, there is no peril, but in front of the aliens I have seconds to succeed.  I'm scared, but I have to do this, I have to try.  Now or never, I step out from behind the wall, I see the first alien, I concentrate all my powers.  I feel the energy flowing through me, I feel the power, I feel the magic.  The alien pops out of existence.  There's a cheer from behind me.  We can do this, the tide has turned.  We can win this war, we can save the world.\n",
        "source": "api",
        "start_time": 662.0,
        "end_time": 662.0,
        "last_event_time": 662.0,
        "start_progress": 0.9746764209341587,
        "end_progress": 1.0
    }
]