[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You look around and see a small army of bees, all of them waiting for your command.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 24.0,
        "last_event_time": 24.0,
        "start_progress": 0,
        "end_progress": 0.14126541981695184
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou look around and see a small army of bees, all of them waiting for your command. You don't understand how you are even in this situation. You're allergic to bees. Why are they all waiting for your command? \n",
        "source": "user",
        "start_time": 25.0,
        "end_time": 77.0,
        "last_event_time": 77.0,
        "start_progress": 0.14126541981695184,
        "end_progress": 0.19220055710306408
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou look around and see a small army of bees, all of them waiting for your command. You don't understand how you are even in this situation. You're allergic to bees. Why are they all waiting for your command? You look down at your arm and see a small bee stinger sticking out of your skin.\n",
        "source": "api",
        "start_time": 83.0,
        "end_time": 83.0,
        "last_event_time": 83.0,
        "start_progress": 0.19220055710306408,
        "end_progress": 0.2240350179068842
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou look around and see a small army of bees, all of them waiting for your command. You don't understand how you are even in this situation. You're allergic to bees. Why are they all waiting for your command? You look down at your arm and see a small bee stinger sticking out of your skin. You look down and are shocked. You were obviously stung but didn't have an allergic reaction.\n\nYou think to yourself, \"what is going on?\" The bee who called you Your Majesty ended up stinging you. He was marking you to be the Leader of the bee army. You talk to that bee and ask him why he stung you. The bee tells you they need a leader that has access to a GPS.\n\nThe bee tells you that there is a garden that the bees need to get to in order to save their friends but they have no way of finding the place. They only know the name of the place and can't use a GPS since they're not human. They also can't talk to anyone that isn't the King of the bee army.\n\nYou ask the bee what the name of the Garden is. He tells you that the name is The Honeycomb Garden. You put that into the GPS and to your surprise, a location pops up. It's about a 30 minute walk from your current location.\n\nYou tell the bee that and that bee communicates it with the rest of the army. You start walking towards the location. You get close enough to see a sign that says The Honeycomb Garden but you have to cross a bridge to get there.\n\nTo your surprise there is a troll protecting the bridge and tells you that a riddle must be solved in order for you to cross. The troll asks you the riddle which is what has to be broken before you can use it? You think quickly and turn around to the bees who are all looking on nervously. You give them a thumbs up and tell the troll your answer is an egg. The troll gives you the thumbs up and lets you walk across the bridge. You walk across the bridge and the bees are able to get to Honeycomb Island.\n\nYou turn around quickly and all of a sudden you see a group of bees fly right by your head. The other bees were rescued and saved and were able to fly away from Honeycomb Garden where they were being used to create honey 24 hours a day. The bees all thanked you and promised to never sting you ever again. What a happy ending. \n",
        "source": "user",
        "start_time": 84.0,
        "end_time": 562.0,
        "last_event_time": 562.0,
        "start_progress": 0.2240350179068842,
        "end_progress": 1.0
    }
]