[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.08353221957040573
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, she meets a guy who’s different from all the rest.\n",
        "source": "api",
        "start_time": 29.0,
        "end_time": 29.0,
        "last_event_time": 29.0,
        "start_progress": 0.08353221957040573,
        "end_progress": 0.10092055915444936
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, she meets a guy who’s different from all the rest. He’s not a shapeshifter, and he’s not interested in her, but she’s intrigued by him.\n",
        "source": "api",
        "start_time": 50.0,
        "end_time": 50.0,
        "last_event_time": 50.0,
        "start_progress": 0.10092055915444936,
        "end_progress": 0.12990112512785543
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, she meets a guy who’s different from all the rest. He’s not a shapeshifter, and he’s not interested in her, but she’s intrigued by him. Maybe it was the challenge that interested her the most, or even the fact that this guy would be different since he wasnt immediately interested in her. What if this guy wasnt single? What if this guy didn't like her? These were all questions that started to rummage her mind. \n",
        "source": "user",
        "start_time": 58.0,
        "end_time": 119.0,
        "last_event_time": 119.0,
        "start_progress": 0.12990112512785543,
        "end_progress": 0.22468462325264235
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, she meets a guy who’s different from all the rest. He’s not a shapeshifter, and he’s not interested in her, but she’s intrigued by him. Maybe it was the challenge that interested her the most, or even the fact that this guy would be different since he wasnt immediately interested in her. What if this guy wasnt single? What if this guy didn't like her? These were all questions that started to rummage her mind. \n\nWhat happens when the shapeshifter finds out about the new guy?\n",
        "source": "api",
        "start_time": 136.0,
        "end_time": 136.0,
        "last_event_time": 136.0,
        "start_progress": 0.22468462325264235,
        "end_progress": 0.24684623252642346
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, she meets a guy who’s different from all the rest. He’s not a shapeshifter, and he’s not interested in her, but she’s intrigued by him. Maybe it was the challenge that interested her the most, or even the fact that this guy would be different since he wasnt immediately interested in her. What if this guy wasnt single? What if this guy didn't like her? . What happens when the shapeshifter finds out about the new guy? These were all questions that started to rummage her mind. In a way she felt that she was destined to never have a genuine relationship since she would always have to wonder whether the person was real, or simply the shapeshifter. She came to peace with realizing that she would just go into each relationship with an open mind, and try to ignore the fact that there is someone going around altering their physical appearance. This time, she wanted to go after the guy and do her best to woe him.\n\nThis was just a guy who she would often seen when walking around town. He never seemed to be with anyone, but was normally just either on his laptop, talking a walk or a jog, or sightseeing. She felt this was perfect since if he was in a relationship he would have brought his partner with him at least once. The woman told herself that the next opportunity she got she wanted to ask him out, and thats what she did. The next day she went out to lunch at the local spot in town she normally goes to. She sees the man as she normally would walking down the street. The place where she is eating is caged in and the man was walking down the street right by the cage. She knows she will have to hop the cage to get his attention. She puts down her food. gets up and lifts her leg up over the cage while yelling excuse me to the man as she makes eye contact. She gets the man's attention but also tears her shorts on the fence. The man laughs and asks if she is ok. The woman tells the man that she has seen him multiple times in town and he was very intriging to her. They had made eye contact multiple times in the past but he never tried to spark any conversation or ask her out. She asks the man if he would be free for dinner one night and he says yea. Well no he says, but yea. What he means is that he is in a long distance relationship in the moment, but things are not going very well. He said he would honestly love to, as he feels his relationship is ending, but it is not officially over yet. If and when the relationship officially ends he will let the woman know. This honesty made the woman admire the man even more. The woman awaited a call from the man as they had exchanged numbers that day as well. He finally calls the woman and the two agree to a date.\n",
        "source": "user",
        "start_time": 140.0,
        "end_time": 762.0,
        "last_event_time": 762.0,
        "start_progress": 0.24684623252642346,
        "end_progress": 1.0
    }
]