[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.19057665260196907
    },
    {
        "text": "During your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am scared to death but managed to calm down finally. \n",
        "source": "user",
        "start_time": 36.0,
        "end_time": 103.0,
        "last_event_time": 103.0,
        "start_progress": 0.19057665260196907,
        "end_progress": 0.2348804500703235
    },
    {
        "text": "During your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am scared to death but managed to calm down finally. I say \"I will have you removed from my shoulder and placed in a nice jar.\"\n",
        "source": "api",
        "start_time": 121.0,
        "end_time": 121.0,
        "last_event_time": 121.0,
        "start_progress": 0.2348804500703235,
        "end_progress": 0.2869198312236287
    },
    {
        "text": "During your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am scared to death but managed to calm down finally. I say \"I will have you removed from my shoulder and placed in a nice jar.\" The bee says \"Your Majesty, I will do that but I must tell you that I am not a bee, I am a tiny fairy.\"\n",
        "source": "api",
        "start_time": 151.0,
        "end_time": 151.0,
        "last_event_time": 151.0,
        "start_progress": 0.2869198312236287,
        "end_progress": 0.360056258790436
    },
    {
        "text": "During your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am scared to death but managed to calm down finally. I say \"I will have you removed from my shoulder and placed in a nice jar.\" The bee says \"Your Majesty, I will do that but I must tell you that I am not a bee, I am a tiny fairy.\" I say \"A fairy?\n",
        "source": "api",
        "start_time": 162.0,
        "end_time": 162.0,
        "last_event_time": 162.0,
        "start_progress": 0.360056258790436,
        "end_progress": 0.37130801687763715
    },
    {
        "text": "During your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am scared to death but managed to calm down finally. I say \"I will have you removed from my shoulder and placed in a nice jar.\" The bee says \"Your Majesty, I will do that but I must tell you that I am not a bee, I am a tiny fairy.\" I say \"A fairy?\" \"Yes, I am a fairy and I will grant you three wishes.\"\n",
        "source": "api",
        "start_time": 174.0,
        "end_time": 174.0,
        "last_event_time": 174.0,
        "start_progress": 0.37130801687763715,
        "end_progress": 0.41068917018284107
    },
    {
        "text": "During your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am scared to death but managed to calm down finally. I say \"I will have you removed from my shoulder and placed in a nice jar.\" The bee says \"Your Majesty, I will do that but I must tell you that I am not a bee, I am a tiny fairy.\" I say \"A fairy?\" \"Yes, I am a fairy and I will grant you three wishes.\" I say \"I wish to be the most beautiful woman in the world.\"\n",
        "source": "api",
        "start_time": 208.0,
        "end_time": 208.0,
        "last_event_time": 208.0,
        "start_progress": 0.41068917018284107,
        "end_progress": 0.45288326300984527
    },
    {
        "text": "During your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am scared to death but managed to calm down finally. I say \"I will have you removed from my shoulder and placed in a nice jar.\" The bee says \"Your Majesty, I will do that but I must tell you that I am not a bee, I am a tiny fairy.\" I say \"A fairy?\" \"Yes, I am a fairy and I will grant you three wishes.\" I say \"I wish to be the most beautiful woman in the world.\" The fairy says \"Your wish is granted.\"\n",
        "source": "api",
        "start_time": 235.0,
        "end_time": 235.0,
        "last_event_time": 235.0,
        "start_progress": 0.45288326300984527,
        "end_progress": 0.480309423347398
    },
    {
        "text": "During your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am scared to death but managed to calm down finally. I say \"I will have you removed from my shoulder and placed in a nice jar.\" The bee says \"Your Majesty, I will do that but I must tell you that I am not a bee, I am a tiny fairy.\" I say \"A fairy?\" \"Yes, I am a fairy and I will grant you three wishes.\" I say \"I wish to be the most beautiful woman in the world.\" The fairy says \"Your wish is granted.\" I say \"I wish to be rich.\"\n",
        "source": "api",
        "start_time": 248.0,
        "end_time": 248.0,
        "last_event_time": 248.0,
        "start_progress": 0.480309423347398,
        "end_progress": 0.49929676511954996
    },
    {
        "text": "During your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am scared to death but managed to calm down finally. I say \"I will have you removed from my shoulder and placed in a nice jar.\" The bee says \"Your Majesty, I will do that but I must tell you that I am not a bee, I am a tiny fairy.\" I say \"A fairy?\" \"Yes, I am a fairy and I will grant you three wishes.\" I say \"I wish to be the most beautiful woman in the world.\" The fairy says \"Your wish is granted.\" I look at the mirror and can't believe what I see! I see a very charming and beautiful woman in the mirror. \"Is it me?\" I asked the fairy. The fairy said it is. I say \"I wish to be rich.\" The fairy says \"Your wish is granted.\" I check my bank balance online which shows $10 millions! I am greedy and say \"I wish to have a big house.\" \n",
        "source": "user",
        "start_time": 250.0,
        "end_time": 470.0,
        "last_event_time": 470.0,
        "start_progress": 0.49929676511954996,
        "end_progress": 0.7158931082981715
    },
    {
        "text": "During your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am scared to death but managed to calm down finally. I say \"I will have you removed from my shoulder and placed in a nice jar.\" The bee says \"Your Majesty, I will do that but I must tell you that I am not a bee, I am a tiny fairy.\" I say \"A fairy?\" \"Yes, I am a fairy and I will grant you three wishes.\" I say \"I wish to be the most beautiful woman in the world.\" The fairy says \"Your wish is granted.\" I look at the mirror and can't believe what I see! I see a very charming and beautiful woman in the mirror. \"Is it me?\" I asked the fairy. The fairy said it is. I say \"I wish to be rich.\" The fairy says \"Your wish is granted.\" I check my bank balance online which shows $10 millions! I am greedy and say \"I wish to have a big house.\" I say \"Your wish is granted.\"\n",
        "source": "api",
        "start_time": 479.0,
        "end_time": 479.0,
        "last_event_time": 479.0,
        "start_progress": 0.7158931082981715,
        "end_progress": 0.7362869198312236
    },
    {
        "text": "During your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am scared to death but managed to calm down finally. I say \"I will have you removed from my shoulder and placed in a nice jar.\" The bee says \"Your Majesty, I will do that but I must tell you that I am not a bee, I am a tiny fairy.\" I say \"A fairy?\" \"Yes, I am a fairy and I will grant you three wishes.\" I say \"I wish to be the most beautiful woman in the world.\" The fairy says \"Your wish is granted.\" I look at the mirror and can't believe what I see! I see a very charming and beautiful woman in the mirror. \"Is it me?\" I asked the fairy. The fairy said it is. I say \"I wish to be rich.\" The fairy says \"Your wish is granted.\" I check my bank balance online which shows $10 millions! I am greedy and say \"I wish to have a big house.\" The fairy says \"Your wish is granted.\" A very big and luxurious house appears in front of me and a key lands on my hand! Suddenly I feel stinked. \n",
        "source": "user",
        "start_time": 482.0,
        "end_time": 575.0,
        "last_event_time": 575.0,
        "start_progress": 0.7362869198312236,
        "end_progress": 0.8185654008438819
    },
    {
        "text": "During your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am scared to death but managed to calm down finally. I say \"I will have you removed from my shoulder and placed in a nice jar.\" The bee says \"Your Majesty, I will do that but I must tell you that I am not a bee, I am a tiny fairy.\" I say \"A fairy?\" \"Yes, I am a fairy and I will grant you three wishes.\" I say \"I wish to be the most beautiful woman in the world.\" The fairy says \"Your wish is granted.\" I look at the mirror and can't believe what I see! I see a very charming and beautiful woman in the mirror. \"Is it me?\" I asked the fairy. The fairy said it is. I say \"I wish to be rich.\" The fairy says \"Your wish is granted.\" I check my bank balance online which shows $10 millions! I am greedy and say \"I wish to have a big house.\" The fairy says \"Your wish is granted.\" A very big and luxurious house appears in front of me and a key lands on my hand! Suddenly I feel stinked. I look at my shoulder and see a bee!\n",
        "source": "api",
        "start_time": 587.0,
        "end_time": 587.0,
        "last_event_time": 587.0,
        "start_progress": 0.8185654008438819,
        "end_progress": 0.8438818565400844
    },
    {
        "text": "During your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am scared to death but managed to calm down finally. I say \"I will have you removed from my shoulder and placed in a nice jar.\" The bee says \"Your Majesty, I will do that but I must tell you that I am not a bee, I am a tiny fairy.\" I say \"A fairy?\" \"Yes, I am a fairy and I will grant you three wishes.\" I say \"I wish to be the most beautiful woman in the world.\" The fairy says \"Your wish is granted.\" I look at the mirror and can't believe what I see! I see a very charming and beautiful woman in the mirror. \"Is it me?\" I asked the fairy. The fairy said it is. I say \"I wish to be rich.\" The fairy says \"Your wish is granted.\" I check my bank balance online which shows $10 millions! I am greedy and say \"I wish to have a big house.\" The fairy says \"Your wish is granted.\" A very big and luxurious house appears in front of me and a key lands on my hand! Suddenly I feel stinked. I look at my shoulder and see a bee! A real bee! \n",
        "source": "user",
        "start_time": 590.0,
        "end_time": 598.0,
        "last_event_time": 598.0,
        "start_progress": 0.8438818565400844,
        "end_progress": 0.8530239099859352
    },
    {
        "text": "During your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am scared to death but managed to calm down finally. I say \"I will have you removed from my shoulder and placed in a nice jar.\" The bee says \"Your Majesty, I will do that but I must tell you that I am not a bee, I am a tiny fairy.\" I say \"A fairy?\" \"Yes, I am a fairy and I will grant you three wishes.\" I say \"I wish to be the most beautiful woman in the world.\" The fairy says \"Your wish is granted.\" I look at the mirror and can't believe what I see! I see a very charming and beautiful woman in the mirror. \"Is it me?\" I asked the fairy. The fairy said it is. I say \"I wish to be rich.\" The fairy says \"Your wish is granted.\" I check my bank balance online which shows $10 millions! I am greedy and say \"I wish to have a big house.\" The fairy says \"Your wish is granted.\" A very big and luxurious house appears in front of me and a key lands on my hand! Suddenly I feel stinked. I look at my shoulder and see a bee! A real bee! I scream and the fairy disappears.\n",
        "source": "api",
        "start_time": 606.0,
        "end_time": 606.0,
        "last_event_time": 606.0,
        "start_progress": 0.8530239099859352,
        "end_progress": 0.8769338959212377
    },
    {
        "text": "During your entire life, you've been told you're deadly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I am scared to death but managed to calm down finally. I say \"I will have you removed from my shoulder and placed in a nice jar.\" The bee says \"Your Majesty, I will do that but I must tell you that I am not a bee, I am a tiny fairy.\" I say \"A fairy?\" \"Yes, I am a fairy and I will grant you three wishes.\" I say \"I wish to be the most beautiful woman in the world.\" The fairy says \"Your wish is granted.\" I look at the mirror and can't believe what I see! I see a very charming and beautiful woman in the mirror. \"Is it me?\" I ask the fairy. The fairy says it is. I say \"I wish to be rich.\" The fairy says \"Your wish is granted.\" I check my bank balance online which shows $10 millions! I am greedy and say \"I wish to have a big house.\" The fairy says \"Your wish is granted.\" A very big and luxurious house appears in front of me and a key lands on my hand! Suddenly I feel stung. I look at my shoulder and see a bee! A real bee! I scream and the fairy disappears. I'm very sad because I am greedy and forgot my urgent need to cure my deadly allergy to bees. There is no more chance to get a wish for that. Finally, I die of the deadly allergy.\n",
        "source": "user",
        "start_time": 608.0,
        "end_time": 852.0,
        "last_event_time": 852.0,
        "start_progress": 0.8769338959212377,
        "end_progress": 1.0
    }
]