[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them. So when they were old enough, she sent them out into the world to seek their fortunes. You know the story about the first three little pigs. This is a story about the 92nd little pig.\n\nThe 92nd little pig built a house out of depleted uranium. And the wolf was like, \"dude.\"\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.15268987341772153
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually \n",
        "source": "user",
        "start_time": 23.0,
        "end_time": 110.0,
        "last_event_time": 110.0,
        "start_progress": 0.15268987341772153,
        "end_progress": 0.12262658227848101
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually found themselves in a small village, where they were taken in by a family of pigs.\n",
        "source": "api",
        "start_time": 119.0,
        "end_time": 119.0,
        "last_event_time": 119.0,
        "start_progress": 0.12262658227848101,
        "end_progress": 0.1550632911392405
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually found themselves in a small village, where they were taken in by a family of pigs. They sympathized with little pig and the loss of their parents, realizing they were truly all alone in the world. The pig although saddened, soon came to accept their new parents, and found themselves a part of the community in due time. \n",
        "source": "user",
        "start_time": 120.0,
        "end_time": 195.0,
        "last_event_time": 195.0,
        "start_progress": 0.1550632911392405,
        "end_progress": 0.24960443037974683
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually found themselves in a small village, where they were taken in by a family of pigs. They sympathized with little pig and the loss of their parents, realizing they were truly all alone in the world. The pig although saddened, soon came to accept their new parents, and found themselves a part of the community in due time. The pig was taught the ways of the village, and was taught to farm and to fight.\n",
        "source": "api",
        "start_time": 201.0,
        "end_time": 201.0,
        "last_event_time": 201.0,
        "start_progress": 0.24960443037974683,
        "end_progress": 0.28125
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually found themselves in a small village, where they were taken in by a family of pigs. They sympathized with little pig and the loss of their parents, realizing they were truly all alone in the world. The pig although saddened, soon came to accept their new parents, and found themselves a part of the community in due time. The pig was taught the ways of the village, and was taught to raise crops and mill them for food. \n",
        "source": "user",
        "start_time": 204.0,
        "end_time": 223.0,
        "last_event_time": 223.0,
        "start_progress": 0.28125,
        "end_progress": 0.28837025316455694
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually found themselves in a small village, where they were taken in by a family of pigs. They sympathized with little pig and the loss of their parents, realizing they were truly all alone in the world. The pig although saddened, soon came to accept their new parents, and found themselves a part of the community in due time. The pig was taught the ways of the village, and was taught to raise crops and mill them for food. The pig was happy, and lived a good life with the family.\n",
        "source": "api",
        "start_time": 232.0,
        "end_time": 232.0,
        "last_event_time": 232.0,
        "start_progress": 0.28837025316455694,
        "end_progress": 0.31091772151898733
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually found themselves in a small village, where they were taken in by a family of pigs. They sympathized with little pig and the loss of their parents, realizing they were truly all alone in the world. The pig although saddened, soon came to accept their new parents, and found themselves a part of the community in due time. The pig was taught the ways of the village, and was taught to raise crops and mill them for food. The pig was happy, and lived a good life with the family. They spent their days in the village, until adulthood, where they decided to head out into the world. \n",
        "source": "user",
        "start_time": 233.0,
        "end_time": 253.0,
        "last_event_time": 253.0,
        "start_progress": 0.31091772151898733,
        "end_progress": 0.3516613924050633
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually found themselves in a small village, where they were taken in by a family of pigs. They sympathized with little pig and the loss of their parents, realizing they were truly all alone in the world. The pig although saddened, soon came to accept their new parents, and found themselves a part of the community in due time. The pig was taught the ways of the village, and was taught to raise crops and mill them for food. The pig was happy, and lived a good life with the family. They spent their days in the village, until adulthood, where they decided to head out into the world. They wanted to see the world, and learn more about it.\n",
        "source": "api",
        "start_time": 262.0,
        "end_time": 262.0,
        "last_event_time": 262.0,
        "start_progress": 0.3516613924050633,
        "end_progress": 0.37302215189873417
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually found themselves in a small village, where they were taken in by a family of pigs. They sympathized with little pig and the loss of their parents, realizing they were truly all alone in the world. The pig although saddened, soon came to accept their new parents, and found themselves a part of the community in due time. The pig was taught the ways of the village, and was taught to raise crops and mill them for food. The pig was happy, and lived a good life with the family. They spent their days in the village, until adulthood, where they decided to head out into the world. They wanted to see the world, and learn more about it. Although they were sad to leave their family and the village, they promised they would return one day.\n\n\n",
        "source": "user",
        "start_time": 267.0,
        "end_time": 300.0,
        "last_event_time": 300.0,
        "start_progress": 0.37302215189873417,
        "end_progress": 0.41455696202531644
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually found themselves in a small village, where they were taken in by a family of pigs. They sympathized with little pig and the loss of their parents, realizing they were truly all alone in the world. The pig although saddened, soon came to accept their new parents, and found themselves a part of the community in due time. The pig was taught the ways of the village, and was taught to raise crops and mill them for food. The pig was happy, and lived a good life with the family. They spent their days in the village, until adulthood, where they decided to head out into the world. They wanted to see the world, and learn more about it. Although they were sad to leave their family and the village, they promised they would return one day.\n\n\n\nThe pig traveled far and wide, learning more about the world and the people in it.\n",
        "source": "api",
        "start_time": 309.0,
        "end_time": 309.0,
        "last_event_time": 309.0,
        "start_progress": 0.41455696202531644,
        "end_progress": 0.4477848101265823
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually found themselves in a small village, where they were taken in by a family of pigs. They sympathized with little pig and the loss of their parents, realizing they were truly all alone in the world. The pig although saddened, soon came to accept their new parents, and found themselves a part of the community in due time. The pig was taught the ways of the village, and was taught to raise crops and mill them for food. The pig was happy, and lived a good life with the family. They spent their days in the village, until adulthood, where they decided to head out into the world. They wanted to see the world, and learn more about it. Although they were sad to leave their family and the village, they promised they would return one day.\n\nThe pig traveled far and wide, learning more about the world and the people in it. They were amazed at all the sights and sounds they saw on their adventure. They eventually came across a destroyed village, without any current living residents. \n",
        "source": "user",
        "start_time": 310.0,
        "end_time": 349.0,
        "last_event_time": 349.0,
        "start_progress": 0.4477848101265823,
        "end_progress": 0.5114715189873418
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually found themselves in a small village, where they were taken in by a family of pigs. They sympathized with little pig and the loss of their parents, realizing they were truly all alone in the world. The pig although saddened, soon came to accept their new parents, and found themselves a part of the community in due time. The pig was taught the ways of the village, and was taught to raise crops and mill them for food. The pig was happy, and lived a good life with the family. They spent their days in the village, until adulthood, where they decided to head out into the world. They wanted to see the world, and learn more about it. Although they were sad to leave their family and the village, they promised they would return one day.\n\nThe pig traveled far and wide, learning more about the world and the people in it. They were amazed at all the sights and sounds they saw on their adventure. They eventually came across a destroyed village, without any current living residents. The pig was curious, and decided to investigate.\n",
        "source": "api",
        "start_time": 356.0,
        "end_time": 356.0,
        "last_event_time": 356.0,
        "start_progress": 0.5114715189873418,
        "end_progress": 0.5304588607594937
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually found themselves in a small village, where they were taken in by a family of pigs. They sympathized with little pig and the loss of their parents, realizing they were truly all alone in the world. The pig although saddened, soon came to accept their new parents, and found themselves a part of the community in due time. The pig was taught the ways of the village, and was taught to raise crops and mill them for food. The pig was happy, and lived a good life with the family. They spent their days in the village, until adulthood, where they decided to head out into the world. They wanted to see the world, and learn more about it. Although they were sad to leave their family and the village, they promised they would return one day.\n\nThe pig traveled far and wide, learning more about the world and the people in it. They were amazed at all the sights and sounds they saw on their adventure. They eventually came across a destroyed village, without any current living residents. The pig was curious, and decided to investigate. Looking amongst the rubble, they discovered a particular hut, that was in better condition than the other houses that were destroyed. \n",
        "source": "user",
        "start_time": 357.0,
        "end_time": 397.0,
        "last_event_time": 397.0,
        "start_progress": 0.5304588607594937,
        "end_progress": 0.5838607594936709
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually found themselves in a small village, where they were taken in by a family of pigs. They sympathized with little pig and the loss of their parents, realizing they were truly all alone in the world. The pig although saddened, soon came to accept their new parents, and found themselves a part of the community in due time. The pig was taught the ways of the village, and was taught to raise crops and mill them for food. The pig was happy, and lived a good life with the family. They spent their days in the village, until adulthood, where they decided to head out into the world. They wanted to see the world, and learn more about it. Although they were sad to leave their family and the village, they promised they would return one day.\n\nThe pig traveled far and wide, learning more about the world and the people in it. They were amazed at all the sights and sounds they saw on their adventure. They eventually came across a destroyed village, without any current living residents. The pig was curious, and decided to investigate. Looking amongst the rubble, they discovered a particular hut, that was in better condition than the other houses that were destroyed. The pig entered the hut, and found a small chest.\n",
        "source": "api",
        "start_time": 406.0,
        "end_time": 406.0,
        "last_event_time": 406.0,
        "start_progress": 0.5838607594936709,
        "end_progress": 0.603243670886076
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually found themselves in a small village, where they were taken in by a family of pigs. They sympathized with little pig and the loss of their parents, realizing they were truly all alone in the world. The pig although saddened, soon came to accept their new parents, and found themselves a part of the community in due time. The pig was taught the ways of the village, and was taught to raise crops and mill them for food. The pig was happy, and lived a good life with the family. They spent their days in the village, until adulthood, where they decided to head out into the world. They wanted to see the world, and learn more about it. Although they were sad to leave their family and the village, they promised they would return one day.\n\nThe pig traveled far and wide, learning more about the world and the people in it. They were amazed at all the sights and sounds they saw on their adventure. They eventually came across a destroyed village, without any current living residents. The pig was curious, and decided to investigate. Looking amongst the rubble, they discovered a particular hut, that was in better condition than the other houses that were destroyed. The pig entered the hut, and found a small chest. In the chest they found a variety of items, including family heirlooms and jewlery. They continued investigating the chest, and eventually came across a photo. The photo was of a family of pigs, two parents and their child. The pig realized it was their parents, and they were in their old home. They began to cry, and felt awful when they remembered that they were murdered along with the rest of the village. \n",
        "source": "user",
        "start_time": 422.0,
        "end_time": 531.0,
        "last_event_time": 531.0,
        "start_progress": 0.603243670886076,
        "end_progress": 0.7662183544303798
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually found themselves in a small village, where they were taken in by a family of pigs. They sympathized with little pig and the loss of their parents, realizing they were truly all alone in the world. The pig although saddened, soon came to accept their new parents, and found themselves a part of the community in due time. The pig was taught the ways of the village, and was taught to raise crops and mill them for food. The pig was happy, and lived a good life with the family. They spent their days in the village, until adulthood, where they decided to head out into the world. They wanted to see the world, and learn more about it. Although they were sad to leave their family and the village, they promised they would return one day.\n\nThe pig traveled far and wide, learning more about the world and the people in it. They were amazed at all the sights and sounds they saw on their adventure. They eventually came across a destroyed village, without any current living residents. The pig was curious, and decided to investigate. Looking amongst the rubble, they discovered a particular hut, that was in better condition than the other houses that were destroyed. The pig entered the hut, and found a small chest. In the chest they found a variety of items, including family heirlooms and jewlery. They continued investigating the chest, and eventually came across a photo. The photo was of a family of pigs, two parents and their child. The pig realized it was their parents, and they were in their old home. They began to cry, and felt awful when they remembered that they were murdered along with the rest of the village. The pig vowed to avenge their parents, and find the person who did this to them.\n",
        "source": "api",
        "start_time": 548.0,
        "end_time": 548.0,
        "last_event_time": 548.0,
        "start_progress": 0.7662183544303798,
        "end_progress": 0.7978639240506329
    },
    {
        "text": "There once was an orphan pig, whose parents died when it had turned 1 years old. They were murdered during an attack from an unknown assailant, and having sacrificed themselves to save their only child. The orphan pig ran away from home, far away from the clutches of their parent's murderer. They eventually found themselves in a small village, where they were taken in by a family of pigs. They sympathized with little pig and the loss of their parents, realizing they were truly all alone in the world. The pig although saddened, soon came to accept their new parents, and found themselves a part of the community in due time. The pig was taught the ways of the village, and was taught to raise crops and mill them for food. The pig was happy, and lived a good life with the family. They spent their days in the village, until adulthood, where they decided to head out into the world. They wanted to see the world, and learn more about it. Although they were sad to leave their family and the village, they promised they would return one day.\n\nThe pig traveled far and wide, learning more about the world and the people in it. They were amazed at all the sights and sounds they saw on their adventure. They eventually came across a destroyed village, without any current living residents. The pig was curious, and decided to investigate. Looking amongst the rubble, they discovered a particular hut, that was in better condition than the other houses that were destroyed. The pig entered the hut, and found a small chest. In the chest they found a variety of items, including family heirlooms and jewelry. They continued investigating the chest, and eventually came across a photo. The photo was of a family of pigs, two parents and their child. The pig realized it was their parents, and they were in their old home. They began to cry, and felt awful when they remembered that they were murdered along with the rest of the village. The pig then vowed to avenge their parents, and find the person who did this to them. Taking the jewelry and his family heirlooms, he left the village and never returned. His journey would take much longer than he initially expected, for he still had one goal that needed to be done before he returned back to his village. He would find the ones that killed his parents and he would bring them to justice, no matter how long it took. With that goal in mind, the pig embarked on a long journey, unsure whether he would be successful or not in finding those responsible for his parent's death.\n",
        "source": "user",
        "start_time": 549.0,
        "end_time": 706.0,
        "last_event_time": 706.0,
        "start_progress": 0.7978639240506329,
        "end_progress": 1.0
    }
]