[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.057054400707651484
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. \n",
        "source": "user",
        "start_time": 6.0,
        "end_time": 75.0,
        "last_event_time": 75.0,
        "start_progress": 0.057054400707651484,
        "end_progress": 0.0800530738611234
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed.\n",
        "source": "api",
        "start_time": 88.0,
        "end_time": 88.0,
        "last_event_time": 88.0,
        "start_progress": 0.0800530738611234,
        "end_progress": 0.10194604157452454
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. \n",
        "source": "user",
        "start_time": 89.0,
        "end_time": 206.0,
        "last_event_time": 206.0,
        "start_progress": 0.10194604157452454,
        "end_progress": 0.15789473684210525
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. \n\nThe United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years.\n",
        "source": "api",
        "start_time": 219.0,
        "end_time": 219.0,
        "last_event_time": 219.0,
        "start_progress": 0.15789473684210525,
        "end_progress": 0.18819106590004422
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. \n",
        "source": "user",
        "start_time": 223.0,
        "end_time": 361.0,
        "last_event_time": 361.0,
        "start_progress": 0.18819106590004422,
        "end_progress": 0.2585139318885449
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone.\n",
        "source": "api",
        "start_time": 368.0,
        "end_time": 368.0,
        "last_event_time": 368.0,
        "start_progress": 0.2585139318885449,
        "end_progress": 0.27930119416187527
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. \n",
        "source": "user",
        "start_time": 374.0,
        "end_time": 439.0,
        "last_event_time": 439.0,
        "start_progress": 0.27930119416187527,
        "end_progress": 0.3233082706766917
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world.\n",
        "source": "api",
        "start_time": 457.0,
        "end_time": 457.0,
        "last_event_time": 457.0,
        "start_progress": 0.3233082706766917,
        "end_progress": 0.3394515701017249
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. \n",
        "source": "user",
        "start_time": 459.0,
        "end_time": 541.0,
        "last_event_time": 541.0,
        "start_progress": 0.3394515701017249,
        "end_progress": 0.3907563025210084
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would\n",
        "source": "api",
        "start_time": 555.0,
        "end_time": 555.0,
        "last_event_time": 555.0,
        "start_progress": 0.3907563025210084,
        "end_progress": 0.4279080053073861
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would attack first and risk the lives of all Americans. \n",
        "source": "user",
        "start_time": 561.0,
        "end_time": 577.0,
        "last_event_time": 577.0,
        "start_progress": 0.4279080053073861,
        "end_progress": 0.43918620079610793
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would attack first and risk the lives of all Americans. The American government decided to come out of isolation, and see what the world was like.\n",
        "source": "api",
        "start_time": 590.0,
        "end_time": 590.0,
        "last_event_time": 590.0,
        "start_progress": 0.43918620079610793,
        "end_progress": 0.4590888987173817
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would attack first and risk the lives of all Americans. The American government decided to come out of isolation, and see what the world was like. Messages were sent to many foreign countries to establish a network once more. After a few hours, there was no response from any foreign nation. The American government was surprised that nobody had answered.\n",
        "source": "user",
        "start_time": 594.0,
        "end_time": 689.0,
        "last_event_time": 689.0,
        "start_progress": 0.4590888987173817,
        "end_progress": 0.5053073861123397
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would attack first and risk the lives of all Americans. The American government decided to come out of isolation, and see what the world was like. Messages were sent to many foreign countries to establish a network once more. After a few hours, there was no response from any foreign nation. The American government was surprised that nobody had answered. The American government decided to send a team of diplomats to the United Nations to see what was going on.\n",
        "source": "api",
        "start_time": 704.0,
        "end_time": 704.0,
        "last_event_time": 704.0,
        "start_progress": 0.5053073861123397,
        "end_progress": 0.5291906236178682
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would attack first and risk the lives of all Americans. The American government decided to come out of isolation, and see what the world was like. Messages were sent to many foreign countries to establish a network once more. After a few hours, there was no response from any foreign nation. The American government was surprised that nobody had answered. The American government decided to send a team of diplomats to the United Nations to see what was going on. When the diplomats arrived, the United Nations was eerily empty, like a haunted house on Halloween. The diplomats searched the premises for any signs of life, but found none. They contacted the American government to let them know that there were no signs of life. The diplomats decided to fly to Europe and investigate the situation there. \n",
        "source": "user",
        "start_time": 708.0,
        "end_time": 841.0,
        "last_event_time": 841.0,
        "start_progress": 0.5291906236178682,
        "end_progress": 0.6048208757187086
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would attack first and risk the lives of all Americans. The American government decided to come out of isolation, and see what the world was like. Messages were sent to many foreign countries to establish a network once more. After a few hours, there was no response from any foreign nation. The American government was surprised that nobody had answered. The American government decided to send a team of diplomats to the United Nations to see what was going on. When the diplomats arrived, the United Nations was eerily empty, like a haunted house on Halloween. The diplomats searched the premises for any signs of life, but found none. They contacted the American government to let them know that there were no signs of life. The diplomats decided to fly to Europe and investigate the situation there. When they arrived, they found the same thing, no signs of life.\n",
        "source": "api",
        "start_time": 851.0,
        "end_time": 851.0,
        "last_event_time": 851.0,
        "start_progress": 0.6048208757187086,
        "end_progress": 0.6187527642636002
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would attack first and risk the lives of all Americans. The American government decided to come out of isolation, and see what the world was like. Messages were sent to many foreign countries to establish a network once more. After a few hours, there was no response from any foreign nation. The American government was surprised that nobody had answered. The American government decided to send a team of diplomats to the United Nations to see what was going on. When the diplomats arrived, the United Nations was eerily empty, like a haunted house on Halloween. The diplomats searched the premises for any signs of life, but found none. They contacted the American government to let them know that there were no signs of life. The diplomats decided to fly to Europe and investigate the situation there. When they arrived, they found the same thing, no signs of life. Only empty streets and desolate buildings filled the atmosphere with sounds of hollow winds. Finally, One of the diplomats discovered a skeleton in the middle of the street. The skeleton was dressed in tattered, lavish clothing, resembling those of a high ranking official. \n",
        "source": "user",
        "start_time": 854.0,
        "end_time": 946.0,
        "last_event_time": 946.0,
        "start_progress": 0.6187527642636002,
        "end_progress": 0.6795665634674922
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would attack first and risk the lives of all Americans. The American government decided to come out of isolation, and see what the world was like. Messages were sent to many foreign countries to establish a network once more. After a few hours, there was no response from any foreign nation. The American government was surprised that nobody had answered. The American government decided to send a team of diplomats to the United Nations to see what was going on. When the diplomats arrived, the United Nations was eerily empty, like a haunted house on Halloween. The diplomats searched the premises for any signs of life, but found none. They contacted the American government to let them know that there were no signs of life. The diplomats decided to fly to Europe and investigate the situation there. When they arrived, they found the same thing, no signs of life. Only empty streets and desolate buildings filled the atmosphere with sounds of hollow winds. Finally, One of the diplomats discovered a skeleton in the middle of the street. The skeleton was dressed in tattered, lavish clothing, resembling those of a high ranking official. The diplomats decided to investigate the skeleton, and found a note in the pocket of the skeleton.\n",
        "source": "api",
        "start_time": 960.0,
        "end_time": 960.0,
        "last_event_time": 960.0,
        "start_progress": 0.6795665634674922,
        "end_progress": 0.7012383900928792
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would attack first and risk the lives of all Americans. The American government decided to come out of isolation, and see what the world was like. Messages were sent to many foreign countries to establish a network once more. After a few hours, there was no response from any foreign nation. The American government was surprised that nobody had answered. The American government decided to send a team of diplomats to the United Nations to see what was going on. When the diplomats arrived, the United Nations was eerily empty, like a haunted house on Halloween. The diplomats searched the premises for any signs of life, but found none. They contacted the American government to let them know that there were no signs of life. The diplomats decided to fly to Europe and investigate the situation there. When they arrived, they found the same thing, no signs of life. Only empty streets and desolate buildings filled the atmosphere with sounds of hollow winds. Finally, One of the diplomats discovered a skeleton in the middle of the street. The skeleton was dressed in tattered, lavish clothing, resembling those of a high ranking official. The diplomats decided to investigate the skeleton, and found a note in the pocket of the skeleton. The note contained a grim warning meant for the world, especially America. One day after America had gone into isolation, a deadly plague had spread like wildfire throughout the remaining nations. Human life was wiped out quickly, but had spared America because they were isolated from every other country, and had closed their borders. The diplomats sent the message to the American government, telling them of the grim outcome.\n",
        "source": "user",
        "start_time": 964.0,
        "end_time": 1100.0,
        "last_event_time": 1100.0,
        "start_progress": 0.7012383900928792,
        "end_progress": 0.796329057938965
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would attack first and risk the lives of all Americans. The American government decided to come out of isolation, and see what the world was like. Messages were sent to many foreign countries to establish a network once more. After a few hours, there was no response from any foreign nation. The American government was surprised that nobody had answered. The American government decided to send a team of diplomats to the United Nations to see what was going on. When the diplomats arrived, the United Nations was eerily empty, like a haunted house on Halloween. The diplomats searched the premises for any signs of life, but found none. They contacted the American government to let them know that there were no signs of life. The diplomats decided to fly to Europe and investigate the situation there. When they arrived, they found the same thing, no signs of life. Only empty streets and desolate buildings filled the atmosphere with sounds of hollow winds. Finally, One of the diplomats discovered a skeleton in the middle of the street. The skeleton was dressed in tattered, lavish clothing, resembling those of a high ranking official. The diplomats decided to investigate the skeleton, and found a note in the pocket of the skeleton. The note contained a grim warning meant for the world, especially America. One day after America had gone into isolation, a deadly plague had spread like wildfire throughout the remaining nations. Human life was wiped out quickly, but had spared America because they were isolated from every other country, and had closed their borders. The diplomats sent the message to the American government, telling them of the grim outcome. The American government was devastated by the news, but they had no choice but to accept it.\n",
        "source": "api",
        "start_time": 1108.0,
        "end_time": 1108.0,
        "last_event_time": 1108.0,
        "start_progress": 0.796329057938965,
        "end_progress": 0.8168951791242813
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would attack first and risk the lives of all Americans. The American government decided to come out of isolation, and see what the world was like. Messages were sent to many foreign countries to establish a network once more. After a few hours, there was no response from any foreign nation. The American government was surprised that nobody had answered. The American government decided to send a team of diplomats to the United Nations to see what was going on. When the diplomats arrived, the United Nations was eerily empty, like a haunted house on Halloween. The diplomats searched the premises for any signs of life, but found none. They contacted the American government to let them know that there were no signs of life. The diplomats decided to fly to Europe and investigate the situation there. When they arrived, they found the same thing, no signs of life. Only empty streets and desolate buildings filled the atmosphere with sounds of hollow winds. Finally, One of the diplomats discovered a skeleton in the middle of the street. The skeleton was dressed in tattered, lavish clothing, resembling those of a high ranking official. The diplomats decided to investigate the skeleton, and found a note in the pocket of the skeleton. The note contained a grim warning meant for the world, especially America. One day after America had gone into isolation, a deadly plague had spread like wildfire throughout the remaining nations. Human life was wiped out quickly, but had spared America because they were isolated from every other country, and had closed their borders. The diplomats sent the message to the American government, telling them of the grim outcome. The American government was devastated by the news, but they had no choice but to accept it. All of these years, the American populace was alone on planet Earth, filled with false hopes of a better future. \n",
        "source": "user",
        "start_time": 1111.0,
        "end_time": 1149.0,
        "last_event_time": 1149.0,
        "start_progress": 0.8168951791242813,
        "end_progress": 0.8421052631578947
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would attack first and risk the lives of all Americans. The American government decided to come out of isolation, and see what the world was like. Messages were sent to many foreign countries to establish a network once more. After a few hours, there was no response from any foreign nation. The American government was surprised that nobody had answered. The American government decided to send a team of diplomats to the United Nations to see what was going on. When the diplomats arrived, the United Nations was eerily empty, like a haunted house on Halloween. The diplomats searched the premises for any signs of life, but found none. They contacted the American government to let them know that there were no signs of life. The diplomats decided to fly to Europe and investigate the situation there. When they arrived, they found the same thing, no signs of life. Only empty streets and desolate buildings filled the atmosphere with sounds of hollow winds. Finally, One of the diplomats discovered a skeleton in the middle of the street. The skeleton was dressed in tattered, lavish clothing, resembling those of a high ranking official. The diplomats decided to investigate the skeleton, and found a note in the pocket of the skeleton. The note contained a grim warning meant for the world, especially America. One day after America had gone into isolation, a deadly plague had spread like wildfire throughout the remaining nations. Human life was wiped out quickly, but had spared America because they were isolated from every other country, and had closed their borders. The diplomats sent the message to the American government, telling them of the grim outcome. The American government was devastated by the news, but they had no choice but to accept it. All of these years, the American populace was alone on planet Earth, filled with false hopes of a better future. The American government decided to let the populace know of the grim outcome, and to let them know that they were alone on Earth.\n",
        "source": "api",
        "start_time": 1165.0,
        "end_time": 1165.0,
        "last_event_time": 1165.0,
        "start_progress": 0.8421052631578947,
        "end_progress": 0.8706324635117205
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would attack first and risk the lives of all Americans. The American government decided to come out of isolation, and see what the world was like. Messages were sent to many foreign countries to establish a network once more. After a few hours, there was no response from any foreign nation. The American government was surprised that nobody had answered. The American government decided to send a team of diplomats to the United Nations to see what was going on. When the diplomats arrived, the United Nations was eerily empty, like a haunted house on Halloween. The diplomats searched the premises for any signs of life, but found none. They contacted the American government to let them know that there were no signs of life. The diplomats decided to fly to Europe and investigate the situation there. When they arrived, they found the same thing, no signs of life. Only empty streets and desolate buildings filled the atmosphere with sounds of hollow winds. Finally, One of the diplomats discovered a skeleton in the middle of the street. The skeleton was dressed in tattered, lavish clothing, resembling those of a high ranking official. The diplomats decided to investigate the skeleton, and found a note in the pocket of the skeleton. The note contained a grim warning meant for the world, especially America. One day after America had gone into isolation, a deadly plague had spread like wildfire throughout the remaining nations. Human life was wiped out quickly, but had spared America because they were isolated from every other country, and had closed their borders. The diplomats sent the message to the American government, telling them of the grim outcome. The American government was devastated by the news, but they had no choice but to accept it. All of these years, the American populace was alone on planet Earth, filled with false hopes of a better future. The American government decided to let the populace know of the grim outcome, and to let them know that they were alone on Earth. The American people had no choice but to continue living and pushing forward. As time went on, people slowly repopulated the other landmasses that once belonged to foreign nations. Scientists discovered the cure for the plague, so that people would survive. \n",
        "source": "user",
        "start_time": 1178.0,
        "end_time": 1292.0,
        "last_event_time": 1292.0,
        "start_progress": 0.8706324635117205,
        "end_progress": 0.9279080053073862
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would attack first and risk the lives of all Americans. The American government decided to come out of isolation, and see what the world was like. Messages were sent to many foreign countries to establish a network once more. After a few hours, there was no response from any foreign nation. The American government was surprised that nobody had answered. The American government decided to send a team of diplomats to the United Nations to see what was going on. When the diplomats arrived, the United Nations was eerily empty, like a haunted house on Halloween. The diplomats searched the premises for any signs of life, but found none. They contacted the American government to let them know that there were no signs of life. The diplomats decided to fly to Europe and investigate the situation there. When they arrived, they found the same thing, no signs of life. Only empty streets and desolate buildings filled the atmosphere with sounds of hollow winds. Finally, One of the diplomats discovered a skeleton in the middle of the street. The skeleton was dressed in tattered, lavish clothing, resembling those of a high ranking official. The diplomats decided to investigate the skeleton, and found a note in the pocket of the skeleton. The note contained a grim warning meant for the world, especially America. One day after America had gone into isolation, a deadly plague had spread like wildfire throughout the remaining nations. Human life was wiped out quickly, but had spared America because they were isolated from every other country, and had closed their borders. The diplomats sent the message to the American government, telling them of the grim outcome. The American government was devastated by the news, but they had no choice but to accept it. All of these years, the American populace was alone on planet Earth, filled with false hopes of a better future. The American government decided to let the populace know of the grim outcome, and to let them know that they were alone on Earth. The American people had no choice but to continue living and pushing forward. As time went on, people slowly repopulated the other landmasses that once belonged to foreign nations. Scientists discovered the cure for the plague, so that people would survive. The United States was the only nation to survive the plague, and was the only nation to survive the war.\n",
        "source": "api",
        "start_time": 1302.0,
        "end_time": 1302.0,
        "last_event_time": 1302.0,
        "start_progress": 0.9279080053073862,
        "end_progress": 0.9509066784608581
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would attack first and risk the lives of all Americans. The American government decided to come out of isolation, and see what the world was like. Messages were sent to many foreign countries to establish a network once more. After a few hours, there was no response from any foreign nation. The American government was surprised that nobody had answered. The American government decided to send a team of diplomats to the United Nations to see what was going on. When the diplomats arrived, the United Nations was eerily empty, like a haunted house on Halloween. The diplomats searched the premises for any signs of life, but found none. They contacted the American government to let them know that there were no signs of life. The diplomats decided to fly to Europe and investigate the situation there. When they arrived, they found the same thing, no signs of life. Only empty streets and desolate buildings filled the atmosphere with sounds of hollow winds. Finally, One of the diplomats discovered a skeleton in the middle of the street. The skeleton was dressed in tattered, lavish clothing, resembling those of a high ranking official. The diplomats decided to investigate the skeleton, and found a note in the pocket of the skeleton. The note contained a grim warning meant for the world, especially America. One day after America had gone into isolation, a deadly plague had spread like wildfire throughout the remaining nations. Human life was wiped out quickly, but had spared America because they were isolated from every other country, and had closed their borders. The diplomats sent the message to the American government, telling them of the grim outcome. The American government was devastated by the news, but they had no choice but to accept it. All of these years, the American populace was alone on planet Earth, filled with false hopes of a better future. The American government decided to let the populace know of the grim outcome, and to let them know that they were alone on Earth. The American people had no choice but to continue living and pushing forward. As time went on, people slowly repopulated the other landmasses that once belonged to foreign nations. Scientists discovered the cure for the plague, so that people would survive. The United States was the only nation to survive the plague, and was the only nation to survive the war. World War III became a reminder of how fragile life can be, more importantly, how useless violence is. \n",
        "source": "user",
        "start_time": 1306.0,
        "end_time": 1367.0,
        "last_event_time": 1367.0,
        "start_progress": 0.9509066784608581,
        "end_progress": 0.9739053516143299
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n \nWorld War III was a devastating, violent affair, that took a heavy toll on the nations of the world. The United States was hit particularly hard, with the majority of its major cities being destroyed. The American food production infrastructure was hit particularly hard, causing massive waves of starvation and famine within every social class. America, like many nations of the world, were forced to rebuild its cities, economies and food production. The United States government, in order to prevent another World War, decided to isolate itself from the rest of the world for 50 years. The other foreign nations also agreed to isolate for 50 years, in order to re-establish society and humanity. At first, it was tough, people were suffering from hunger, unemployment, and nightmares from the war. America did not trust the other nations to isolate as promised, expecting a surprise attack at any moment. However, as the years went on, and the world rebuilt itself, the fear of another war was gone. People established their daily routines, rebuilt cities, and had grown delicious food to feed the populace. Everything had gone back to normal, with people finding jobs and starting families again. The year was 2052, and the United States was ready to re-enter the world. The American government held grueling meetings to decide if it was a good time to come out of isolation, and reconnect with the world.  The American people were divided on whether or not to come out of hiding and risk another war. Many people were afraid that the other nations would not honor the 50 year agreement and attack the United States, while others were afraid that the United States would attack first and risk the lives of all Americans. The American government decided to come out of isolation, and see what the world was like. Messages were sent to many foreign countries to establish a network once more. After a few hours, there was no response from any foreign nation. The American government was surprised that nobody had answered. The American government decided to send a team of diplomats to the United Nations to see what was going on. When the diplomats arrived, the United Nations was eerily empty, like a haunted house on Halloween. The diplomats searched the premises for any signs of life, but found none. They contacted the American government to let them know that there were no signs of life. The diplomats decided to fly to Europe and investigate the situation there. When they arrived, they found the same thing, no signs of life. Only empty streets and desolate buildings filled the atmosphere with sounds of hollow winds. Finally, One of the diplomats discovered a skeleton in the middle of the street. The skeleton was dressed in tattered, lavish clothing, resembling those of a high ranking official. The diplomats decided to investigate the skeleton, and found a note in the pocket of the skeleton. The note contained a grim warning meant for the world, especially America. One day after America had gone into isolation, a deadly plague had spread like wildfire throughout the remaining nations. Human life was wiped out quickly, but had spared America because they were isolated from every other country, and had closed their borders. The diplomats sent the message to the American government, telling them of the grim outcome. The American government was devastated by the news, but they had no choice but to accept it. All of these years, the American populace was alone on planet Earth, filled with false hopes of a better future. The American government decided to let the populace know of the grim outcome, and to let them know that they were alone on Earth. The American people had no choice but to continue living and pushing forward. As time went on, people slowly repopulated the other landmasses that once belonged to foreign nations. Scientists discovered the cure for the plague, so that people would survive. The United States was the only nation to survive the plague, and was the only nation to survive the war. World War III became a reminder of how fragile life can be, more importantly, how useless violence is. The American people were determined to make the world a better place, and to never let another World War happen again.\n",
        "source": "api",
        "start_time": 1376.0,
        "end_time": 1376.0,
        "last_event_time": 1376.0,
        "start_progress": 0.9739053516143299,
        "end_progress": 1.0
    }
]