[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. The drug causes a form of dementia, and you're forced to live out the rest of your life in a nursing home.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 99.0,
        "last_event_time": 99.0,
        "start_progress": 0,
        "end_progress": 0.322061191626409
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  The drug causes a form of dementia, and they're forced to live out the rest of their lives in a nursing home.  This isn't fair, they were meant to take care of us, now we, the old and infirmed, have to be the care givers.   They have had all the advantages, youth, longevity, health, and we were left to wither and fade.  \n",
        "source": "user",
        "start_time": 102.0,
        "end_time": 287.0,
        "last_event_time": 287.0,
        "start_progress": 0.322061191626409,
        "end_progress": 0.4967793880837359
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  The drug causes a form of dementia, and they're forced to live out the rest of their lives in a nursing home.  This isn't fair, they were meant to take care of us, now we, the old and infirmed, have to be the care givers.   They have had all the advantages, youth, longevity, health, and we were left to wither and fade.   We're the Lost Generations.\n",
        "source": "api",
        "start_time": 321.0,
        "end_time": 321.0,
        "last_event_time": 321.0,
        "start_progress": 0.4967793880837359,
        "end_progress": 0.5193236714975845
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  The drug causes a form of dementia, and they're forced to live out the rest of their lives in a nursing home.  This isn't fair, they were meant to take care of us, now we, the old and infirmed, have to be the care givers.   They have had all the advantages, youth, longevity, health, and we were left to wither and fade.   We're the Lost Generations, a second class type of citizen, and now it is up to us to save the world.  We don't have the energy\n",
        "source": "user",
        "start_time": 329.0,
        "end_time": 385.0,
        "last_event_time": 385.0,
        "start_progress": 0.5193236714975845,
        "end_progress": 0.5998389694041868
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  The drug causes a form of dementia, and they're forced to live out the rest of their lives in a nursing home.  This isn't fair, they were meant to take care of us, now we, the old and infirmed, have to be the care givers.   They have had all the advantages, youth, longevity, health, and we were left to wither and fade.   We're the Lost Generations, a second class type of citizen, and now it is up to us to save the world.  We don't have the energy, the vigor, or the strength to do it, but we must.\n",
        "source": "api",
        "start_time": 401.0,
        "end_time": 401.0,
        "last_event_time": 401.0,
        "start_progress": 0.5998389694041868,
        "end_progress": 0.6409017713365539
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  The drug causes a form of dementia, and they're forced to live out the rest of their lives in a nursing home.  This isn't fair, they were meant to take care of us, now we, the old and infirmed, have to be the care givers.   They have had all the advantages, youth, longevity, health, and we were left to wither and fade.   We're the Lost Generations, a second class type of citizen, and now it is up to us to save the world.  We don't have the energy, the vigor, or the strength to do it, but we must.  We were abandoned by them, and now\n",
        "source": "user",
        "start_time": 410.0,
        "end_time": 428.0,
        "last_event_time": 428.0,
        "start_progress": 0.6409017713365539,
        "end_progress": 0.6698872785829307
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  The drug causes a form of dementia, and they're forced to live out the rest of their lives in a nursing home.  This isn't fair, they were meant to take care of us, now we, the old and infirmed, have to be the care givers.   They have had all the advantages, youth, longevity, health, and we were left to wither and fade.   We're the Lost Generations, a second class type of citizen, and now it is up to us to save the world.  We don't have the energy, the vigor, or the strength to do it, but we must.  We were abandoned by them, and now we must save them.\n",
        "source": "api",
        "start_time": 431.0,
        "end_time": 431.0,
        "last_event_time": 431.0,
        "start_progress": 0.6698872785829307,
        "end_progress": 0.6851851851851852
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  The drug causes a form of dementia, and they're forced to live out the rest of their lives in a nursing home.  This isn't fair, they were meant to take care of us, now we, the old and infirmed, have to be the care givers.   They have had all the advantages, youth, longevity, health, and we were left to wither and fade.   We're the Lost Generations, a second class type of citizen, and now it is up to us to save the world.  We don't have the energy, the vigor, or the strength to do it, but we must.  We were abandoned by them, and now we must save them.  Many of us want to have no pity \n",
        "source": "user",
        "start_time": 433.0,
        "end_time": 463.0,
        "last_event_time": 463.0,
        "start_progress": 0.6851851851851852,
        "end_progress": 0.7125603864734299
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  The drug causes a form of dementia, and they're forced to live out the rest of their lives in a nursing home.  This isn't fair, they were meant to take care of us, now we, the old and infirmed, have to be the care givers.   They have had all the advantages, youth, longevity, health, and we were left to wither and fade.   We're the Lost Generations, a second class type of citizen, and now it is up to us to save the world.  We don't have the energy, the vigor, or the strength to do it, but we must.  We were abandoned by them, and now we must save them.  Many of us want to have no pity for them, but we can't help it, we still love them.\n",
        "source": "api",
        "start_time": 480.0,
        "end_time": 480.0,
        "last_event_time": 480.0,
        "start_progress": 0.7125603864734299,
        "end_progress": 0.7536231884057971
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  The drug causes a form of dementia, and they're forced to live out the rest of their lives in a nursing home.  This isn't fair, they were meant to take care of us, now we, the old and infirmed, have to be the care givers.   They have had all the advantages, youth, longevity, health, and we were left to wither and fade.   We're the Lost Generations, a second class type of citizen, and now it is up to us to save the world.  We don't have the energy, the vigor, or the strength to do it, but we must.  We were abandoned by them, and now we must save them.  Many of us want to have no pity for them, saying we should abandon them like they abandoned us. \n",
        "source": "user",
        "start_time": 488.0,
        "end_time": 520.0,
        "last_event_time": 520.0,
        "start_progress": 0.7536231884057971,
        "end_progress": 0.7640901771336553
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  The drug causes a form of dementia, and they're forced to live out the rest of their lives in a nursing home.  This isn't fair, they were meant to take care of us, now we, the old and infirmed, have to be the care givers.   They have had all the advantages, youth, longevity, health, and we were left to wither and fade.   We're the Lost Generations, a second class type of citizen, and now it is up to us to save the world.  We don't have the energy, the vigor, or the strength to do it, but we must.  We were abandoned by them, and now we must save them.  Many of us want to have no pity for them, saying we should abandon them like they abandoned us.  But we can't, they're our children, our family, and we must save them.\n",
        "source": "api",
        "start_time": 532.0,
        "end_time": 532.0,
        "last_event_time": 532.0,
        "start_progress": 0.7640901771336553,
        "end_progress": 0.821256038647343
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.  The drug causes a form of dementia, and they're forced to live out the rest of their lives in a nursing home.  This isn't fair, they were meant to take care of us, now we, the old and infirmed, have to be the care givers.   They have had all the advantages, youth, longevity, health, and we were left to wither and fade.   We're the Lost Generations, a second class type of citizen, and now it is up to us to save the world.  We don't have the energy, the vigor, or the strength to do it, but we must.  We were abandoned by them, and now we must save them.  Many of us want to have no pity for them, saying we should abandon them like they abandoned us.  But we can't, they're our children, our family, and we must save them.  This is our lot, we must do the right and proper thing.  We will do our best, for as long as we can, and finally united in age and decay we can march towards our destiny hand in hand, no longer divided from one another. \n",
        "source": "user",
        "start_time": 538.0,
        "end_time": 764.0,
        "last_event_time": 764.0,
        "start_progress": 0.821256038647343,
        "end_progress": 1.0
    }
]