[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.07736027786548784
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, \n",
        "source": "user",
        "start_time": 5.0,
        "end_time": 29.0,
        "last_event_time": 29.0,
        "start_progress": 0.07736027786548784,
        "end_progress": 0.08020208399115883
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man.\n",
        "source": "api",
        "start_time": 40.0,
        "end_time": 40.0,
        "last_event_time": 40.0,
        "start_progress": 0.08020208399115883,
        "end_progress": 0.105462582886012
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. \n",
        "source": "user",
        "start_time": 46.0,
        "end_time": 148.0,
        "last_event_time": 148.0,
        "start_progress": 0.105462582886012,
        "end_progress": 0.18850647300284182
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away.\n",
        "source": "api",
        "start_time": 165.0,
        "end_time": 165.0,
        "last_event_time": 165.0,
        "start_progress": 0.18850647300284182,
        "end_progress": 0.20713609093779603
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. \n",
        "source": "user",
        "start_time": 167.0,
        "end_time": 192.0,
        "last_event_time": 192.0,
        "start_progress": 0.20713609093779603,
        "end_progress": 0.23650142090306284
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common.\n",
        "source": "api",
        "start_time": 202.0,
        "end_time": 202.0,
        "last_event_time": 202.0,
        "start_progress": 0.23650142090306284,
        "end_progress": 0.26018313861698766
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it.   \n",
        "source": "user",
        "start_time": 205.0,
        "end_time": 343.0,
        "last_event_time": 343.0,
        "start_progress": 0.26018313861698766,
        "end_progress": 0.3530154720555731
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it.    Rachel and John go on a few more dates, and they fall in love.\n",
        "source": "api",
        "start_time": 350.0,
        "end_time": 350.0,
        "last_event_time": 350.0,
        "start_progress": 0.3530154720555731,
        "end_progress": 0.37290811493527
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other.\n",
        "source": "user",
        "start_time": 355.0,
        "end_time": 403.0,
        "last_event_time": 403.0,
        "start_progress": 0.37290811493527,
        "end_progress": 0.4000631512472371
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married.\n",
        "source": "api",
        "start_time": 417.0,
        "end_time": 417.0,
        "last_event_time": 417.0,
        "start_progress": 0.4000631512472371,
        "end_progress": 0.41742974423744866
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. \n",
        "source": "user",
        "start_time": 418.0,
        "end_time": 452.0,
        "last_event_time": 452.0,
        "start_progress": 0.41742974423744866,
        "end_progress": 0.4467950742027155
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.\n",
        "source": "api",
        "start_time": 477.0,
        "end_time": 477.0,
        "last_event_time": 477.0,
        "start_progress": 0.4467950742027155,
        "end_progress": 0.46258288601199876
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. \n",
        "source": "user",
        "start_time": 480.0,
        "end_time": 503.0,
        "last_event_time": 503.0,
        "start_progress": 0.46258288601199876,
        "end_progress": 0.4894221660877802
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. Rachel accepts this, but she still has a feeling that something isn’t right.\n",
        "source": "api",
        "start_time": 513.0,
        "end_time": 513.0,
        "last_event_time": 513.0,
        "start_progress": 0.4894221660877802,
        "end_progress": 0.5134196400378908
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. Rachel accepts this, but she still has a feeling that something isn’t right. One day, Rachel goes to the store alone and tells John that she will be back shortly. John stays at home and says he has work to do and catch up on. One hour later, Rachel returns from the store and sees John in the backyard acting strange.  \n",
        "source": "user",
        "start_time": 517.0,
        "end_time": 597.0,
        "last_event_time": 597.0,
        "start_progress": 0.5134196400378908,
        "end_progress": 0.5901484054310072
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. Rachel accepts this, but she still has a feeling that something isn’t right. One day, Rachel goes to the store alone and tells John that she will be back shortly. John stays at home and says he has work to do and catch up on. One hour later, Rachel returns from the store and sees John in the backyard acting strange.   Rachel goes to the backyard to see what John is doing, and she sees John digging a hole in the ground.\n",
        "source": "api",
        "start_time": 607.0,
        "end_time": 607.0,
        "last_event_time": 607.0,
        "start_progress": 0.5901484054310072,
        "end_progress": 0.6226712977581307
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. Rachel accepts this, but she still has a feeling that something isn’t right. One day, Rachel goes to the store alone and tells John that she will be back shortly. John stays at home and says he has work to do and catch up on. One hour later, Rachel returns from the store and sees John in the backyard acting strange.  Rachel goes to the backyard to see what John is doing, and she sees John digging a hole in the ground. John is burying some shredded clothes, so Rachel asks what he is doing.\n",
        "source": "user",
        "start_time": 611.0,
        "end_time": 642.0,
        "last_event_time": 642.0,
        "start_progress": 0.6226712977581307,
        "end_progress": 0.6450899905273129
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. Rachel accepts this, but she still has a feeling that something isn’t right. One day, Rachel goes to the store alone and tells John that she will be back shortly. John stays at home and says he has work to do and catch up on. One hour later, Rachel returns from the store and sees John in the backyard acting strange.  Rachel goes to the backyard to see what John is doing, and she sees John digging a hole in the ground. John is burying some shredded clothes, so Rachel asks what he is doing. John tells Rachel that he is burying some old clothes that he doesn’t need anymore.\n",
        "source": "api",
        "start_time": 652.0,
        "end_time": 652.0,
        "last_event_time": 652.0,
        "start_progress": 0.6450899905273129,
        "end_progress": 0.6716135143669087
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. Rachel accepts this, but she still has a feeling that something isn’t right. One day, Rachel goes to the store alone and tells John that she will be back shortly. John stays at home and says he has work to do and catch up on. One hour later, Rachel returns from the store and sees John in the backyard acting strange.  Rachel goes to the backyard to see what John is doing, and she sees John digging a hole in the ground. John is burying some shredded clothes, so Rachel asks what he is doing. John tells Rachel that he is burying some old clothes that he doesn’t need anymore. Rachel does not buy John's excuse this time and asks him what is really going on.\n",
        "source": "user",
        "start_time": 656.0,
        "end_time": 683.0,
        "last_event_time": 683.0,
        "start_progress": 0.6716135143669087,
        "end_progress": 0.6975055257341333
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. Rachel accepts this, but she still has a feeling that something isn’t right. One day, Rachel goes to the store alone and tells John that she will be back shortly. John stays at home and says he has work to do and catch up on. One hour later, Rachel returns from the store and sees John in the backyard acting strange.  Rachel goes to the backyard to see what John is doing, and she sees John digging a hole in the ground. John is burying some shredded clothes, so Rachel asks what he is doing. John tells Rachel that he is burying some old clothes that he doesn’t need anymore. Rachel does not buy John's excuse this time and asks him what is really going on. John tells Rachel that he is a shapeshifter and he has been dating her over and over again.\n",
        "source": "api",
        "start_time": 696.0,
        "end_time": 696.0,
        "last_event_time": 696.0,
        "start_progress": 0.6975055257341333,
        "end_progress": 0.7265550994632144
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. Rachel accepts this, but she still has a feeling that something isn’t right. One day, Rachel goes to the store alone and tells John that she will be back shortly. John stays at home and says he has work to do and catch up on. One hour later, Rachel returns from the store and sees John in the backyard acting strange.  Rachel goes to the backyard to see what John is doing, and she sees John digging a hole in the ground. John is burying some shredded clothes, so Rachel asks what he is doing. John tells Rachel that he is burying some old clothes that he doesn’t need anymore. Rachel does not buy John's excuse this time and asks him what is really going on. John tells Rachel that he is a shapeshifter and he has been dating her over and over again. He tells her that he is madly in love with her and has been trying to get it right, so that he could be with her forever. \n",
        "source": "user",
        "start_time": 702.0,
        "end_time": 729.0,
        "last_event_time": 729.0,
        "start_progress": 0.7265550994632144,
        "end_progress": 0.7653931165140512
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. Rachel accepts this, but she still has a feeling that something isn’t right. One day, Rachel goes to the store alone and tells John that she will be back shortly. John stays at home and says he has work to do and catch up on. One hour later, Rachel returns from the store and sees John in the backyard acting strange.  Rachel goes to the backyard to see what John is doing, and she sees John digging a hole in the ground. John is burying some shredded clothes, so Rachel asks what he is doing. John tells Rachel that he is burying some old clothes that he doesn’t need anymore. Rachel does not buy John's excuse this time and asks him what is really going on. John tells Rachel that he is a shapeshifter and he has been dating her over and over again. He tells her that he is madly in love with her and has been trying to get it right, so that he could be with her forever. John tells Rachel that she is the only woman he has ever loved, and he will never hurt her again.\n",
        "source": "api",
        "start_time": 742.0,
        "end_time": 742.0,
        "last_event_time": 742.0,
        "start_progress": 0.7653931165140512,
        "end_progress": 0.7960214714240607
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. Rachel accepts this, but she still has a feeling that something isn’t right. One day, Rachel goes to the store alone and tells John that she will be back shortly. John stays at home and says he has work to do and catch up on. One hour later, Rachel returns from the store and sees John in the backyard acting strange.  Rachel goes to the backyard to see what John is doing, and she sees John digging a hole in the ground. John is burying some shredded clothes, so Rachel asks what he is doing. John tells Rachel that he is burying some old clothes that he doesn’t need anymore. Rachel does not buy John's excuse this time and asks him what is really going on. John tells Rachel that he is a shapeshifter and he has been dating her over and over again. He tells her that he is madly in love with her and has been trying to get it right, so that he could be with her forever. John tells Rachel that she is the only woman he has ever loved, and he will never hurt her again. Rachel is shocked and surprised that John has been doing this for so long. She does not know if she wants to stay with John or leave him.\n",
        "source": "user",
        "start_time": 746.0,
        "end_time": 816.0,
        "last_event_time": 816.0,
        "start_progress": 0.7960214714240607,
        "end_progress": 0.8395958320176824
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. Rachel accepts this, but she still has a feeling that something isn’t right. One day, Rachel goes to the store alone and tells John that she will be back shortly. John stays at home and says he has work to do and catch up on. One hour later, Rachel returns from the store and sees John in the backyard acting strange.  Rachel goes to the backyard to see what John is doing, and she sees John digging a hole in the ground. John is burying some shredded clothes, so Rachel asks what he is doing. John tells Rachel that he is burying some old clothes that he doesn’t need anymore. Rachel does not buy John's excuse this time and asks him what is really going on. John tells Rachel that he is a shapeshifter and he has been dating her over and over again. He tells her that he is madly in love with her and has been trying to get it right, so that he could be with her forever. John tells Rachel that she is the only woman he has ever loved, and he will never hurt her again. Rachel is shocked and surprised that John has been doing this for so long. She does not know if she wants to stay with John or leave him. She goes home and thinks about what John has told her.\n",
        "source": "api",
        "start_time": 831.0,
        "end_time": 831.0,
        "last_event_time": 831.0,
        "start_progress": 0.8395958320176824,
        "end_progress": 0.8569624250078939
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. Rachel accepts this, but she still has a feeling that something isn’t right. One day, Rachel goes to the store alone and tells John that she will be back shortly. John stays at home and says he has work to do and catch up on. One hour later, Rachel returns from the store and sees John in the backyard acting strange.  Rachel goes to the backyard to see what John is doing, and she sees John digging a hole in the ground. John is burying some shredded clothes, so Rachel asks what he is doing. John tells Rachel that he is burying some old clothes that he doesn’t need anymore. Rachel does not buy John's excuse this time and asks him what is really going on. John tells Rachel that he is a shapeshifter and he has been dating her over and over again. He tells her that he is madly in love with her and has been trying to get it right, so that he could be with her forever. John tells Rachel that she is the only woman he has ever loved, and he will never hurt her again. Rachel is shocked and surprised that John has been doing this for so long. She does not know if she wants to stay with John or leave him. She goes home with her parents and thinks about what John has told her. She realizes that anyone who would go through that much trouble for her is someone worth keeping.\n",
        "source": "user",
        "start_time": 834.0,
        "end_time": 863.0,
        "last_event_time": 863.0,
        "start_progress": 0.8569624250078939,
        "end_progress": 0.8932743921692453
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. Rachel accepts this, but she still has a feeling that something isn’t right. One day, Rachel goes to the store alone and tells John that she will be back shortly. John stays at home and says he has work to do and catch up on. One hour later, Rachel returns from the store and sees John in the backyard acting strange.  Rachel goes to the backyard to see what John is doing, and she sees John digging a hole in the ground. John is burying some shredded clothes, so Rachel asks what he is doing. John tells Rachel that he is burying some old clothes that he doesn’t need anymore. Rachel does not buy John's excuse this time and asks him what is really going on. John tells Rachel that he is a shapeshifter and he has been dating her over and over again. He tells her that he is madly in love with her and has been trying to get it right, so that he could be with her forever. John tells Rachel that she is the only woman he has ever loved, and he will never hurt her again. Rachel is shocked and surprised that John has been doing this for so long. She does not know if she wants to stay with John or leave him. She goes home with her parents and thinks about what John has told her. She realizes that anyone who would go through that much trouble for her is someone worth keeping. \n\nRachel goes back to John and tells him that she loves him and wants to stay with him.\n",
        "source": "api",
        "start_time": 872.0,
        "end_time": 872.0,
        "last_event_time": 872.0,
        "start_progress": 0.8932743921692453,
        "end_progress": 0.9210609409535838
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. Rachel accepts this, but she still has a feeling that something isn’t right. One day, Rachel goes to the store alone and tells John that she will be back shortly. John stays at home and says he has work to do and catch up on. One hour later, Rachel returns from the store and sees John in the backyard acting strange.  Rachel goes to the backyard to see what John is doing, and she sees John digging a hole in the ground. John is burying some shredded clothes, so Rachel asks what he is doing. John tells Rachel that he is burying some old clothes that he doesn’t need anymore. Rachel does not buy John's excuse this time and asks him what is really going on. John tells Rachel that he is a shapeshifter and he has been dating her over and over again. He tells her that he is madly in love with her and has been trying to get it right, so that he could be with her forever. John tells Rachel that she is the only woman he has ever loved, and he will never hurt her again. Rachel is shocked and surprised that John has been doing this for so long. She does not know if she wants to stay with John or leave him. She goes home with her parents and thinks about what John has told her. She realizes that anyone who would go through that much trouble for her is someone worth keeping. Rachel goes back to John and tells him that she loves him and wants to stay with him. John tells Rachel that he will be more honest about his shapeshifting.\n",
        "source": "user",
        "start_time": 879.0,
        "end_time": 923.0,
        "last_event_time": 923.0,
        "start_progress": 0.9210609409535838,
        "end_progress": 0.9428481212503947
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. Rachel accepts this, but she still has a feeling that something isn’t right. One day, Rachel goes to the store alone and tells John that she will be back shortly. John stays at home and says he has work to do and catch up on. One hour later, Rachel returns from the store and sees John in the backyard acting strange.  Rachel goes to the backyard to see what John is doing, and she sees John digging a hole in the ground. John is burying some shredded clothes, so Rachel asks what he is doing. John tells Rachel that he is burying some old clothes that he doesn’t need anymore. Rachel does not buy John's excuse this time and asks him what is really going on. John tells Rachel that he is a shapeshifter and he has been dating her over and over again. He tells her that he is madly in love with her and has been trying to get it right, so that he could be with her forever. John tells Rachel that she is the only woman he has ever loved, and he will never hurt her again. Rachel is shocked and surprised that John has been doing this for so long. She does not know if she wants to stay with John or leave him. She goes home with her parents and thinks about what John has told her. She realizes that anyone who would go through that much trouble for her is someone worth keeping. Rachel goes back to John and tells him that she loves him and wants to stay with him. John tells Rachel that he will be more honest about his shapeshifting. He tells her that he will tell her when he is going to transform, so she will be prepared.\n",
        "source": "api",
        "start_time": 929.0,
        "end_time": 929.0,
        "last_event_time": 929.0,
        "start_progress": 0.9428481212503947,
        "end_progress": 0.9715819387432901
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, Rachel, a beautiful young woman, is walking home from work when she’s attacked by a man. The man pulls Rachel into a dark alley, away from the bustling city street. Another man, John, happens to see Rachel getting attacked by the stranger, and decides to help. He grabs the man from behind and shoves him away from Rachel into a pile of garbage bags. The man turns around and looks at John, and then runs away. Rachel is relieved that the man has left her alone, thanks in part to John, who helped her. John and Rachel get to talking, and they realize they have a lot in common. Rachel decides to thank John by going on a date with him to a small, coffee shop the following day. Rachel meets John at the coffee shop and they get to know each other better over cappuccinos. Rachel gets a strange feeling that she knows John very well, but she can't put her finger on it. She dismisses the feeling and they go on a few more dates, and they fall in love. As time goes on, Rachel and John fall deeper in love with each other. They decide to move in together, and they get married. Over the years, Rachel realizes that John has a habit of disappearing for a couple of days. He always comes back, and he always has an excuse.  John tells Rachel that he travels for business at work a lot and he has no choice. Rachel accepts this, but she still has a feeling that something isn’t right. One day, Rachel goes to the store alone and tells John that she will be back shortly. John stays at home and says he has work to do and catch up on. One hour later, Rachel returns from the store and sees John in the backyard acting strange.  Rachel goes to the backyard to see what John is doing, and she sees John digging a hole in the ground. John is burying some shredded clothes, so Rachel asks what he is doing. John tells Rachel that he is burying some old clothes that he doesn’t need anymore. Rachel does not buy John's excuse this time and asks him what is really going on. John tells Rachel that he is a shapeshifter and he has been dating her over and over again. He tells her that he is madly in love with her and has been trying to get it right, so that he could be with her forever. John tells Rachel that she is the only woman he has ever loved, and he will never hurt her again. Rachel is shocked and surprised that John has been doing this for so long. She does not know if she wants to stay with John or leave him. She goes home with her parents and thinks about what John has told her. She realizes that anyone who would go through that much trouble for her is someone worth keeping. Rachel goes back to John and tells him that she loves him and wants to stay with him. John tells Rachel that he will be more honest about his shapeshifting. He tells her that he will tell her when he is going to transform, so she will be prepared. Rachel and John go back in the house and spend the rest of their lives together, happily.\n",
        "source": "user",
        "start_time": 932.0,
        "end_time": 959.0,
        "last_event_time": 959.0,
        "start_progress": 0.9715819387432901,
        "end_progress": 1.0
    }
]