[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.1441340782122905
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. \n",
        "source": "user",
        "start_time": 17.0,
        "end_time": 34.0,
        "last_event_time": 34.0,
        "start_progress": 0.1441340782122905,
        "end_progress": 0.19441340782122904
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time.\n",
        "source": "api",
        "start_time": 46.0,
        "end_time": 46.0,
        "last_event_time": 46.0,
        "start_progress": 0.19441340782122904,
        "end_progress": 0.2240223463687151
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time. They are working hard to catch up with technology and science and the arts. \n",
        "source": "user",
        "start_time": 78.0,
        "end_time": 94.0,
        "last_event_time": 94.0,
        "start_progress": 0.2240223463687151,
        "end_progress": 0.2670391061452514
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time. They are working hard to catch up with technology and science and the arts. But the rest of the world is still wary of them and their intentions.\n",
        "source": "api",
        "start_time": 108.0,
        "end_time": 108.0,
        "last_event_time": 108.0,
        "start_progress": 0.2670391061452514,
        "end_progress": 0.30558659217877093
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time. They are working hard to catch up with technology and science and the arts. But the rest of the world is still wary of them and their intentions. Every nation in the world becomes extremely competitive with the United States. \n",
        "source": "user",
        "start_time": 110.0,
        "end_time": 148.0,
        "last_event_time": 148.0,
        "start_progress": 0.30558659217877093,
        "end_progress": 0.35083798882681566
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time. They are working hard to catch up with technology and science and the arts. But the rest of the world is still wary of them and their intentions. Every nation in the world becomes extremely competitive with the United States. It becomes a race to see who can out-innovate them.\n",
        "source": "api",
        "start_time": 166.0,
        "end_time": 166.0,
        "last_event_time": 166.0,
        "start_progress": 0.35083798882681566,
        "end_progress": 0.3793296089385475
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time. They are working hard to catch up with technology and science and the arts. But the rest of the world is still wary of them and their intentions. Every nation in the world becomes extremely competitive with the United States. It becomes a race to see who can out-innovate them. This sparks a new age of rapid technological advancement and evolution. The United States cannot catch up. \n",
        "source": "user",
        "start_time": 172.0,
        "end_time": 213.0,
        "last_event_time": 213.0,
        "start_progress": 0.3793296089385475,
        "end_progress": 0.43966480446927375
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time. They are working hard to catch up with technology and science and the arts. But the rest of the world is still wary of them and their intentions. Every nation in the world becomes extremely competitive with the United States. It becomes a race to see who can out-innovate them. This sparks a new age of rapid technological advancement and evolution. The United States cannot catch up. They are out-innovated, out-maneuvered, and out of time.\n",
        "source": "api",
        "start_time": 225.0,
        "end_time": 225.0,
        "last_event_time": 225.0,
        "start_progress": 0.43966480446927375,
        "end_progress": 0.47094972067039104
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time. They are working hard to catch up with technology and science and the arts. But the rest of the world is still wary of them and their intentions. Every nation in the world becomes extremely competitive with the United States. It becomes a race to see who can out-innovate them. This sparks a new age of rapid technological advancement and evolution. The United States cannot catch up. They are out-innovated, out-maneuvered, and out of time. The world is far too ahead of them. They eventually surrender to their new reality. They are no longer a super power. \n",
        "source": "user",
        "start_time": 226.0,
        "end_time": 285.0,
        "last_event_time": 285.0,
        "start_progress": 0.47094972067039104,
        "end_progress": 0.5374301675977654
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time. They are working hard to catch up with technology and science and the arts. But the rest of the world is still wary of them and their intentions. Every nation in the world becomes extremely competitive with the United States. It becomes a race to see who can out-innovate them. This sparks a new age of rapid technological advancement and evolution. The United States cannot catch up. They are out-innovated, out-maneuvered, and out of time. The world is far too ahead of them. They eventually surrender to their new reality. They are no longer a super power. They are a third world country, forever behind in the progress of technology and science.\n",
        "source": "api",
        "start_time": 295.0,
        "end_time": 295.0,
        "last_event_time": 295.0,
        "start_progress": 0.5374301675977654,
        "end_progress": 0.5871508379888268
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time. They are working hard to catch up with technology and science and the arts. But the rest of the world is still wary of them and their intentions. Every nation in the world becomes extremely competitive with the United States. It becomes a race to see who can out-innovate them. This sparks a new age of rapid technological advancement and evolution. The United States cannot catch up. They are out-innovated, out-maneuvered, and out of time. The world is far too ahead of them. They eventually surrender to their new reality. They are no longer a super power. They are a third world country, forever behind in the progress of technology and science. They are a struggling developing nation. They reach out for help and their requests are ignored. They are looked down on with pity. \n",
        "source": "user",
        "start_time": 298.0,
        "end_time": 370.0,
        "last_event_time": 370.0,
        "start_progress": 0.5871508379888268,
        "end_progress": 0.6614525139664804
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time. They are working hard to catch up with technology and science and the arts. But the rest of the world is still wary of them and their intentions. Every nation in the world becomes extremely competitive with the United States. It becomes a race to see who can out-innovate them. This sparks a new age of rapid technological advancement and evolution. The United States cannot catch up. They are out-innovated, out-maneuvered, and out of time. The world is far too ahead of them. They eventually surrender to their new reality. They are no longer a super power. They are a third world country, forever behind in the progress of technology and science. They are a struggling developing nation. They reach out for help and their requests are ignored. They are looked down on with pity. They eventually become dependent on the world for answers to their problems.\n",
        "source": "api",
        "start_time": 382.0,
        "end_time": 382.0,
        "last_event_time": 382.0,
        "start_progress": 0.6614525139664804,
        "end_progress": 0.7039106145251397
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time. They are working hard to catch up with technology and science and the arts. But the rest of the world is still wary of them and their intentions. Every nation in the world becomes extremely competitive with the United States. It becomes a race to see who can out-innovate them. This sparks a new age of rapid technological advancement and evolution. The United States cannot catch up. They are out-innovated, out-maneuvered, and out of time. The world is far too ahead of them. They eventually surrender to their new reality. They are no longer a super power. They are a third world country, forever behind in the progress of technology and science. They are a struggling developing nation. They reach out for help and their requests are ignored. They are looked down on with pity. They eventually become dependent on the world for answers to their problems. They learn to survive on what the world gives them.\n",
        "source": "api",
        "start_time": 451.0,
        "end_time": 451.0,
        "last_event_time": 451.0,
        "start_progress": 0.7039106145251397,
        "end_progress": 0.7329608938547486
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time. They are working hard to catch up with technology and science and the arts. But the rest of the world is still wary of them and their intentions. Every nation in the world becomes extremely competitive with the United States. It becomes a race to see who can out-innovate them. This sparks a new age of rapid technological advancement and evolution. The United States cannot catch up. They are out-innovated, out-maneuvered, and out of time. The world is far too ahead of them. They eventually surrender to their new reality. They are no longer a super power. They are a third world country, forever behind in the progress of technology and science. They are a struggling developing nation. They reach out for help and their requests are ignored. They are looked down on with pity. They eventually become dependent on the world for answers to their problems. They learn to survive on what the world gives them. This turns them into a humble people. \n",
        "source": "user",
        "start_time": 453.0,
        "end_time": 460.0,
        "last_event_time": 460.0,
        "start_progress": 0.7329608938547486,
        "end_progress": 0.7547486033519553
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time. They are working hard to catch up with technology and science and the arts. But the rest of the world is still wary of them and their intentions. Every nation in the world becomes extremely competitive with the United States. It becomes a race to see who can out-innovate them. This sparks a new age of rapid technological advancement and evolution. The United States cannot catch up. They are out-innovated, out-maneuvered, and out of time. The world is far too ahead of them. They eventually surrender to their new reality. They are no longer a super power. They are a third world country, forever behind in the progress of technology and science. They are a struggling developing nation. They reach out for help and their requests are ignored. They are looked down on with pity. They eventually become dependent on the world for answers to their problems. They learn to survive on what the world gives them. This turns them into a humble people. They learn to appreciate every little thing they get from the world.\n",
        "source": "api",
        "start_time": 466.0,
        "end_time": 466.0,
        "last_event_time": 466.0,
        "start_progress": 0.7547486033519553,
        "end_progress": 0.7927374301675978
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time. They are working hard to catch up with technology and science and the arts. But the rest of the world is still wary of them and their intentions. Every nation in the world becomes extremely competitive with the United States. It becomes a race to see who can out-innovate them. This sparks a new age of rapid technological advancement and evolution. The United States cannot catch up. They are out-innovated, out-maneuvered, and out of time. The world is far too ahead of them. They eventually surrender to their new reality. They are no longer a super power. They are a third world country, forever behind in the progress of technology and science. They are a struggling developing nation. They reach out for help and their requests are ignored. They are looked down on with pity. They eventually become dependent on the world for answers to their problems. They learn to survive on what the world gives them. This turns them into a humble people. They learn to appreciate every little thing they get from the world. They grow in spiritual and religious practice. Eventually, the United States becomes a place for people seeking religious solace. \n",
        "source": "user",
        "start_time": 470.0,
        "end_time": 497.0,
        "last_event_time": 497.0,
        "start_progress": 0.7927374301675978,
        "end_progress": 0.8659217877094972
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time. They are working hard to catch up with technology and science and the arts. But the rest of the world is still wary of them and their intentions. Every nation in the world becomes extremely competitive with the United States. It becomes a race to see who can out-innovate them. This sparks a new age of rapid technological advancement and evolution. The United States cannot catch up. They are out-innovated, out-maneuvered, and out of time. The world is far too ahead of them. They eventually surrender to their new reality. They are no longer a super power. They are a third world country, forever behind in the progress of technology and science. They are a struggling developing nation. They reach out for help and their requests are ignored. They are looked down on with pity. They eventually become dependent on the world for answers to their problems. They learn to survive on what the world gives them. This turns them into a humble people. They learn to appreciate every little thing they get from the world. They grow in spiritual and religious practice. Eventually, the United States becomes a place for people seeking religious solace. People come to the United States for religious freedom.\n",
        "source": "api",
        "start_time": 508.0,
        "end_time": 508.0,
        "last_event_time": 508.0,
        "start_progress": 0.8659217877094972,
        "end_progress": 0.8966480446927374
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The people of the United States find out they are 50 years behind the rest of the world. But now, they are beginning to make up for lost time. They are working hard to catch up with technology and science and the arts. But the rest of the world is still wary of them and their intentions. Every nation in the world becomes extremely competitive with the United States. It becomes a race to see who can out-innovate them. This sparks a new age of rapid technological advancement and evolution. The United States cannot catch up. They are out-innovated, out-maneuvered, and out of time. The world is far too ahead of them. They eventually surrender to their new reality. They are no longer a super power. They are a third world country, forever behind in the progress of technology and science. They are a struggling developing nation. They reach out for help and their requests are ignored. They are looked down on with pity. They eventually become dependent on the world for answers to their problems. They learn to survive on what the world gives them. This turns them into a humble people. They learn to appreciate every little thing they get from the world. They grow in spiritual and religious practice. Eventually, the United States becomes a place for people seeking religious solace. People come to the United States for religious freedom. Newcomers are greeted with warmth and hospitality. The United States becomes a new world inadvertently, through hard work and painstaking circumstances. It becomes the land of dreams. \n",
        "source": "user",
        "start_time": 545.0,
        "end_time": 582.0,
        "last_event_time": 582.0,
        "start_progress": 0.8966480446927374,
        "end_progress": 1.0
    }
]