[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.09582689335394126
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.\n The alien brought him to an underground bunker and no one knew where he was.\n",
        "source": "user",
        "start_time": 8.0,
        "end_time": 50.0,
        "last_event_time": 50.0,
        "start_progress": 0.09582689335394126,
        "end_progress": 0.1561051004636785
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.\n The alien brought him to an underground bunker and no one knew where he was. One day when he was taken out for some fresh air, the alien is attacked by one of the other kids.\n",
        "source": "api",
        "start_time": 97.0,
        "end_time": 97.0,
        "last_event_time": 97.0,
        "start_progress": 0.1561051004636785,
        "end_progress": 0.23183925811437403
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.\n The alien brought him to an underground bunker and no one knew where he was. The new had reported Matt Damon's disappearance and was asking for help from the public to find him.\n",
        "source": "user",
        "start_time": 113.0,
        "end_time": 156.0,
        "last_event_time": 156.0,
        "start_progress": 0.23183925811437403,
        "end_progress": 0.23415765069551778
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.\n The alien brought him to an underground bunker and no one knew where he was. The new had reported Matt Damon's disappearance and was asking for help from the public to find him. Every person on Earth was asked to help him find Matt Damon.\n",
        "source": "api",
        "start_time": 188.0,
        "end_time": 188.0,
        "last_event_time": 188.0,
        "start_progress": 0.23415765069551778,
        "end_progress": 0.28129829984544047
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.\n The alien brought him to an underground bunker and no one knew where he was. The new had reported Matt Damon's disappearance and was asking for help from the public to find him. Every person on Earth was asked to help him find Matt Damon. One day Matt Damon convinced the alien to let him outside just to get some fresh air. He walked out of the bunker enjoyed some fresh air. \n",
        "source": "user",
        "start_time": 190.0,
        "end_time": 263.0,
        "last_event_time": 263.0,
        "start_progress": 0.28129829984544047,
        "end_progress": 0.38871715610510044
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.\n The alien brought him to an underground bunker and no one knew where he was. The new had reported Matt Damon's disappearance and was asking for help from the public to find him. Every person on Earth was asked to help him find Matt Damon. One day Matt Damon convinced the alien to let him outside just to get some fresh air. He walked out of the bunker enjoyed some fresh air. He looked up in the sky and saw an alien ship.\n",
        "source": "api",
        "start_time": 286.0,
        "end_time": 286.0,
        "last_event_time": 286.0,
        "start_progress": 0.38871715610510044,
        "end_progress": 0.4242658423493045
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.\n The alien brought him to an underground bunker and no one knew where he was. The new had reported Matt Damon's disappearance and was asking for help from the public to find him. Every person on Earth was asked to help him find Matt Damon. One day Matt Damon convinced the alien to let him outside just to get some fresh air. He walked out of the bunker enjoyed some fresh air. He looked up in the sky and saw an alien ship. \"If I could only destroy that ship,\" he thought, \"The alien then wouldn't be able to take me away to his planet.\" \n",
        "source": "user",
        "start_time": 290.0,
        "end_time": 350.0,
        "last_event_time": 350.0,
        "start_progress": 0.4242658423493045,
        "end_progress": 0.5131375579598145
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.\n The alien brought him to an underground bunker and no one knew where he was. The new had reported Matt Damon's disappearance and was asking for help from the public to find him. Every person on Earth was asked to help him find Matt Damon. One day Matt Damon convinced the alien to let him outside just to get some fresh air. He walked out of the bunker enjoyed some fresh air. He looked up in the sky and saw an alien ship. \"If I could only destroy that ship,\" he thought, \"The alien then wouldn't be able to take me away to his planet.\" He pulled a rocket launcher from his backpack and shot the ship out of the sky.\n",
        "source": "api",
        "start_time": 372.0,
        "end_time": 372.0,
        "last_event_time": 372.0,
        "start_progress": 0.5131375579598145,
        "end_progress": 0.5741885625965997
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.\n The alien brought him to an underground bunker and no one knew where he was. The new had reported Matt Damon's disappearance and was asking for help from the public to find him. Every person on Earth was asked to help him find Matt Damon. One day Matt Damon convinced the alien to let him outside just to get some fresh air. He walked out of the bunker enjoyed some fresh air. He looked up in the sky and saw an alien ship. \"If I could only destroy that ship,\" he thought, \"The alien then wouldn't be able to take me away to his planet.\"  You see this whole time Matt Damon had weapons in his pockets that he stole from the alien. He pulled a rocket launcher from his pocket and shot the ship out of the sky.\n",
        "source": "user",
        "start_time": 377.0,
        "end_time": 447.0,
        "last_event_time": 447.0,
        "start_progress": 0.5741885625965997,
        "end_progress": 0.6445131375579598
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.\n The alien brought him to an underground bunker and no one knew where he was. The new had reported Matt Damon's disappearance and was asking for help from the public to find him. Every person on Earth was asked to help him find Matt Damon. One day Matt Damon convinced the alien to let him outside just to get some fresh air. He walked out of the bunker enjoyed some fresh air. He looked up in the sky and saw an alien ship. \"If I could only destroy that ship,\" he thought, \"The alien then wouldn't be able to take me away to his planet.\"  You see this whole time Matt Damon had weapons in his pockets that he stole from the alien. He pulled a rocket launcher from his pocket and shot the ship out of the sky. People around the world were very happy and they were able to find him.\n",
        "source": "api",
        "start_time": 465.0,
        "end_time": 465.0,
        "last_event_time": 465.0,
        "start_progress": 0.6445131375579598,
        "end_progress": 0.7001545595054096
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.\n The alien brought him to an underground bunker and no one knew where he was. The new had reported Matt Damon's disappearance and was asking for help from the public to find him. Every person on Earth was asked to help him find Matt Damon. One day Matt Damon convinced the alien to let him outside just to get some fresh air. He walked out of the bunker enjoyed some fresh air. He looked up in the sky and saw an alien ship. \"If I could only destroy that ship,\" he thought, \"The alien then wouldn't be able to take me away to his planet.\"  You see this whole time Matt Damon had weapons in his pockets that he stole from the alien. He pulled a rocket launcher from his pocket and shot the ship out of the sky. People around the world were very happy and they were able to find him. But the alien was still there. With no ship and nowhere to go.\n",
        "source": "user",
        "start_time": 472.0,
        "end_time": 493.0,
        "last_event_time": 493.0,
        "start_progress": 0.7001545595054096,
        "end_progress": 0.7488408037094282
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.\n The alien brought him to an underground bunker and no one knew where he was. The new had reported Matt Damon's disappearance and was asking for help from the public to find him. Every person on Earth was asked to help him find Matt Damon. One day Matt Damon convinced the alien to let him outside just to get some fresh air. He walked out of the bunker enjoyed some fresh air. He looked up in the sky and saw an alien ship. \"If I could only destroy that ship,\" he thought, \"The alien then wouldn't be able to take me away to his planet.\"  You see this whole time Matt Damon had weapons in his pockets that he stole from the alien. He pulled a rocket launcher from his pocket and shot the ship out of the sky. People around the world were very happy and they were able to find him. But the alien was still there. With no ship and nowhere to go. The alien had finally realised that taking Matt Damon away from Earth was a mistake and he took him back and left.\n",
        "source": "api",
        "start_time": 506.0,
        "end_time": 506.0,
        "last_event_time": 506.0,
        "start_progress": 0.7488408037094282,
        "end_progress": 0.8377125193199382
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.\n The alien brought him to an underground bunker and no one knew where he was. The new had reported Matt Damon's disappearance and was asking for help from the public to find him. Every person on Earth was asked to help him find Matt Damon. One day Matt Damon convinced the alien to let him outside just to get some fresh air. He walked out of the bunker enjoyed some fresh air. He looked up in the sky and saw an alien ship. \"If I could only destroy that ship,\" he thought, \"The alien then wouldn't be able to take me away to his planet.\"  You see this whole time Matt Damon had weapons in his pockets that he stole from the alien. He pulled a rocket launcher from his pocket and shot the ship out of the sky. People around the world were very happy and they were able to find him. But the alien was still there. With no ship and nowhere to go. The alien had finally realised that taking Matt Damon away from Earth was a mistake because now he couldn't go home. In the end, humanity decided to forgive the alien because he was no longer a threat. It's a good thing he wasn't though because humanity will always go to great lengths to protect the brilliant...Matt Damon.\n",
        "source": "user",
        "start_time": 511.0,
        "end_time": 590.0,
        "last_event_time": 590.0,
        "start_progress": 0.8377125193199382,
        "end_progress": 1.0
    }
]