[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.22298325722983256
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. You can see that all of the people that took the anti aging drug are now having some strange effects from the drug. \n",
        "source": "user",
        "start_time": 26.0,
        "end_time": 103.0,
        "last_event_time": 103.0,
        "start_progress": 0.2237442922374429,
        "end_progress": 0.3120243531202435
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. You can see that all of the people that took the anti aging drug are now having some strange effects from the drug. They seem to forget their age and go back to being younger in their mind as though they have dementia. \n",
        "source": "user",
        "start_time": 106.0,
        "end_time": 176.0,
        "last_event_time": 176.0,
        "start_progress": 0.3120243531202435,
        "end_progress": 0.3904109589041096
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. You can see that all of the people that took the anti aging drug are now having some strange effects from the drug. They seem to forget their age and go back to being younger in their mind as though they have dementia. They are all walking around like zombies that don't know what year it is. \n",
        "source": "user",
        "start_time": 179.0,
        "end_time": 214.0,
        "last_event_time": 214.0,
        "start_progress": 0.3904109589041096,
        "end_progress": 0.4467275494672755
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. You can see that all of the people that took the anti aging drug are now having some strange effects from the drug. They seem to forget their age and go back to being younger in their mind as though they have dementia. They are all walking around like zombies that don't know what year it is. You are one of the few that didn't take the drug, and you are now the only one that can save the world.\n",
        "source": "api",
        "start_time": 235.0,
        "end_time": 235.0,
        "last_event_time": 235.0,
        "start_progress": 0.4467275494672755,
        "end_progress": 0.5251141552511416
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. You can see that all of the people that took the anti aging drug are now having some strange effects from the drug. They seem to forget their age and go back to being younger in their mind as though they have dementia. They are all walking around like zombies that don't know what year it is. \n",
        "source": "user",
        "start_time": 242.0,
        "end_time": 255.0,
        "last_event_time": 255.0,
        "start_progress": 0.5251141552511416,
        "end_progress": 0.4467275494672755
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. You can see that all of the people that took the anti aging drug are now having some strange effects from the drug. They seem to forget their age and go back to being younger in their mind as though they have dementia. They are all walking around like zombies that don't know what year it is. All of the older people that didn't take the drug know what is going on. \n",
        "source": "user",
        "start_time": 258.0,
        "end_time": 292.0,
        "last_event_time": 292.0,
        "start_progress": 0.4467275494672755,
        "end_progress": 0.502283105022831
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. You can see that all of the people that took the anti aging drug are now having some strange effects from the drug. They seem to forget their age and go back to being younger in their mind as though they have dementia. They are all walking around like zombies that don't know what year it is. All of the older people that didn't take the drug know what is going on. They are trying to help the younger people that are going through this.\n",
        "source": "api",
        "start_time": 302.0,
        "end_time": 302.0,
        "last_event_time": 302.0,
        "start_progress": 0.502283105022831,
        "end_progress": 0.556316590563166
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. You can see that all of the people that took the anti aging drug are now having some strange effects from the drug. They seem to forget their age and go back to being younger in their mind as though they have dementia. They are all walking around like zombies that don't know what year it is. All of the older people that didn't take the drug know what is going on. They are trying to help the younger people that are going through this. They want to demand that the government bans this drug so no one else turns into a confused zombie. \n",
        "source": "user",
        "start_time": 306.0,
        "end_time": 338.0,
        "last_event_time": 338.0,
        "start_progress": 0.556316590563166,
        "end_progress": 0.6331811263318112
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. You can see that all of the people that took the anti aging drug are now having some strange effects from the drug. They seem to forget their age and go back to being younger in their mind as though they have dementia. They are all walking around like zombies that don't know what year it is. All of the older people that didn't take the drug know what is going on. They are trying to help the younger people that are going through this. They want to demand that the government bans this drug so no one else turns into a confused zombie. You and your friends are trying to figure out what to do.\n",
        "source": "api",
        "start_time": 366.0,
        "end_time": 366.0,
        "last_event_time": 366.0,
        "start_progress": 0.6331811263318112,
        "end_progress": 0.6765601217656012
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. \nI can see that all of the people that took the anti aging drug are now having some strange effects from the drug. They seem to forget their age and go back to being younger in their mind as though they have dementia. They are all walking around like zombies that don't know what year it is. All of the older people that didn't take the drug know what is going on. We are trying to help the younger people that are going through this. We want to demand that the government bans this drug so no one else turns into a confused zombie. Finally I decide to step up and call the President and ask him to stop it. \n",
        "source": "user",
        "start_time": 371.0,
        "end_time": 467.0,
        "last_event_time": 467.0,
        "start_progress": 0.6765601217656012,
        "end_progress": 0.6864535768645358
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. \nI can see that all of the people that took the anti aging drug are now having some strange effects from the drug. They seem to forget their age and go back to being younger in their mind as though they have dementia. They are all walking around like zombies that don't know what year it is. All of the older people that didn't take the drug know what is going on. We are trying to help the younger people that are going through this. We want to demand that the government bans this drug so no one else turns into a confused zombie. Finally I decide to step up and call the President and ask him to stop it. He tells me that he will think about it and call me back.\n",
        "source": "api",
        "start_time": 480.0,
        "end_time": 480.0,
        "last_event_time": 480.0,
        "start_progress": 0.6864535768645358,
        "end_progress": 0.7298325722983258
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. \nI can see that all of the people that took the anti aging drug are now having some strange effects from the drug. They seem to forget their age and go back to being younger in their mind as though they have dementia. They are all walking around like zombies that don't know what year it is. All of the older people that didn't take the drug know what is going on. We are trying to help the younger people that are going through this. We want to demand that the government bans this drug so no one else turns into a confused zombie. Finally I decide to step up and call the President and ask him to stop it. He tells me that he will think about it and call me back. But the president had already conspired with the drug company in exchange for a lifetime supply. \n",
        "source": "user",
        "start_time": 483.0,
        "end_time": 517.0,
        "last_event_time": 517.0,
        "start_progress": 0.7298325722983258,
        "end_progress": 0.80441400304414
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. \nI can see that all of the people that took the anti aging drug are now having some strange effects from the drug. They seem to forget their age and go back to being younger in their mind as though they have dementia. They are all walking around like zombies that don't know what year it is. All of the older people that didn't take the drug know what is going on. We are trying to help the younger people that are going through this. We want to demand that the government bans this drug so no one else turns into a confused zombie. Finally I decide to step up and call the President and ask him to stop it. He tells me that he will think about it and call me back. But the president had already conspired with the drug company in exchange for a lifetime supply. He was already taking the drug and was already a confused zombie.\n",
        "source": "api",
        "start_time": 528.0,
        "end_time": 528.0,
        "last_event_time": 528.0,
        "start_progress": 0.80441400304414,
        "end_progress": 0.8538812785388128
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. \nI can see that all of the people that took the anti aging drug are now having some strange effects from the drug. They seem to forget their age and go back to being younger in their mind as though they have dementia. They are all walking around like zombies that don't know what year it is. All of the older people that didn't take the drug know what is going on. We are trying to help the younger people that are going through this. We want to demand that the government bans this drug so no one else turns into a confused zombie. Finally I decide to step up and call the President and ask him to stop it. He tells me that he will think about it and call me back. But the president had already conspired with the drug company in exchange for a lifetime supply. He was already taking the drug and was already a confused zombie. \n\nSo there was no hope. It seemed that anyone who could help was already compromised. The drug kept being sold and eventually everyone on Earth became insane from it. But hey they didn't age!\n",
        "source": "user",
        "start_time": 533.0,
        "end_time": 604.0,
        "last_event_time": 604.0,
        "start_progress": 0.8538812785388128,
        "end_progress": 1.0
    }
]