[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.08058281296461493
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. \n",
        "source": "user",
        "start_time": 3.0,
        "end_time": 15.0,
        "last_event_time": 15.0,
        "start_progress": 0.08058281296461493,
        "end_progress": 0.10615521855486174
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs.\n",
        "source": "api",
        "start_time": 30.0,
        "end_time": 30.0,
        "last_event_time": 30.0,
        "start_progress": 0.10615521855486174,
        "end_progress": 0.1311329170383586
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because \n",
        "source": "user",
        "start_time": 30.0,
        "end_time": 36.0,
        "last_event_time": 36.0,
        "start_progress": 0.1311329170383586,
        "end_progress": 0.13856675587273268
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees.\n",
        "source": "api",
        "start_time": 43.0,
        "end_time": 43.0,
        "last_event_time": 43.0,
        "start_progress": 0.13856675587273268,
        "end_progress": 0.1528397264347309
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, \n",
        "source": "user",
        "start_time": 43.0,
        "end_time": 45.0,
        "last_event_time": 45.0,
        "start_progress": 0.1528397264347309,
        "end_progress": 0.15611061552185548
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you?\n",
        "source": "api",
        "start_time": 51.0,
        "end_time": 51.0,
        "last_event_time": 51.0,
        "start_progress": 0.15611061552185548,
        "end_progress": 0.16830211121022895
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees.\n",
        "source": "api",
        "start_time": 56.0,
        "end_time": 56.0,
        "last_event_time": 56.0,
        "start_progress": 0.16859946476360393,
        "end_progress": 0.18435920309247694
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them.\n",
        "source": "api",
        "start_time": 66.0,
        "end_time": 66.0,
        "last_event_time": 66.0,
        "start_progress": 0.18465655664585193,
        "end_progress": 0.19982158786797502
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Why would she order one to protect you?\n",
        "source": "api",
        "start_time": 71.0,
        "end_time": 71.0,
        "last_event_time": 71.0,
        "start_progress": 0.20011894142134998,
        "end_progress": 0.21171573000297353
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. \n",
        "source": "user",
        "start_time": 72.0,
        "end_time": 73.0,
        "last_event_time": 73.0,
        "start_progress": 0.21171573000297353,
        "end_progress": 0.20011894142134998
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day.\n",
        "source": "api",
        "start_time": 82.0,
        "end_time": 82.0,
        "last_event_time": 82.0,
        "start_progress": 0.20011894142134998,
        "end_progress": 0.22182575081772227
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty.\n",
        "source": "api",
        "start_time": 92.0,
        "end_time": 92.0,
        "last_event_time": 92.0,
        "start_progress": 0.22212310437109722,
        "end_progress": 0.2375854891465953
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says \n",
        "source": "user",
        "start_time": 93.0,
        "end_time": 99.0,
        "last_event_time": 99.0,
        "start_progress": 0.2375854891465953,
        "end_progress": 0.2503716919417187
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\"\n",
        "source": "api",
        "start_time": 105.0,
        "end_time": 105.0,
        "last_event_time": 105.0,
        "start_progress": 0.2503716919417187,
        "end_progress": 0.256021409455843
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and \n",
        "source": "user",
        "start_time": 113.0,
        "end_time": 123.0,
        "last_event_time": 123.0,
        "start_progress": 0.256021409455843,
        "end_progress": 0.2780255724055902
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n",
        "source": "api",
        "start_time": 129.0,
        "end_time": 129.0,
        "last_event_time": 129.0,
        "start_progress": 0.2780255724055902,
        "end_progress": 0.2875408861135891
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. \n",
        "source": "user",
        "start_time": 131.0,
        "end_time": 140.0,
        "last_event_time": 140.0,
        "start_progress": 0.2875408861135891,
        "end_progress": 0.30597680642283676
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot.\n",
        "source": "api",
        "start_time": 149.0,
        "end_time": 149.0,
        "last_event_time": 149.0,
        "start_progress": 0.30597680642283676,
        "end_progress": 0.32054713053820993
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid.\n",
        "source": "api",
        "start_time": 157.0,
        "end_time": 157.0,
        "last_event_time": 157.0,
        "start_progress": 0.3208444840915849,
        "end_progress": 0.34374070770145704
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and \n",
        "source": "user",
        "start_time": 158.0,
        "end_time": 161.0,
        "last_event_time": 161.0,
        "start_progress": 0.34374070770145704,
        "end_progress": 0.34820101100208145
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you.\n",
        "source": "api",
        "start_time": 169.0,
        "end_time": 169.0,
        "last_event_time": 169.0,
        "start_progress": 0.34820101100208145,
        "end_progress": 0.3633660422242046
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, \n",
        "source": "user",
        "start_time": 170.0,
        "end_time": 172.0,
        "last_event_time": 172.0,
        "start_progress": 0.3633660422242046,
        "end_progress": 0.36931311329170385
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder.\n",
        "source": "api",
        "start_time": 179.0,
        "end_time": 179.0,
        "last_event_time": 179.0,
        "start_progress": 0.36931311329170385,
        "end_progress": 0.3776390127862028
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. \n",
        "source": "user",
        "start_time": 180.0,
        "end_time": 222.0,
        "last_event_time": 222.0,
        "start_progress": 0.3776390127862028,
        "end_progress": 0.3913172762414511
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you.\n",
        "source": "api",
        "start_time": 226.0,
        "end_time": 226.0,
        "last_event_time": 226.0,
        "start_progress": 0.3913172762414511,
        "end_progress": 0.399940529289325
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. \n",
        "source": "user",
        "start_time": 227.0,
        "end_time": 234.0,
        "last_event_time": 234.0,
        "start_progress": 0.399940529289325,
        "end_progress": 0.41718703538507285
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\"\n",
        "source": "api",
        "start_time": 244.0,
        "end_time": 244.0,
        "last_event_time": 244.0,
        "start_progress": 0.41718703538507285,
        "end_progress": 0.424323520666072
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, includnig \n",
        "source": "user",
        "start_time": 247.0,
        "end_time": 260.0,
        "last_event_time": 260.0,
        "start_progress": 0.42462087421944694,
        "end_progress": 0.45227475468331846
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, includnig : a loaf of bread, a bag of chips, and some chocolate ice cream.\n",
        "source": "api",
        "start_time": 266.0,
        "end_time": 266.0,
        "last_event_time": 266.0,
        "start_progress": 0.45227475468331846,
        "end_progress": 0.4713053820993161
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including: a loaf of bread, a bag of chips, and some chocolate ice cream. You end up preparing chicken salad sandwiches, \n",
        "source": "user",
        "start_time": 268.0,
        "end_time": 281.0,
        "last_event_time": 281.0,
        "start_progress": 0.4713053820993161,
        "end_progress": 0.4852809991079393
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including: a loaf of bread, a bag of chips, and some chocolate ice cream. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches.\n",
        "source": "api",
        "start_time": 287.0,
        "end_time": 287.0,
        "last_event_time": 287.0,
        "start_progress": 0.4852809991079393,
        "end_progress": 0.5060957478441868
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including: a loaf of bread, a bag of chips, and some chocolate ice cream. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing \n",
        "source": "user",
        "start_time": 288.0,
        "end_time": 291.0,
        "last_event_time": 291.0,
        "start_progress": 0.5060957478441868,
        "end_progress": 0.5153137079988106
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including: a loaf of bread, a bag of chips, and some chocolate ice cream. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake.\n",
        "source": "api",
        "start_time": 299.0,
        "end_time": 299.0,
        "last_event_time": 299.0,
        "start_progress": 0.5153137079988106,
        "end_progress": 0.5328575676479334
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including: a loaf of bread, a bag of chips, and some chocolate ice cream. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake. You start to add peanut butter to the brownie batter but Alfred stops you immediately. \n",
        "source": "user",
        "start_time": 307.0,
        "end_time": 319.0,
        "last_event_time": 319.0,
        "start_progress": 0.5328575676479334,
        "end_progress": 0.5590246803449301
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including: a loaf of bread, a bag of chips, and some chocolate ice cream. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake. You start to add peanut butter to the brownie batter but Alfred stops you immediately. \"That's not good for you,\" he tells you.\n",
        "source": "api",
        "start_time": 323.0,
        "end_time": 323.0,
        "last_event_time": 323.0,
        "start_progress": 0.5590246803449301,
        "end_progress": 0.5709188224799286
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including: a loaf of bread, a bag of chips, and some chocolate ice cream. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake. You start to add peanut butter to the brownie batter but Alfred stops you immediately. \"That's not good for you,\" he tells you. You ask why.\n",
        "source": "api",
        "start_time": 330.0,
        "end_time": 330.0,
        "last_event_time": 330.0,
        "start_progress": 0.5712161760333035,
        "end_progress": 0.5747844186738031
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including: a loaf of bread, a bag of chips, and some chocolate ice cream. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake. You start to add peanut butter to the brownie batter but Alfred stops you immediately. \"That's not good for you,\" he tells you. You ask why. He says he'll explain it to you later, but for now you should just leave it out of the batter.\n",
        "source": "api",
        "start_time": 343.0,
        "end_time": 343.0,
        "last_event_time": 343.0,
        "start_progress": 0.5750817722271782,
        "end_progress": 0.6030330062444246
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including a loaf of bread and a bag of chips. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake. You start to add peanut butter to the brownie batter but Alfred stops you immediately. \"That's not good for you,\" he tells you. You ask why. He says he'll explain it to you later, but for now you should just leave it out of the batter. You comply, but you're a little suspicious.\n\nLater you go on your picnic, with your bike basket loaded up with all your treats and sandwiches. You're about to take off without your helmet but Alfred stops you again. \n",
        "source": "user",
        "start_time": 344.0,
        "end_time": 395.0,
        "last_event_time": 395.0,
        "start_progress": 0.6030330062444246,
        "end_progress": 0.6592328278322926
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including a loaf of bread and a bag of chips. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake. You start to add peanut butter to the brownie batter but Alfred stops you immediately. \"That's not good for you,\" he tells you. You ask why. He says he'll explain it to you later, but for now you should just leave it out of the batter. You comply, but you're a little suspicious.\n\nLater you go on your picnic, with your bike basket loaded up with all your treats and sandwiches. You're about to take off without your helmet but Alfred stops you again. He tells you that there's something important about helmets.\n",
        "source": "api",
        "start_time": 401.0,
        "end_time": 401.0,
        "last_event_time": 401.0,
        "start_progress": 0.6592328278322926,
        "end_progress": 0.6770740410347904
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including a loaf of bread and a bag of chips. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake. You start to add peanut butter to the brownie batter but Alfred stops you immediately. \"That's not good for you,\" he tells you. You ask why. He says he'll explain it to you later, but for now you should just leave it out of the batter. You comply, but you're a little suspicious.\n\nLater you go on your picnic, with your bike basket loaded up with all your treats and sandwiches. You're about to take off without your helmet but Alfred stops you again. He tells you that there's something important about helmets. You have to wear one. You groan. You can practically hear your mother's voice through Alfred's. \n",
        "source": "user",
        "start_time": 401.0,
        "end_time": 412.0,
        "last_event_time": 412.0,
        "start_progress": 0.6770740410347904,
        "end_progress": 0.7059173357121618
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including a loaf of bread and a bag of chips. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake. You start to add peanut butter to the brownie batter but Alfred stops you immediately. \"That's not good for you,\" he tells you. You ask why. He says he'll explain it to you later, but for now you should just leave it out of the batter. You comply, but you're a little suspicious.\n\nLater you go on your picnic, with your bike basket loaded up with all your treats and sandwiches. You're about to take off without your helmet but Alfred stops you again. He tells you that there's something important about helmets. You have to wear one. You groan. You can practically hear your mother's voice through Alfred's. You put on your helmet and kick off with Alfred on your shoulder.\n",
        "source": "api",
        "start_time": 416.0,
        "end_time": 416.0,
        "last_event_time": 416.0,
        "start_progress": 0.7059173357121618,
        "end_progress": 0.7252453166815344
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including a loaf of bread and a bag of chips. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake. You start to add peanut butter to the brownie batter but Alfred stops you immediately. \"That's not good for you,\" he tells you. You ask why. He says he'll explain it to you later, but for now you should just leave it out of the batter. You comply, but you're a little suspicious.\n\nLater you go on your picnic, with your bike basket loaded up with all your treats and sandwiches. You're about to take off without your helmet but Alfred stops you again. He tells you that there's something important about helmets. You have to wear one. You groan. You can practically hear your mother's voice through Alfred's. You put on your helmet and kick off with Alfred on your shoulder. Later, you get to the picnic park and start munching your treats. You offer Alfred a sandwich, \n",
        "source": "user",
        "start_time": 417.0,
        "end_time": 433.0,
        "last_event_time": 433.0,
        "start_progress": 0.7252453166815344,
        "end_progress": 0.7537912578055308
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including a loaf of bread and a bag of chips. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake. You start to add peanut butter to the brownie batter but Alfred stops you immediately. \"That's not good for you,\" he tells you. You ask why. He says he'll explain it to you later, but for now you should just leave it out of the batter. You comply, but you're a little suspicious.\n\nLater you go on your picnic, with your bike basket loaded up with all your treats and sandwiches. You're about to take off without your helmet but Alfred stops you again. He tells you that there's something important about helmets. You have to wear one. You groan. You can practically hear your mother's voice through Alfred's. You put on your helmet and kick off with Alfred on your shoulder. Later, you get to the picnic park and start munching your treats. You offer Alfred a sandwich, but he says that bees only eat pollen from flowers, not from sandwiches.\n",
        "source": "api",
        "start_time": 438.0,
        "end_time": 438.0,
        "last_event_time": 438.0,
        "start_progress": 0.7537912578055308,
        "end_progress": 0.775200713648528
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including a loaf of bread and a bag of chips. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake. You start to add peanut butter to the brownie batter but Alfred stops you immediately. \"That's not good for you,\" he tells you. You ask why. He says he'll explain it to you later, but for now you should just leave it out of the batter. You comply, but you're a little suspicious.\n\nLater you go on your picnic, with your bike basket loaded up with all your treats and sandwiches. You're about to take off without your helmet but Alfred stops you again. He tells you that there's something important about helmets. You have to wear one. You groan. You can practically hear your mother's voice through Alfred's. You put on your helmet and kick off with Alfred on your shoulder. Later, you get to the picnic park and start munching your treats. You offer Alfred a sandwich, but he says that bees only eat pollen from flowers, not from sandwiches. You ask why Alfred refused to let you put peanut butter in the brownie batter. \n",
        "source": "user",
        "start_time": 441.0,
        "end_time": 452.0,
        "last_event_time": 452.0,
        "start_progress": 0.775200713648528,
        "end_progress": 0.7989889979185252
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including a loaf of bread and a bag of chips. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake. You start to add peanut butter to the brownie batter but Alfred stops you immediately. \"That's not good for you,\" he tells you. You ask why. He says he'll explain it to you later, but for now you should just leave it out of the batter. You comply, but you're a little suspicious.\n\nLater you go on your picnic, with your bike basket loaded up with all your treats and sandwiches. You're about to take off without your helmet but Alfred stops you again. He tells you that there's something important about helmets. You have to wear one. You groan. You can practically hear your mother's voice through Alfred's. You put on your helmet and kick off with Alfred on your shoulder. Later, you get to the picnic park and start munching your treats. You offer Alfred a sandwich, but he says that bees only eat pollen from flowers, not from sandwiches. You ask why Alfred refused to let you put peanut butter in the brownie batter. Alfred says that he can sense you have a severe allergy to peanut butter. \n",
        "source": "user",
        "start_time": 454.0,
        "end_time": 466.0,
        "last_event_time": 466.0,
        "start_progress": 0.7989889979185252,
        "end_progress": 0.8209931608682723
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including a loaf of bread and a bag of chips. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake. You start to add peanut butter to the brownie batter but Alfred stops you immediately. \"That's not good for you,\" he tells you. You ask why. He says he'll explain it to you later, but for now you should just leave it out of the batter. You comply, but you're a little suspicious.\n\nLater you go on your picnic, with your bike basket loaded up with all your treats and sandwiches. You're about to take off without your helmet but Alfred stops you again. He tells you that there's something important about helmets. You have to wear one. You groan. You can practically hear your mother's voice through Alfred's. You put on your helmet and kick off with Alfred on your shoulder. Later, you get to the picnic park and start munching your treats. You offer Alfred a sandwich, but he says that bees only eat pollen from flowers, not from sandwiches. You ask why Alfred refused to let you put peanut butter in the brownie batter. Alfred says that he can sense you have a severe allergy to peanut butter. He doesn't want you to end up in the hospital because of it.\n",
        "source": "api",
        "start_time": 473.0,
        "end_time": 473.0,
        "last_event_time": 473.0,
        "start_progress": 0.8209931608682723,
        "end_progress": 0.8388343740707701
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including a loaf of bread and a bag of chips. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake. You start to add peanut butter to the brownie batter but Alfred stops you immediately. \"That's not good for you,\" he tells you. You ask why. He says he'll explain it to you later, but for now you should just leave it out of the batter. You comply, but you're a little suspicious.\n\nLater you go on your picnic, with your bike basket loaded up with all your treats and sandwiches. You're about to take off without your helmet but Alfred stops you again. He tells you that there's something important about helmets. You have to wear one. You groan. You can practically hear your mother's voice through Alfred's. You put on your helmet and kick off with Alfred on your shoulder. Later, you get to the picnic park and start munching your treats. You offer Alfred a sandwich, but he says that bees only eat pollen from flowers, not from sandwiches. You ask why Alfred refused to let you put peanut butter in the brownie batter. Alfred says that he can sense you have a severe allergy to peanut butter. He doesn't want you to end up in the hospital because of it. You're surprised since you've never had a peanut allergy before. \"It's new,\" Alfred tells you. \n",
        "source": "user",
        "start_time": 473.0,
        "end_time": 493.0,
        "last_event_time": 493.0,
        "start_progress": 0.8388343740707701,
        "end_progress": 0.8673803151947665
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including a loaf of bread and a bag of chips. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake. You start to add peanut butter to the brownie batter but Alfred stops you immediately. \"That's not good for you,\" he tells you. You ask why. He says he'll explain it to you later, but for now you should just leave it out of the batter. You comply, but you're a little suspicious.\n\nLater you go on your picnic, with your bike basket loaded up with all your treats and sandwiches. You're about to take off without your helmet but Alfred stops you again. He tells you that there's something important about helmets. You have to wear one. You groan. You can practically hear your mother's voice through Alfred's. You put on your helmet and kick off with Alfred on your shoulder. Later, you get to the picnic park and start munching your treats. You offer Alfred a sandwich, but he says that bees only eat pollen from flowers, not from sandwiches. You ask why Alfred refused to let you put peanut butter in the brownie batter. Alfred says that he can sense you have a severe allergy to peanut butter. He doesn't want you to end up in the hospital because of it. You're surprised since you've never had a peanut allergy before. \"It's new,\" Alfred tells you. You start to ask Alfred how he knows all this about you, but you're interrupted by a bee.\n",
        "source": "api",
        "start_time": 505.0,
        "end_time": 505.0,
        "last_event_time": 505.0,
        "start_progress": 0.8673803151947665,
        "end_progress": 0.8938447814451382
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee introduces himself to you as Alfred. You're surprised to hear a bee talking. He tells you that he's the bee that your mother ordered to protect you at all costs. You're confused because your mother never mentioned anything about bees. Moreover, why would she order a bee to protect you? You've spent your entire life actively avoiding bees. Your mother has forbidden you to even go near them. Alfred says that your mother had given him orders to protect you all day. He tells you that jobs like these are his specialty. You ask what his job title is and he says he's a \"Guard Bee.\" Well, how about that! You've never even heard of a guard bee before, and now here you are talking to one!\n\nYou ask Alfred why your mother thought you needed his help. He says that your mother worries about you a lot. She ordered Alfred to protect you and make sure you don't do anything stupid. You laugh and ask if he's really going to be able to protect you. \"Try me,\" he says, and flies off your shoulder. You say that you want to go for a bike ride. Alfred says he'll follow you. You ask if he thinks you should pack a picnic lunch too. Alfred says \"Of course!\" So you go to the pantry in your kitchen and you start assembling treats for lunch, including a loaf of bread and a bag of chips. You end up preparing chicken salad sandwiches, tuna salad sandwiches, ham salad sandwiches, and egg salad sandwiches. And you also end up preparing some cookies, some brownies, and some strawberry shortcake. You start to add peanut butter to the brownie batter but Alfred stops you immediately. \"That's not good for you,\" he tells you. You ask why. He says he'll explain it to you later, but for now you should just leave it out of the batter. You comply, but you're a little suspicious.\n\nLater you go on your picnic, with your bike basket loaded up with all your treats and sandwiches. You're about to take off without your helmet but Alfred stops you again. He tells you that there's something important about helmets. You have to wear one. You groan. You can practically hear your mother's voice through Alfred's. You put on your helmet and kick off with Alfred on your shoulder. Later, you get to the picnic park and start munching your treats. You offer Alfred a sandwich, but he says that bees only eat pollen from flowers, not from sandwiches. You ask why Alfred refused to let you put peanut butter in the brownie batter. Alfred says that he can sense you have a severe allergy to peanut butter. He doesn't want you to end up in the hospital because of it. You're surprised since you've never had a peanut allergy before. \"It's new,\" Alfred tells you. You start to ask Alfred how he knows all this about you, but you're interrupted by a bee. Alfred tells the bee to go away. He's annoyed that this bee is encroaching on his territory. The bee flies off and Alfred explains to you that as a guard bee, he has special sensors and is attuned to every risk that might come to you. You are very impressed and from that moment on, you let Alfred guard and protect you, and you end up living a safe life. \n",
        "source": "user",
        "start_time": 521.0,
        "end_time": 597.0,
        "last_event_time": 597.0,
        "start_progress": 0.8938447814451382,
        "end_progress": 1.0
    }
]