[
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.07245604688332445
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from was not sufficient enough to sustain the population on our planet.    \n",
        "source": "user",
        "start_time": 3.0,
        "end_time": 238.0,
        "last_event_time": 238.0,
        "start_progress": 0.07245604688332445,
        "end_progress": 0.18913159296750134
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more.  \n",
        "source": "user",
        "start_time": 247.0,
        "end_time": 489.0,
        "last_event_time": 489.0,
        "start_progress": 0.18913159296750134,
        "end_progress": 0.3540223761321257
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more.   The remaining humans began to band together in small communities, and used their powers for the betterment of humanity.\n",
        "source": "api",
        "start_time": 516.0,
        "end_time": 516.0,
        "last_event_time": 516.0,
        "start_progress": 0.3540223761321257,
        "end_progress": 0.3859882791688865
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. \n",
        "source": "user",
        "start_time": 519.0,
        "end_time": 623.0,
        "last_event_time": 623.0,
        "start_progress": 0.3859882791688865,
        "end_progress": 0.4352690463505594
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible.\n",
        "source": "api",
        "start_time": 634.0,
        "end_time": 634.0,
        "last_event_time": 634.0,
        "start_progress": 0.4352690463505594,
        "end_progress": 0.4507192328183271
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. \n",
        "source": "user",
        "start_time": 637.0,
        "end_time": 676.0,
        "last_event_time": 676.0,
        "start_progress": 0.4507192328183271,
        "end_progress": 0.47975492807671816
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly.\n",
        "source": "api",
        "start_time": 688.0,
        "end_time": 688.0,
        "last_event_time": 688.0,
        "start_progress": 0.47975492807671816,
        "end_progress": 0.500799147575919
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. \n",
        "source": "user",
        "start_time": 692.0,
        "end_time": 726.0,
        "last_event_time": 726.0,
        "start_progress": 0.500799147575919,
        "end_progress": 0.5303676078849228
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations.\n",
        "source": "api",
        "start_time": 737.0,
        "end_time": 737.0,
        "last_event_time": 737.0,
        "start_progress": 0.5303676078849228,
        "end_progress": 0.5519445924347363
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations.\n",
        "source": "user",
        "start_time": 740.0,
        "end_time": 776.0,
        "last_event_time": 776.0,
        "start_progress": 0.5519445924347363,
        "end_progress": 0.582312200319659
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations. We knew the best time to attack is when they are at their weakest, in the middle of a new moon.\n",
        "source": "api",
        "start_time": 790.0,
        "end_time": 790.0,
        "last_event_time": 790.0,
        "start_progress": 0.582312200319659,
        "end_progress": 0.6078849227490677
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations. We knew the best time to attack is when they are at their weakest, in the middle of a new moon. The new moon weakened their bodies to a point of hibernation, which was the perfect window of attack.\n",
        "source": "user",
        "start_time": 794.0,
        "end_time": 840.0,
        "last_event_time": 840.0,
        "start_progress": 0.6078849227490677,
        "end_progress": 0.6350559403303143
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations. We knew the best time to attack is when they are at their weakest, in the middle of a new moon. The new moon weakened their bodies to a point of hibernation, which was the perfect window of attack. We had to strike now, before they were fully prepared for the new moon.\n",
        "source": "api",
        "start_time": 855.0,
        "end_time": 855.0,
        "last_event_time": 855.0,
        "start_progress": 0.6350559403303143,
        "end_progress": 0.6542354821523708
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations. We knew the best time to attack is when they are at their weakest, in the middle of a new moon. The new moon weakened their bodies to a point of hibernation, which was the perfect window of attack. We had to strike now, before they were fully prepared for the new moon. On the dawn of the new moon, our mole and a few of our soldiers planted an explosive, magic bomb at the alien mana source. They managed to escape before the explosion. \n",
        "source": "user",
        "start_time": 858.0,
        "end_time": 903.0,
        "last_event_time": 903.0,
        "start_progress": 0.6542354821523708,
        "end_progress": 0.6992541289291423
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations. We knew the best time to attack is when they are at their weakest, in the middle of a new moon. The new moon weakened their bodies to a point of hibernation, which was the perfect window of attack. We had to strike now, before they were fully prepared for the new moon. On the dawn of the new moon, our mole and a few of our soldiers planted an explosive, magic bomb at the alien mana source. They managed to escape before the explosion. The explosion was loud and bright.\n",
        "source": "api",
        "start_time": 912.0,
        "end_time": 912.0,
        "last_event_time": 912.0,
        "start_progress": 0.6992541289291423,
        "end_progress": 0.7083111347895578
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations. We knew the best time to attack is when they are at their weakest, in the middle of a new moon. The new moon weakened their bodies to a point of hibernation, which was the perfect window of attack. We had to strike now, before they were fully prepared for the new moon. On the dawn of the new moon, our mole and a few of our soldiers planted an explosive, magic bomb at the alien mana source. They managed to escape before the explosion. The explosion was loud and bright. The aliens were weak and feeble without their source of mana. We began our attack by sending in our soldiers, wiping out the aliens quickly. \n",
        "source": "user",
        "start_time": 913.0,
        "end_time": 993.0,
        "last_event_time": 993.0,
        "start_progress": 0.7083111347895578,
        "end_progress": 0.746137453383058
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations. We knew the best time to attack is when they are at their weakest, in the middle of a new moon. The new moon weakened their bodies to a point of hibernation, which was the perfect window of attack. We had to strike now, before they were fully prepared for the new moon. On the dawn of the new moon, our mole and a few of our soldiers planted an explosive, magic bomb at the alien mana source. They managed to escape before the explosion. The explosion was loud and bright. The aliens were weak and feeble without their source of mana. We began our attack by sending in our soldiers, wiping out the aliens quickly. Our soldiers were armed with magic guns, which harnessed our newly found powers.\n",
        "source": "api",
        "start_time": 1007.0,
        "end_time": 1007.0,
        "last_event_time": 1007.0,
        "start_progress": 0.746137453383058,
        "end_progress": 0.7674480554075652
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations. We knew the best time to attack is when they are at their weakest, in the middle of a new moon. The new moon weakened their bodies to a point of hibernation, which was the perfect window of attack. We had to strike now, before they were fully prepared for the new moon. On the dawn of the new moon, our mole and a few of our soldiers planted an explosive, magic bomb at the alien mana source. They managed to escape before the explosion. The explosion was loud and bright. The aliens were weak and feeble without their source of mana. We began our attack by sending in our soldiers, wiping out the aliens quickly. Our soldiers were armed with magic guns, which harnessed our newly found powers. The fighting progressed throughout the night, with humanity gaining more and more victories. \n",
        "source": "user",
        "start_time": 1010.0,
        "end_time": 1034.0,
        "last_event_time": 1034.0,
        "start_progress": 0.7674480554075652,
        "end_progress": 0.7924880127863612
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations. We knew the best time to attack is when they are at their weakest, in the middle of a new moon. The new moon weakened their bodies to a point of hibernation, which was the perfect window of attack. We had to strike now, before they were fully prepared for the new moon. On the dawn of the new moon, our mole and a few of our soldiers planted an explosive, magic bomb at the alien mana source. They managed to escape before the explosion. The explosion was loud and bright. The aliens were weak and feeble without their source of mana. We began our attack by sending in our soldiers, wiping out the aliens quickly. Our soldiers were armed with magic guns, which harnessed our newly found powers. The fighting progressed throughout the night, with humanity gaining more and more victories. The aliens became desperate and began to use their most powerful weapons.\n",
        "source": "api",
        "start_time": 1044.0,
        "end_time": 1044.0,
        "last_event_time": 1044.0,
        "start_progress": 0.7924880127863612,
        "end_progress": 0.8119339371337241
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations. We knew the best time to attack is when they are at their weakest, in the middle of a new moon. The new moon weakened their bodies to a point of hibernation, which was the perfect window of attack. We had to strike now, before they were fully prepared for the new moon. On the dawn of the new moon, our mole and a few of our soldiers planted an explosive, magic bomb at the alien mana source. They managed to escape before the explosion. The explosion was loud and bright. The aliens were weak and feeble without their source of mana. We began our attack by sending in our soldiers, wiping out the aliens quickly. Our soldiers were armed with magic guns, which harnessed our newly found powers. The fighting progressed throughout the night, with humanity gaining more and more victories. The aliens became desperate and began to use their most powerful weapons. The weapons were no match for our magical powers, proving to have no effect on us. \n",
        "source": "user",
        "start_time": 1045.0,
        "end_time": 1072.0,
        "last_event_time": 1072.0,
        "start_progress": 0.8119339371337241,
        "end_progress": 0.8343100692594566
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations. We knew the best time to attack is when they are at their weakest, in the middle of a new moon. The new moon weakened their bodies to a point of hibernation, which was the perfect window of attack. We had to strike now, before they were fully prepared for the new moon. On the dawn of the new moon, our mole and a few of our soldiers planted an explosive, magic bomb at the alien mana source. They managed to escape before the explosion. The explosion was loud and bright. The aliens were weak and feeble without their source of mana. We began our attack by sending in our soldiers, wiping out the aliens quickly. Our soldiers were armed with magic guns, which harnessed our newly found powers. The fighting progressed throughout the night, with humanity gaining more and more victories. The aliens became desperate and began to use their most powerful weapons. The weapons were no match for our magical powers, proving to have no effect on us. Our soldiers were able to subdue the remaining aliens with ease.\n",
        "source": "api",
        "start_time": 1081.0,
        "end_time": 1081.0,
        "last_event_time": 1081.0,
        "start_progress": 0.8343100692594566,
        "end_progress": 0.8513585508790623
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations. We knew the best time to attack is when they are at their weakest, in the middle of a new moon. The new moon weakened their bodies to a point of hibernation, which was the perfect window of attack. We had to strike now, before they were fully prepared for the new moon. On the dawn of the new moon, our mole and a few of our soldiers planted an explosive, magic bomb at the alien mana source. They managed to escape before the explosion. The explosion was loud and bright. The aliens were weak and feeble without their source of mana. We began our attack by sending in our soldiers, wiping out the aliens quickly. Our soldiers were armed with magic guns, which harnessed our newly found powers. The fighting progressed throughout the night, with humanity gaining more and more victories. The aliens became desperate and began to use their most powerful weapons. The weapons were no match for our magical powers, proving to have no effect on us. Our soldiers were able to subdue the remaining aliens with ease. By morning, the alien camps had been wiped out entirely and we regained our foothold on our planet. \n",
        "source": "user",
        "start_time": 1081.0,
        "end_time": 1121.0,
        "last_event_time": 1121.0,
        "start_progress": 0.8513585508790623,
        "end_progress": 0.8782631859350026
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations. We knew the best time to attack is when they are at their weakest, in the middle of a new moon. The new moon weakened their bodies to a point of hibernation, which was the perfect window of attack. We had to strike now, before they were fully prepared for the new moon. On the dawn of the new moon, our mole and a few of our soldiers planted an explosive, magic bomb at the alien mana source. They managed to escape before the explosion. The explosion was loud and bright. The aliens were weak and feeble without their source of mana. We began our attack by sending in our soldiers, wiping out the aliens quickly. Our soldiers were armed with magic guns, which harnessed our newly found powers. The fighting progressed throughout the night, with humanity gaining more and more victories. The aliens became desperate and began to use their most powerful weapons. The weapons were no match for our magical powers, proving to have no effect on us. Our soldiers were able to subdue the remaining aliens with ease. By morning, the alien camps had been wiped out entirely and we regained our foothold on our planet. \n\nWhen we finally had control of our planet, the government decided to divide it up into small communities.\n",
        "source": "api",
        "start_time": 1135.0,
        "end_time": 1135.0,
        "last_event_time": 1135.0,
        "start_progress": 0.8782631859350026,
        "end_progress": 0.906766116142781
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations. We knew the best time to attack is when they are at their weakest, in the middle of a new moon. The new moon weakened their bodies to a point of hibernation, which was the perfect window of attack. We had to strike now, before they were fully prepared for the new moon. On the dawn of the new moon, our mole and a few of our soldiers planted an explosive, magic bomb at the alien mana source. They managed to escape before the explosion. The explosion was loud and bright. The aliens were weak and feeble without their source of mana. We began our attack by sending in our soldiers, wiping out the aliens quickly. Our soldiers were armed with magic guns, which harnessed our newly found powers. The fighting progressed throughout the night, with humanity gaining more and more victories. The aliens became desperate and began to use their most powerful weapons. The weapons were no match for our magical powers, proving to have no effect on us. Our soldiers were able to subdue the remaining aliens with ease. By morning, the alien camps had been wiped out entirely and we regained our foothold on our planet.  When we finally had control of our planet, the government decided to divide it up into small communities. Many of us had lost many loved ones, but gained our magical powers in return.  To some of us it was a fair exchange, to others it was a grim reminder of our dark past. \n",
        "source": "user",
        "start_time": 1140.0,
        "end_time": 1187.0,
        "last_event_time": 1187.0,
        "start_progress": 0.906766116142781,
        "end_progress": 0.9515183803942462
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations. We knew the best time to attack is when they are at their weakest, in the middle of a new moon. The new moon weakened their bodies to a point of hibernation, which was the perfect window of attack. We had to strike now, before they were fully prepared for the new moon. On the dawn of the new moon, our mole and a few of our soldiers planted an explosive, magic bomb at the alien mana source. They managed to escape before the explosion. The explosion was loud and bright. The aliens were weak and feeble without their source of mana. We began our attack by sending in our soldiers, wiping out the aliens quickly. Our soldiers were armed with magic guns, which harnessed our newly found powers. The fighting progressed throughout the night, with humanity gaining more and more victories. The aliens became desperate and began to use their most powerful weapons. The weapons were no match for our magical powers, proving to have no effect on us. Our soldiers were able to subdue the remaining aliens with ease. By morning, the alien camps had been wiped out entirely and we regained our foothold on our planet.  When we finally had control of our planet, the government decided to divide it up into small communities. Many of us had lost many loved ones, but gained our magical powers in return.  To some of us it was a fair exchange, to others it was a grim reminder of our dark past.  Although we had finally gained our freedom, the memories of the 5 years of captivity would remain with us forever.\n",
        "source": "api",
        "start_time": 1195.0,
        "end_time": 1195.0,
        "last_event_time": 1195.0,
        "start_progress": 0.9515183803942462,
        "end_progress": 0.9821523708044753
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n\nWhen the aliens invaded over 50 years ago, it caught humanity by surprise. We used to think that we were alone in this vast universe, but we were sorely mistaken. As magical beings, humanity had always had a firm grasp on on our magical powers. As our world grew, our magical powers began to wither away. The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion. Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow. Most of our magical powers were mere shadows of what they used to be. The supply of mana could not power our magical ambitions. As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate. The alien invaders enslaved humanity and killed countless others on their conquest of our planet. As the human population decreased, the mana pool began to have a greater effect on our powers once more. The remaining humans began to band together in small communities, and used their powers for the betterment of humanity. The betterment of humanity meant fighting against our alien masters, taking back our planet. Our small communities learned to combine our powers and mana, to conjure devastating powers. Our powers are evolving in ways we never thought possible. We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed. We had to come up with a way for us to wipe out the aliens quickly and quietly. The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations. If we could destroy their main supply of mana, we could cripple their operations. We had been successful in planting a mole within their alien ranks, which gave us a window into their operations. We knew the best time to attack is when they are at their weakest, in the middle of a new moon. The new moon weakened their bodies to a point of hibernation, which was the perfect window of attack. We had to strike now, before they were fully prepared for the new moon. On the dawn of the new moon, our mole and a few of our soldiers planted an explosive, magic bomb at the alien mana source. They managed to escape before the explosion. The explosion was loud and bright. The aliens were weak and feeble without their source of mana. We began our attack by sending in our soldiers, wiping out the aliens quickly. Our soldiers were armed with magic guns, which harnessed our newly found powers. The fighting progressed throughout the night, with humanity gaining more and more victories. The aliens became desperate and began to use their most powerful weapons. The weapons were no match for our magical powers, proving to have no effect on us. Our soldiers were able to subdue the remaining aliens with ease. By morning, the alien camps had been wiped out entirely and we regained our foothold on our planet.  When we finally had control of our planet, the government decided to divide it up into small communities. Many of us had lost many loved ones, but gained our magical powers in return.  To some of us it was a fair exchange, to others it was a grim reminder of our dark past.  Although we had finally gained our freedom, the memories of the 5 years of captivity would remain with us forever. We had to push forward and rebuild our beautiful planet once more.\n",
        "source": "user",
        "start_time": 1201.0,
        "end_time": 1217.0,
        "last_event_time": 1217.0,
        "start_progress": 0.9821523708044753,
        "end_progress": 1.0
    }
]