[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.12544802867383512
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, he feels like he's at the end of his rope.   She's become so demanding.  He feels he needs to put her in her place but based on prior experience he knows that will work out badly for him.\n",
        "source": "user",
        "start_time": 14.0,
        "end_time": 65.0,
        "last_event_time": 65.0,
        "start_progress": 0.12544802867383512,
        "end_progress": 0.22171018945212492
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, he feels like he's at the end of his rope.   She's become so demanding.  He feels he needs to put her in her place but based on prior experience he knows that will work out badly for him.\n\nHe finds a photo of her mother, and gets an idea.\n",
        "source": "api",
        "start_time": 90.0,
        "end_time": 90.0,
        "last_event_time": 90.0,
        "start_progress": 0.22171018945212492,
        "end_progress": 0.24782386072708654
    },
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out. She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.\n\nOne day, he feels like he's at the end of his rope.   She's become so demanding.  He feels he needs to put her in her place but based on prior experience he knows that will work out badly for him.\n\nHe finds a photo of her mother, and gets an idea.  Perfect, in all his previous guises her mom loves him to death.  If he can get her to come for a visit his girlfriend will back off with the demands and her mother can correct her behavior.  After all, that's what mothers are for.  Just one sticky wicket her, in this guise he's not yet met her mum and therefore can't just ring her up and invite her himself.  How can he get his girlfriend to invite her without letting her know his thoughts?\n\nAh, he thinks, I've got it, if she's sick mum will come running.  \"Now, how do I arrange that?\" he mussed.  Oh, she's allergic to peanuts, I just slip some in tonight's dinner, that's the ticket.  And, that's what he does.\n\nAs the paramedics cluster over her prone body administering CPR and heart stimulation he feels as though perhaps he's made a mistake.  He follows the ambulance to the hospital.  On the way, he contacts her mother.  He introduces himself and tells her what's happened.  Mum takes the next flight in.\n\nTwo days later they stand white-faced at her bedside.  The doctors have convinced mum to pull the plug.  Irreversible brain damage, brain dead they told her.  He can hardly bear to be there.  This, he did this.  He tried confessing to the hospital chaplain but the fellow didn't believe him and chalked it up to stress.  He walked him to the psych wing and asked them there to examine him to see if he needed to be admitted.\n\nDue to his selfishness he had destroyed what was most precious to him.\n\n\n",
        "source": "user",
        "start_time": 117.0,
        "end_time": 613.0,
        "last_event_time": 613.0,
        "start_progress": 0.24782386072708654,
        "end_progress": 1.0
    }
]