[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.14077922077922078
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I see the bee and without thinking, squash it with a shoe. The next day the same thing happened, I squashed it with a shoe but this time stopped to really think about what was happening and were these bees trying to communicate with me. \n",
        "source": "user",
        "start_time": 12.0,
        "end_time": 104.0,
        "last_event_time": 104.0,
        "start_progress": 0.14077922077922078,
        "end_progress": 0.26441558441558444
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I see the bee and without thinking, squash it with a shoe. The next day the same thing happened, I squashed it with a shoe but this time stopped to really think about what was happening and were these bees trying to communicate with me. The next day I got dressed in a Tyvek suit, sat by my window and waited. \n",
        "source": "user",
        "start_time": 109.0,
        "end_time": 172.0,
        "last_event_time": 172.0,
        "start_progress": 0.26441558441558444,
        "end_progress": 0.30233766233766235
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I see the bee and without thinking, squash it with a shoe. The next day the same thing happened, I squashed it with a shoe but this time stopped to really think about what was happening and were these bees trying to communicate with me. The next day I got dressed in a Tyvek suit, sat by my window and waited. Sure enough, another bee flies in, lands on my shoulder and asks what my orders are. I simply cant believe my senses.\n",
        "source": "user",
        "start_time": 175.0,
        "end_time": 240.0,
        "last_event_time": 240.0,
        "start_progress": 0.30233766233766235,
        "end_progress": 0.3631168831168831
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I see the bee and without thinking, squash it with a shoe. The next day the same thing happened, I squashed it with a shoe but this time stopped to really think about what was happening and were these bees trying to communicate with me. The next day I got dressed in a Tyvek suit, sat by my window and waited. Sure enough, another bee flies in, lands on my shoulder and asks what my orders are. I simply cant believe my senses. I ask the bee why they have come to ask for my help. They said I am the only one who can save the bee population from disheartening. \n",
        "source": "user",
        "start_time": 243.0,
        "end_time": 315.0,
        "last_event_time": 315.0,
        "start_progress": 0.3631168831168831,
        "end_progress": 0.43272727272727274
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I see the bee and without thinking, squash it with a shoe. The next day the same thing happened, I squashed it with a shoe but this time stopped to really think about what was happening and were these bees trying to communicate with me. The next day I got dressed in a Tyvek suit, sat by my window and waited. Sure enough, another bee flies in, lands on my shoulder and asks what my orders are. I simply cant believe my senses. I ask the bee why they have come to ask for my help. They said I am the only one who can save the bee population from disheartening. I ask the bee what I can do.\n",
        "source": "api",
        "start_time": 333.0,
        "end_time": 333.0,
        "last_event_time": 333.0,
        "start_progress": 0.43272727272727274,
        "end_progress": 0.44727272727272727
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I see the bee and without thinking, squash it with a shoe. The next day the same thing happened, I squashed it with a shoe but this time stopped to really think about what was happening and were these bees trying to communicate with me. The next day I got dressed in a Tyvek suit, sat by my window and waited. Sure enough, another bee flies in, lands on my shoulder and asks what my orders are. I simply cant believe my senses. I ask the bee why they have come to ask for my help. They said I am the only one who can save the bee population from disappearing. I ask them what can I, a young boy do to help every bee in the world. \n",
        "source": "user",
        "start_time": 336.0,
        "end_time": 370.0,
        "last_event_time": 370.0,
        "start_progress": 0.44727272727272727,
        "end_progress": 0.4685714285714286
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I see the bee and without thinking, squash it with a shoe. The next day the same thing happened, I squashed it with a shoe but this time stopped to really think about what was happening and were these bees trying to communicate with me. The next day I got dressed in a Tyvek suit, sat by my window and waited. Sure enough, another bee flies in, lands on my shoulder and asks what my orders are. I simply cant believe my senses. I ask the bee why they have come to ask for my help. They said I am the only one who can save the bee population from disappearing. I ask them what can I, a young boy do to help every bee in the world. The bee says \"We need your help to stop the human race from destroying every flower and plant on earth.\n",
        "source": "api",
        "start_time": 388.0,
        "end_time": 388.0,
        "last_event_time": 388.0,
        "start_progress": 0.4685714285714286,
        "end_progress": 0.522077922077922
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I see the bee and without thinking, squash it with a shoe. The next day the same thing happened, I squashed it with a shoe but this time stopped to really think about what was happening and were these bees trying to communicate with me. The next day I got dressed in a Tyvek suit, sat by my window and waited. Sure enough, another bee flies in, lands on my shoulder and asks what my orders are. I simply cant believe my senses. I ask the bee why they have come to ask for my help. They said I am the only one who can save the bee population from disappearing. I ask them what can I, a young boy do to help every bee in the world. The bee says \"We need your help to stop the human race from destroying every flower and plant on earth. They continued to tell me that I am actually a prince bee that has been kidnapped by an evil corporation, bent on destroying the worlds flowers so they can sell their artificial ones and make huge profits.  \n",
        "source": "user",
        "start_time": 394.0,
        "end_time": 460.0,
        "last_event_time": 460.0,
        "start_progress": 0.522077922077922,
        "end_progress": 0.6301298701298701
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" I see the bee and without thinking, squash it with a shoe. The next day the same thing happened, I squashed it with a shoe but this time stopped to really think about what was happening and were these bees trying to communicate with me. The next day I got dressed in a Tyvek suit, sat by my window and waited. Sure enough, another bee flies in, lands on my shoulder and asks what my orders are. I simply cant believe my senses. I ask the bee why they have come to ask for my help. They said I am the only one who can save the bee population from disappearing. I ask them what can I, a young boy do to help every bee in the world. The bee says \"We need your help to stop the human race from destroying every flower and plant on earth. They continued to tell me that I am actually a prince bee that has been kidnapped by an evil corporation, bent on destroying the worlds flowers so they can sell their artificial ones and make huge profits.  The bee then informs me my parents have been planted there by the corporation to keep me hidden They knew that one day I would be the salvation of all the bees in the world. The bee then pulled out a small needle and poked me with it. I then shrank very quickly and transformed into a bee. All these memories of a past life as a prince rushed through my mind and I then knew that my sole purpose in life was to save my fellow bees. From there we devised a plan involving the 7 great colonies from around the world and organized The Great Sting, where they stung every employee of the flower company every day until they stopped making fake flowers. This worked and in the end all the flowers and bees returned.  \n",
        "source": "user",
        "start_time": 464.0,
        "end_time": 738.0,
        "last_event_time": 738.0,
        "start_progress": 0.6301298701298701,
        "end_progress": 1.0
    }
]