[
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\"\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.2536101083032491
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" I wondered, \"Is this a joke? How could JFK write me a letter?\" \n",
        "source": "user",
        "start_time": 21.0,
        "end_time": 54.0,
        "last_event_time": 54.0,
        "start_progress": 0.2536101083032491,
        "end_progress": 0.31137184115523464
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" I wondered, \"Is this a joke? How could JFK write me a letter?\" I picked up the phone and called the number.\n",
        "source": "api",
        "start_time": 77.0,
        "end_time": 77.0,
        "last_event_time": 77.0,
        "start_progress": 0.31137184115523464,
        "end_progress": 0.3510830324909747
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" I wondered, \"Is this a joke? How could JFK write me a letter?\" I picked up the phone and called the number. \"Hello,\" said the voice on the other line. This is me, Barack. I'm from the future and here with JFK who is still alive and we need your help.\" \n",
        "source": "user",
        "start_time": 100.0,
        "end_time": 204.0,
        "last_event_time": 204.0,
        "start_progress": 0.351985559566787,
        "end_progress": 0.48194945848375453
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" I wondered, \"Is this a joke? How could JFK write me a letter?\" I picked up the phone and called the number. \"Hello,\" said the voice on the other line. This is me, Barack. I'm from the future and here with JFK who is still alive and we need your help.\" \"What do you mean you're from the future?\" I asked.\n",
        "source": "api",
        "start_time": 211.0,
        "end_time": 211.0,
        "last_event_time": 211.0,
        "start_progress": 0.48194945848375453,
        "end_progress": 0.5279783393501805
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" I wondered, \"Is this a joke? How could JFK write me a letter?\" I picked up the phone and called the number. \"Hello,\" said the voice on the other line. This is me, Barack. I'm from the future and here with JFK who is still alive and we need your help.\" \"What do you mean you're from the future?\" I asked. \"I'm from the year 2053.\n",
        "source": "api",
        "start_time": 229.0,
        "end_time": 229.0,
        "last_event_time": 229.0,
        "start_progress": 0.5288808664259927,
        "end_progress": 0.5505415162454874
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" I wondered, \"Is this a joke? How could JFK write me a letter?\" I picked up the phone and called the number. \"Hello,\" said the voice on the other line. This is me, Barack. I'm from the future and here with JFK who is still alive and we need your help.\" \"What do you mean you're from the future?\" I asked. \"\n",
        "source": "user",
        "start_time": 236.0,
        "end_time": 239.0,
        "last_event_time": 239.0,
        "start_progress": 0.5505415162454874,
        "end_progress": 0.529783393501805
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" I wondered, \"Is this a joke? How could JFK write me a letter?\" I picked up the phone and called the number. \"Hello,\" said the voice on the other line. This is me, Barack. I'm from the future and here with JFK who is still alive and we need your help.\" \"What do you mean you're from the future?\" I asked. \"Well, you see, we've been trying to fix the economy and we've been trying to get rid of the Russians and we've been trying\n",
        "source": "api",
        "start_time": 268.0,
        "end_time": 268.0,
        "last_event_time": 268.0,
        "start_progress": 0.5288808664259927,
        "end_progress": 0.6398916967509025
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" I wondered, \"Is this a joke? How could JFK write me a letter?\" I picked up the phone and called the number. \"Hello,\" said the voice on the other line. This is me, Barack. I'm from the future and here with JFK who is still alive and we need your help.\" \"What do you mean you're from the future?\" I asked. And then he told me that in year 2030, there was an alien invasion. He needed me to have a small planet blown up to prevent the alien invasion. \n",
        "source": "user",
        "start_time": 281.0,
        "end_time": 355.0,
        "last_event_time": 355.0,
        "start_progress": 0.6398916967509025,
        "end_progress": 0.6588447653429603
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" I wondered, \"Is this a joke? How could JFK write me a letter?\" I picked up the phone and called the number. \"Hello,\" said the voice on the other line. This is me, Barack. I'm from the future and here with JFK who is still alive and we need your help.\" \"What do you mean you're from the future?\" I asked. And then he told me that in year 2030, there was an alien invasion. He needed me to have a small planet blown up to prevent the alien invasion. \"But why me?\"\n",
        "source": "api",
        "start_time": 366.0,
        "end_time": 366.0,
        "last_event_time": 366.0,
        "start_progress": 0.6588447653429603,
        "end_progress": 0.6705776173285198
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" I wondered, \"Is this a joke? How could JFK write me a letter?\" I picked up the phone and called the number. \"Hello,\" said the voice on the other line. This is me, Barack. I'm from the future and here with JFK who is still alive and we need your help.\" \"What do you mean you're from the future?\" I asked. And then he told me that in year 2030, there was an alien invasion. He needed me to have a small planet blown up to prevent the alien invasion. \"But why me?\" \"Because you know the codes and we can't trust the current president to keep this secret.\" \"Okay. So how can I get them to blow up the planet?\" \n",
        "source": "user",
        "start_time": 370.0,
        "end_time": 433.0,
        "last_event_time": 433.0,
        "start_progress": 0.6705776173285198,
        "end_progress": 0.8014440433212996
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" I wondered, \"Is this a joke? How could JFK write me a letter?\" I picked up the phone and called the number. \"Hello,\" said the voice on the other line. This is me, Barack. I'm from the future and here with JFK who is still alive and we need your help.\" \"What do you mean you're from the future?\" I asked. And then he told me that in year 2030, there was an alien invasion. He needed me to have a small planet blown up to prevent the alien invasion. \"But why me?\" \"Because we can't trust the current president to keep this secret.\" \"Okay. So how can I get them to blow up the planet?\" \n",
        "source": "user",
        "start_time": 438.0,
        "end_time": 464.0,
        "last_event_time": 464.0,
        "start_progress": 0.8014440433212996,
        "end_progress": 0.7806859205776173
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" I wondered, \"Is this a joke? How could JFK write me a letter?\" I picked up the phone and called the number. \"Hello,\" said the voice on the other line. This is me, Barack. I'm from the future and here with JFK who is still alive and we need your help.\" \"What do you mean you're from the future?\" I asked. And then he told me that in year 2030, there was an alien invasion. He needed me to have a small planet blown up to prevent the alien invasion. \"But why me?\" \"Because we can't trust the current president to keep this secret.\" \"Okay. So how can I get them to blow up the planet?\" \"You'll have to convince them that the planet is a threat to Earth.\"\n",
        "source": "api",
        "start_time": 506.0,
        "end_time": 506.0,
        "last_event_time": 506.0,
        "start_progress": 0.7806859205776173,
        "end_progress": 0.842057761732852
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" I wondered, \"Is this a joke? How could JFK write me a letter?\" I picked up the phone and called the number. \"Hello,\" said the voice on the other line. This is me, Barack. I'm from the future and here with JFK who is still alive and we need your help.\" \"What do you mean you're from the future?\" I asked. And then he told me that in year 2030, there was an alien invasion. He needed me to have a small planet blown up to prevent the alien invasion. \"But why me?\" \"Because we can't trust the current president to keep this secret.\" \"Okay. So how should I blow up the planet?\" I asked. \n",
        "source": "user",
        "start_time": 513.0,
        "end_time": 567.0,
        "last_event_time": 567.0,
        "start_progress": 0.842057761732852,
        "end_progress": 0.7806859205776173
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" I wondered, \"Is this a joke? How could JFK write me a letter?\" I picked up the phone and called the number. \"Hello,\" said the voice on the other line. This is me, Barack. I'm from the future and here with JFK who is still alive and we need your help.\" \"What do you mean you're from the future?\" I asked. And then he told me that in year 2030, there was an alien invasion. He needed me to have a small planet blown up to prevent the alien invasion. \"But why me?\" \"Because we can't trust the current president to keep this secret.\" \"Okay. So how should I blow up the planet?\" I asked. \"You're going to need to build a time machine.\"\n",
        "source": "api",
        "start_time": 583.0,
        "end_time": 583.0,
        "last_event_time": 583.0,
        "start_progress": 0.7806859205776173,
        "end_progress": 0.8231046931407943
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" I wondered, \"Is this a joke? How could JFK write me a letter?\" I picked up the phone and called the number. \"Hello,\" said the voice on the other line. This is me, Barack. I'm from the future and here with JFK who is still alive and we need your help.\" \"What do you mean you're from the future?\" I asked. And then he told me that in year 2030, there was an alien invasion. He needed me to have a small planet blown up to prevent the alien invasion. \"But why me?\" \"Because we can't trust the current president to keep this secret.\" \"Okay. So how should I blow up the planet?\" I asked. \"You're going to need to build a time machine.\" So he built a time machine and went back to when he was president. He warned his former self that this planet needed to be blown up. \n",
        "source": "user",
        "start_time": 592.0,
        "end_time": 631.0,
        "last_event_time": 631.0,
        "start_progress": 0.8240072202166066,
        "end_progress": 0.944043321299639
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" I wondered, \"Is this a joke? How could JFK write me a letter?\" I picked up the phone and called the number. \"Hello,\" said the voice on the other line. This is me, Barack. I'm from the future and here with JFK who is still alive and we need your help.\" \"What do you mean you're from the future?\" I asked. And then he told me that in year 2030, there was an alien invasion. He needed me to have a small planet blown up to prevent the alien invasion. \"But why me?\" \"Because we can't trust the current president to keep this secret.\" \"Okay. So how should I blow up the planet?\" I asked. \"You're going to need to build a time machine.\" So he built a time machine and went back to when he was president. He warned his former self that this planet needed to be blown up. He blew it up and prevented the invasion. Humanity was saved. \n",
        "source": "user",
        "start_time": 635.0,
        "end_time": 667.0,
        "last_event_time": 667.0,
        "start_progress": 0.944043321299639,
        "end_progress": 1.0
    }
]