[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.14073006724303555
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n\nThe Lost Generations is a story about the lives of the people who were denied immortality, and how they cope with their lives.\n",
        "source": "api",
        "start_time": 61.0,
        "end_time": 61.0,
        "last_event_time": 61.0,
        "start_progress": 0.14121037463976946,
        "end_progress": 0.202209414024976
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n\nThe Lost Generations is a story about the lives of the people who were denied immortality, and how they cope with their lives.\nA specific part of the population was chosen to receive immortality and those above the age of 26 are denied that immortality. \n",
        "source": "user",
        "start_time": 64.0,
        "end_time": 116.0,
        "last_event_time": 116.0,
        "start_progress": 0.202209414024976,
        "end_progress": 0.26368876080691644
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n\nThe Lost Generations is a story about the lives of the people who were denied immortality, and how they cope with their lives.\nA specific part of the population was chosen to receive immortality and those above the age of 26 are denied that immortality. The story is told through the eyes of a man who is 28 and is part of the Lost Generations.\n",
        "source": "api",
        "start_time": 138.0,
        "end_time": 138.0,
        "last_event_time": 138.0,
        "start_progress": 0.26368876080691644,
        "end_progress": 0.3069164265129683
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n\nThe Lost Generations is a story about the lives of the people who were denied immortality, and how they cope with their lives.\nA specific part of the population was chosen to receive immortality and those above the age of 26 are denied that immortality. The story is told through the eyes of a man who is 28 and is part of the Lost Generations. This man who we will call William, has been happy with the result of not receiving immortality. William has watched others experience the side effects of having immortality and he is glad that he is not a part of this experiment. \n",
        "source": "user",
        "start_time": 140.0,
        "end_time": 235.0,
        "last_event_time": 235.0,
        "start_progress": 0.3069164265129683,
        "end_progress": 0.41786743515850144
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n\nThe Lost Generations is a story about the lives of the people who were denied immortality, and how they cope with their lives.\nA specific part of the population was chosen to receive immortality and those above the age of 26 are denied that immortality. The story is told through the eyes of a man who is 28 and is part of the Lost Generations. This man who we will call William, has been happy with the result of not receiving immortality. William has watched others experience the side effects of having immortality and he is glad that he is not a part of this experiment. William is a man who is happy with his life and is content with his decision not to receive immortality.\n",
        "source": "api",
        "start_time": 248.0,
        "end_time": 248.0,
        "last_event_time": 248.0,
        "start_progress": 0.41786743515850144,
        "end_progress": 0.4678194044188281
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n\nThe Lost Generations is a story about the lives of the people who were denied immortality, and how they cope with their lives.\nA specific part of the population was chosen to receive immortality and those above the age of 26 are denied that immortality. The story is told through the eyes of a man who is 28 and is part of the Lost Generations. This man who we will call William, has been happy with the result of not receiving immortality. William has watched others experience the side effects of having immortality and he is glad that he is not a part of this experiment. William is a man who is happy with his life and is content with the decision not to receive immortality. William has seen severe side effects in those who have taken the drug. The side effects have included such tiredness that people cannot function and just want to sleep as a result. Many people have experienced an appetite that cannot be satiated so they are never content with any amount of food that they consume. This is one of the more severe side effects that leaves people constantly hungry, never full and never satisfied. \n",
        "source": "user",
        "start_time": 263.0,
        "end_time": 393.0,
        "last_event_time": 393.0,
        "start_progress": 0.4678194044188281,
        "end_progress": 0.6743515850144092
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n\nThe Lost Generations is a story about the lives of the people who were denied immortality, and how they cope with their lives.\nA specific part of the population was chosen to receive immortality and those above the age of 26 are denied that immortality. The story is told through the eyes of a man who is 28 and is part of the Lost Generations. This man who we will call William, has been happy with the result of not receiving immortality. William has watched others experience the side effects of having immortality and he is glad that he is not a part of this experiment. William is a man who is happy with his life and is content with the decision not to receive immortality. William has seen severe side effects in those who have taken the drug. The side effects have included such tiredness that people cannot function and just want to sleep as a result. Many people have experienced an appetite that cannot be satiated so they are never content with any amount of food that they consume. This is one of the more severe side effects that leaves people constantly hungry, never full and never satisfied. William has seen people who have taken the drug and have gone insane and have committed suicide.\n",
        "source": "api",
        "start_time": 425.0,
        "end_time": 425.0,
        "last_event_time": 425.0,
        "start_progress": 0.6743515850144092,
        "end_progress": 0.7204610951008645
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n\nThe Lost Generations is a story about the lives of the people who were denied immortality, and how they cope with their lives.\nA specific part of the population was chosen to receive immortality and those above the age of 26 are denied that immortality. The story is told through the eyes of a man who is 28 and is part of the Lost Generations. This man who we will call William, has been happy with the result of not receiving immortality. William has watched others experience the side effects of having immortality and he is glad that he is not a part of this experiment. William is a man who is happy with his life and is content with the decision not to receive immortality. William has seen severe side effects in those who have taken the drug. The side effects have included such tiredness that people cannot function and just want to sleep as a result. Many people have experienced an appetite that cannot be satiated so they are never content with any amount of food that they consume. This is one of the more severe side effects that leaves people constantly hungry, never full and never satisfied. William has seen people who have taken the drug and have gone insane and have committed suicide. Severe obesity has been a very serious medical complication as a result of constant and unending hunger.  \n",
        "source": "user",
        "start_time": 428.0,
        "end_time": 464.0,
        "last_event_time": 464.0,
        "start_progress": 0.7204610951008645,
        "end_progress": 0.7718539865513929
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n\nThe Lost Generations is a story about the lives of the people who were denied immortality, and how they cope with their lives.\nA specific part of the population was chosen to receive immortality and those above the age of 26 are denied that immortality. The story is told through the eyes of a man who is 28 and is part of the Lost Generations. This man who we will call William, has been happy with the result of not receiving immortality. William has watched others experience the side effects of having immortality and he is glad that he is not a part of this experiment. William is a man who is happy with his life and is content with the decision not to receive immortality. William has seen severe side effects in those who have taken the drug. The side effects have included such tiredness that people cannot function and just want to sleep as a result. Many people have experienced an appetite that cannot be satiated so they are never content with any amount of food that they consume. This is one of the more severe side effects that leaves people constantly hungry, never full and never satisfied. William has seen people who have taken the drug and have gone insane and have committed suicide. Severe obesity has been a very serious medical complication as a result of constant and unending hunger.  Another unwanted side effect is \n",
        "source": "user",
        "start_time": 471.0,
        "end_time": 490.0,
        "last_event_time": 490.0,
        "start_progress": 0.7718539865513929,
        "end_progress": 0.787223823246878
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n\nThe Lost Generations is a story about the lives of the people who were denied immortality, and how they cope with their lives.\nA specific part of the population was chosen to receive immortality and those above the age of 26 are denied that immortality. The story is told through the eyes of a man who is 28 and is part of the Lost Generations. This man who we will call William, has been happy with the result of not receiving immortality. William has watched others experience the side effects of having immortality and he is glad that he is not a part of this experiment. William is a man who is happy with his life and is content with the decision not to receive immortality. William has seen severe side effects in those who have taken the drug. The side effects have included such tiredness that people cannot function and just want to sleep as a result. Many people have experienced an appetite that cannot be satiated so they are never content with any amount of food that they consume. This is one of the more severe side effects that leaves people constantly hungry, never full and never satisfied. William has seen people who have taken the drug and have gone insane and have committed suicide. Severe obesity has been a very serious medical complication as a result of constant and unending hunger.  Another unwanted side effect is that people have become extremely obese and have been unable to move.\n",
        "source": "api",
        "start_time": 501.0,
        "end_time": 501.0,
        "last_event_time": 501.0,
        "start_progress": 0.787223823246878,
        "end_progress": 0.8203650336215178
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n\nThe Lost Generations is a story about the lives of the people who were denied immortality, and how they cope with their lives.\nA specific part of the population was chosen to receive immortality and those above the age of 26 are denied that immortality. The story is told through the eyes of a man who is 28 and is part of the Lost Generations. This man who we will call William, has been happy with the result of not receiving immortality. William has watched others experience the side effects of having immortality and he is glad that he is not a part of this experiment. William is a man who is happy with his life and is content with the decision not to receive immortality. William has seen severe side effects in those who have taken the drug. The side effects have included such tiredness that people cannot function and just want to sleep as a result. Many people have experienced an appetite that cannot be satiated so they are never content with any amount of food that they consume. This is one of the more severe side effects that leaves people constantly hungry, never full and never satisfied. William has seen people who have taken the drug and have gone insane and have committed suicide. Severe obesity has been a very serious medical complication as a result of constant and unending hunger.  Another unwanted side effect is that people have become unable to move because of the obesity and their size. .\n",
        "source": "user",
        "start_time": 508.0,
        "end_time": 525.0,
        "last_event_time": 525.0,
        "start_progress": 0.8203650336215178,
        "end_progress": 0.8251681075888568
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n\nThe Lost Generations is a story about the lives of the people who were denied immortality, and how they cope with their lives.\nA specific part of the population was chosen to receive immortality and those above the age of 26 are denied that immortality. The story is told through the eyes of a man who is 28 and is part of the Lost Generations. This man who we will call William, has been happy with the result of not receiving immortality. William has watched others experience the side effects of having immortality and he is glad that he is not a part of this experiment. William is a man who is happy with his life and is content with the decision not to receive immortality. William has seen severe side effects in those who have taken the drug. The side effects have included such tiredness that people cannot function and just want to sleep as a result. Many people have experienced an appetite that cannot be satiated so they are never content with any amount of food that they consume. This is one of the more severe side effects that leaves people constantly hungry, never full and never satisfied. William has seen people who have taken the drug and have gone insane and have committed suicide. Severe obesity has been a very serious medical complication as a result of constant and unending hunger.  Another unwanted side effect is that people have become unable to move because of the obesity and their size. William has found in his interactions, that those who took the immortality drug are regretful and wish that they never took it. \n",
        "source": "user",
        "start_time": 530.0,
        "end_time": 586.0,
        "last_event_time": 586.0,
        "start_progress": 0.8251681075888568,
        "end_progress": 0.8861671469740634
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n\nThe Lost Generations is a story about the lives of the people who were denied immortality, and how they cope with their lives.\nA specific part of the population was chosen to receive immortality and those above the age of 26 are denied that immortality. The story is told through the eyes of a man who is 28 and is part of the Lost Generations. This man who we will call William, has been happy with the result of not receiving immortality. William has watched others experience the side effects of having immortality and he is glad that he is not a part of this experiment. William is a man who is happy with his life and is content with the decision not to receive immortality. William has seen severe side effects in those who have taken the drug. The side effects have included such tiredness that people cannot function and just want to sleep as a result. Many people have experienced an appetite that cannot be satiated so they are never content with any amount of food that they consume. This is one of the more severe side effects that leaves people constantly hungry, never full and never satisfied. William has seen people who have taken the drug and have gone insane and have committed suicide. Severe obesity has been a very serious medical complication as a result of constant and unending hunger.  Another unwanted side effect is that people have become unable to move because of the obesity and their size. William has found in his interactions, that those who took the immortality drug are regretful and wish that they never took it. Unfortunately there is no resolve to this dilemna for these people since it is now too late. \n",
        "source": "user",
        "start_time": 589.0,
        "end_time": 627.0,
        "last_event_time": 627.0,
        "start_progress": 0.8861671469740634,
        "end_progress": 0.930835734870317
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n\nThe Lost Generations is a story about the lives of the people who were denied immortality, and how they cope with their lives.\nA specific part of the population was chosen to receive immortality and those above the age of 26 are denied that immortality. The story is told through the eyes of a man who is 28 and is part of the Lost Generations. This man who we will call William, has been happy with the result of not receiving immortality. William has watched others experience the side effects of having immortality and he is glad that he is not a part of this experiment. William is a man who is happy with his life and is content with the decision not to receive immortality. William has seen severe side effects in those who have taken the drug. The side effects have included such tiredness that people cannot function and just want to sleep as a result. Many people have experienced an appetite that cannot be satiated so they are never content with any amount of food that they consume. This is one of the more severe side effects that leaves people constantly hungry, never full and never satisfied. William has seen people who have taken the drug and have gone insane and have committed suicide. Severe obesity has been a very serious medical complication as a result of constant and unending hunger.  Another unwanted side effect is that people have become unable to move because of the obesity and their size. William has found in his interactions, that those who took the immortality drug are regretful and wish that they never took it. Unfortunately there is no resolve to this dilemna for these people since it is now too late. William remains happy and content with his natural life cycle and is grateful for the time that he does have and uses it to his full advantage. \n",
        "source": "user",
        "start_time": 630.0,
        "end_time": 671.0,
        "last_event_time": 671.0,
        "start_progress": 0.930835734870317,
        "end_progress": 1.0
    }
]