[
    {
        "text": "",
        "source": "api",
        "last_event_time": 1814.0,
        "start_time": 0.0,
        "end_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.0
    },
    {
        "text": "$What are the main arguments for supporting the concept of corporate personhood?$",
        "source": "user",
        "last_event_time": 1814.0,
        "start_time": 217.0,
        "end_time": 240.0,
        "start_progress": 0.0,
        "end_progress": 0.025969862135299775
    },
    {
        "text": "$What are the main arguments for opposing rting the concept of corporate personhood?$",
        "source": "user",
        "last_event_time": 1814.0,
        "start_time": 243.0,
        "end_time": 273.0,
        "start_progress": 0.025969862135299775,
        "end_progress": 0.0272523244629689
    },
    {
        "text": "$How does corporate personhood protect the rights of a corporationonhood?$",
        "source": "user",
        "last_event_time": 1814.0,
        "start_time": 276.0,
        "end_time": 324.0,
        "start_progress": 0.0272523244629689,
        "end_progress": 0.023725553061878808
    },
    {
        "text": "$How does corporate personhood give a corporation political poweronhood?$",
        "source": "user",
        "last_event_time": 1814.0,
        "start_time": 326.0,
        "end_time": 362.0,
        "start_progress": 0.023725553061878808,
        "end_progress": 0.023404937479961526
    },
    {
        "text": "Corporate personhood is a concept that reinvents how companies move through the political and legal world. This idea treats a corporation as if it is its own entity, treated similarly to any other individual. When it comes to the power this gives to corporations, there exists a shift in the capabilities of company versus individual, with that shift giving more power to the corporation. This can be seen through in a positior ve and negativebut when I put myself in the shoes of an owner of a corporation, I see a lot of opportunity to promote and strive towards a positive future. With the funding that corporations can provide to campaigns or charities, corporations in the United States and beyond are given power to help advocate for worthy causes. lens, hood?$",
        "source": "user",
        "last_event_time": 1814.0,
        "start_time": 365.0,
        "end_time": 720.0,
        "start_progress": 0.023404937479961526,
        "end_progress": 0.24591215133055466
    },
    {
        "text": "Corporate personhood is a concept that reinvents how companies move through the political and legal world. This idea treats a corporation as if it is its own entity, treated similarly to any other individual. When it comes to the power this gives to corporations, there exists a shift in the capabilities of company versus individual, with that shift giving more power to the corporation. This can be seen through in a positior ve and negativebut when I put myself in the shoes of an owner of a corporation, I see a lot of opportunity to promote and strive towards a positive future. With the funding that corporations can provide to campaigns or charities, corporations in the United States and beyond are given power to help advocate for worthy causes. Caution is necessary, however, as this power can undermine the democratic system that exists in this country. To this concern I propose implementing a system that guides the use of corporation power in a democratic manor. Individuals who exercise their right to vote can be given the opportunity to vote where corporate funding goes. The specifics of what this vote would look like, like if all funding is funneled toward one campaign, charity, etc. or a percentage amount of funding goes to different causes according to the voting results, is not a fully fleshed out idea, but I believe it can be made possible. The key to making corporate personhood work in a way that keeps democracy afloat would be to add some sort of checks to the power that corporations are given under this concept, like this idea of adding the opinion of the people to make corporate decisions. Companies that choose not to comply with the wants of the people also risk losing customer support, so logically, I think that companies will put their power in whatever direction attracts more customers and business activity.  lens, hood?$",
        "source": "user",
        "last_event_time": 1814.0,
        "start_time": 722.0,
        "end_time": 1269.0,
        "start_progress": 0.24591215133055466,
        "end_progress": 0.598589291439564
    },
    {
        "text": "Corporate personhood is a concept that reinvents how companies move through the political and legal world. This idea treats a corporation as if it is its own entity, treated similarly to any other individual. When it comes to the power this gives to corporations, there exists a shift in the capabilities of company versus individual, with that shift giving more power to the corporation. This can be seen through in a positior ve and negativebut when I put myself in the shoes of an owner of a corporation, I see a lot of opportunity to promote and strive towards a positive future. With the funding that corporations can provide to campaigns or charities, corporations in the United States and beyond are given power to help advocate for worthy causes. Caution is necessary, however, as this power can undermine the democratic system that exists in this country. To this concern I propose implementing a system that guides the use of corporation power in a democratic manor. Individuals who exercise their right to vote can be given the opportunity to vote where corporate funding goes. The specifics of what this vote would look like, like if all funding is funneled toward one campaign, charity, etc. or a percentage amount of funding goes to different causes according to the voting results, is not a fully fleshed out idea, but I believe it can be made possible. The key to making corporate personhood work in a way that keeps democracy afloat would be to add some sort of checks to the power that corporations are given under this concept, like this idea of adding the opinion of the people to make corporate decisions. Companies that choose not to comply with the wants of the people also risk losing customer support, so logically, I think that companies will put their power in whatever direction attracts more customers and business activity. This could create a stronger bond between consumers and corporations, promoting socially responsible business practices. lens, hood?$",
        "source": "api",
        "last_event_time": 1814.0,
        "start_time": 1323.0,
        "end_time": 1323.0,
        "start_progress": 0.598589291439564,
        "end_progress": 0.6370631612696377
    },
    {
        "text": "Corporate personhood is a concept that reinvents how companies move through the political and legal world. This idea treats a corporation as if it is its own entity, treated similarly to any other individual. When it comes to the power this gives to corporations, there exists a shift in the capabilities of company versus individual, with that shift giving more power to the corporation. This can be seen through in a positior ve and negativebut when I put myself in the shoes of an owner of a corporation, I see a lot of opportunity to promote and strive towards a positive future. With the funding that corporations can provide to campaigns or charities, corporations in the United States and beyond are given power to help advocate for worthy causes. Caution is necessary, however, as this power can undermine the democratic system that exists in this country. To this concern I propose implementing a system that guides the use of corporation power in a democratic manor. Individuals who exercise their right to vote can be given the opportunity to vote where corporate funding goes. The specifics of what this vote would look like, like if all funding is funneled toward one campaign, charity, etc. or a percentage amount of funding goes to different causes according to the voting results, is not a fully fleshed out idea, but I believe it can be made possible. The key to making corporate personhood work in a way that keeps democracy afloat would be to add some sort of checks to the power that corporations are given under this concept, like this idea of adding the opinion of the people to make corporate decisions. Companies that choose not to comply with the wants of the people also risk losing customer support, so logically, I think that companies will put their power in whatever direction attracts more customers and business activity. This could create a stronger bond between consumers and corporations, promoting socially responsible business practices. With debate on the appropriateness of corporate personhood being quite heated, people may be losing sight of how to work with the concept to benefit society as a whole rather than fighting new concepts. Advancement in society doesn't always come without risk, which the implementation o corporate personhood certainly comes with,  so we shouldn't be afraid of trying something new. Societal systems are ever-changing, and I think it's important to remember that the people have power. When corporations cross a line with the people, retaliation can and will happen, likely through the customer engagement with said corporation. If a democratic system is imposed to facilitate the use of corporate personhood, people also have the right to remember that corporations can be sued for malpractice, which possibly gives the power that corporate personhood creates right back to the people, if set up in a way to do so. Overall, I believe corporate personhood has a lot to offer society, and I look forward to seeing what comes next in terms of building a system where benefits exist for both corporations and those who engage with them.lens, hood?$",
        "source": "user",
        "last_event_time": 1814.0,
        "start_time": 1324.0,
        "end_time": 1814.0,
        "start_progress": 0.6370631612696377,
        "end_progress": 1.0
    }
]