[
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.15855404438081602
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, it is not selfish to pursue risky sports like extreme mountain climbing. People have their reasons to participating in sports like these, and i dont feel it is really our choice to determine whether this reason is selfish or not. \n",
        "source": "user",
        "start_time": 3.0,
        "end_time": 38.0,
        "last_event_time": 38.0,
        "start_progress": 0.15855404438081602,
        "end_progress": 0.24123120973514675
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, it is not selfish to pursue risky sports like extreme mountain climbing. People have their reasons to participating in sports like these, and i dont feel it is really our choice to determine whether this reason is selfish or not. \n\nThere are many reasons why people do extreme mountain climbing.\n",
        "source": "api",
        "start_time": 54.0,
        "end_time": 54.0,
        "last_event_time": 54.0,
        "start_progress": 0.24123120973514675,
        "end_progress": 0.26449534717251255
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, it is not selfish to pursue risky sports like extreme mountain climbing. People have their reasons to participating in sports like these, and i dont feel it is really our choice to determine whether this reason is selfish or not. There are probably many reasons why people do extreme mountain climbing. One of the main reasons i believe is just for that adrenaline rush or thrill. That rush is something that is more than likely thereapeutic to them. The feeling of bliss when all you are focused on is just climbing that rock, the reason being if you fall you are probably going to be seriously injured or die. I can really understand someone who is doing it for this reason because it is a way to control your mental. I have participated in sports all my life as well, and i know for a fact it is what kept my mental sane. As soon as i stopped playing football after college, i had a huge missing gap in my life. One that i had from the age of 8 all the way through 22. I have learned so much about myself and know that i needed to find that another sport that gave me that feeling. This caused me to get into boxing. Boxing gave me the same sort of adrenaline that cleared my mind and made me feel good and happy. Me personally, I would so much rather do something dangerous and scary than to be in my own head and be upset or depressed. I would rather sky dive from a plane, climb a mountain, fight a boxing match, or even run into a burning building than being in my own head and upset. So someone who does mountain climbing for the mental part of it directly correlates to my life directly. \n",
        "source": "user",
        "start_time": 58.0,
        "end_time": 448.0,
        "last_event_time": 448.0,
        "start_progress": 0.26449534717251255,
        "end_progress": 0.7304939155332856
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, it is not selfish to pursue risky sports like extreme mountain climbing. People have their reasons to participating in sports like these, and i dont feel it is really our choice to determine whether this reason is selfish or not. There are probably many reasons why people do extreme mountain climbing. One of the main reasons i believe is just for that adrenaline rush or thrill. That rush is something that is more than likely thereapeutic to them. The feeling of bliss when all you are focused on is just climbing that rock, the reason being if you fall you are probably going to be seriously injured or die. I can really understand someone who is doing it for this reason because it is a way to control your mental. I have participated in sports all my life as well, and i know for a fact it is what kept my mental sane. As soon as i stopped playing football after college, i had a huge missing gap in my life. One that i had from the age of 8 all the way through 22. I have learned so much about myself and know that i needed to find that another sport that gave me that feeling. This caused me to get into boxing. Boxing gave me the same sort of adrenaline that cleared my mind and made me feel good and happy. Me personally, I would so much rather do something dangerous and scary than to be in my own head and be upset or depressed. I would rather sky dive from a plane, climb a mountain, fight a boxing match, or even run into a burning building than being in my own head and upset. So someone who does mountain climbing for the mental part of it directly correlates to my life directly. I dont think any sort of line can be drawn for what is reasonable and not because it is completely up to that person. Whether this person is a father of four, or a twenty year old with no kids. If this person is doing the sport for a mental benefit, or benefit of any kind, i think it is not selfish. A clear head is what ultimately allows someone to be the best version of themselves. Us making the decision on what someone can and can not do because it is deemed selfish, completely takes that choice away from the individuals. So in conclusion, i feel that it is not selfish to pursue risky sports likee extreme mountain climbing. I think it would be more selfish to believe that we can make the decision for the person on whether or not they should.\n",
        "source": "user",
        "start_time": 451.0,
        "end_time": 605.0,
        "last_event_time": 605.0,
        "start_progress": 0.7304939155332856,
        "end_progress": 1.0
    }
]