[
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.21481942714819427
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, good citizens should be expected to keep reasonably informed about the news, both national and international. The ancient Greeks, who we model much of our own civilization from, judged a man a fool who did not understand the affairs of the day. \n",
        "source": "user",
        "start_time": 13.0,
        "end_time": 130.0,
        "last_event_time": 130.0,
        "start_progress": 0.21481942714819427,
        "end_progress": 0.3679950186799502
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, good citizens should be expected to keep reasonably informed about the news, both national and international. The ancient Greeks, who we model much of our own civilization from, judged a man a fool who did not understand the affairs of the day. I think that is a good standard to hold ourselves to.\n",
        "source": "api",
        "start_time": 156.0,
        "end_time": 156.0,
        "last_event_time": 156.0,
        "start_progress": 0.3679950186799502,
        "end_progress": 0.40099626400996263
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, good citizens should be expected to keep reasonably informed about the news, both national and international. The ancient Greeks, who we model much of our own civilization from, judged a man a fool who did not understand the affairs of the day. I think that is a good standard to hold ourselves to. Some might feel that they should just be left alone to mange their own business, without needing to know what is going on in the world around them.  However, nobody in modern society is an island. A well-informed population is especially important in democratic systems. \n",
        "source": "user",
        "start_time": 158.0,
        "end_time": 285.0,
        "last_event_time": 285.0,
        "start_progress": 0.40099626400996263,
        "end_progress": 0.5703611457036114
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, good citizens should be expected to keep reasonably informed about the news, both national and international. The ancient Greeks, who we model much of our own civilization from, judged a man a fool who did not understand the affairs of the day. I think that is a good standard to hold ourselves to. Some might feel that they should just be left alone to mange their own business, without needing to know what is going on in the world around them.  However, nobody in modern society is an island. A well-informed population is especially important in democratic systems. If people are not informed, they cannot make informed decisions about who to vote for, or what laws to support.\n",
        "source": "api",
        "start_time": 304.0,
        "end_time": 304.0,
        "last_event_time": 304.0,
        "start_progress": 0.5703611457036114,
        "end_progress": 0.6394769613947696
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, good citizens should be expected to keep reasonably informed about the news, both national and international. The ancient Greeks, who we model much of our own civilization from, judged a man a fool who did not understand the affairs of the day. I think that is a good standard to hold ourselves to. Some might feel that they should just be left alone to mange their own business, without needing to know what is going on in the world around them.  However, nobody in modern society is an island. A well-informed population is especially important in democratic systems. If people are not informed, they cannot make informed decisions about who to vote for, or what laws to support. The morality and justness of a democracy hinges on the population making reasonable and informed decisions. In this light we can see that it is selfish and dangerous to allow ourselves to be ignorant of the news. Society only works when people are responsible not only for themselves but for each other and for the community as a whole. We can only act to help our community when we are educated about the issues it faces. For these reasons we must all take the responsibility to learn the news and to understand it. In this way we can move together wisely into a better world. \n",
        "source": "user",
        "start_time": 306.0,
        "end_time": 661.0,
        "last_event_time": 661.0,
        "start_progress": 0.6394769613947696,
        "end_progress": 1.0
    }
]