[
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.19810576164167323
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike \n",
        "source": "user",
        "start_time": 9.0,
        "end_time": 13.0,
        "last_event_time": 13.0,
        "start_progress": 0.19810576164167323,
        "end_progress": 0.2067876874506709
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike the portrayal of the \"evil\" stepmother in fairy tales.\n",
        "source": "api",
        "start_time": 23.0,
        "end_time": 23.0,
        "last_event_time": 23.0,
        "start_progress": 0.2067876874506709,
        "end_progress": 0.2494080505130229
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike the portrayal of the \"evil\" stepmother in fairy tales. I think it is one of the worst villains\n",
        "source": "user",
        "start_time": 62.0,
        "end_time": 75.0,
        "last_event_time": 75.0,
        "start_progress": 0.250197316495659,
        "end_progress": 0.2809786898184688
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike the portrayal of the \"evil\" stepmother in fairy tales. I think it is one of the worst villains in literature.\n",
        "source": "api",
        "start_time": 80.0,
        "end_time": 80.0,
        "last_event_time": 80.0,
        "start_progress": 0.2809786898184688,
        "end_progress": 0.292817679558011
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike the portrayal of the \"evil\" stepmother in fairy tales. I think it is one of the worst villains in literature. This character requires a fundamental type of cruelty that is hard for someone like me to understand. \n",
        "source": "user",
        "start_time": 81.0,
        "end_time": 100.0,
        "last_event_time": 100.0,
        "start_progress": 0.292817679558011,
        "end_progress": 0.3741120757695343
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike the portrayal of the \"evil\" stepmother in fairy tales. I think it is one of the worst villains in literature. This character requires a fundamental type of cruelty that is hard for someone like me to understand. I can't imagine being so cruel to someone else's child.\n",
        "source": "api",
        "start_time": 163.0,
        "end_time": 163.0,
        "last_event_time": 163.0,
        "start_progress": 0.3741120757695343,
        "end_progress": 0.4175217048145225
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike the portrayal of the \"evil\" stepmother in fairy tales. I think it is one of the worst villains in literature. This character requires a fundamental type of cruelty that is hard for someone like me to understand. I can't imagine being so cruel to someone else's child. It makes this villain one of the worst stereoptypes. \n",
        "source": "user",
        "start_time": 165.0,
        "end_time": 180.0,
        "last_event_time": 180.0,
        "start_progress": 0.4175217048145225,
        "end_progress": 0.4601420678768745
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike the portrayal of the \"evil\" stepmother in fairy tales. I think it is one of the worst villains in literature. This character requires a fundamental type of cruelty that is hard for someone like me to understand. I can't imagine being so cruel to someone else's child. It makes this villain one of the worst stereotypes.  This is probably what makes them so interesting in a story though. \n",
        "source": "user",
        "start_time": 182.0,
        "end_time": 199.0,
        "last_event_time": 199.0,
        "start_progress": 0.4601420678768745,
        "end_progress": 0.5130228887134964
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike the portrayal of the \"evil\" stepmother in fairy tales. I think it is one of the worst villains in literature. This character requires a fundamental type of cruelty that is hard for someone like me to understand. I can't imagine being so cruel to someone else's child. It makes this villain one of the worst stereotypes.  This is probably what makes them so interesting in a story though. They are so evil that they are fascinating.\n",
        "source": "api",
        "start_time": 230.0,
        "end_time": 230.0,
        "last_event_time": 230.0,
        "start_progress": 0.5130228887134964,
        "end_progress": 0.5469613259668509
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike the portrayal of the \"evil\" stepmother in fairy tales. I think it is one of the worst villains in literature. This character requires a fundamental type of cruelty that is hard for someone like me to understand. I can't imagine being so cruel to someone else's child. It makes this villain one of the worst stereotypes.  This is probably what makes them so interesting in a story though. They are so evil that they are fascinating. And they give the story lots of ups and downs and twists and turns. \n",
        "source": "user",
        "start_time": 232.0,
        "end_time": 279.0,
        "last_event_time": 279.0,
        "start_progress": 0.5469613259668509,
        "end_progress": 0.601420678768745
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike the portrayal of the \"evil\" stepmother in fairy tales. I think it is one of the worst villains in literature. This character requires a fundamental type of cruelty that is hard for someone like me to understand. I can't imagine being so cruel to someone else's child. It makes this villain one of the worst stereotypes.  This is probably what makes them so interesting in a story though. They are so evil that they are fascinating. And they give the story lots of ups and downs and twists and turns. Their evil nature and undertakings make the main character so much more likable.  \n",
        "source": "user",
        "start_time": 281.0,
        "end_time": 332.0,
        "last_event_time": 332.0,
        "start_progress": 0.601420678768745,
        "end_progress": 0.6661404893449092
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike the portrayal of the \"evil\" stepmother in fairy tales. I think it is one of the worst villains in literature. This character requires a fundamental type of cruelty that is hard for someone like me to understand. I can't imagine being so cruel to someone else's child. It makes this villain one of the worst stereotypes.  This is probably what makes them so interesting in a story though. They are so evil that they are fascinating. And they give the story lots of ups and downs and twists and turns. Their evil nature and undertakings make the main character so much more likable.  The good versus evil theme is prevalent in most stories. \n",
        "source": "user",
        "start_time": 334.0,
        "end_time": 415.0,
        "last_event_time": 415.0,
        "start_progress": 0.6661404893449092,
        "end_progress": 0.7111286503551697
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike the portrayal of the \"evil\" stepmother in fairy tales. I think it is one of the worst villains in literature. This character requires a fundamental type of cruelty that is hard for someone like me to understand. I can't imagine being so cruel to someone else's child. It makes this villain one of the worst stereotypes.  This is probably what makes them so interesting in a story though. They are so evil that they are fascinating. And they give the story lots of ups and downs and twists and turns. Their evil nature and undertakings make the main character so much more likable.  The good versus evil theme is prevalent in most stories. It is what makes the story interesting.\n",
        "source": "api",
        "start_time": 422.0,
        "end_time": 422.0,
        "last_event_time": 422.0,
        "start_progress": 0.7111286503551697,
        "end_progress": 0.7419100236779794
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike the portrayal of the \"evil\" stepmother in fairy tales. I think it is one of the worst villains in literature. This character requires a fundamental type of cruelty that is hard for someone like me to understand. I can't imagine being so cruel to someone else's child. It makes this villain one of the worst stereotypes.  This is probably what makes them so interesting in a story though. They are so evil that they are fascinating. And they give the story lots of ups and downs and twists and turns. Their evil nature and undertakings make the main character so much more likable.  The good versus evil theme is prevalent in most stories. It is what makes the story interesting. Still it is very hard to watch a story that centers around family abuse. \n",
        "source": "user",
        "start_time": 446.0,
        "end_time": 458.0,
        "last_event_time": 458.0,
        "start_progress": 0.7419100236779794,
        "end_progress": 0.8003157063930545
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike the portrayal of the \"evil\" stepmother in fairy tales. I think it is one of the worst villains in literature. This character requires a fundamental type of cruelty that is hard for someone like me to understand. I can't imagine being so cruel to someone else's child. It makes this villain one of the worst stereotypes.  This is probably what makes them so interesting in a story though. They are so evil that they are fascinating. And they give the story lots of ups and downs and twists and turns. Their evil nature and undertakings make the main character so much more likable.  The good versus evil theme is prevalent in most stories. It is what makes the story interesting. Still it is very hard to watch a story that centers around family abuse. It is hard to watch a story that centers around abuse of any kind.\n",
        "source": "api",
        "start_time": 463.0,
        "end_time": 463.0,
        "last_event_time": 463.0,
        "start_progress": 0.8003157063930545,
        "end_progress": 0.8524072612470402
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike the portrayal of the \"evil\" stepmother in fairy tales. I think it is one of the worst villains in literature. This character requires a fundamental type of cruelty that is hard for someone like me to understand. I can't imagine being so cruel to someone else's child. It makes this villain one of the worst stereotypes.  This is probably what makes them so interesting in a story though. They are so evil that they are fascinating. And they give the story lots of ups and downs and twists and turns. Their evil nature and undertakings make the main character so much more likable.  The good versus evil theme is prevalent in most stories. It is what makes the story interesting. Still it is very hard to watch a story that centers around family abuse. It is hard to watch a story that centers around abuse of any kind. I think that is why I don't like the portrayal of the evil stepmother.\n",
        "source": "api",
        "start_time": 525.0,
        "end_time": 525.0,
        "last_event_time": 525.0,
        "start_progress": 0.8531965272296764,
        "end_progress": 0.9084451460142068
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I dislike the portrayal of the \"evil\" stepmother in fairy tales. I think it is one of the worst villains in literature. This character requires a fundamental type of cruelty that is hard for someone like me to understand. I can't imagine being so cruel to someone else's child. It makes this villain one of the worst stereotypes.  This is probably what makes them so interesting in a story though. They are so evil that they are fascinating. And they give the story lots of ups and downs and twists and turns. Their evil nature and undertakings make the main character so much more likable.  The good versus evil theme is prevalent in most stories. It is what makes the story interesting. Still it is very hard to watch a story that centers around family abuse. It is hard to watch a story that centers around abuse of any kind. I think that is why I don't like the portrayal of the evil stepmother. But it is something that really makes the main character shine and turn them more toward doing good in their life. \n",
        "source": "user",
        "start_time": 562.0,
        "end_time": 589.0,
        "last_event_time": 589.0,
        "start_progress": 0.909234411996843,
        "end_progress": 1.0
    }
]