[
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.18691588785046728
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology actually helps with dating these days.\n",
        "source": "user",
        "start_time": 24.0,
        "end_time": 57.0,
        "last_event_time": 57.0,
        "start_progress": 0.18691588785046728,
        "end_progress": 0.2115100836202656
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology actually helps with dating these days. It's a lot easier to meet people and get to know them before you actually meet them.\n",
        "source": "api",
        "start_time": 78.0,
        "end_time": 78.0,
        "last_event_time": 78.0,
        "start_progress": 0.2115100836202656,
        "end_progress": 0.2533202164289228
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology actually helps with dating these days. It's a lot easier to meet people and get to know them before you actually meet them. I know I am very busy with work and don't have the kind of schedule that lends itself to meeting people in bars and such. Dating apps make it possible for me to meet other people that want to meet people without all the awkward fuss of going to a smelly bar.\n",
        "source": "user",
        "start_time": 82.0,
        "end_time": 151.0,
        "last_event_time": 151.0,
        "start_progress": 0.2533202164289228,
        "end_progress": 0.3807181505164781
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology actually helps with dating these days. It's a lot easier to meet people and get to know them before you actually meet them. I know I am very busy with work and don't have the kind of schedule that lends itself to meeting people in bars and such. Dating apps make it possible for me to meet other people that want to meet people without all the awkward fuss of going to a smelly bar.\n\nI also think that technology has made it easier to keep in touch with people and maintain relationships.\n",
        "source": "api",
        "start_time": 164.0,
        "end_time": 164.0,
        "last_event_time": 164.0,
        "start_progress": 0.3807181505164781,
        "end_progress": 0.4328578455484506
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology actually helps with dating these days. It's a lot easier to meet people and get to know them before you actually meet them. I know I am very busy with work and don't have the kind of schedule that lends itself to meeting people in bars and such. Dating apps make it possible for me to meet other people that want to meet people without all the awkward fuss of going to a smelly bar. I also think that technology has made it easier to keep in touch with people and maintain relationships. In some it's sometimes necessary to\n",
        "source": "user",
        "start_time": 169.0,
        "end_time": 287.0,
        "last_event_time": 287.0,
        "start_progress": 0.4328578455484506,
        "end_progress": 0.4500737825873094
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology actually helps with dating these days. It's a lot easier to meet people and get to know them before you actually meet them. I know I am very busy with work and don't have the kind of schedule that lends itself to meeting people in bars and such. Dating apps make it possible for me to meet other people that want to meet people without all the awkward fuss of going to a smelly bar. I also think that technology has made it easier to keep in touch with people and maintain relationships. In some it's sometimes necessary to keep in touch with people via text or social media because they are not in the same city or even country.\n",
        "source": "api",
        "start_time": 305.0,
        "end_time": 305.0,
        "last_event_time": 305.0,
        "start_progress": 0.4500737825873094,
        "end_progress": 0.5022134776192818
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology actually helps with dating these days. It's a lot easier to meet people and get to know them before you actually meet them. I know I am very busy with work and don't have the kind of schedule that lends itself to meeting people in bars and such. Dating apps make it possible for me to meet other people that want to meet people without all the awkward fuss of going to a smelly bar. I also think that technology has made it easier to keep in touch with people and maintain relationships. In some relationships it's sometimes necessary to keep in touch with people via text or social media because they are not in the same city or even country. My partner had to travel for 3 weeks one time and being in contact through technology made it much easier. Another reason I think technology is good for dating is\n",
        "source": "user",
        "start_time": 312.0,
        "end_time": 369.0,
        "last_event_time": 369.0,
        "start_progress": 0.5022134776192818,
        "end_progress": 0.5892769306443679
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology actually helps with dating these days. It's a lot easier to meet people and get to know them before you actually meet them. I know I am very busy with work and don't have the kind of schedule that lends itself to meeting people in bars and such. Dating apps make it possible for me to meet other people that want to meet people without all the awkward fuss of going to a smelly bar. I also think that technology has made it easier to keep in touch with people and maintain relationships. In some relationships it's sometimes necessary to keep in touch with people via text or social media because they are not in the same city or even country. My partner had to travel for 3 weeks one time and being in contact through technology made it much easier. Another reason I think technology is good for dating is because it's easier to get to know people before you meet them.\n",
        "source": "api",
        "start_time": 380.0,
        "end_time": 380.0,
        "last_event_time": 380.0,
        "start_progress": 0.5892769306443679,
        "end_progress": 0.6207575012297097
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology actually helps with dating these days. It's a lot easier to meet people and get to know them before you actually meet them. I know I am very busy with work and don't have the kind of schedule that lends itself to meeting people in bars and such. Dating apps make it possible for me to meet other people that want to meet people without all the awkward fuss of going to a smelly bar. I also think that technology has made it easier to keep in touch with people and maintain relationships. In some relationships it's sometimes necessary to keep in touch with people via text or social media because they are not in the same city or even country. My partner had to travel for 3 weeks one time and being in contact through technology made it much easier. Another reason I think technology is good for dating is because it's easier to get to know people before you meet them. This means you can chat through the technology and find out enough about them before risking a miserable mismatched first date. If you don't hit it off right away, no hard feelings, AND you don't have to be all weird with them in person. The last reason I think tech and dating apps are good for dating and relationships is\n",
        "source": "user",
        "start_time": 383.0,
        "end_time": 549.0,
        "last_event_time": 549.0,
        "start_progress": 0.6207575012297097,
        "end_progress": 0.780127889818003
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology actually helps with dating these days. It's a lot easier to meet people and get to know them before you actually meet them. I know I am very busy with work and don't have the kind of schedule that lends itself to meeting people in bars and such. Dating apps make it possible for me to meet other people that want to meet people without all the awkward fuss of going to a smelly bar. I also think that technology has made it easier to keep in touch with people and maintain relationships. In some relationships it's sometimes necessary to keep in touch with people via text or social media because they are not in the same city or even country. My partner had to travel for 3 weeks one time and being in contact through technology made it much easier. Another reason I think technology is good for dating is because it's easier to get to know people before you meet them. This means you can chat through the technology and find out enough about them before risking a miserable mismatched first date. If you don't hit it off right away, no hard feelings, AND you don't have to be all weird with them in person. The last reason I think tech and dating apps are good for dating and relationships is because it's easier to find people who are looking for the same thing you are.\n",
        "source": "api",
        "start_time": 584.0,
        "end_time": 584.0,
        "last_event_time": 584.0,
        "start_progress": 0.780127889818003,
        "end_progress": 0.8189867191342843
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology actually helps with dating these days. It's a lot easier to meet people and get to know them before you actually meet them. I know I am very busy with work and don't have the kind of schedule that lends itself to meeting people in bars and such. Dating apps make it possible for me to meet other people that want to meet people without all the awkward fuss of going to a smelly bar. I also think that technology has made it easier to keep in touch with people and maintain relationships. In some relationships it's sometimes necessary to keep in touch with people via text or social media because they are not in the same city or even country. My partner had to travel for 3 weeks one time and being in contact through technology made it much easier. Another reason I think technology is good for dating is because it's easier to get to know people before you meet them. This means you can chat through the technology and find out enough about them before risking a miserable mismatched first date. If you don't hit it off right away, no hard feelings, AND you don't have to be all weird with them in person. The last reason I think tech and dating apps are good for dating and relationships is because it's easier to find people who are looking for the same thing you are. I just feel like when meeting people out in public it's really hard to know who is actually looking for something with substance.  With a dating app, you can learn what the person is looking for in a date instead of having to try and read their mind. There really are lots of benefits of technology when it comes to dating and that is why I think it improves romance.\n",
        "source": "user",
        "start_time": 587.0,
        "end_time": 746.0,
        "last_event_time": 746.0,
        "start_progress": 0.8189867191342843,
        "end_progress": 1.0
    }
]