[
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.13462214411247803
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons. I am not a female, however i cant imagine what it would feel like to be trapped in school on your period that suddenly popped up, without any sort of tampon or pad. Especially a middle school girl who may not even know what is going on down there.  At this age, i think schools should do their best to make sure that the girls are supported in this way. Schools can be rough, and it would stink to have a girl get made fun of for something like this she could not control. Im not saying that you need to put the pads or tampons in a vending machine or something like that, but i think every school nurse should have them to hand out in case a girl needs them. I would say that pads and tampons are similar to toilet paper, soap, and band aids because they are all essential type of products. What is a girl suppose to do if there were no such thing as tampons. She would probably have to just stick toilet paper or something in there. I dont think tampons and pads are overly expensive so there is really no reason why schools wouldnt be able to provide them and just buy them in bulk. \n",
        "source": "user",
        "start_time": 13.0,
        "end_time": 208.0,
        "last_event_time": 208.0,
        "start_progress": 0.13462214411247803,
        "end_progress": 0.5328646748681898
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons. I am not a female, however i cant imagine what it would feel like to be trapped in school on your period that suddenly popped up, without any sort of tampon or pad. Especially a middle school girl who may not even know what is going on down there.  At this age, i think schools should do their best to make sure that the girls are supported in this way. Schools can be rough, and it would stink to have a girl get made fun of for something like this she could not control. Im not saying that you need to put the pads or tampons in a vending machine or something like that, but i think every school nurse should have them to hand out in case a girl needs them. I would say that pads and tampons are similar to toilet paper, soap, and band aids because they are all essential type of products. What is a girl suppose to do if there were no such thing as tampons. She would probably have to just stick toilet paper or something in there. I dont think tampons and pads are overly expensive so there is really no reason why schools wouldnt be able to provide them and just buy them in bulk. If a school is even thinking about providing something like condoms, then they ought to have something like tampons. I just always think of the worst situation possible when it comes to these sorts of things, and i think of a girl who is thinking about just leaving school after something like this happens. I think of a girl who may bleed through her clothes and has nothing to change into. I know things like this must have happened before, so why not have a tampon that the girl can use to feel better and maybe even a change of pants. \n",
        "source": "user",
        "start_time": 225.0,
        "end_time": 360.0,
        "last_event_time": 360.0,
        "start_progress": 0.5328646748681898,
        "end_progress": 0.7223198594024605
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons. I am not a female, however i cant imagine what it would feel like to be trapped in school on your period that suddenly popped up, without any sort of tampon or pad. Especially a middle school girl who may not even know what is going on down there.  At this age, i think schools should do their best to make sure that the girls are supported in this way. Schools can be rough, and it would stink to have a girl get made fun of for something like this she could not control. Im not saying that you need to put the pads or tampons in a vending machine or something like that, but i think every school nurse should have them to hand out in case a girl needs them. I would say that pads and tampons are similar to toilet paper, soap, and band aids because they are all essential type of products. What is a girl suppose to do if there were no such thing as tampons. She would probably have to just stick toilet paper or something in there. I dont think tampons and pads are overly expensive so there is really no reason why schools wouldnt be able to provide them and just buy them in bulk. If a school is even thinking about providing something like condoms, then they ought to have something like tampons. I just always think of the worst situation possible when it comes to these sorts of things, and i think of a girl who is thinking about just leaving school after something like this happens. I think of a girl who may bleed through her clothes and has nothing to change into. I know things like this must have happened before, so why not have a tampon that the girl can use to feel better and maybe even a change of pants. This would make a girl feel completely supported and really lessen the negative feeling associated with that day. It is a completely natural thing that happens, and they should not have to feel sorry for themselves about the situation. I would think most girls nowadays know about periods before they happen, but it would still be nice to be prepared. Thats a positive about social media i guess is that nothing is hidden. Young kids know about all of these things long before they become adults, so they are sort of desensitized to it. But i am sure there is still that one young girl who has been coddled and protected who would be completely thrown off when she sees blood down there. So in conclusion, i personally feel that tampons and pads should both be provided in schools for free.\n",
        "source": "user",
        "start_time": 400.0,
        "end_time": 600.0,
        "last_event_time": 600.0,
        "start_progress": 0.7223198594024605,
        "end_progress": 1.0
    }
]