[
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.22127872127872128
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, there is no sport that is too dangerous to be called a sport. At least not that I know of. At the end of the day, there shouldn't be a line.\n\nFootball isn't really considered an extreme sport but there are many who won't let their children play due to the risks involved. I totally understand that point of view. \n\nSo in reality, I think we all just draw our own lines in that situation. Some people are thrill seekers. Some people like myself are afraid to take risks.\n\nHow are we supposed to tell other people what decisions are right and wrong for them to make? We are all adults. We all have the freedom to make our own decisions. \n\nThere are people that love to go sky diving. They know the risks of sky diving going in. They weigh those risks and think that the reward is greater than the risk. For me, the risk would be way too much. You'll never catch me diving out of a plane.\n\nFootball, basketball, hockey, baseball, snowboarding, skateboarding, etc. All of those sports are fine IMO. Ultimate Fighting is fine. We all get to decide what is too extreme for us personally, but we can't decide that for others. \n\nExtreme Mountain Climbing is dangerous. You can't prevent people from doing it. Climbing Mount Everest can lead to death because of how difficult it is. Everyone who goes to climb it knows that. Risk is sometimes what drives those people to take on those difficult tasks. They live for the adrenaline. \n\nWe all make our own decisions and that's part of what makes life great. That can't be changed, especially for something like sports. \n",
        "source": "user",
        "start_time": 4.0,
        "end_time": 555.0,
        "last_event_time": 555.0,
        "start_progress": 0.22127872127872128,
        "end_progress": 1.0
    }
]