[
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.20127659574468085
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion, we shouldn't be too worried about excessive screen use right now. Digital devices have many benefits for both individuals and society as a whole. Can screen use get out of hand? Sure. If you are driving and looking at your phone to check your text messages, there's an issue. Luckily, there are laws that ban that and consequences come from that action.\n\nWhen I think about screens, I think about the enjoyment that I get when I come home from work and can relax by watching my favorite television program. I think about having the ability to use my GPS whenever I am lost or am trying to find the quickest route to a place. I think about the ability to communicate via FaceTime with my family in Italy.\n\nThere is also the ability to just text a family member or friend and be able to get that message to them near instantly. Without screen time the Coronavirus pandemic would have been terrible. What would we have done if we were stuck inside, not able to go out and see friends and family and also didn't have a television or the internet?\n\nI think people would have went insane. I personally know that most of my time during the pandemic was spent using the internet, watching sports and playing video games. There simply wasn't anything else to do.\n\nI really think we need to appreciate just how much screens have benefited us. Talk to an elderly person and ask them how beneficial the invention of the television was. Just think about how our lives would be affected without the internet. Think about how many people wouldn't have a job.\n\nScreen time can get out of control but I think most humans have enough discipline to not go overboard. We use our phones and screens for entertainment purposes. That entertainment doesn't change the fact that most of us are responsible adults with jobs and families that are our top priority and what we really value in this world.\n",
        "source": "user",
        "start_time": 32.0,
        "end_time": 549.0,
        "last_event_time": 549.0,
        "start_progress": 0.20127659574468085,
        "end_progress": 1.0
    }
]