[
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.2289405684754522
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the line really depends on the person. Some people will have an opinion that extreme sports are way too dangerous and other people will have an opinion that nothing is too dangerous. I personally would never participate in an extreme sport. I do not like taking risks at all. I don't even fly in an airplane. There's no way that I'm going to participate in a sport where there is serious risk at injury.\n\nHowever, I understand that there are other people who are adrenaline junkies. Some people love to go sky diving for example. They live for that thrill. While I think those people are out of their minds, they truly love it.\n\nI don't think there really is a line. Ultimately we all make individual choices. If someone asks me to go sky diving, I make the choice to say no. Just like they make the choice to say yes.\n\nSo I don't think any sport is too dangerous to be called a sport. At least I don't know of one. You can break your bones skiing or snowboarding and I consider those sports. You can break your bones playing football and hockey. Those are considered sports by basically everyone.\n\nSo again, we all make our own lines. What I consider to be too dangerous many others wouldn't consider to be dangerous at all. That's what makes humans great though. We are all different in so many different ways.\n\nYou draw your line when it comes to extreme sports. Ultimately, everyone should do what makes them happy. I am happy not taking risks. If you are happy taking risks, go for it.\n\n",
        "source": "user",
        "start_time": 23.0,
        "end_time": 547.0,
        "last_event_time": 547.0,
        "start_progress": 0.2289405684754522,
        "end_progress": 1.0
    }
]