[
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.19794459338695264
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, one decides where the line may be drawn based off of their own personality and thoughts. I can't tell you what is too extreme or too dangerous when it comes to sports and vice versa. \n\nI am afraid of getting hurt and therefore don't really put myself in situations for that to happen. You won't catch me going extreme mountain climbing, snowboarding, skiing or anything like that. \n\nI am a boots on the ground person. I'm not a risk taker and think that people who are adrenaline junkies and seek risks are nuts. But I'm not going to tell them that they can't jump out of a plane and they can't ski down an extremely steep mountain/slope. At the end of the day, we all make choices and decisions in our life and we have the freedom to live the way that we want to. I don't have the right to define what danger is for other people.\n\nI don't think any sport is too dangerous to be called a sport. Boxing and MMA are two of the most popular sports in the world and they feature blood and knockouts all the time. Those fighters know what they are signing up for and most of them love the competition. \n\nExtreme is a word that doesn't have a concrete definition. What's extreme for a certain portion of people is normal for others. Hence why there is no line that needs to be drawn.\n\nThe only time I think a line should be drawn is as a parent. If you as a parent don't feel comfortable with your child playing football for example due to fears of concussions and broken bones, that is entirely your right. Your priority as a parent is to keep your child safe. You get to draw that line. \n\nWhen it comes to extreme sports, there's no such thing as something that is too extreme for the general population. This world is great because we get to make our own decisions and live with the consequences. \n",
        "source": "user",
        "start_time": 33.0,
        "end_time": 554.0,
        "last_event_time": 554.0,
        "start_progress": 0.19794459338695264,
        "end_progress": 1.0
    }
]