[
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.25205684367988035
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important things students should learn in school are to be able to think critically, to be able to communicate effectively, and to be able to work\n",
        "source": "api",
        "start_time": 41.0,
        "end_time": 41.0,
        "last_event_time": 41.0,
        "start_progress": 0.25280478683620045,
        "end_progress": 0.368735976065819
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important things students should learn in school are to be able to think critically, to be able to communicate effectively, and to be able to work with others,  Obviously, students should come out of school with the basics, Math, English skills, and some History.  Also, they need to learn the skills to pursue the career that they want.\n",
        "source": "user",
        "start_time": 49.0,
        "end_time": 201.0,
        "last_event_time": 201.0,
        "start_progress": 0.368735976065819,
        "end_progress": 0.5115931189229619
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important things students should learn in school are to be able to think critically, to be able to communicate effectively, and to be able to work with others,  Obviously, students should come out of school with the basics, Math, English skills, and some History.  Also, they need to learn the skills to pursue the career that they want.  After this, however, \n",
        "source": "user",
        "start_time": 206.0,
        "end_time": 245.0,
        "last_event_time": 245.0,
        "start_progress": 0.5115931189229619,
        "end_progress": 0.5287958115183246
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important things students should learn in school are to be able to think critically, to be able to communicate effectively, and to be able to work with others,  Obviously, students should come out of school with the basics, Math, English skills, and some History.  Also, they need to learn the skills to pursue the career that they want.  After this, however, they need to be able to think critically.\n",
        "source": "api",
        "start_time": 263.0,
        "end_time": 263.0,
        "last_event_time": 263.0,
        "start_progress": 0.5287958115183246,
        "end_progress": 0.5594614809274495
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important things students should learn in school are to be able to think critically, to be able to communicate effectively, and to be able to work with others,  Obviously, students should come out of school with the basics, Math, English skills, and some History.  Also, they need to learn the skills to pursue the career that they want.  After this, however, they need to be able to think critically.   This skill allow people to function as independent, productive and responsible members of the public.  \n",
        "source": "user",
        "start_time": 264.0,
        "end_time": 322.0,
        "last_event_time": 322.0,
        "start_progress": 0.5594614809274495,
        "end_progress": 0.6387434554973822
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important things students should learn in school are to be able to think critically, to be able to communicate effectively, and to be able to work with others,  Obviously, students should come out of school with the basics, Math, English skills, and some History.  Also, they need to learn the skills to pursue the career that they want.  After this, however, they need to be able to think critically.   This skill allow people to function as independent, productive and responsible members of the public.  They need to be able to think for themselves, and not just accept what they are told.\n",
        "source": "api",
        "start_time": 343.0,
        "end_time": 343.0,
        "last_event_time": 343.0,
        "start_progress": 0.6387434554973822,
        "end_progress": 0.7023186237845924
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important things students should learn in school are to be able to think critically, to be able to communicate effectively, and to be able to work with others,  Obviously, students should come out of school with the basics, Math, English skills, and some History.  Also, they need to learn the skills to pursue the career that they want.  After this, however, they need to be able to think critically.   This skill allow people to function as independent, productive and responsible members of the public.  They need to be able to think for themselves, and not just accept what they are told.  A functioning democracy requires it population to understand what is going on in the world and make the proper decisions, and hold their leaders to account.  \n",
        "source": "user",
        "start_time": 348.0,
        "end_time": 415.0,
        "last_event_time": 415.0,
        "start_progress": 0.7023186237845924,
        "end_progress": 0.8219895287958116
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important things students should learn in school are to be able to think critically, to be able to communicate effectively, and to be able to work with others,  Obviously, students should come out of school with the basics, Math, English skills, and some History.  Also, they need to learn the skills to pursue the career that they want.  After this, however, they need to be able to think critically.   This skill allow people to function as independent, productive and responsible members of the public.  They need to be able to think for themselves, and not just accept what they are told.  A functioning democracy requires it population to understand what is going on in the world and make the proper decisions, and hold their leaders to account.  Thining critiacally\n",
        "source": "user",
        "start_time": 438.0,
        "end_time": 484.0,
        "last_event_time": 484.0,
        "start_progress": 0.8219895287958116,
        "end_progress": 0.8362004487658938
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important things students should learn in school are to be able to think critically, to be able to communicate effectively, and to be able to work with others,  Obviously, students should come out of school with the basics, Math, English skills, and some History.  Also, they need to learn the skills to pursue the career that they want.  After this, however, they need to be able to think critically.   This skill allow people to function as independent, productive and responsible members of the public.  They need to be able to think for themselves, and not just accept what they are told.  A functioning democracy requires it population to understand what is going on in the world and make the proper decisions, and hold their leaders to account.  Thinking critically\n",
        "source": "user",
        "start_time": 488.0,
        "end_time": 495.0,
        "last_event_time": 495.0,
        "start_progress": 0.8362004487658938,
        "end_progress": 0.8362004487658938
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important things students should learn in school are to be able to think critically, to be able to communicate effectively, and to be able to work with others,  Obviously, students should come out of school with the basics, Math, English skills, and some History.  Also, they need to learn the skills to pursue the career that they want.  After this, however, they need to be able to think critically.   This skill allow people to function as independent, productive and responsible members of the public.  They need to be able to think for themselves, and not just accept what they are told.  A functioning democracy requires it population to understand what is going on in the world and make the proper decisions, and hold their leaders to account.  Critical thinking \n",
        "source": "user",
        "start_time": 511.0,
        "end_time": 533.0,
        "last_event_time": 533.0,
        "start_progress": 0.8362004487658938,
        "end_progress": 0.8354525056095736
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important things students should learn in school are to be able to think critically, to be able to communicate effectively, and to be able to work with others,  Obviously, students should come out of school with the basics, Math, English skills, and some History.  Also, they need to learn the skills to pursue the career that they want.  After this, however, they need to be able to think critically.   This skill allow people to function as independent, productive and responsible members of the public.  They need to be able to think for themselves, and not just accept what they are told.  A functioning democracy requires it population to understand what is going on in the world and make the proper decisions, and hold their leaders to account.  Critical thinking means people won't be taken advantage of, will see things as they truly are, \n",
        "source": "user",
        "start_time": 536.0,
        "end_time": 570.0,
        "last_event_time": 570.0,
        "start_progress": 0.8354525056095736,
        "end_progress": 0.8930441286462228
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important things students should learn in school are to be able to think critically, to be able to communicate effectively, and to be able to work with others,  Obviously, students should come out of school with the basics, Math, English skills, and some History.  Also, they need to learn the skills to pursue the career that they want.  After this, however, they need to be able to think critically.   This skill allow people to function as independent, productive and responsible members of the public.  They need to be able to think for themselves, and not just accept what they are told.  A functioning democracy requires it population to understand what is going on in the world and make the proper decisions, and hold their leaders to account.  Critical thinking means people won't be taken advantage of, will see things as they truly are, and will be able to make informed decisions.\n",
        "source": "api",
        "start_time": 578.0,
        "end_time": 578.0,
        "last_event_time": 578.0,
        "start_progress": 0.8930441286462228,
        "end_progress": 0.9259536275243081
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important things students should learn in school are to be able to think critically, to be able to communicate effectively, and to be able to work with others,  Obviously, students should come out of school with the basics, Math, English skills, and some History.  Also, they need to learn the skills to pursue the career that they want.  After this, however, they need to be able to think critically.   This skill allow people to function as independent, productive and responsible members of the public.  They need to be able to think for themselves, and not just accept what they are told.  A functioning democracy requires it population to understand what is going on in the world and make the proper decisions, and hold their leaders to account.  Critical thinking means people won't be taken advantage of, will see things as they truly are, and will be able to make informed decisions.   This is the most important thing students should learn in school.\n",
        "source": "api",
        "start_time": 596.0,
        "end_time": 596.0,
        "last_event_time": 596.0,
        "start_progress": 0.9274495138369484,
        "end_progress": 0.9768137621540763
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important thing students should learn in school is to be able to think critically. Obviously, students should come out of school with the basics, Math, English skills, and some History.  Also, they need to learn the skills to pursue the career that they want.  After this, however, they need to be able to think critically.   This skill allows people to function as independent, productive and responsible members of the public.  They need to be able to think for themselves, and not just accept what they are told.  A functioning democracy requires its population to understand what is going on in the world and make the proper decisions, and hold their leaders to account.  Critical thinking means people won't be taken advantage of, will see things as they truly are, and will be able to make informed decisions.   This is the most important thing students should learn in school, and every lesson taught, whether math, science, social studies, should have an element of this life skill.\n",
        "source": "user",
        "start_time": 600.0,
        "end_time": 740.0,
        "last_event_time": 740.0,
        "start_progress": 0.9768137621540763,
        "end_progress": 1.0
    }
]