[
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.2005952380952381
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important thing in school that I learned was how to reason and use logical thought. \n",
        "source": "user",
        "start_time": 10.0,
        "end_time": 38.0,
        "last_event_time": 38.0,
        "start_progress": 0.2005952380952381,
        "end_progress": 0.256547619047619
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important thing in school that I learned was how to reason and use logical thought. I learned how to think critically and how to apply logic to everyday situations.\n",
        "source": "api",
        "start_time": 63.0,
        "end_time": 63.0,
        "last_event_time": 63.0,
        "start_progress": 0.256547619047619,
        "end_progress": 0.30416666666666664
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important thing in school that I learned was how to reason and use logical thought. I learned how to think critically and how to apply logic to everyday situations. I learned how to use my mind to solve problems and how to think about the world around me.\n",
        "source": "api",
        "start_time": 67.0,
        "end_time": 86.0,
        "last_event_time": 86.0,
        "start_progress": 0.30416666666666664,
        "end_progress": 0.35833333333333334
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important thing in school that I learned was how to reason and use logical thought. I learned how to think critically and how to apply logic to everyday situations. I learned how to use my mind to solve problems and how to think about the world around me. I learned how to think about the world and how to apply my knowledge to it.\n",
        "source": "api",
        "start_time": 90.0,
        "end_time": 122.0,
        "last_event_time": 122.0,
        "start_progress": 0.35833333333333334,
        "end_progress": 0.4035714285714286
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important thing in school that I learned was how to reason and use logical thought. I learned how to think critically and how to apply logic to everyday situations. I learned how to use my mind to solve problems and how to think about the world around me. I learned how to think about the world and how to apply my knowledge to it. These things that I have learned did not come from one class or one grade but it was the culmination of all my schooling from kindergarten to college. \n",
        "source": "user",
        "start_time": 126.0,
        "end_time": 200.0,
        "last_event_time": 200.0,
        "start_progress": 0.4035714285714286,
        "end_progress": 0.49404761904761907
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important thing in school that I learned was how to reason and use logical thought. I learned how to think critically and how to apply logic to everyday situations. I learned how to use my mind to solve problems and how to think about the world around me. I learned how to think about the world and how to apply my knowledge to it. These things that I have learned did not come from one class or one grade but it was the culmination of all my schooling from kindergarten to college. I believe that this knowledge is more important know then ever before. \n",
        "source": "user",
        "start_time": 230.0,
        "end_time": 302.0,
        "last_event_time": 302.0,
        "start_progress": 0.49404761904761907,
        "end_progress": 0.5363095238095238
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important thing in school that I learned was how to reason and use logical thought. I learned how to think critically and how to apply logic to everyday situations. I learned how to use my mind to solve problems and how to think about the world around me. I learned how to think about the world and how to apply my knowledge to it. These things that I have learned did not come from one class or one grade but it was the culmination of all my schooling from kindergarten to college. I believe that this knowledge is more important know then ever before. The world is changing so fast and the ability to think critically and logically is more important than ever.\n",
        "source": "api",
        "start_time": 322.0,
        "end_time": 322.0,
        "last_event_time": 322.0,
        "start_progress": 0.5363095238095238,
        "end_progress": 0.6005952380952381
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important thing in school that I learned was how to reason and use logical thought. I learned how to think critically and how to apply logic to everyday situations. I learned how to use my mind to solve problems and how to think about the world around me. I learned how to think about the world and how to apply my knowledge to it. These things that I have learned did not come from one class or one grade but it was the culmination of all my schooling from kindergarten to college. I believe that this knowledge is more important know then ever before. The world is changing so fast and the ability to think critically and logically is more important than ever. From cable news to your family, its hard to know who is right and wrong and how to figure that out is critical now a days. \n",
        "source": "user",
        "start_time": 333.0,
        "end_time": 377.0,
        "last_event_time": 377.0,
        "start_progress": 0.6005952380952381,
        "end_progress": 0.674404761904762
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the most important thing in school that I learned was how to reason and use logical thought. I learned how to think critically and how to apply logic to everyday situations. I learned how to use my mind to solve problems and how to think about the world around me. I learned how to think about the world and how to apply my knowledge to it. These things that I have learned did not come from one class or one grade but it was the culmination of all my schooling from kindergarten to college. I believe that this knowledge is more important know then ever before. The world is changing so fast and the ability to think critically and logically is more important than ever. From cable news to social media to your family, its hard to know who is right and wrong and it is critical that we know how to figure that out. Understanding the difference between objective facts and personal facts is key to navigating this new social order we find ourselves in. I think the recent disconnect from facts on the election and the pandemic goes to show how important it is to know what is true and what is not. It also shows how many people truly are misinformed and how much impact it has on the health and well being of a society. This is why I believe that learning logic and reasoning skills is the most important thing to be learned in school today. \n",
        "source": "user",
        "start_time": 381.0,
        "end_time": 657.0,
        "last_event_time": 657.0,
        "start_progress": 0.674404761904762,
        "end_progress": 1.0
    }
]