[
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.2028601694915254
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools need to provide pads and tampons to their students as needed. I would suggest keeping a dispenser in each of the girl's bathrooms and locker rooms. \n",
        "source": "user",
        "start_time": 6.0,
        "end_time": 69.0,
        "last_event_time": 69.0,
        "start_progress": 0.2033898305084746,
        "end_progress": 0.2860169491525424
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools need to provide pads and tampons to their students as needed. I would suggest keeping a dispenser in each of the girl's bathrooms and locker rooms. The dispenser would be similar to those that dispense soap and paper towels, but it would contain pads and tampons.\n",
        "source": "api",
        "start_time": 86.0,
        "end_time": 86.0,
        "last_event_time": 86.0,
        "start_progress": 0.2860169491525424,
        "end_progress": 0.3469279661016949
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools need to provide pads and tampons to their students as needed. I would suggest keeping a dispenser in each of the girl's bathrooms and locker rooms. The dispenser would be similar to those that dispense soap and paper towels, but it would contain pads and tampons. I dont think the financial cost would be unbearable but the having them freely available at all times would be priceless to the girls. \n",
        "source": "user",
        "start_time": 90.0,
        "end_time": 178.0,
        "last_event_time": 178.0,
        "start_progress": 0.3469279661016949,
        "end_progress": 0.4189618644067797
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools need to provide pads and tampons to their students as needed. I would suggest keeping a dispenser in each of the girl's bathrooms and locker rooms. The dispenser would be similar to those that dispense soap and paper towels, but it would contain pads and tampons. I dont think the financial cost would be unbearable but the having them freely available at all times would be priceless to the girls. This would effectively end most period shaming and any other embarrassments that may go along with it. It would just be one less thing a young girl needs to worry about and that in itself is worth any trouble since they have enough worries as it is. \n",
        "source": "user",
        "start_time": 191.0,
        "end_time": 290.0,
        "last_event_time": 290.0,
        "start_progress": 0.4189618644067797,
        "end_progress": 0.5513771186440678
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools need to provide pads and tampons to their students as needed. I would suggest keeping a dispenser in each of the girl's bathrooms and locker rooms. The dispenser would be similar to those that dispense soap and paper towels, but it would contain pads and tampons. I dont think the financial cost would be unbearable but the having them freely available at all times would be priceless to the girls. This would effectively end most period shaming and any other embarrassments that may go along with it. It would just be one less thing a young girl needs to worry about and that in itself is worth any trouble since they have enough worries as it is. I personally remember seeing and hearing stories in middle and high school about girls having issues and it haunted them for the rest of their school days. \n",
        "source": "user",
        "start_time": 293.0,
        "end_time": 355.0,
        "last_event_time": 355.0,
        "start_progress": 0.5513771186440678,
        "end_progress": 0.6340042372881356
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools need to provide pads and tampons to their students as needed. I would suggest keeping a dispenser in each of the girl's bathrooms and locker rooms. The dispenser would be similar to those that dispense soap and paper towels, but it would contain pads and tampons. I dont think the financial cost would be unbearable but the having them freely available at all times would be priceless to the girls. This would effectively end most period shaming and any other embarrassments that may go along with it. It would just be one less thing a young girl needs to worry about and that in itself is worth any trouble since they have enough worries as it is. I personally remember seeing and hearing stories in middle and high school about girls having issues and it haunted them for the rest of their school days. A majority of those incidents can be prevented with easy access to these essential hygiene products. \n",
        "source": "user",
        "start_time": 361.0,
        "end_time": 414.0,
        "last_event_time": 414.0,
        "start_progress": 0.6340042372881356,
        "end_progress": 0.6875
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools need to provide pads and tampons to their students as needed. I would suggest keeping a dispenser in each of the girl's bathrooms and locker rooms. The dispenser would be similar to those that dispense soap and paper towels, but it would contain pads and tampons. I dont think the financial cost would be unbearable but the having them freely available at all times would be priceless to the girls. This would effectively end most period shaming and any other embarrassments that may go along with it. It would just be one less thing a young girl needs to worry about and that in itself is worth any trouble since they have enough worries as it is. I personally remember seeing and hearing stories in middle and high school about girls having issues and it haunted them for the rest of their school days. A majority of those incidents can be prevented with easy access to these essential hygiene products. This is an easy thing to do and can make a world of difference to all the girls out there.\n",
        "source": "api",
        "start_time": 445.0,
        "end_time": 445.0,
        "last_event_time": 445.0,
        "start_progress": 0.6875,
        "end_progress": 0.7351694915254238
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools need to provide pads and tampons to their students as needed. I would suggest keeping a dispenser in each of the girl's bathrooms and locker rooms. The dispenser would be similar to those that dispense soap and paper towels, but it would contain pads and tampons. I dont think the financial cost would be unbearable but the having them freely available at all times would be priceless to the girls. This would effectively end most period shaming and any other embarrassments that may go along with it. It would just be one less thing a young girl needs to worry about and that in itself is worth any trouble since they have enough worries as it is. I personally remember seeing and hearing stories in middle and high school about girls having issues and it haunted them for the rest of their school days. A majority of those incidents can be prevented with easy access to these essential hygiene products. This is an easy thing to do and can make a world of difference to all the girls out there. I am surprised that it has not already been established nation wide. In fact I am a little disturbed that there is even any controversy over it. \n",
        "source": "user",
        "start_time": 448.0,
        "end_time": 486.0,
        "last_event_time": 486.0,
        "start_progress": 0.7351694915254238,
        "end_progress": 0.8125
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools need to provide pads and tampons to their students as needed. I would suggest keeping a dispenser in each of the girl's bathrooms and locker rooms. The dispenser would be similar to those that dispense soap and paper towels, but it would contain pads and tampons. I dont think the financial cost would be unbearable but the having them freely available at all times would be priceless to the girls. This would effectively end most period shaming and any other embarrassments that may go along with it. It would just be one less thing a young girl needs to worry about and that in itself is worth any trouble since they have enough worries as it is. I personally remember seeing and hearing stories in middle and high school about girls having issues and it haunted them for the rest of their school days. A majority of those incidents can be prevented with easy access to these essential hygiene products. This is an easy thing to do and can make a world of difference to all the girls out there. I am surprised that it has not already been established nation wide. In fact I am a little disturbed that there is even any controversy over it. To me it a no brainier but then again so is getting vaccinted so I am only one voice in a sea of conflicting opinions. \nAs I have said above, this should not be an issue that has any controversy. It is a necessity for these girls and they need to be freely available at all times. That way they have that sense of security and control over their bodies. \n",
        "source": "user",
        "start_time": 491.0,
        "end_time": 685.0,
        "last_event_time": 685.0,
        "start_progress": 0.8125,
        "end_progress": 1.0
    }
]