[
    {
        "text": "Should College Athletes Be Paid?\n\nDo you think college athletes should be paid? Or is a college scholarship and other non-monetary perks like the opportunity to play in front of cheering fans enough?\n\nIn “Paying Students to Play Would Ruin College Sports,\" Cody J. McDavis writes: “Paying student-athletes might sound like a fairer way to treat students who generate so much money and attention for their colleges (not to mention the television networks that broadcast their games). But paying athletes would distort the economics of college sports in a way that would hurt the broader community of student-athletes, universities, fans and alumni. A handful of big sports programs would pay top dollar for a select few athletes, while almost every other college would get caught up in a bidding war it couldn't afford.\"\n\nDo you find his argument persuasive? What possible difficulties or downsides might there be in providing monetary compensation to players?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.2724243265759511
    },
    {
        "text": "Should College Athletes Be Paid?\n\nDo you think college athletes should be paid? Or is a college scholarship and other non-monetary perks like the opportunity to play in front of cheering fans enough?\n\nIn “Paying Students to Play Would Ruin College Sports,\" Cody J. McDavis writes: “Paying student-athletes might sound like a fairer way to treat students who generate so much money and attention for their colleges (not to mention the television networks that broadcast their games). But paying athletes would distort the economics of college sports in a way that would hurt the broader community of student-athletes, universities, fans and alumni. A handful of big sports programs would pay top dollar for a select few athletes, while almost every other college would get caught up in a bidding war it couldn't afford.\"\n\nDo you find his argument persuasive? What possible difficulties or downsides might there be in providing monetary compensation to players?\n\n---\n\nIn my opinion, it is a tough decision on whether or not to pay student-athletes. The amount of money that each school makes widely varies, and if the schools that made the most money were able to pay their athletes more, it would just turn into a bidding war as far as recruiting goes. I think that the only realistic way to even talk about payment to athletes would be if the NCAA just made the payments to all the student-athletes by division, and gave them all a set amount of money. Either this, or they give out other non-monetary types of perks. What should not happen however, is these same student-athletes struggling to pay for their dorms, or barely having enough food to eat. I have heard so many stories of these well known players who could barely pay to survive in school. That makes absolutely no sense since they are helping provide tons of funds to the school they are at. I think the least they could do is make sure the student athletes all have plenty of food and no worry whatsoever on the cost of their rooms. This should be the minimum in my opinion. From there, yea we can talk about some sort of monetary payment. So i played college football at a division II school, and although we were division II, we were a top 10 team each year and actually made the championship and lost my senior year. I dont think the amount of money we generate is anywhere near the amount at a big college football school in division one, so of course the monetation would have to vary based off of this. Either way, i think it is acceptable for these student athletes to be paid. I just think it will be a tough process because this would mean that all student-athletes would want to be paid, or essentially any team or group on campus that contributes to the college making money. \n",
        "source": "user",
        "start_time": 11.0,
        "end_time": 360.0,
        "last_event_time": 360.0,
        "start_progress": 0.2724243265759511,
        "end_progress": 0.7645098583726743
    },
    {
        "text": "Should College Athletes Be Paid?\n\nDo you think college athletes should be paid? Or is a college scholarship and other non-monetary perks like the opportunity to play in front of cheering fans enough?\n\nIn “Paying Students to Play Would Ruin College Sports,\" Cody J. McDavis writes: “Paying student-athletes might sound like a fairer way to treat students who generate so much money and attention for their colleges (not to mention the television networks that broadcast their games). But paying athletes would distort the economics of college sports in a way that would hurt the broader community of student-athletes, universities, fans and alumni. A handful of big sports programs would pay top dollar for a select few athletes, while almost every other college would get caught up in a bidding war it couldn't afford.\"\n\nDo you find his argument persuasive? What possible difficulties or downsides might there be in providing monetary compensation to players?\n\n---\n\nIn my opinion, it is a tough decision on whether or not to pay student-athletes. The amount of money that each school makes widely varies, and if the schools that made the most money were able to pay their athletes more, it would just turn into a bidding war as far as recruiting goes. I think that the only realistic way to even talk about payment to athletes would be if the NCAA just made the payments to all the student-athletes by division, and gave them all a set amount of money. Either this, or they give out other non-monetary types of perks. What should not happen however, is these same student-athletes struggling to pay for their dorms, or barely having enough food to eat. I have heard so many stories of these well known players who could barely pay to survive in school. That makes absolutely no sense since they are helping provide tons of funds to the school they are at. I think the least they could do is make sure the student athletes all have plenty of food and no worry whatsoever on the cost of their rooms. This should be the minimum in my opinion. From there, yea we can talk about some sort of monetary payment. So i played college football at a division II school, and although we were division II, we were a top 10 team each year and actually made the championship and lost my senior year. I dont think the amount of money we generate is anywhere near the amount at a big college football school in division one, so of course the monetation would have to vary based off of this. Either way, i think it is acceptable for these student athletes to be paid. I just think it will be a tough process because this would mean that all student-athletes would want to be paid, or essentially any team or group on campus that contributes to the college making money. While it is a huge opportunity to begin with to play college sports, i do think the ncaa could do a much better job at providing for these students. As the prompt says, it is important to avoid the bidding war, and the only way you can do this is by paying a flat fee i would suppose to all the athletes in that division. This would however cause the schools who are making more money to contribute much more than the schools making a lower amount of money. But who knows maybe this would actually even out the competition for the schools, and end up in a much more fair recruitment process that goes more off of the school itself as opposed to just the team. So in conclusion, i think student athletes to have the right to be paid, however the ncaa is going to have to make sure they are very careful in the way they choose to go about doing this.\n",
        "source": "user",
        "start_time": 365.0,
        "end_time": 601.0,
        "last_event_time": 601.0,
        "start_progress": 0.7645098583726743,
        "end_progress": 1.0
    }
]