[
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.25997652582159625
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the decision about sports is a personal one.\n",
        "source": "api",
        "start_time": 31.0,
        "end_time": 31.0,
        "last_event_time": 31.0,
        "start_progress": 0.2605633802816901,
        "end_progress": 0.2863849765258216
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the decision about sports is a personal one.  The issue arises if you endanger others in pursuit of your sport.  \n",
        "source": "user",
        "start_time": 33.0,
        "end_time": 57.0,
        "last_event_time": 57.0,
        "start_progress": 0.2863849765258216,
        "end_progress": 0.3268779342723005
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the decision about sports is a personal one.  The issue arises if you endanger others in pursuit of your sport.  If you are endangering people not involved, or if rescuers have to put their own safety at risk to aide you because of an accident, then I believe you have crossed a line. \n",
        "source": "user",
        "start_time": 60.0,
        "end_time": 161.0,
        "last_event_time": 161.0,
        "start_progress": 0.3268779342723005,
        "end_progress": 0.4278169014084507
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the decision about sports is a personal one.  The issue arises if you endanger others in pursuit of your sport.  If you are endangering people not involved, or if rescuers have to put their own safety at risk to aide you because of an accident, then I believe you have crossed a line. \n\nOn the other hand, if it is just your own risk and only your own choice to endanger yourself, I don't think that's necessarily\n",
        "source": "api",
        "start_time": 180.0,
        "end_time": 180.0,
        "last_event_time": 180.0,
        "start_progress": 0.4278169014084507,
        "end_progress": 0.5029342723004695
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the decision about sports is a personal one.  The issue arises if you endanger others in pursuit of your sport.  If you are endangering people not involved, or if rescuers have to put their own safety at risk to aide you because of an accident, then I believe you have crossed a line.   On the other hand, if it is just your own risk and only your own choice to endanger yourself, I don't think that's necessarily a problem.  \n",
        "source": "user",
        "start_time": 183.0,
        "end_time": 224.0,
        "last_event_time": 224.0,
        "start_progress": 0.5029342723004695,
        "end_progress": 0.5105633802816901
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the decision about sports is a personal one.  The issue arises if you endanger others in pursuit of your sport.  If you are endangering people not involved, or if rescuers have to put their own safety at risk to aide you because of an accident, then I believe you have crossed a line.   On the other hand, if it is just your own risk and only your own choice to endanger yourself, I don't think that's necessarily a problem.  There are times when people go hiking and climbing in inclement weather and get stranded, In those cases rescue teams have to venture into the same danger, but they have not made that choice, aside from signing on to be a life saver.  Other times, \n",
        "source": "user",
        "start_time": 230.0,
        "end_time": 354.0,
        "last_event_time": 354.0,
        "start_progress": 0.5105633802816901,
        "end_progress": 0.6561032863849765
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the decision about sports is a personal one.  The issue arises if you endanger others in pursuit of your sport.  If you are endangering people not involved, or if rescuers have to put their own safety at risk to aide you because of an accident, then I believe you have crossed a line.   On the other hand, if it is just your own risk and only your own choice to endanger yourself, I don't think that's necessarily a problem.  There are times when people go hiking and climbing in inclement weather and get stranded, In those cases rescue teams have to venture into the same danger, but they have not made that choice, aside from signing on to be a life saver.  Other times, these sports can put at risk spectators , or even the general public, due to the hazardousness of the activity.  \n",
        "source": "user",
        "start_time": 356.0,
        "end_time": 482.0,
        "last_event_time": 482.0,
        "start_progress": 0.6561032863849765,
        "end_progress": 0.7224178403755869
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the decision about sports is a personal one.  The issue arises if you endanger others in pursuit of your sport.  If you are endangering people not involved, or if rescuers have to put their own safety at risk to aide you because of an accident, then I believe you have crossed a line.   On the other hand, if it is just your own risk and only your own choice to endanger yourself, I don't think that's necessarily a problem.  There are times when people go hiking and climbing in inclement weather and get stranded, In those cases rescue teams have to venture into the same danger, but they have not made that choice, aside from signing on to be a life saver.  Other times, these sports can put at risk spectators, or even the general public, due to the hazardousness of the activity., free climbing and base jumping can imperil those below.   \n",
        "source": "user",
        "start_time": 528.0,
        "end_time": 599.0,
        "last_event_time": 599.0,
        "start_progress": 0.7224178403755869,
        "end_progress": 0.755868544600939
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the decision about sports is a personal one.  The issue arises if you endanger others in pursuit of your sport.  If you are endangering people not involved, or if rescuers have to put their own safety at risk to aide you because of an accident, then I believe you have crossed a line.   On the other hand, if it is just your own risk and only your own choice to endanger yourself, I don't think that's necessarily a problem.  There are times when people go hiking and climbing in inclement weather and get stranded, In those cases rescue teams have to venture into the same danger, but they have not made that choice, aside from signing on to be a life saver.  Other times, these sports can put at risk spectators, or even the general public, due to the hazardousness of the activity, free climbing and base jumping can imperil those below.   \n",
        "source": "user",
        "start_time": 602.0,
        "end_time": 613.0,
        "last_event_time": 613.0,
        "start_progress": 0.755868544600939,
        "end_progress": 0.7552816901408451
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the decision about sports is a personal one.  The issue arises if you endanger others in pursuit of your sport.  If you are endangering people not involved, or if rescuers have to put their own safety at risk to aide you because of an accident, then I believe you have crossed a line.   On the other hand, if it is just your own risk and only your own choice to endanger yourself, I don't think that's necessarily a problem.  There are times when people go hiking and climbing in inclement weather and get stranded, In those cases rescue teams have to venture into the same danger, but they have not made that choice, aside from signing on to be a life saver.  Other times, these sports can put at risk spectators, or even the general public, due to the hazardousness of the activity, free climbing and base jumping can imperil those below, skiing\n",
        "source": "user",
        "start_time": 626.0,
        "end_time": 634.0,
        "last_event_time": 634.0,
        "start_progress": 0.7552816901408451,
        "end_progress": 0.7576291079812206
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the decision about sports is a personal one.  The issue arises if you endanger others in pursuit of your sport.  If you are endangering people not involved, or if rescuers have to put their own safety at risk to aide you because of an accident, then I believe you have crossed a line.   On the other hand, if it is just your own risk and only your own choice to endanger yourself, I don't think that's necessarily a problem.  There are times when people go hiking and climbing in inclement weather and get stranded, In those cases rescue teams have to venture into the same danger, but they have not made that choice, aside from signing on to be a life saver.  Other times, these sports can put at risk spectators, or even the general public, due to the hazardousness of the activity, free climbing and base jumping can imperil those below, avalanches\n",
        "source": "user",
        "start_time": 648.0,
        "end_time": 656.0,
        "last_event_time": 656.0,
        "start_progress": 0.7576291079812206,
        "end_progress": 0.7599765258215962
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the decision about sports is a personal one.  The issue arises if you endanger others in pursuit of your sport.  If you are endangering people not involved, or if rescuers have to put their own safety at risk to aide you because of an accident, then I believe you have crossed a line.   On the other hand, if it is just your own risk and only your own choice to endanger yourself, I don't think that's necessarily a problem.  There are times when people go hiking and climbing in inclement weather and get stranded, In those cases rescue teams have to venture into the same danger, but they have not made that choice, aside from signing on to be a life saver.  Other times, these sports can put at risk spectators, or even the general public, due to the hazardousness of the activity, free climbing and base jumping can imperil those below, skiing off the track \n",
        "source": "user",
        "start_time": 662.0,
        "end_time": 682.0,
        "last_event_time": 682.0,
        "start_progress": 0.7599765258215962,
        "end_progress": 0.7664319248826291
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the decision about sports is a personal one.  The issue arises if you endanger others in pursuit of your sport.  If you are endangering people not involved, or if rescuers have to put their own safety at risk to aide you because of an accident, then I believe you have crossed a line.   On the other hand, if it is just your own risk and only your own choice to endanger yourself, I don't think that's necessarily a problem.  There are times when people go hiking and climbing in inclement weather and get stranded, In those cases rescue teams have to venture into the same danger, but they have not made that choice, aside from signing on to be a life saver.  Other times, these sports can put at risk spectators, or even the general public, due to the hazardousness of the activity, free climbing and base jumping can imperil those below, skiing off the track can cause avalanches. \n",
        "source": "user",
        "start_time": 685.0,
        "end_time": 700.0,
        "last_event_time": 700.0,
        "start_progress": 0.7664319248826291,
        "end_progress": 0.7793427230046949
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the decision about sports is a personal one.  The issue arises if you endanger others in pursuit of your sport.  If you are endangering people not involved, or if rescuers have to put their own safety at risk to aide you because of an accident, then I believe you have crossed a line.   On the other hand, if it is just your own risk and only your own choice to endanger yourself, I don't think that's necessarily a problem.  There are times when people go hiking and climbing in inclement weather and get stranded, In those cases rescue teams have to venture into the same danger, but they have not made that choice, aside from signing on to be a life saver.  Other times, these sports can put at risk spectators, or even the general public, due to the hazardousness of the activity, free climbing and base jumping can imperil those below, skiing off the track can cause avalanches.  There is nothing wrong with extreme sports, but the participant \n",
        "source": "user",
        "start_time": 708.0,
        "end_time": 740.0,
        "last_event_time": 740.0,
        "start_progress": 0.7793427230046949,
        "end_progress": 0.8174882629107981
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the decision about sports is a personal one.  The issue arises if you endanger others in pursuit of your sport.  If you are endangering people not involved, or if rescuers have to put their own safety at risk to aide you because of an accident, then I believe you have crossed a line.   On the other hand, if it is just your own risk and only your own choice to endanger yourself, I don't think that's necessarily a problem.  There are times when people go hiking and climbing in inclement weather and get stranded, In those cases rescue teams have to venture into the same danger, but they have not made that choice, aside from signing on to be a life saver.  Other times, these sports can put at risk spectators, or even the general public, due to the hazardousness of the activity, free climbing and base jumping can imperil those below, skiing off the track can cause avalanches.  There is nothing wrong with extreme sports, but the participant should demonstrate responsibility not to put others in danger, or to rescue the person themself if necessary, or at the very least insure adequate safety precautions and\n",
        "source": "api",
        "start_time": 760.0,
        "end_time": 760.0,
        "last_event_time": 760.0,
        "start_progress": 0.8174882629107981,
        "end_progress": 0.9166666666666666
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the decision about sports is a personal one.  The issue arises if you endanger others in pursuit of your sport.  If you are endangering people not involved, or if rescuers have to put their own safety at risk to aide you because of an accident, then I believe you have crossed a line.   On the other hand, if it is just your own risk and only your own choice to endanger yourself, I don't think that's necessarily a problem.  There are times when people go hiking and climbing in inclement weather and get stranded, In those cases rescue teams have to venture into the same danger, but they have not made that choice, aside from signing on to be a life saver.  Other times, these sports can put at risk spectators, or even the general public, due to the hazardousness of the activity, free climbing and base jumping can imperil those below, skiing off the track can cause avalanches.  There is nothing wrong with extreme sports, but the participant should demonstrate responsibility not to put others in danger, or to rescue the person themselves if necessary, or at the very least insure adequate safety precautions.  Therefore, whether it is selfish depends on the person, not the sport.  It is only selfish to pursue, if you actions in doing it are selfish.\n",
        "source": "user",
        "start_time": 771.0,
        "end_time": 829.0,
        "last_event_time": 829.0,
        "start_progress": 0.9166666666666666,
        "end_progress": 1.0
    }
]