[
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.12121212121212122
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has actually really helped dating. Nowadays, there are so many couples that have met one another using a dating app. I personally feel that this has contributed to stronger relationships in general, and has also allowed people who may not have had the time to find a good relationship. For example, single mothers and fathers who have to work to support their kids have been able to meet significant others on a deeper level. Also, people who simply are not as extroverted have been able to work up the confidence to meet partners using a dating app. \n\nNow once in a relationship, i think technology has the ability to take away from relationships, especially if quality time with one another is lessened due to spending time on screens.  As long as present time with one another is still met, than the screen time use isnt a huge deal. I think as long as people are weary about their time spent in front of screens, and make sure to keep their partner in mind, then it is ok. \n",
        "source": "user",
        "start_time": 15.0,
        "end_time": 214.0,
        "last_event_time": 214.0,
        "start_progress": 0.12121212121212122,
        "end_progress": 0.43668261562998406
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has actually really helped dating. Nowadays, there are so many couples that have met one another using a dating app. I personally feel that this has contributed to stronger relationships in general, and has also allowed people who may not have had the time to find a good relationship. For example, single mothers and fathers who have to work to support their kids have been able to meet significant others on a deeper level. Also, people who simply are not as extroverted have been able to work up the confidence to meet partners using a dating app. \n\nNow once in a relationship, i think technology has the ability to take away from relationships, especially if quality time with one another is lessened due to spending time on screens.  As long as present time with one another is still met, than the screen time use isnt a huge deal. I think as long as people are weary about their time spent in front of screens, and make sure to keep their partner in mind, then it is ok. I think mostly of social media when i talk about this, simply because social media can so easily be used as a negative. Social media breeds constant comparisons of your life to someone elses. This can cause you to not be happy with what you have, and always want more. This is not a good idea for relationships. I think apps for entertainment can be good however because it provides a sense of entertainment for you arnd your partner. Maybe you want to sit down together and watch a movie on netflix, or you want to simply text a family member instead of call so you dont have to get up and walk away from your partner. Apps are simply a part of our world now, and there is always going to be negatives to anything in the world. To me, it really just depends on how you choose to use apps.\n\nIn conclusion, i would say that dating apps are great for our generation. I think dating apps have done much more good than bad. They allow you to attempt to connect with someone without having to go out and physically meet them. It can be good to physically meet people, however it is not an option for everyone's lifestyle depending on the variables. So once again, just a great tool to have at our disposal as a society. Single parents simply are not going to get the chance to go out to populated places on their own and attempt to meet people. Even with this, they severly limiting their pool of people to choose from. With a dating app, there are so many more people at their disposal who they could meet. \n",
        "source": "user",
        "start_time": 216.0,
        "end_time": 536.0,
        "last_event_time": 536.0,
        "start_progress": 0.43668261562998406,
        "end_progress": 0.9161084529505582
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has actually really helped dating. Nowadays, there are so many couples that have met one another using a dating app. I personally feel that this has contributed to stronger relationships in general, and has also allowed people who may not have had the time to find a good relationship. For example, single mothers and fathers who have to work to support their kids have been able to meet significant others on a deeper level. Also, people who simply are not as extroverted have been able to work up the confidence to meet partners using a dating app. \n\nNow once in a relationship, i think technology has the ability to take away from relationships, especially if quality time with one another is lessened due to spending time on screens.  As long as present time with one another is still met, than the screen time use isnt a huge deal. I think as long as people are weary about their time spent in front of screens, and make sure to keep their partner in mind, then it is ok. I think mostly of social media when i talk about this, simply because social media can so easily be used as a negative. Social media breeds constant comparisons of your life to someone elses. This can cause you to not be happy with what you have, and always want more. This is not a good idea for relationships. I think apps for entertainment can be good however because it provides a sense of entertainment for you arnd your partner. Maybe you want to sit down together and watch a movie on netflix, or you want to simply text a family member instead of call so you dont have to get up and walk away from your partner. Apps are simply a part of our world now, and there is always going to be negatives to anything in the world. To me, it really just depends on how you choose to use apps.\n\nIn conclusion, i would say that dating apps are great for our generation. I think dating apps have done much more good than bad. They allow you to attempt to connect with someone without having to go out and physically meet them. It can be good to physically meet people, however it is not an option for everyone's lifestyle depending on the variables. So once again, just a great tool to have at our disposal as a society. Single parents simply are not going to get the chance to go out to populated places on their own and attempt to meet people. Even with this, they severly limiting their pool of people to choose from. With a dating app, there are so many more people at their disposal who they could meet. I am a huge proponent of dating apps, possibly because i met my wife on one. I also know numerous successful couples who have met on dating apps who live happy lives and have created their very own families. This my stance on technology and its effects on dating.\n",
        "source": "user",
        "start_time": 539.0,
        "end_time": 623.0,
        "last_event_time": 623.0,
        "start_progress": 0.9161084529505582,
        "end_progress": 1.0
    }
]