[
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.09735449735449736
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, listening to a book is just as good as reading it without a doubt. I think there are many advantages to listening to an audio book in my personal opinion. Sometimes the reader's voice even ties into the book, and makes the book feel even more real. For example, if you listen to a harry potter book using audible, the voice matches that of the characters in harry potter. Its that british sounding voice. In addition to this, you are able to listen to the book in many more situations and places than you would be able to physically read a book. I can lay down in bed without having to sit up and listen to a book, or listen to a book while driving, or while cleaning up in the house, or even while taking the dogs for a walk. This makes it much easier to indulge yourself into a good book. I personally do not feel that there are any advantages to reading a book physically over listening. I think it is simply preference. Reading is more quiet and can allow some people the ability to immerse themselves a little more. However, i dont really find reading to have any advantages like audiobooks do, especially for efficiency. I am a huge fan of being efficient, and being able to listen while still working or doing other activities is the seller for me. You may even save money using an audiobook, as normally these are subscriptions and you can get titles for cheaper. \n",
        "source": "user",
        "start_time": 5.0,
        "end_time": 268.0,
        "last_event_time": 268.0,
        "start_progress": 0.09735449735449736,
        "end_progress": 0.581657848324515
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, listening to a book is just as good as reading it without a doubt. I think there are many advantages to listening to an audio book in my personal opinion. Sometimes the reader's voice even ties into the book, and makes the book feel even more real. For example, if you listen to a harry potter book using audible, the voice matches that of the characters in harry potter. Its that british sounding voice. In addition to this, you are able to listen to the book in many more situations and places than you would be able to physically read a book. I can lay down in bed without having to sit up and listen to a book, or listen to a book while driving, or while cleaning up in the house, or even while taking the dogs for a walk. This makes it much easier to indulge yourself into a good book. I personally do not feel that there are any advantages to reading a book physically over listening. I think it is simply preference. Reading is more quiet and can allow some people the ability to immerse themselves a little more. However, i dont really find reading to have any advantages like audiobooks do, especially for efficiency. I am a huge fan of being efficient, and being able to listen while still working or doing other activities is the seller for me. You may even save money using an audiobook, as normally these are subscriptions and you can get titles for cheaper. I pay a monthly fee for a certain number of credits for my subscription, and normally one credit is the equivalent of one book. The monthly fee is only 15 dollars a month, so do the math on that. If your heavy into books, this is well worth it, not only for the books but for the service. \n",
        "source": "user",
        "start_time": 271.0,
        "end_time": 369.0,
        "last_event_time": 369.0,
        "start_progress": 0.581657848324515,
        "end_progress": 0.6835978835978836
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, listening to a book is just as good as reading it without a doubt. I think there are many advantages to listening to an audio book in my personal opinion. Sometimes the reader's voice even ties into the book, and makes the book feel even more real. For example, if you listen to a harry potter book using audible, the voice matches that of the characters in harry potter. Its that british sounding voice. In addition to this, you are able to listen to the book in many more situations and places than you would be able to physically read a book. I can lay down in bed without having to sit up and listen to a book, or listen to a book while driving, or while cleaning up in the house, or even while taking the dogs for a walk. This makes it much easier to indulge yourself into a good book. I personally do not feel that there are any advantages to reading a book physically over listening. I think it is simply preference. Reading is more quiet and can allow some people the ability to immerse themselves a little more. However, i dont really find reading to have any advantages like audiobooks do, especially for efficiency. I am a huge fan of being efficient, and being able to listen while still working or doing other activities is the seller for me. You may even save money using an audiobook, as normally these are subscriptions and you can get titles for cheaper. I pay a monthly fee for a certain number of credits for my subscription, and normally one credit is the equivalent of one book. The monthly fee is only 15 dollars a month, so do the math on that. If your heavy into books, this is well worth it, not only for the books but for the service. I personally am a huge fan of audible.com, i love the ability to be able to download and listen to my books at my own steps.\n",
        "source": "api",
        "start_time": 384.0,
        "end_time": 384.0,
        "last_event_time": 384.0,
        "start_progress": 0.6835978835978836,
        "end_progress": 0.727336860670194
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, listening to a book is just as good as reading it without a doubt. I think there are many advantages to listening to an audio book in my personal opinion. Sometimes the reader's voice even ties into the book, and makes the book feel even more real. For example, if you listen to a harry potter book using audible, the voice matches that of the characters in harry potter. Its that british sounding voice. In addition to this, you are able to listen to the book in many more situations and places than you would be able to physically read a book. I can lay down in bed without having to sit up and listen to a book, or listen to a book while driving, or while cleaning up in the house, or even while taking the dogs for a walk. This makes it much easier to indulge yourself into a good book. I personally do not feel that there are any advantages to reading a book physically over listening. I think it is simply preference. Reading is more quiet and can allow some people the ability to immerse themselves a little more. However, i dont really find reading to have any advantages like audiobooks do, especially for efficiency. I am a huge fan of being efficient, and being able to listen while still working or doing other activities is the seller for me. You may even save money using an audiobook, as normally these are subscriptions and you can get titles for cheaper. I pay a monthly fee for a certain number of credits for my subscription, and normally one credit is the equivalent of one book. The monthly fee is only 15 dollars a month, so do the math on that. If your heavy into books, this is well worth it, not only for the books but for the service. I personally am a huge fan of audible, i love the ability to be able to download and listen to my books at my own steps. Audible is an app that you can download where there are many audiobooks available at your disposal. Audible is associated with amazon, and i have an amazon prime so this was a no brainer for me. I believe you even get free credits simply because you are a prime member as well. Dont know the exact number on this however. \n",
        "source": "user",
        "start_time": 387.0,
        "end_time": 442.0,
        "last_event_time": 442.0,
        "start_progress": 0.727336860670194,
        "end_progress": 0.8398589065255732
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, listening to a book is just as good as reading it without a doubt. I think there are many advantages to listening to an audio book in my personal opinion. Sometimes the reader's voice even ties into the book, and makes the book feel even more real. For example, if you listen to a harry potter book using audible, the voice matches that of the characters in harry potter. Its that british sounding voice. In addition to this, you are able to listen to the book in many more situations and places than you would be able to physically read a book. I can lay down in bed without having to sit up and listen to a book, or listen to a book while driving, or while cleaning up in the house, or even while taking the dogs for a walk. This makes it much easier to indulge yourself into a good book. I personally do not feel that there are any advantages to reading a book physically over listening. I think it is simply preference. Reading is more quiet and can allow some people the ability to immerse themselves a little more. However, i dont really find reading to have any advantages like audiobooks do, especially for efficiency. I am a huge fan of being efficient, and being able to listen while still working or doing other activities is the seller for me. You may even save money using an audiobook, as normally these are subscriptions and you can get titles for cheaper. I pay a monthly fee for a certain number of credits for my subscription, and normally one credit is the equivalent of one book. The monthly fee is only 15 dollars a month, so do the math on that. If your heavy into books, this is well worth it, not only for the books but for the service. I personally am a huge fan of audible, i love the ability to be able to download and listen to my books at my own steps. Audible is an app that you can download where there are many audiobooks available at your disposal. Audible is associated with amazon, and i have an amazon prime so this was a no brainer for me. I believe you even get free credits simply because you are a prime member as well. Dont know the exact number on this however. In addition, alot of the audiobooks on audible are pretty cheap.\n",
        "source": "api",
        "start_time": 463.0,
        "end_time": 463.0,
        "last_event_time": 463.0,
        "start_progress": 0.8398589065255732,
        "end_progress": 0.8624338624338624
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, listening to a book is just as good as reading it without a doubt. I think there are many advantages to listening to an audio book in my personal opinion. Sometimes the reader's voice even ties into the book, and makes the book feel even more real. For example, if you listen to a harry potter book using audible, the voice matches that of the characters in harry potter. Its that british sounding voice. In addition to this, you are able to listen to the book in many more situations and places than you would be able to physically read a book. I can lay down in bed without having to sit up and listen to a book, or listen to a book while driving, or while cleaning up in the house, or even while taking the dogs for a walk. This makes it much easier to indulge yourself into a good book. I personally do not feel that there are any advantages to reading a book physically over listening. I think it is simply preference. Reading is more quiet and can allow some people the ability to immerse themselves a little more. However, i dont really find reading to have any advantages like audiobooks do, especially for efficiency. I am a huge fan of being efficient, and being able to listen while still working or doing other activities is the seller for me. You may even save money using an audiobook, as normally these are subscriptions and you can get titles for cheaper. I pay a monthly fee for a certain number of credits for my subscription, and normally one credit is the equivalent of one book. The monthly fee is only 15 dollars a month, so do the math on that. If your heavy into books, this is well worth it, not only for the books but for the service. I personally am a huge fan of audible, i love the ability to be able to download and listen to my books at my own steps. Audible is an app that you can download where there are many audiobooks available at your disposal. Audible is associated with amazon, and i have an amazon prime so this was a no brainer for me. I believe you even get free credits simply because you are a prime member as well. Dont know the exact number on this however. These are all reasons why i feel using audiobooks have so many advantages. Just grab a pair of headphones and listen on the go. Search the library for whatever books you may be interested in, and even find books out that you may be interested in. There is a rating system just like amazon has on their main site, and this allows you to know what other people think of the book. So in conclusion, I feel listening to a book is just as good as reading one.\n",
        "source": "user",
        "start_time": 477.0,
        "end_time": 593.0,
        "last_event_time": 593.0,
        "start_progress": 0.8624338624338624,
        "end_progress": 1.0
    }
]