[
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.25818777292576417
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion, we do not need to worry too much about screen time.  \n",
        "source": "user",
        "start_time": 14.0,
        "end_time": 29.0,
        "last_event_time": 29.0,
        "start_progress": 0.25818777292576417,
        "end_progress": 0.2876637554585153
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion, we do not need to worry too much about screen time.  When the pandemic is over many things will return to how they were, people are desperate to interact with each other again, seeing them face to face. \n",
        "source": "user",
        "start_time": 31.0,
        "end_time": 103.0,
        "last_event_time": 103.0,
        "start_progress": 0.2876637554585153,
        "end_progress": 0.3695414847161572
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion, we do not need to worry too much about screen time.  When the pandemic is over many things will return to how they were, people are desperate to interact with each other again, seeing them face to face. \n\nWe will be able to go outside again, we will be able to travel again.\n",
        "source": "api",
        "start_time": 130.0,
        "end_time": 130.0,
        "last_event_time": 130.0,
        "start_progress": 0.3695414847161572,
        "end_progress": 0.40829694323144106
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion, we do not need to worry too much about screen time.  When the pandemic is over many things will return to how they were, people are desperate to interact with each other again, seeing them face to face.  We will be able to go outside again, we will be able to travel again and our over reliance on screens will start to diminish.  As with all new technology, it is demonized at first, \n",
        "source": "user",
        "start_time": 133.0,
        "end_time": 176.0,
        "last_event_time": 176.0,
        "start_progress": 0.40829694323144106,
        "end_progress": 0.46888646288209607
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion, we do not need to worry too much about screen time.  When the pandemic is over many things will return to how they were, people are desperate to interact with each other again, seeing them face to face.  We will be able to go outside again, we will be able to travel again and our over reliance on screens will start to diminish.  As with all new technology, it is demonized at first, then it is accepted and finally it becomes part of our lives.\n",
        "source": "api",
        "start_time": 186.0,
        "end_time": 186.0,
        "last_event_time": 186.0,
        "start_progress": 0.46888646288209607,
        "end_progress": 0.5021834061135371
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion, we do not need to worry too much about screen time.  When the pandemic is over many things will return to how they were, people are desperate to interact with each other again, seeing them face to face.  We will be able to go outside again, we will be able to travel again and our over reliance on screens will start to diminish.  As with all new technology, it is demonized at first, then it is accepted and finally it becomes part of our lives.  We will use screens more than we did, but just like books, radio, television, cinema, and even cars, \n",
        "source": "user",
        "start_time": 189.0,
        "end_time": 262.0,
        "last_event_time": 262.0,
        "start_progress": 0.5021834061135371,
        "end_progress": 0.5584061135371179
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion, we do not need to worry too much about screen time.  When the pandemic is over many things will return to how they were, people are desperate to interact with each other again, seeing them face to face.  We will be able to go outside again, we will be able to travel again and our over reliance on screens will start to diminish.  As with all new technology, it is demonized at first, then it is accepted and finally it becomes part of our lives.  We will use screens more than we did, but just like books, radio, television, cinema, and even cars, we will adapt to the new technology and it will become part of our lives.\n",
        "source": "api",
        "start_time": 273.0,
        "end_time": 273.0,
        "last_event_time": 273.0,
        "start_progress": 0.5584061135371179,
        "end_progress": 0.5982532751091703
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion, we do not need to worry too much about screen time.  When the pandemic is over many things will return to how they were, people are desperate to interact with each other again, seeing them face to face.  We will be able to go outside again, we will be able to travel again and our over reliance on screens will start to diminish.  As with all new technology, it is demonized at first, then it is accepted and finally it becomes part of our lives.  We will use screens more than we did, but just like books, radio, television, cinema, and even cars, we will adapt to the new technology and it will become part of our lives.  Sure there are some who are over reliant on screen,  but that is the same with everything, we don't ban \n",
        "source": "user",
        "start_time": 275.0,
        "end_time": 323.0,
        "last_event_time": 323.0,
        "start_progress": 0.5982532751091703,
        "end_progress": 0.6561135371179039
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion, we do not need to worry too much about screen time.  When the pandemic is over many things will return to how they were, people are desperate to interact with each other again, seeing them face to face.  We will be able to go outside again, we will be able to travel again and our over reliance on screens will start to diminish.  As with all new technology, it is demonized at first, then it is accepted and finally it becomes part of our lives.  We will use screens more than we did, but just like books, radio, television, cinema, and even cars, we will adapt to the new technology and it will become part of our lives.  Sure there are some who are over reliant on screen,  but that is the same with everything, we don't ban books because some people read too much.  In many ways the shift to screens during the pandemic has been good for many, people are making their own schedule, they don't have to commute, some work better at home, many students thrive working via a computer.  \n",
        "source": "user",
        "start_time": 327.0,
        "end_time": 501.0,
        "last_event_time": 501.0,
        "start_progress": 0.6561135371179039,
        "end_progress": 0.7969432314410481
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion, we do not need to worry too much about screen time.  When the pandemic is over many things will return to how they were, people are desperate to interact with each other again, seeing them face to face.  We will be able to go outside again, we will be able to travel again and our over reliance on screens will start to diminish.  As with all new technology, it is demonized at first, then it is accepted and finally it becomes part of our lives.  We will use screens more than we did, but just like books, radio, television, cinema, and even cars, we will adapt to the new technology and it will become part of our lives.  Sure there are some who are over reliant on screen,  but that is the same with everything, we don't ban books because some people read too much.  In many ways the shift to screens during the pandemic has been good for many, people are making their own schedule, they don't have to commute, some work better at home, many students thrive working via a computer.  I think we will look back on this time as a turning point, when we finally embraced the benefits of our digital devices.\n",
        "source": "api",
        "start_time": 513.0,
        "end_time": 513.0,
        "last_event_time": 513.0,
        "start_progress": 0.7969432314410481,
        "end_progress": 0.8624454148471615
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion, we do not need to worry too much about screen time.  When the pandemic is over many things will return to how they were, people are desperate to interact with each other again, seeing them face to face.  We will be able to go outside again, we will be able to travel again and our over reliance on screens will start to diminish.  As with all new technology, it is demonized at first, then it is accepted and finally it becomes part of our lives.  We will use screens more than we did, but just like books, radio, television, cinema, and even cars, we will adapt to the new technology and it will become part of our lives.  Sure there are some who are over reliant on screen,  but that is the same with everything, we don't ban books because some people read too much.  In many ways the shift to screens during the pandemic has been good for many, people are making their own schedule, they don't have to commute, some work better at home, many students thrive working via a computer.  I think we will look back on this time as a turning point, when we finally embraced the benefits of our digital devices.  Indeed, we may not even remember it as a turning point, it is just natural progression.  If it turns out to be bad\n",
        "source": "user",
        "start_time": 515.0,
        "end_time": 549.0,
        "last_event_time": 549.0,
        "start_progress": 0.8624454148471615,
        "end_progress": 0.925764192139738
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion, we do not need to worry too much about screen time.  When the pandemic is over many things will return to how they were, people are desperate to interact with each other again, seeing them face to face.  We will be able to go outside again, we will be able to travel again and our over reliance on screens will start to diminish.  As with all new technology, it is demonized at first, then it is accepted and finally it becomes part of our lives.  We will use screens more than we did, but just like books, radio, television, cinema, and even cars, we will adapt to the new technology and it will become part of our lives.  Sure there are some who are over reliant on screen,  but that is the same with everything, we don't ban books because some people read too much.  In many ways the shift to screens during the pandemic has been good for many, people are making their own schedule, they don't have to commute, some work better at home, many students thrive working via a computer.  I think we will look back on this time as a turning point, when we finally embraced the benefits of our digital devices.  Indeed, we may not even remember it as a turning point, it is just natural progression.  If it turns out to be bad for us, we will adapt and change again.\n",
        "source": "api",
        "start_time": 562.0,
        "end_time": 562.0,
        "last_event_time": 562.0,
        "start_progress": 0.925764192139738,
        "end_progress": 0.9475982532751092
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion, we do not need to worry too much about screen time.  When the pandemic is over many things will return to how they were, people are desperate to interact with each other again, seeing them face to face.  We will be able to go outside again, we will be able to travel again and our over reliance on screens will start to diminish.  As with all new technology, it is demonized at first, then it is accepted and finally it becomes part of our lives.  We will use screens more than we did, but just like books, radio, television, cinema, and even cars, we will adapt to the new technology and it will become part of our lives.  Sure there are some who are over reliant on screen,  but that is the same with everything, we don't ban books because some people read too much.  In many ways the shift to screens during the pandemic has been good for many, people are making their own schedule, they don't have to commute, some work better at home, many students thrive working via a computer.  I think we will look back on this time as a turning point, when we finally embraced the benefits of our digital devices.  Indeed, we may not even remember it as a turning point, it is just natural progression.  If it turns out to be bad for us, we will adapt and change again.  We do not need to be worried, life goes on and each changed is resisted before \n",
        "source": "user",
        "start_time": 572.0,
        "end_time": 600.0,
        "last_event_time": 600.0,
        "start_progress": 0.9475982532751092,
        "end_progress": 0.9918122270742358
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion, we do not need to worry too much about screen time.  When the pandemic is over many things will return to how they were, people are desperate to interact with each other again, seeing them face to face.  We will be able to go outside again, we will be able to travel again and our over reliance on screens will start to diminish.  As with all new technology, it is demonized at first, then it is accepted and finally it becomes part of our lives.  We will use screens more than we did, but just like books, radio, television, cinema, and even cars, we will adapt to the new technology and it will become part of our lives.  Sure there are some who are over reliant on screen,  but that is the same with everything, we don't ban books because some people read too much.  In many ways the shift to screens during the pandemic has been good for many, people are making their own schedule, they don't have to commute, some work better at home, many students thrive working via a computer.  I think we will look back on this time as a turning point, when we finally embraced the benefits of our digital devices.  Indeed, we may not even remember it as a turning point, it is just natural progression.  If it turns out to be bad for us, we will adapt and change again.  We do not need to be worried, life goes on and each changed is resisted before it is accepted.\n",
        "source": "api",
        "start_time": 605.0,
        "end_time": 605.0,
        "last_event_time": 605.0,
        "start_progress": 0.9918122270742358,
        "end_progress": 1.0
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion, we do not need to worry too much about screen time.  When the pandemic is over many things will return to how they were, people are desperate to interact with each other again, seeing them face to face.  We will be able to go outside again, we will be able to travel again and our over reliance on screens will start to diminish.  As with all new technology, it is demonized at first, then it is accepted and finally it becomes part of our lives.  We will use screens more than we did, but just like books, radio, television, cinema, and even cars, we will adapt to the new technology and it will become part of our lives.  Sure there are some who are over reliant on screen,  but that is the same with everything, we don't ban books because some people read too much.  In many ways the shift to screens during the pandemic has been good for many, people are making their own schedules, they don't have to commute, some work better at home, many students thrive working via a computer.  I think we may look back on this time as a turning point, when we finally embraced the benefits of our digital devices.  Indeed, we may not even remember it as a turning point, it is just natural progression.  If it turns out to be bad for us, we will adapt and change again.  We do not need to be worried, life goes on and each changed is resisted before it is accepted.\n",
        "source": "user",
        "start_time": 655.0,
        "end_time": 670.0,
        "last_event_time": 670.0,
        "start_progress": 1.0,
        "end_progress": 1.0
    }
]