[
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.18031609195402298
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I would not watch or read something because of its offensive portrayal or stereotypical of someone. \n",
        "source": "user",
        "start_time": 46.0,
        "end_time": 97.0,
        "last_event_time": 97.0,
        "start_progress": 0.18031609195402298,
        "end_progress": 0.25287356321839083
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I would not watch or read something because of its offensive portrayal or stereotypical of someone. I don't like to see people being portrayed in a negative light.\n",
        "source": "api",
        "start_time": 128.0,
        "end_time": 128.0,
        "last_event_time": 128.0,
        "start_progress": 0.25287356321839083,
        "end_progress": 0.29813218390804597
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I would not watch or read something because of its offensive portrayal or stereotypical of someone. I don't like to see people being portrayed in a negative light. I think it's important to be aware of the stereotypes that are out there and how they can affect people.\n",
        "source": "api",
        "start_time": 138.0,
        "end_time": 138.0,
        "last_event_time": 138.0,
        "start_progress": 0.2988505747126437,
        "end_progress": 0.3735632183908046
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I would not watch or read something because of its offensive portrayal or stereotypical of someone. I don't like to see people being portrayed in a negative light. I think it's important to be aware of the stereotypes that are out there and how they can affect people. Stereotyping is disrespectful and discriminative. \n",
        "source": "user",
        "start_time": 140.0,
        "end_time": 174.0,
        "last_event_time": 174.0,
        "start_progress": 0.3735632183908046,
        "end_progress": 0.41020114942528735
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I would not watch or read something because of its offensive portrayal or stereotypical of someone. I don't like to see people being portrayed in a negative light. I think it's important to be aware of the stereotypes that are out there and how they can affect people. Stereotyping is disrespectful and discriminative. It will do more harm than good, because it disharmonizes the society and causes hatred. Why people like to stereotype certain groups of people? \n",
        "source": "user",
        "start_time": 176.0,
        "end_time": 424.0,
        "last_event_time": 424.0,
        "start_progress": 0.41020114942528735,
        "end_progress": 0.5136494252873564
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I would not watch or read something because of its offensive portrayal or stereotypical of someone. I don't like to see people being portrayed in a negative light. I think it's important to be aware of the stereotypes that are out there and how they can affect people. Stereotyping is disrespectful and discriminative. It will do more harm than good, because it disharmonizes the society and causes hatred. Why people like to stereotype certain groups of people? I don't know.\n",
        "source": "api",
        "start_time": 428.0,
        "end_time": 428.0,
        "last_event_time": 428.0,
        "start_progress": 0.5136494252873564,
        "end_progress": 0.5229885057471264
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I would not watch or read something because of its offensive portrayal or stereotypical of someone. I don't like to see people being portrayed in a negative light. I think it's important to be aware of the stereotypes that are out there and how they can affect people. Stereotyping is disrespectful and discriminative. It will do more harm than good, because it disharmonizes the society and causes hatred. Why people like to stereotype certain groups of people? I don't know. I think it's because they are afraid of the unknown.\n",
        "source": "api",
        "start_time": 445.0,
        "end_time": 445.0,
        "last_event_time": 445.0,
        "start_progress": 0.5237068965517241,
        "end_progress": 0.5610632183908046
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I would not watch or read something because of its offensive portrayal or stereotypical of someone. I don't like to see people being portrayed in a negative light. I think it's important to be aware of the stereotypes that are out there and how they can affect people. Stereotyping is disrespectful and discriminative. It will do more harm than good, because it disharmonizes the society and causes hatred. Why people like to stereotype certain groups of people? I don't know. I think it's because they are afraid of the unknown. They don't know how to react to something different.\n",
        "source": "api",
        "start_time": 474.0,
        "end_time": 474.0,
        "last_event_time": 474.0,
        "start_progress": 0.5617816091954023,
        "end_progress": 0.5991379310344828
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I would not watch or read something because of its offensive portrayal or stereotypical of someone. I don't like to see people being portrayed in a negative light. I think it's important to be aware of the stereotypes that are out there and how they can affect people. Stereotyping is disrespectful and discriminative. It will do more harm than good, because it disharmonizes the society and causes hatred. Why people like to stereotype certain groups of people? I don't know. I think it's because they are afraid of the unknown. They don't know how to react to something different. They don't know how to react to something that they don't understand.\n",
        "source": "api",
        "start_time": 494.0,
        "end_time": 494.0,
        "last_event_time": 494.0,
        "start_progress": 0.5998563218390804,
        "end_progress": 0.6494252873563219
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I would not watch or read something because of its offensive portrayal or stereotypical of someone. I don't like to see people being portrayed in a negative light. I think it's important to be aware of the stereotypes that are out there and how they can affect people. Stereotyping is disrespectful and discriminative. It will do more harm than good, because it disharmonizes the society and causes hatred. Why people like to stereotype certain groups of people? I don't know. I think it's because they are afraid of the unknown. They don't know how to react to something different. They don't know how to react to something that they don't understand. So they like to stereotype other people that they don't know well or feel different from them. \n",
        "source": "user",
        "start_time": 496.0,
        "end_time": 531.0,
        "last_event_time": 531.0,
        "start_progress": 0.6494252873563219,
        "end_progress": 0.7183908045977011
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I would not watch or read something because of its offensive portrayal or stereotypical of someone. I don't like to see people being portrayed in a negative light. I think it's important to be aware of the stereotypes that are out there and how they can affect people. Stereotyping is disrespectful and discriminative. It will do more harm than good, because it disharmonizes the society and causes hatred. Why people like to stereotype certain groups of people? I don't know. I think it's because they are afraid of the unknown. They don't know how to react to something different. They don't know how to react to something that they don't understand. So they like to stereotype other people that they don't know well or feel different from them. I think it's a way to protect themselves from the unknown.\n",
        "source": "api",
        "start_time": 538.0,
        "end_time": 538.0,
        "last_event_time": 538.0,
        "start_progress": 0.7183908045977011,
        "end_progress": 0.7600574712643678
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, I would not watch or read something because of its offensive portrayal or stereotypical of someone. I don't like to see people being portrayed in a negative light. I think it's important to be aware of the stereotypes that are out there and how they can affect people. Stereotyping is disrespectful and discriminative. It will do more harm than good, because it disharmonizes the society and causes hatred. Why people like to stereotype certain groups of people? I don't know. I think it's because they are afraid of the unknown. They don't know how to react to something different. They don't know how to react to something that they don't understand. So they like to stereotype other people that they don't know well or feel different from them. I think it's a way to protect themselves from the unknown. I think that people should open up themselves and learn more about other people's culture and tradition, instead of stereotyping them as something bad or unpleasant. Only when all the people in this world accept each other's difference can they embrace the happiness derived from other people's heartful contribution to the society. \n",
        "source": "user",
        "start_time": 539.0,
        "end_time": 827.0,
        "last_event_time": 827.0,
        "start_progress": 0.7600574712643678,
        "end_progress": 1.0
    }
]