{
    "0c7bfadbd8db49b4b793e2a46e581759.jsonl": {
        "errors": [
            "nots",
            "fi",
            "sci"
        ],
        "error_sentences": [
            "Thus begins the story of the \"Lost Generations\" in this thought-provoking speculative sci-fi novel.",
            "It was once again a case of the haves and have nots."
        ]
    },
    "278af098f2784b7ba22335f356ab854e.jsonl": {
        "errors": [
            "unbee",
            "lievable",
            "coincidently"
        ],
        "error_sentences": [
            "Which coincidently, is not really your mother.\" revealed Buzz.",
            "unbee-lievable.\" said Buzz jokingly."
        ]
    },
    "2cd036c85bce43f180f81abd83525110.jsonl": {
        "errors": [
            "conclsuion",
            "datings",
            "signficant",
            "fiance"
        ],
        "error_sentences": [
            "What datings app do for someone who uses them the right way is open up the pool of potential partners to a much higher number than if they were to go out physically searching for a partner.",
            "Later on, i met my fiance on a dating app whom I hit it off with right away.",
            "However, if you are using an app like netflix productively, and enjoying a show with your signficant other and cuddling, this can be a positive.",
            "So in conclsuion, i personally feel that technology nowadays is a good thing for dating and relationships."
        ]
    },
    "308df34d38ce447a957e540a6cde21c7.jsonl": {
        "errors": [
            "truthdog",
            "influencer",
            "influencers",
            "nator"
        ],
        "error_sentences": [
            "Even if Matt Damon's disappearance and the known culprit being the aliens, the media and social media influencers are more interested with the new couple.",
            "Parker, a social media influencer with over 100K followers."
        ]
    },
    "335ffea5a1a8426badc75a2fa056a1a8.jsonl": {
        "errors": [
            "dissapear",
            "visially",
            "me's"
        ],
        "error_sentences": [
            "I sit there and await just as the other me's are awaiting.",
            "visially these all seem like different people standing here with me, however our thoughts are interconnected in a weird way that i can not explain at this point in time.",
            "Will we just dissapear?"
        ]
    },
    "4a1587e75edd4d1297755c1f526108d7.jsonl": {
        "errors": [
            "unbothered",
            "exotifying",
            "hypersexualizing"
        ],
        "error_sentences": [
            "Whether it's exotifying a character of color to make them mysterious or different with no real substance, whether it's hypersexualizing or desexualizing a character in line with axes of historical oppression against their kind, or whether it's something as lazy as giving them two surnames for a name instead of a legitimate first name and a family name, racist writing tropes signal to me as a reader that an author has no integrity as a writer and is too unbothered to even do cursory research or imagine their own characters as thee-dimensional, multifaceted beings."
        ]
    },
    "5265ab6df085473795385139bc7f821a.jsonl": {
        "errors": [
            "hashtag",
            "influencers",
            "fi",
            "sci"
        ],
        "error_sentences": [
            "Damon is a very nice man, and he's a very good actor, and I'm sure he'll be fine.\"\n\nOf course, Matt Damon was well known for this sci-fi movies such as The Martian, Interstellar, and The Bourne Identity.",
            "Other pranksters and social media influencers were also trying to save Matt Damon but no efforts have come close to getting him back.",
            "The hashtag #SaveMattDamon was trending on Twitter, and even the President of the United States, Donald Trump (who is in his 5th term), tweeted about it."
        ]
    },
    "55c68fe2661343d4b1ab43ba95db5c09.jsonl": {
        "errors": [
            "fiance",
            "other's",
            "eharmony"
        ],
        "error_sentences": [
            "I'm a girl named Soeurette who met my fiance Matt online through Tinder.",
            "I mean, it's not like I met him on eHarmony or Match.com.",
            "We fell asleep in each other's arms, and it was the best night of my life."
        ]
    },
    "57f0dbe735624c44b58c67e78a31caa6.jsonl": {
        "errors": [
            "cryptocurrency",
            "datacenter",
            "blockchain"
        ],
        "error_sentences": [
            "You've also just created a distributed system that is a lot like a blockchain.",
            "The blockchain is a distributed ledger.",
            "They fly around the datacenter, and land on the servers.",
            "Or the bees have made it for you, by using their distributed system to make an addendum to the Belarus' servers blockchain with their own Bee-Blockchain.",
            "The bees have just created a new cryptocurrency.",
            "This is the future of blockchain."
        ]
    },
    "58e702b7c7e249a0aaf762ea10f833b3.jsonl": {
        "errors": [
            "motived",
            "terraforming",
            "ve",
            "handedly"
        ],
        "error_sentences": [
            "They ’ve put together an elite team, comprised of the best mercenaries our planet has to offer.",
            "The kidnapping wasn't motived by profit or a desire to possess, it turns out that the alien is a huge fan of Matt Damon, and was simply too shy to introduce himself.",
            "Next they hit up Saturn, and Matt Damon is stunned by the lovely rings, as well as the fact that they've come so close to terraforming them.",
            "Single-handedly, he manages to take out the whole squad of mercenaries, and then realizes that the alien was the love of his life, and is gone forever, thanks to Earth."
        ]
    },
    "5db9af9d7eb8449482b05842af955c63.jsonl": {
        "errors": [
            "elses",
            "wierd",
            "blurr",
            "me's",
            "becuase"
        ],
        "error_sentences": [
            "It was a little wierd since it was a bunch of naked me's, however still very interesting.",
            "It was funny becuase all though we all looked similar, we had different intricate changes from the time period we were living in.",
            "After a while of seeing the different life experiences, i was able to see my current reincarnation from the broad view, and it looked like everyone elses individual cinema's had paused.",
            "Just as i noticed that the reincarnation was speaking to the parents, my vision started to blurr and fade to black."
        ]
    },
    "60ac23b47a594ad881b0ee62839b1fcb.jsonl": {
        "errors": [
            "bestie",
            "coms",
            "multi"
        ],
        "error_sentences": [
            "In these stories, the gay characters or even any of the LGBT characters are portrayed to be multi-dimensional and not just the sidekick or plot device.",
            "And lastly, I cringe about how the typical gay bestie in rom-coms are typically the ones that are very out there with the flamboyancy, and they scream \"Hooker Queen\" with their over the top outfits and make-up.",
            "So to summarize my point, let's just remove the gay bestie trope in any form of media from now on.",
            "It's time to showcase LGBT characters for who they are, and to allow LGBT actors and actresses to be multi-dimensional characters."
        ]
    },
    "6395e22e141c4ee0bf233b95a63a61ea.jsonl": {
        "errors": [
            "teleport",
            "teleporting",
            "teleportation",
            "teleports",
            "teleported"
        ],
        "error_sentences": [
            "The aliens move by teleporting.",
            "Any place they have been, or any place they will go in the future, they can teleport to.",
            "Matt Damon has survived both the alien abduction, and being teleported through the ship.",
            "Ben Affleck is an expert at teleporting.",
            "He has studied the alien teleportation, and knows all its secrets.",
            "When the aliens shield themselves, Ben Affleck uses a special little device that blocks the alien's teleportation.",
            "He then teleports into the alien ship, and frees Matt Damon."
        ]
    },
    "7e400fae43e543b0a6719cc2974029de.jsonl": {
        "errors": [
            "baconism",
            "troughery",
            "baconists"
        ],
        "error_sentences": [
            "He would not do anything to support baconism.",
            "The baconists would not have him for breakfast, not today and not ever.",
            "He would go for a trough, at the local troughery, even when he wasn't hungry."
        ]
    },
    "836d8f49af1340ee84cd534b2051bd34.jsonl": {
        "errors": [
            "fiancee",
            "embarassing",
            "convienance"
        ],
        "error_sentences": [
            "I am not a female, however i know that when my fiancee gets her period it can be stressful when it comes to blood showing on her clothes if she doesnt have a tampon or pad.",
            "It can be super embarassing i would assume for a girl to have to go through this, and also scary in a way.",
            "This convienance would mean more to the girls than i think they would even be able to communicate."
        ]
    },
    "842e37eb2e4d49ea883303dd9b01dc54.jsonl": {
        "errors": [
            "cringey",
            "steretype",
            "antogonist",
            "alot"
        ],
        "error_sentences": [
            "This makes me cringe simply because of how direct it is as a steretype.",
            "In addition to this, the stereotype also brings along other characters that are cringey like the sidekick of the popular kids.",
            "Since often times the popular kid in school ends up being an antogonist, and getting to see the antogonist loose at the end of the movie is something that a lot of people like seeing in a movie.",
            "I learn a lot about myself and also learn alot about different situations people can go through."
        ]
    },
    "8d732ed8f2cc4bb393aab9f68c82e408.jsonl": {
        "errors": [
            "villian",
            "sequal",
            "villians"
        ],
        "error_sentences": [
            "Wolf was devious at heart, and knew that having the strongest house in the village only made him stronger as a villian.",
            "\"Villian\" was not really the word to describe wolf however during the day to day.",
            "The wolf simply had impulses that he needed to indulge in that caused him to become a villian.",
            "He was a villian because he was a wolf, and wolves were villians.",
            "Will the wolf be able to complete the home or will this be the sequal to the three little pigs, only reversed and with 92 pigs instead."
        ]
    },
    "917d343c54e145969496c1aabe8c321c.jsonl": {
        "errors": [
            "disabilitied",
            "itd",
            "arent",
            "maths"
        ],
        "error_sentences": [
            "All the more advanced types of maths and sciences arent all that beneficial to many of the lives of students, especially those who plan on working after graduation.",
            "I think itd be a great idea to teach about foods as a way to heal your body, like medicine.",
            "I grew up with ADHD, so i always viewed this as a crutch growing through school because i was different and disabilitied in that environment."
        ]
    },
    "95804c7277db4d538b06492830bed43c.jsonl": {
        "errors": [
            "tht",
            "withg",
            "teh"
        ],
        "error_sentences": [
            "But tht is post-school life anyway - graduates with degrees from \"better\"  schools have an easier time finding better, higher paying jobs, and student athletes from schools with strong programs are more likely to go on to be professional athletes.",
            "Paying athletes like any other employee would allow a more fair system that could be regulated and monitored, and withg teh right rules could benefit everyone."
        ]
    },
    "95a0ce79d7ed4a77a0981c522b3deda7.jsonl": {
        "errors": [
            "occured",
            "chapte",
            "undercurrant",
            "predictabily"
        ],
        "error_sentences": [
            "In chapter after chapte.",
            "Although fictional, one at times believes that various post-war situations could have easily occured.",
            "It depicts accurate attitudes that occured by citizens and the government of Russia after the war.",
            "Suspicion is the undercurrant of every word spoken; of every action taken.",
            "At one point, almost predictabily, she felt tempted to disappear with another new identity so she could be with the man she promised herself to not fall in love with."
        ]
    },
    "9a29f841869a4fd98cf358da50f4a340.jsonl": {
        "errors": [
            "totaly",
            "me's",
            "fi",
            "sci"
        ],
        "error_sentences": [
            "While totaly confused, I still felt calm and after looking up and seeing my parents on the screen holding me as a child, I sat down and started to enjoy the show.",
            "After the movie me and all the other me's which must have numbered in the thousands went into the lobby to interact with each other and to mainly try to find out what was going on.",
            "We all had crazy ideas since we were all sci-fi geeks except for .0021% of us."
        ]
    },
    "ada1c4b3f99847d9907e77dd96200ed9.jsonl": {
        "errors": [
            "nutjob",
            "selfies",
            "wasn"
        ],
        "error_sentences": [
            "And she was also coming on way too strong, even though I was obviously putting all signs out there that I wasn’t interested in a serious relationship.",
            "I mean, I just wasn't getting any good vibes from her.",
            "She immediately started freaking out, even though I had told her that I wasn't serious about having a relationship with her the night before.",
            "But that didn't stop her from sending me a series of crazy texts and posting selfies of herself on Facebook, with tags to my account, over the next few weeks.",
            "So yes, while she's terrific at making herself look all glamorous on her Tinder profile, she's a nutjob who has no one to blame but herself for giving me a negative impression of her."
        ]
    },
    "ae1a4e491d3045dc9cac0b30f832667e.jsonl": {
        "errors": [
            "chatrooms",
            "ll",
            "aren",
            "hashtag",
            "unfriend"
        ],
        "error_sentences": [
            "It’s so much easier to be mean to somebody on the other side of a screen, and then you can just “unfriend\" them.",
            "It’s all about, “I’ll send you a message, and we’ll use texting and chatrooms instead.\" People are being held away at a distance, instead of being able to sit in the same room and talk to somebody.",
            "We’re all so busy trying to tweet the best hashtag, or say something that will get a \"Share\" or a “Like,\" that we’re not taking the time to acknowledge the human being right in front of us.",
            "My mom went into a meeting with a school teacher who told her the kids aren’t playing in the playground anymore."
        ]
    },
    "ba6d32a6c29a4bfeacf1e25a87a1f804.jsonl": {
        "errors": [
            "dressor",
            "trans",
            "dissapearing",
            "shrooms"
        ],
        "error_sentences": [
            "I look to my dressor and see a mug.",
            "The letter kept appearing and dissapearing over and over, like some sort of magic.",
            "He told me that i had taken some shrooms and was most likely hallucinating or in a trans...."
        ]
    },
    "c362a09a04644abcab777be73f508034.jsonl": {
        "errors": [
            "elses",
            "arnd",
            "isnt",
            "severly"
        ],
        "error_sentences": [
            "As long as present time with one another is still met, than the screen time use isnt a huge deal.",
            "Social media breeds constant comparisons of your life to someone elses.",
            "I think apps for entertainment can be good however because it provides a sense of entertainment for you arnd your partner.",
            "Even with this, they severly limiting their pool of people to choose from."
        ]
    },
    "c8fe68ef837447728273c137d49a144f.jsonl": {
        "errors": [
            "caualties",
            "weilders",
            "trianing",
            "firece"
        ],
        "error_sentences": [
            "To keep others like her from giving themselves away like she almost did, she looks out for other people exhibiting odd behavior, who might also be Mana weilders.",
            "When she does, she is shocked to discover that they are not only ready and willing to help, they themselves have been trianing hard to take on the aliens on their own.",
            "The battle is long and firece, with many human caualties in all three battle locations."
        ]
    },
    "da72913a2d764538a71c9607212b148c.jsonl": {
        "errors": [
            "didn",
            "men's",
            "women's"
        ],
        "error_sentences": [
            "I cannot fathom how much money I would have saved if I didn’t have to worry about how I was going to afford tampons and pads.",
            "And moreover, don't experts always say that women's savings accounts are far less than men's?"
        ]
    },
    "e3152d380e13471a91d31ab07f01255c.jsonl": {
        "errors": [
            "cryogenicly",
            "olds",
            "petri",
            "unthawing"
        ],
        "error_sentences": [
            "By this time the lost generations are all older but certain treatments have increased their lifespan as well so instead of a 100 year old person they are more like 50 year olds.",
            "Then it is found out that the mass chambers of cryogenicly frozen bodies are starting to fail.",
            "They are unthawing and we are not done.",
            "Just then one of the lost generation's older scientists sneeze right onto a petri-dish."
        ]
    },
    "ea8c98f9c0ab41d0b488acadca0e635b.jsonl": {
        "errors": [
            "disharmonizes",
            "other's",
            "heartful"
        ],
        "error_sentences": [
            "It will do more harm than good, because it disharmonizes the society and causes hatred.",
            "Only when all the people in this world accept each other's difference can they embrace the happiness derived from other people's heartful contribution to the society."
        ]
    },
    "f1523aa1deaa487c917db18be99ac355.jsonl": {
        "errors": [
            "another's",
            "expreme",
            "adreneline"
        ],
        "error_sentences": [
            "Their pursuit needs to be solitary or with others that acknowledge the potential to be harmed or killed by another's action.",
            "Some people are adreneline junkies and look for extreme sports to feel that high.",
            "Ultimately, expreme sports is a personal decision that should not be taken away by regulation or otherwise controlling authority."
        ]
    }
}