[
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.17159498207885304
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion,it should be provided especially when and if it happens as an accident in school and the girl does not know that it is coming as it brings less embarrassment and a lifelong fear. Girls that do not know what a period is at the beginning of their puberty years can make a big deal out of it and it can cause a scar in their lifetime if they start to bleed all of a sudden in school and do not have pads or tampon to help with the flow. At least the state should have some kind of emergency kit implemented in every school and that goes for middle school right thru high school . For boys these are not things to worry about but for a girl this can be a big thing when it comes to their puberty years. If the schools do not have budget for kit as standby , they should have an option where all the teachers come together and could buy such a kit and keep it on hand. These girls reputation are at hands if they start bleeding in class and it can have a lasting effect right thru middle school or high school and brings a sort of stigma. Parents should also be aware or be more involved in their teen girls life of when they are starting their period, that may also help with the girls carrying extra pads or tampons in their backpacks so they can have them at hand anytime they need. Other than parents and teachers not having emergency pads or tampons on hand it would be up to the student to take care of such things , so in that case there should be more education about this in class, like a special class for all freshman when they first enter high school to teach them the basics. Or there should be books or dvd's provided to help them deal with the situation. That will help them in private to deal with these things and it will also give them more confidence in confiding in parents or even teachers about what should be done about the topic. \n",
        "source": "user",
        "start_time": 15.0,
        "end_time": 655.0,
        "last_event_time": 655.0,
        "start_progress": 0.17159498207885304,
        "end_progress": 1.0
    }
]