[
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.3020408163265306
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion, people personify pets, they anthropomorphize them. So dogs and cats might as well be a person with a history, personality, and relationships. They are considered part of the family so I do understand why people would choose their pets 40 percent of the time over a strangers life. However, we have the financial capacity and the capacity to care enough about both issues. This should not be an either or, it should be a both. The world is both full of people problems and animal problems. We need to prioritize them to reduce the most suffering on both sides. The conditions of people and animals are not separate so when one is doing well the other is usually doing well. Pets have also been bread over the years to get cuter and for humans that means resemble children with their big round eyes and small facial features. We look at a puppy and part of us unconsciously thinks of a young child. We then want to nurture and protect it. \n",
        "source": "user",
        "start_time": 18.0,
        "end_time": 448.0,
        "last_event_time": 448.0,
        "start_progress": 0.3020408163265306,
        "end_progress": 0.7806122448979592
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion, people personify pets, they anthropomorphize them. So dogs and cats might as well be a person with a history, personality, and relationships. They are considered part of the family so I do understand why people would choose their pets 40 percent of the time over a strangers life. However, we have the financial capacity and the capacity to care enough about both issues. This should not be an either or, it should be a both. The world is both full of people problems and animal problems. We need to prioritize them to reduce the most suffering on both sides. The conditions of people and animals are not separate so when one is doing well the other is usually doing well. Pets have also been bread over the years to get cuter and for humans that means resemble children with their big round eyes and small facial features. We look at a puppy and part of us unconsciously thinks of a young child. We then want to nurture and protect it. This is why we are more empathetic to the suffering of animals.\n",
        "source": "api",
        "start_time": 459.0,
        "end_time": 459.0,
        "last_event_time": 459.0,
        "start_progress": 0.7806122448979592,
        "end_progress": 0.8127551020408164
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion, people personify pets, they anthropomorphize them. So dogs and cats might as well be a person with a history, personality, and relationships. They are considered part of the family so I do understand why people would choose their pets 40 percent of the time over a strangers life. However, we have the financial capacity and the capacity to care enough about both issues. This should not be an either or, it should be a both. The world is both full of people problems and animal problems. We need to prioritize them to reduce the most suffering on both sides. The conditions of people and animals are not separate so when one is doing well the other is usually doing well. Pets have also been bread over the years to get cuter and for humans that means resemble children with their big round eyes and small facial features. We look at a puppy and part of us unconsciously thinks of a young child. We then want to nurture and protect it. This is one of the main reasons we are so overly empathetic to the suffering of our pets but not so much animals in the wild. We need a comprehensive plan to increase the well being of both humans and animals. A healthy human civilization could end up saving many more animals then it uses if we, ourselves can get our act together. Choosing between the two would be an reckless at best. We must tackle both issues simultaneously.\n",
        "source": "user",
        "start_time": 465.0,
        "end_time": 638.0,
        "last_event_time": 638.0,
        "start_progress": 0.8127551020408164,
        "end_progress": 1.0
    }
]