[
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.1302163833075734
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, the things that we are typically taught in school are pretty pointless. I know that personally I haven't used much of what I learned in school. The number one subject that I think is important to learn in school is math.\n\nMath is essential. We use it every day. I disagree with some of the ways that it is taught in school though. We should be learning things that are valuable. For example, figuring out how to generate a tip to leave a server based on different percentages.\n\nWe should learn about things that are important such as interest rates and mortgages. These are things that will help us as we become adults. \n\nThere are things that we learn in history that also is extremely important. History allows us to not repeat mistakes that had happened previously. Without that evidence, we wouldn't know that it was a mistake in the first place. We also learn about previous cultures and can appreciate how our ancestors lived.\n\nThe most important thing that I learned in school was math and then when I went to college it would be computer science. My major was Computer Science and I currently work as a Technical Support Manager at a web hosting company.\n\nI feel like there are aspects of college that are a waste of time as well. Ultimately, it comes down to money and greed. I knew I wanted to do something related to Computer Science when I was in High School. I was placed into the Computer Science program at my University from Day One.\n\nMy first year in college I took a grand total of 0 computer science classes. This was because I had to waste time and money taking classes that don't pertain to computer science. Classes like English, Theology, and Art. \n\nThese classes have nothing to do with my major, but I can't graduate without them. The more you think about school the more you realize that it's an imperfect solution. \n\nSchool should simply be there to teach children the important aspects of life. School should also help children learn to socialize, learn how to behave and learn how to follow rules. That sets a standard that they will have to follow when they become adults. \n\nThe school system is valuable, but it bothers me to this day that it is an imperfect one that is built off of greed and ignorance in my opinion. \n",
        "source": "user",
        "start_time": 31.0,
        "end_time": 578.0,
        "last_event_time": 578.0,
        "start_progress": 0.1302163833075734,
        "end_progress": 1.0
    }
]