[
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.31607047517351844
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion, yes it is, we should watch out for each other first, and then worry about animals.  \n",
        "source": "user",
        "start_time": 14.0,
        "end_time": 77.0,
        "last_event_time": 77.0,
        "start_progress": 0.31607047517351844,
        "end_progress": 0.3614522156967432
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion, yes it is, we should watch out for each other first, and then worry about animals.   But I think we should also be able to help animals in need as much as we can.\n",
        "source": "api",
        "start_time": 89.0,
        "end_time": 89.0,
        "last_event_time": 89.0,
        "start_progress": 0.3614522156967432,
        "end_progress": 0.40309663641217297
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion, yes it is, we should watch out for each other first, and then worry about animals.   But I think we should also be able to help animals in need as much as we can.  We should also think about why animals are suffering, is it because of harm caused by us, or is it does nature taking its course.  However, our main concern has to be for each other, our societal standards demand that we watch out for one another.  If we want others to watch over us and be there for us, we have to be willing to do the same.  It can be heart wrenching to see animals suffering, and if we have the ability to intervene we should.  But this should not be in place of taking care of those people who are suffering, whether here or abroad.  We can do many things to protect animals, making choices in how we live our lives and what actions to take, and these can benefit animals in an on going way.  But much of animal suffering is just the natural world, and if we truly got involved we would never have time for anything else in our lives.\n",
        "source": "user",
        "start_time": 92.0,
        "end_time": 704.0,
        "last_event_time": 704.0,
        "start_progress": 0.40309663641217297,
        "end_progress": 0.8606513614522157
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion, yes it is, we should watch out for each other first, and then worry about animals.   But I think we should also be able to help animals in need as much as we can.  We should also think about why animals are suffering, is it because of harm caused by us, or is it does nature taking its course.  However, our main concern has to be for each other, our societal standards demand that we watch out for one another.  If we want others to watch over us and be there for us, we have to be willing to do the same.  It can be heart wrenching to see animals suffering, and if we have the ability to intervene we should.  But this should not be in place of taking care of those people who are suffering, whether here or abroad.  We can do many things to protect animals, making choices in how we live our lives and what actions to take, and these can benefit animals in an on going way.  But much of animal suffering is just the natural world, and if we truly got involved we would never have time for anything else in our lives.  That is what I believe, we should help others in need, and not be taken up in the suffering of animals.\n",
        "source": "api",
        "start_time": 731.0,
        "end_time": 731.0,
        "last_event_time": 731.0,
        "start_progress": 0.8606513614522157,
        "end_progress": 0.9167111585691404
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion, yes it is, we should watch out for each other first, and then worry about animals.   But I think we should also be able to help animals in need as much as we can.  We should also think about why animals are suffering, is it because of harm caused by us, or is it does nature taking its course.  However, our main concern has to be for each other, our societal standards demand that we watch out for one another.  If we want others to watch over us and be there for us, we have to be willing to do the same.  It can be heart wrenching to see animals suffering, and if we have the ability to intervene we should.  But this should not be in place of taking care of those people who are suffering, whether here or abroad.  We can do many things to protect animals, making choices in how we live our lives and what actions to take, and these can benefit animals in an on going way.  But much of animal suffering is just the natural world, and if we truly got involved we would never have time for anything else in our lives.  That is what I believe, we should help others in need, and not be taken up in the suffering of animals.  I am certain in this opinion that we can't equate the suffering of a human with an animal, and it is, therefore wrong to focus on animals ahead of humans.\n",
        "source": "user",
        "start_time": 743.0,
        "end_time": 813.0,
        "last_event_time": 813.0,
        "start_progress": 0.9167111585691404,
        "end_progress": 1.0
    }
]