[
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.1827801827801828
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating.  \n",
        "source": "user",
        "start_time": 18.0,
        "end_time": 45.0,
        "last_event_time": 45.0,
        "start_progress": 0.1827801827801828,
        "end_progress": 0.21693121693121692
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating.   We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.\n",
        "source": "api",
        "start_time": 57.0,
        "end_time": 57.0,
        "last_event_time": 57.0,
        "start_progress": 0.21693121693121692,
        "end_progress": 0.27705627705627706
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media \n",
        "source": "user",
        "start_time": 60.0,
        "end_time": 107.0,
        "last_event_time": 107.0,
        "start_progress": 0.27705627705627706,
        "end_progress": 0.3088023088023088
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media , people develop unrealistic expectations of relationships and partner's personalities.\n",
        "source": "api",
        "start_time": 113.0,
        "end_time": 113.0,
        "last_event_time": 113.0,
        "start_progress": 0.3088023088023088,
        "end_progress": 0.35064935064935066
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, \n",
        "source": "user",
        "start_time": 118.0,
        "end_time": 157.0,
        "last_event_time": 157.0,
        "start_progress": 0.35064935064935066,
        "end_progress": 0.36892736892736894
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.\n",
        "source": "api",
        "start_time": 163.0,
        "end_time": 163.0,
        "last_event_time": 163.0,
        "start_progress": 0.36892736892736894,
        "end_progress": 0.3872053872053872
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating \n",
        "source": "user",
        "start_time": 165.0,
        "end_time": 176.0,
        "last_event_time": 176.0,
        "start_progress": 0.3872053872053872,
        "end_progress": 0.4016354016354016
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating a fake image online and attributing a persona that doesn't exist in real life.\n",
        "source": "api",
        "start_time": 192.0,
        "end_time": 192.0,
        "last_event_time": 192.0,
        "start_progress": 0.4016354016354016,
        "end_progress": 0.43915343915343913
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating a fake image online and attributing a persona that doesn't exist in real life.  Then when it comes to meeting them they bare no resemblance to their presentation.  Also, the images of their lives \n",
        "source": "user",
        "start_time": 194.0,
        "end_time": 251.0,
        "last_event_time": 251.0,
        "start_progress": 0.43915343915343913,
        "end_progress": 0.4959114959114959
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating a fake image online and attributing a persona that doesn't exist in real life.  Then when it comes to meeting them they bare no resemblance to their presentation.  Also, the images of their lives that they present on social media are far removed from their actual lives.\n",
        "source": "api",
        "start_time": 264.0,
        "end_time": 264.0,
        "last_event_time": 264.0,
        "start_progress": 0.4959114959114959,
        "end_progress": 0.5315055315055315
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating a fake image online and attributing a persona that doesn't exist in real life..  Also, the images of their lives that they present on social media are far removed from their actual lives, all you see is the positives, not the negatives.   Then when it comes to meeting them they bare no resemblance to their presentation, either in appearance or what they do.  All of this creates \n",
        "source": "user",
        "start_time": 269.0,
        "end_time": 340.0,
        "last_event_time": 340.0,
        "start_progress": 0.5315055315055315,
        "end_progress": 0.5848965848965849
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating a fake image online and attributing a persona that doesn't exist in real life..  Also, the images of their lives that they present on social media are far removed from their actual lives, all you see is the positives, not the negatives.   Then when it comes to meeting them they bare no resemblance to their presentation, either in appearance or what they do.  All of this creates an UNREAL expectation that everyone else is doing the same as them and that others WILL fit into that trend.\n",
        "source": "api",
        "start_time": 354.0,
        "end_time": 354.0,
        "last_event_time": 354.0,
        "start_progress": 0.5848965848965849,
        "end_progress": 0.6368446368446369
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating a fake image online and attributing a persona that doesn't exist in real life..  Also, the images of their lives that they present on social media are far removed from their actual lives, all you see is the positives, not the negatives.   Then when it comes to meeting them they bare no resemblance to their presentation, either in appearance or what they do.  All of this creates an unreal expectation that cannot be met in real life.  People compare their romantic lives \n",
        "source": "user",
        "start_time": 357.0,
        "end_time": 437.0,
        "last_event_time": 437.0,
        "start_progress": 0.6368446368446369,
        "end_progress": 0.6291486291486291
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating a fake image online and attributing a persona that doesn't exist in real life..  Also, the images of their lives that they present on social media are far removed from their actual lives, all you see is the positives, not the negatives.   Then when it comes to meeting them they bare no resemblance to their presentation, either in appearance or what they do.  All of this creates an unreal expectation that cannot be met in real life.  People compare their romantic lives to those on TV and social media, causing increased dissatisfaction and disillusionment.\n",
        "source": "api",
        "start_time": 445.0,
        "end_time": 445.0,
        "last_event_time": 445.0,
        "start_progress": 0.6291486291486291,
        "end_progress": 0.670995670995671
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating a fake image online and attributing a persona that doesn't exist in real life..  Also, the images of their lives that they present on social media are far removed from their actual lives, all you see is the positives, not the negatives.   Then when it comes to meeting them they bare no resemblance to their presentation, either in appearance or what they do.  All of this creates an unreal expectation that cannot be met in real life.  People compare their romantic lives to those on TV and social media, causing increased dissatisfaction and disillusionment.  Dating apps also focus on the appearance over substance, and their is no development \n",
        "source": "user",
        "start_time": 455.0,
        "end_time": 494.0,
        "last_event_time": 494.0,
        "start_progress": 0.670995670995671,
        "end_progress": 0.7128427128427128
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating a fake image online and attributing a persona that doesn't exist in real life..  Also, the images of their lives that they present on social media are far removed from their actual lives, all you see is the positives, not the negatives.   Then when it comes to meeting them they bare no resemblance to their presentation, either in appearance or what they do.  All of this creates an unreal expectation that cannot be met in real life.  People compare their romantic lives to those on TV and social media, causing increased dissatisfaction and disillusionment.  Dating apps also focus on the appearance over substance, and their is no development of an interpersonal relationship that exists in real life, which I think is vital to a healthy relationship.\n",
        "source": "api",
        "start_time": 506.0,
        "end_time": 506.0,
        "last_event_time": 506.0,
        "start_progress": 0.7128427128427128,
        "end_progress": 0.7647907647907648
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating a fake image online and attributing a persona that doesn't exist in real life..  Also, the images of their lives that they present on social media are far removed from their actual lives, all you see is the positives, not the negatives.   Then when it comes to meeting them they bare no resemblance to their presentation, either in appearance or what they do.  All of this creates an unreal expectation that cannot be met in real life.  People compare their romantic lives to those on TV and social media, causing increased dissatisfaction and disillusionment.  Dating apps also focus on the appearance over substance, and their is no development of an interpersonal relationship that exists in real life, which I think is vital to a healthy relationship.  People used to get to know each other, at work, in bars, at other social events, now \n",
        "source": "user",
        "start_time": 508.0,
        "end_time": 534.0,
        "last_event_time": 534.0,
        "start_progress": 0.7647907647907648,
        "end_progress": 0.8066378066378066
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating a fake image online and attributing a persona that doesn't exist in real life..  Also, the images of their lives that they present on social media are far removed from their actual lives, all you see is the positives, not the negatives.   Then when it comes to meeting them they bare no resemblance to their presentation, either in appearance or what they do.  All of this creates an unreal expectation that cannot be met in real life.  People compare their romantic lives to those on TV and social media, causing increased dissatisfaction and disillusionment.  Dating apps also focus on the appearance over substance, and their is no development of an interpersonal relationship that exists in real life, which I think is vital to a healthy relationship.  People used to get to know each other, at work, in bars, at other social events, now they meet through a virtual world that encourages narcissism and reflection over human interactions.\n",
        "source": "api",
        "start_time": 558.0,
        "end_time": 558.0,
        "last_event_time": 558.0,
        "start_progress": 0.8066378066378066,
        "end_progress": 0.8547378547378547
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating a fake image online and attributing a persona that doesn't exist in real life..  Also, the images of their lives that they present on social media are far removed from their actual lives, all you see is the positives, not the negatives.   Then when it comes to meeting them they bare no resemblance to their presentation, either in appearance or what they do.  All of this creates an unreal expectation that cannot be met in real life.  People compare their romantic lives to those on TV and social media, causing increased dissatisfaction and disillusionment.  Dating apps also focus on the appearance over substance, and their is no development of an interpersonal relationship that exists in real life, which I think is vital to a healthy relationship.  People used to get to know each other, at work, in bars, at other social events, now they meet through a virtual world that encourages narcissism over human interactions.  All in all, I feel that our romantic lives have suffered in the digital age, \n",
        "source": "user",
        "start_time": 575.0,
        "end_time": 613.0,
        "last_event_time": 613.0,
        "start_progress": 0.8547378547378547,
        "end_progress": 0.8855218855218855
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating a fake image online and attributing a persona that doesn't exist in real life..  Also, the images of their lives that they present on social media are far removed from their actual lives, all you see is the positives, not the negatives.   Then when it comes to meeting them they bare no resemblance to their presentation, either in appearance or what they do.  All of this creates an unreal expectation that cannot be met in real life.  People compare their romantic lives to those on TV and social media, causing increased dissatisfaction and disillusionment.  Dating apps also focus on the appearance over substance, and their is no development of an interpersonal relationship that exists in real life, which I think is vital to a healthy relationship.  People used to get to know each other, at work, in bars, at other social events, now they meet through a virtual world that encourages narcissism over human interactions.  All in all, I feel that our romantic lives have suffered in the digital age, that lack of social interaction is not conducive to growth of personal relationships.\n",
        "source": "api",
        "start_time": 626.0,
        "end_time": 626.0,
        "last_event_time": 626.0,
        "start_progress": 0.8855218855218855,
        "end_progress": 0.9264069264069265
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating a fake image online and attributing a persona that doesn't exist in real life..  Also, the images of their lives that they present on social media are far removed from their actual lives, all you see is the positives, not the negatives.   Then when it comes to meeting them they bare no resemblance to their presentation, either in appearance or what they do.  All of this creates an unreal expectation that cannot be met in real life.  People compare their romantic lives to those on TV and social media, causing increased dissatisfaction and disillusionment.  Dating apps also focus on the appearance over substance, and their is no development of an interpersonal relationship that exists in real life, which I think is vital to a healthy relationship.  People used to get to know each other, at work, in bars, at other social events, now they meet through a virtual world that encourages narcissism over human interactions.  All in all, I feel that our romantic lives have suffered in the digital age, that lack of social interaction is not conducive to growth of personal relationships.  It is too late to turn back the clock, but \n",
        "source": "user",
        "start_time": 638.0,
        "end_time": 648.0,
        "last_event_time": 648.0,
        "start_progress": 0.9264069264069265,
        "end_progress": 0.948051948051948
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating a fake image online and attributing a persona that doesn't exist in real life..  Also, the images of their lives that they present on social media are far removed from their actual lives, all you see is the positives, not the negatives.   Then when it comes to meeting them they bare no resemblance to their presentation, either in appearance or what they do.  All of this creates an unreal expectation that cannot be met in real life.  People compare their romantic lives to those on TV and social media, causing increased dissatisfaction and disillusionment.  Dating apps also focus on the appearance over substance, and their is no development of an interpersonal relationship that exists in real life, which I think is vital to a healthy relationship.  People used to get to know each other, at work, in bars, at other social events, now they meet through a virtual world that encourages narcissism over human interactions.  All in all, I feel that our romantic lives have suffered in the digital age, that lack of social interaction is not conducive to growth of personal relationships.  It is too late to turn back the clock, but maybe there is a way to minimize the damage that technology has caused?\n",
        "source": "api",
        "start_time": 663.0,
        "end_time": 663.0,
        "last_event_time": 663.0,
        "start_progress": 0.948051948051948,
        "end_progress": 0.9822029822029822
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has had a detrimental affect on relationships and dating., for many reasons.  We have lost the art of socializing and communicating face-to-face, which precludes a closer interaction between two people.  Due to unrealistic depictions in modern media, people develop unrealistic expectations of relationships and partner's personalities.  All these apps are about appearance, and have nothing to do with substance.  People spend hours curating a fake image online and attributing a persona that doesn't exist in real life..  Also, the images of their lives that they present on social media are far removed from their actual lives, all you see is the positives, not the negatives.   Then when it comes to meeting them they bare no resemblance to their presentation, either in appearance or what they do.  All of this creates an unreal expectation that cannot be met in real life.  People compare their romantic lives to those on TV and social media, causing increased dissatisfaction and disillusionment.  Dating apps also focus on the appearance over substance, and their is no development of an interpersonal relationship that exists in real life, which I think is vital to a healthy relationship.  People used to get to know each other, at work, in bars, at other social events, now they meet through a virtual world that encourages narcissism over human interactions.  All in all, I feel that our romantic lives have suffered in the digital age, that lack of social interaction is not conducive to growth of personal relationships.  It is too late to turn back the clock, but maybe there is a way to minimize the damage that technology has caused?  Technology has not been beneficial.\n",
        "source": "user",
        "start_time": 665.0,
        "end_time": 691.0,
        "last_event_time": 691.0,
        "start_progress": 0.9822029822029822,
        "end_progress": 1.0
    }
]