[
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.18523985239852397
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. \n",
        "source": "user",
        "start_time": 19.0,
        "end_time": 113.0,
        "last_event_time": 113.0,
        "start_progress": 0.18523985239852397,
        "end_progress": 0.2878228782287823
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. \n\nI think that creating offensive stereotypical characters is bad because it is a form of discrimination.\n",
        "source": "api",
        "start_time": 130.0,
        "end_time": 130.0,
        "last_event_time": 130.0,
        "start_progress": 0.2878228782287823,
        "end_progress": 0.36531365313653136
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. \n",
        "source": "user",
        "start_time": 132.0,
        "end_time": 136.0,
        "last_event_time": 136.0,
        "start_progress": 0.36531365313653136,
        "end_progress": 0.36457564575645757
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. It is a form of discrimination because it is a way of saying that all people who are like the character are bad.\n",
        "source": "api",
        "start_time": 153.0,
        "end_time": 153.0,
        "last_event_time": 153.0,
        "start_progress": 0.36457564575645757,
        "end_progress": 0.44723247232472324
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. It is a form of discrimination because it is a way of saying that all people who are like the character are bad. It is also a way of saying that all people who are like the character are stupid.\n",
        "source": "api",
        "start_time": 176.0,
        "end_time": 176.0,
        "last_event_time": 176.0,
        "start_progress": 0.44723247232472324,
        "end_progress": 0.5077490774907749
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. It is a form of discrimination because it is a way of saying that all people who are like the character are bad and stupid. \n",
        "source": "user",
        "start_time": 197.0,
        "end_time": 202.0,
        "last_event_time": 202.0,
        "start_progress": 0.5077490774907749,
        "end_progress": 0.45608856088560884
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. It is a form of discrimination because it is a way of saying that all people who are like the character are bad and stupid. It is also a way of saying that all people who are like the character are not as good as people who are not like the character.\n",
        "source": "api",
        "start_time": 217.0,
        "end_time": 217.0,
        "last_event_time": 217.0,
        "start_progress": 0.45608856088560884,
        "end_progress": 0.5498154981549815
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. It is a form of discrimination because it is a way of saying that all people who are like the character are bad and stupid. It is also a way of saying that all people who are like the character are not as good as people who are not like the character. But does it really apply to the real world situations? \n",
        "source": "user",
        "start_time": 219.0,
        "end_time": 245.0,
        "last_event_time": 245.0,
        "start_progress": 0.5498154981549815,
        "end_progress": 0.5911439114391144
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. It is a form of discrimination because it is a way of saying that all people who are like the character are bad and stupid. It is also a way of saying that all people who are like the character are not as good as people who are not like the character. But does it really apply to the real world situations? I think that it does not.\n",
        "source": "api",
        "start_time": 252.0,
        "end_time": 252.0,
        "last_event_time": 252.0,
        "start_progress": 0.5911439114391144,
        "end_progress": 0.6095940959409594
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. It is a form of discrimination because it is a way of saying that all people who are like the character are bad and stupid. It is also a way of saying that all people who are like the character are not as good as people who are not like the character. But does it really apply to the real world situations? I think that it does not. I think that it is just a way of entertainment.\n",
        "source": "api",
        "start_time": 272.0,
        "end_time": 272.0,
        "last_event_time": 272.0,
        "start_progress": 0.6095940959409594,
        "end_progress": 0.6450184501845019
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. It is a form of discrimination because it is a way of saying that all people who are like the character are bad and stupid. It is also a way of saying that all people who are like the character are not as good as people who are not like the character. But does it really apply to the real world situations? I think that it does not. I think that it is just a way of entertainment and it is very superficial. \n",
        "source": "user",
        "start_time": 278.0,
        "end_time": 290.0,
        "last_event_time": 290.0,
        "start_progress": 0.6450184501845019,
        "end_progress": 0.6656826568265682
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. It is a form of discrimination because it is a way of saying that all people who are like the character are bad and stupid. It is also a way of saying that all people who are like the character are not as good as people who are not like the character. But does it really apply to the real world situations? I think that it does not. I think that it is just a way of entertainment and it is very superficial. I think that it is not a good way of entertainment because it is not realistic.\n",
        "source": "api",
        "start_time": 306.0,
        "end_time": 306.0,
        "last_event_time": 306.0,
        "start_progress": 0.6656826568265682,
        "end_progress": 0.7239852398523985
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. It is a form of discrimination because it is a way of saying that all people who are like the character are bad and stupid. It is also a way of saying that all people who are like the character are not as good as people who are not like the character. But does it really apply to the real world situations? I think that it does not. It is just a way of entertainment and is very superficial. Sadly, it is not a good way of entertainment because it is not realistic. Remember that no two people are born alike. \n",
        "source": "user",
        "start_time": 317.0,
        "end_time": 416.0,
        "last_event_time": 416.0,
        "start_progress": 0.7239852398523985,
        "end_progress": 0.7409594095940959
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. It is a form of discrimination because it is a way of saying that all people who are like the character are bad and stupid. It is also a way of saying that all people who are like the character are not as good as people who are not like the character. But does it really apply to the real world situations? I think that it does not. It is just a way of entertainment and is very superficial. Sadly, it is not a good way of entertainment because it is not realistic. Remember that no two people are born alike. We are all different and unique.\n",
        "source": "api",
        "start_time": 428.0,
        "end_time": 428.0,
        "last_event_time": 428.0,
        "start_progress": 0.7409594095940959,
        "end_progress": 0.7645756457564575
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. It is a form of discrimination because it is a way of saying that all people who are like the character are bad and stupid. It is also a way of saying that all people who are like the character are not as good as people who are not like the character. But does it really apply to the real world situations? I think that it does not. It is just a way of entertainment and is very superficial. Sadly, it is not a good way of entertainment because it is not realistic. Remember that no two people are born alike. We are all different and unique. We all have different personalities and different ways of thinking.\n",
        "source": "api",
        "start_time": 437.0,
        "end_time": 437.0,
        "last_event_time": 437.0,
        "start_progress": 0.7645756457564575,
        "end_progress": 0.814760147601476
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. It is a form of discrimination because it is a way of saying that all people who are like the character are bad and stupid. It is also a way of saying that all people who are like the character are not as good as people who are not like the character. But does it really apply to the real world situations? I think that it does not. It is just a way of entertainment and is very superficial. Sadly, it is not a good way of entertainment because it is not realistic. Remember that no two people are born alike. We are all different and unique. We all have different personalities and different ways of thinking. We all have different ways of acting and behaving.\n",
        "source": "api",
        "start_time": 474.0,
        "end_time": 474.0,
        "last_event_time": 474.0,
        "start_progress": 0.814760147601476,
        "end_progress": 0.8523985239852399
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. It is a form of discrimination because it is a way of saying that all people who are like the character are bad and stupid. It is also a way of saying that all people who are like the character are not as good as people who are not like the character. But does it really apply to the real world situations? I think that it does not. It is just a way of entertainment and is very superficial. Sadly, it is not a good way of entertainment because it is not realistic. Remember that no two people are born alike. We are all different and unique. We all have different personalities and different ways of thinking, and thus different ways of acting and behaving. Taking all these into consideration, how can someone stereotype a specific group of people? \n",
        "source": "user",
        "start_time": 482.0,
        "end_time": 535.0,
        "last_event_time": 535.0,
        "start_progress": 0.8523985239852399,
        "end_progress": 0.9188191881918819
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. It is a form of discrimination because it is a way of saying that all people who are like the character are bad and stupid. It is also a way of saying that all people who are like the character are not as good as people who are not like the character. But does it really apply to the real world situations? I think that it does not. It is just a way of entertainment and is very superficial. Sadly, it is not a good way of entertainment because it is not realistic. Remember that no two people are born alike. We are all different and unique. We all have different personalities and different ways of thinking, and thus different ways of acting and behaving. Taking all these into consideration, how can someone stereotype a specific group of people? It is impossible.\n",
        "source": "api",
        "start_time": 549.0,
        "end_time": 549.0,
        "last_event_time": 549.0,
        "start_progress": 0.9188191881918819,
        "end_progress": 0.9313653136531366
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, creating offensive stereotypical characters is bad and I would not watch or read something because of its offensive portrayal of someone. I think that creating offensive stereotypical characters is bad because it is a form of discrimination. It is a form of discrimination because it is a way of saying that all people who are like the character are bad and stupid. It is also a way of saying that all people who are like the character are not as good as people who are not like the character. But does it really apply to the real world situations? I think that it does not. It is just a way of entertainment and is very superficial. Sadly, it is not a good way of entertainment because it is not realistic. Remember that no two people are born alike. We are all different and unique. We all have different personalities and different ways of thinking, and thus different ways of acting and behaving. Taking all these into consideration, how can someone stereotype a specific group of people? It is impossible. So just stop stereotyping. To conclude, creating offensive stereotypical characters is bad. \n",
        "source": "user",
        "start_time": 552.0,
        "end_time": 613.0,
        "last_event_time": 613.0,
        "start_progress": 0.9313653136531366,
        "end_progress": 1.0
    }
]