[
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.18419647624132407
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we definitely aren't bad citizens if we don't keep up with the news. The news can be so stressful, even traumatizing for people if they are too plugged in to it. \n",
        "source": "user",
        "start_time": 20.0,
        "end_time": 86.0,
        "last_event_time": 86.0,
        "start_progress": 0.18419647624132407,
        "end_progress": 0.27122263747997866
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we definitely aren't bad citizens if we don't keep up with the news. The news can be so stressful, even traumatizing for people if they are too plugged in to it. A lot of what's happening in the world should be left separate from our lives.\n",
        "source": "api",
        "start_time": 112.0,
        "end_time": 112.0,
        "last_event_time": 112.0,
        "start_progress": 0.27122263747997866,
        "end_progress": 0.31286705819540844
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we definitely aren't bad citizens if we don't keep up with the news. The news can be so stressful, even traumatizing for people if they are too plugged in to it. A lot of what's happening in the world should be left separate from our lives. Big world events are important to know, but the small things like someone getting stabbed at a convenience store, just serve to cause fear and it doesn't help society for everyone to know. \n",
        "source": "user",
        "start_time": 116.0,
        "end_time": 163.0,
        "last_event_time": 163.0,
        "start_progress": 0.31286705819540844,
        "end_progress": 0.4143085958355579
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we definitely aren't bad citizens if we don't keep up with the news. The news can be so stressful, even traumatizing for people if they are too plugged in to it. A lot of what's happening in the world should be left separate from our lives. Big world events are important to know, but the small things like someone getting stabbed at a convenience store, just serve to cause fear and it doesn't help society for everyone to know. Especially if the news mentions how horrible this store is and encourages people to avoid it, then suddenly the people who work at said store are worried it will\n",
        "source": "api",
        "start_time": 200.0,
        "end_time": 200.0,
        "last_event_time": 200.0,
        "start_progress": 0.4143085958355579,
        "end_progress": 0.5002669514148425
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we definitely aren't bad citizens if we don't keep up with the news. The news can be so stressful, even traumatizing for people if they are too plugged in to it. A lot of what's happening in the world should be left separate from our lives. Big world events are important to know, but the small things like someone getting stabbed at a convenience store, just serve to cause fear and it doesn't help society for everyone to know. I do think it is important for people to know what's going on in regard to some things. \n",
        "source": "user",
        "start_time": 211.0,
        "end_time": 244.0,
        "last_event_time": 244.0,
        "start_progress": 0.5002669514148425,
        "end_progress": 0.4612920448478377
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we definitely aren't bad citizens if we don't keep up with the news. The news can be so stressful, even traumatizing for people if they are too plugged in to it. A lot of what's happening in the world should be left separate from our lives. Big world events are important to know, but the small things like someone getting stabbed at a convenience store, just serve to cause fear and it doesn't help society for everyone to know. I do think it is important for people to know what's going on in regard to some things. Being informed of what's going on in the world politically can benefit us, but I don't believe that we need to know all of the crazy stuff\n",
        "source": "api",
        "start_time": 262.0,
        "end_time": 262.0,
        "last_event_time": 262.0,
        "start_progress": 0.4612920448478377,
        "end_progress": 0.5349706353443673
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we definitely aren't bad citizens if we don't keep up with the news. The news can be so stressful, even traumatizing for people if they are too plugged in to it. A lot of what's happening in the world should be left separate from our lives. Big world events are important to know, but the small things like someone getting stabbed at a convenience store, just serve to cause fear and it doesn't help society for everyone to know. Being informed of what's going on in the world politically can benefit us, but I don't believe that we need to know all of the crazy stuff. I do think it is important for people to know what's going on in regard to some things. \n",
        "source": "user",
        "start_time": 272.0,
        "end_time": 312.0,
        "last_event_time": 312.0,
        "start_progress": 0.5349706353443673,
        "end_progress": 0.5360384410037373
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we definitely aren't bad citizens if we don't keep up with the news. The news can be so stressful, even traumatizing for people if they are too plugged in to it. A lot of what's happening in the world should be left separate from our lives. Big world events are important to know, but the small things like someone getting stabbed at a convenience store, just serve to cause fear and it doesn't help society for everyone to know. Being informed of what's going on in the world politically can benefit us, but I don't believe that we need to know all of the crazy stuff. I do think it is important for people to know what's going on in regard to some things. I wouldn't want to live somewhere where I didn't know that the environment was being poisoned.\n",
        "source": "api",
        "start_time": 321.0,
        "end_time": 321.0,
        "last_event_time": 321.0,
        "start_progress": 0.5360384410037373,
        "end_progress": 0.5862253069941271
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we definitely aren't bad citizens if we don't keep up with the news. The news can be so stressful, even traumatizing for people if they are too plugged in to it. A lot of what's happening in the world should be left separate from our lives. Big world events are important to know, but the small things like someone getting stabbed at a convenience store, just serve to cause fear and it doesn't help society for everyone to know. Being informed of what's going on in the world politically can benefit us, but I don't believe that we need to know all of the crazy stuff. I do think it is important for people to know what's going on in regard to some things. I wouldn't want to live somewhere where I didn't know that the environment was being poisoned. I would also want to know if our country was threatened by war. \n",
        "source": "user",
        "start_time": 324.0,
        "end_time": 343.0,
        "last_event_time": 343.0,
        "start_progress": 0.5862253069941271,
        "end_progress": 0.620928990923652
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we definitely aren't bad citizens if we don't keep up with the news. The news can be so stressful, even traumatizing for people if they are too plugged in to it. A lot of what's happening in the world should be left separate from our lives. Big world events are important to know, but the small things like someone getting stabbed at a convenience store, just serve to cause fear and it doesn't help society for everyone to know. Being informed of what's going on in the world politically can benefit us, but I don't believe that we need to know all of the crazy stuff. I do think it is important for people to know what's going on in regard to some things. I wouldn't want to live somewhere where I didn't know that the environment was being poisoned. I would also want to know if our country was threatened by war. Those are things that a person should never have to ignore in general.\n",
        "source": "api",
        "start_time": 368.0,
        "end_time": 368.0,
        "last_event_time": 368.0,
        "start_progress": 0.620928990923652,
        "end_progress": 0.6583021890016018
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we definitely aren't bad citizens if we don't keep up with the news. The news can be so stressful, even traumatizing for people if they are too plugged in to it. A lot of what's happening in the world should be left separate from our lives. Big world events are important to know, but the small things like someone getting stabbed at a convenience store, just serve to cause fear and it doesn't help society for everyone to know. Being informed of what's going on in the world politically can benefit us, but I don't believe that we need to know all of the crazy stuff. I do think it is important for people to know what's going on in regard to some things. I wouldn't want to live somewhere where I didn't know that the environment was being poisoned. I would also want to know if our country was threatened by war. Those are things that a person should never have to ignore in general. But, sometimes it's easy to learn about the important things just by talking to people. There isn't a need to follow so closely to keep up with what is going on. \n",
        "source": "user",
        "start_time": 373.0,
        "end_time": 455.0,
        "last_event_time": 455.0,
        "start_progress": 0.6583021890016018,
        "end_progress": 0.7453283502402562
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we definitely aren't bad citizens if we don't keep up with the news. The news can be so stressful, even traumatizing for people if they are too plugged in to it. A lot of what's happening in the world should be left separate from our lives. Big world events are important to know, but the small things like someone getting stabbed at a convenience store, just serve to cause fear and it doesn't help society for everyone to know. Being informed of what's going on in the world politically can benefit us, but I don't believe that we need to know all of the crazy stuff. I do think it is important for people to know what's going on in regard to some things. I wouldn't want to live somewhere where I didn't know that the environment was being poisoned. I would also want to know if our country was threatened by war. Those are things that a person should never have to ignore in general. But, sometimes it's easy to learn about the important things just by talking to people. There isn't a need to follow so closely to keep up with what is going on. I don't think that everyone has a responsibility to know what is going on in the news, but I do believe that every person should feel some sort\n",
        "source": "api",
        "start_time": 464.0,
        "end_time": 464.0,
        "last_event_time": 464.0,
        "start_progress": 0.7453283502402562,
        "end_progress": 0.8216764548852109
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we definitely aren't bad citizens if we don't keep up with the news. The news can be so stressful, even traumatizing for people if they are too plugged in to it. A lot of what's happening in the world should be left separate from our lives. Big world events are important to know, but the small things like someone getting stabbed at a convenience store, just serve to cause fear and it doesn't help society for everyone to know. Being informed of what's going on in the world politically can benefit us, but I don't believe that we need to know all of the crazy stuff. I do think it is important for people to know what's going on in regard to some things. I wouldn't want to live somewhere where I didn't know that the environment was being poisoned. I would also want to know if our country was threatened by war. Those are things that a person should never have to ignore in general. But, sometimes it's easy to learn about the important things just by talking to people. There isn't a need to follow so closely to keep up with what is going on. I don't think that everyone has a responsibility to know what is going on in the news, but I do believe that every person should feel some sort of connection to people so that they at least care about what is going on. Engaging with current events can be one way of doing this, but it isn't the only way. So in conclusion, no, I do not think we are being bad citizens if we don't keep up with the news because there are still so many other ways to be involved, good citizens.  \n",
        "source": "user",
        "start_time": 469.0,
        "end_time": 635.0,
        "last_event_time": 635.0,
        "start_progress": 0.8216764548852109,
        "end_progress": 1.0
    }
]