[
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.2487382840663302
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we are not being bad citizens if we don't keep up with the news.\n",
        "source": "api",
        "start_time": 33.0,
        "end_time": 33.0,
        "last_event_time": 33.0,
        "start_progress": 0.2487382840663302,
        "end_progress": 0.29560201874549386
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we are not being bad citizens if we don't keep up with the news. I think that it is a matter of personal \n",
        "source": "user",
        "start_time": 34.0,
        "end_time": 66.0,
        "last_event_time": 66.0,
        "start_progress": 0.29560201874549386,
        "end_progress": 0.32516222062004324
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we are not being bad citizens if we don't keep up with the news. I think that it is a matter of personal choice.\n",
        "source": "api",
        "start_time": 82.0,
        "end_time": 82.0,
        "last_event_time": 82.0,
        "start_progress": 0.32516222062004324,
        "end_progress": 0.3302090843547224
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we are not being bad citizens if we don't keep up with the news. I think that it is a matter of personal choice. Everyone has a different point of view \n",
        "source": "user",
        "start_time": 83.0,
        "end_time": 90.0,
        "last_event_time": 90.0,
        "start_progress": 0.3302090843547224,
        "end_progress": 0.3590483056957462
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we are not being bad citizens if we don't keep up with the news. I think that it is a matter of personal choice. Everyone has a different point of view and different things that they are interested in.\n",
        "source": "api",
        "start_time": 94.0,
        "end_time": 94.0,
        "last_event_time": 94.0,
        "start_progress": 0.3590483056957462,
        "end_progress": 0.39437635183850034
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we are not being bad citizens if we don't keep up with the news. I think that it is a matter of personal choice. Everyone has a different point of view and different things that they are interested in. I think that it is important to know what is going on in the world, but I don't think that it is necessary to know every single detail\n",
        "source": "api",
        "start_time": 121.0,
        "end_time": 121.0,
        "last_event_time": 121.0,
        "start_progress": 0.39437635183850034,
        "end_progress": 0.49170872386445563
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we are not being bad citizens if we don't keep up with the news. I think that it is a matter of personal choice. Everyone has a different point of view and different things that they are interested in. I think that it is important to know what is going on in the world, but I don't think that it is necessary to know every single detail. I think it is counterproductive to get too involved in news. I think it is bad for the psyche to read or watch the news too much. \n",
        "source": "user",
        "start_time": 122.0,
        "end_time": 185.0,
        "last_event_time": 185.0,
        "start_progress": 0.49170872386445563,
        "end_progress": 0.5868781542898341
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we are not being bad citizens if we don't keep up with the news. I think that it is a matter of personal choice. Everyone has a different point of view and different things that they are interested in. I think that it is important to know what is going on in the world, but I don't think that it is necessary to know every single detail. I think it is counterproductive to get too involved in news. I think it is bad for the psyche to read or watch the news too much. It can be very depressing and it can make you feel helpless.\n",
        "source": "api",
        "start_time": 195.0,
        "end_time": 195.0,
        "last_event_time": 195.0,
        "start_progress": 0.5868781542898341,
        "end_progress": 0.6301369863013698
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we are not being bad citizens if we don't keep up with the news. I think that it is a matter of personal choice. Everyone has a different point of view and different things that they are interested in. I think that it is important to know what is going on in the world, but I don't think that it is necessary to know every single detail. I think it is counterproductive to get too involved in news. I think it is bad for the psyche to read or watch the news too much. It can be very depressing and it can make you feel helpless.  There is no telling what goes on in the world that is not reported, so we cannot assume that if we watch all the news, we know everything that's going. I think everyone should just seek out what they feel called to know.  Furthermore, \n",
        "source": "user",
        "start_time": 234.0,
        "end_time": 413.0,
        "last_event_time": 413.0,
        "start_progress": 0.6301369863013698,
        "end_progress": 0.8010093727469358
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we are not being bad citizens if we don't keep up with the news. I think that it is a matter of personal choice. Everyone has a different point of view and different things that they are interested in. I think that it is important to know what is going on in the world, but I don't think that it is necessary to know every single detail. I think it is counterproductive to get too involved in news. I think it is bad for the psyche to read or watch the news too much. It can be very depressing and it can make you feel helpless.  There is no telling what goes on in the world that is not reported, so we cannot assume that if we watch all the news, we know everything that's going. I think everyone should just seek out what they feel called to know.  Furthermore, I think that the news is not always accurate.\n",
        "source": "api",
        "start_time": 437.0,
        "end_time": 437.0,
        "last_event_time": 437.0,
        "start_progress": 0.8010093727469358,
        "end_progress": 0.8334534967555876
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we are not being bad citizens if we don't keep up with the news. I think that it is a matter of personal choice. Everyone has a different point of view and different things that they are interested in. I think that it is important to know what is going on in the world, but I don't think that it is necessary to know every single detail. I think it is counterproductive to get too involved in news. I think it is bad for the psyche to read or watch the news too much. It can be very depressing and it can make you feel helpless.  There is no telling what goes on in the world that is not reported, so we cannot assume that if we watch all the news, we know everything that's going. I think everyone should just seek out what they feel called to know.  Furthermore, I think that the news is not always accurate. It is often biased and it is often sensationalized.\n",
        "source": "api",
        "start_time": 459.0,
        "end_time": 459.0,
        "last_event_time": 459.0,
        "start_progress": 0.8334534967555876,
        "end_progress": 0.8709444844989185
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we are not being bad citizens if we don't keep up with the news. I think that it is a matter of personal choice. Everyone has a different point of view and different things that they are interested in. I think that it is important to know what is going on in the world, but I don't think that it is necessary to know every single detail. I think it is counterproductive to get too involved in news. I think it is bad for the psyche to read or watch the news too much. It can be very depressing and it can make you feel helpless.  There is no telling what goes on in the world that is not reported, so we cannot assume that if we watch all the news, we know everything that's going. I think everyone should just seek out what they feel called to know.  Furthermore, I think that the news is not always accurate. It is often biased and it is often sensationalized. A lot of times, you'll learn the best information from friends and family or any group with any shared sense of community.  In the end, \n",
        "source": "user",
        "start_time": 462.0,
        "end_time": 526.0,
        "last_event_time": 526.0,
        "start_progress": 0.8709444844989185,
        "end_progress": 0.969718817591925
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, we are not being bad citizens if we don't keep up with the news. I think that it is a matter of personal choice. Everyone has a different point of view and different things that they are interested in. I think that it is important to know what is going on in the world, but I don't think that it is necessary to know every single detail. I think it is counterproductive to get too involved in news. I think it is bad for the psyche to read or watch the news too much. It can be very depressing and it can make you feel helpless.  There is no telling what goes on in the world that is not reported, so we cannot assume that if we watch all the news, we know everything that's going. I think everyone should just seek out what they feel called to know.  Furthermore, I think that the news is not always accurate. It is often biased and it is often sensationalized. A lot of times, you'll learn the best information from friends and family or any group with any shared sense of community.  In the end, I think it is a matter of personal choice.\n",
        "source": "api",
        "start_time": 541.0,
        "end_time": 541.0,
        "last_event_time": 541.0,
        "start_progress": 0.969718817591925,
        "end_progress": 1.0
    }
]