[
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.18783984181908056
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has made romantic interactions better and has improved the dating scene. Just take technology out of the equation for a second. No phones, no internet. How do you keep in touch with your boyfriend or girlfriend if you're not living in the same area? You would have to drive just to have simple communication with them.  \n",
        "source": "user",
        "start_time": 24.0,
        "end_time": 152.0,
        "last_event_time": 152.0,
        "start_progress": 0.18783984181908056,
        "end_progress": 0.351952545724172
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has made romantic interactions better and has improved the dating scene. Just take technology out of the equation for a second. No phones, no internet. How do you keep in touch with your boyfriend or girlfriend if you're not living in the same area? You would have to drive just to have simple communication with them.   And you can't spend all your time in a car.\n",
        "source": "api",
        "start_time": 161.0,
        "end_time": 161.0,
        "last_event_time": 161.0,
        "start_progress": 0.351952545724172,
        "end_progress": 0.3737024221453287
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology has made romantic interactions better and has improved the dating scene. Just take technology out of the equation for a second. No phones, no internet. How do you keep in touch with your boyfriend or girlfriend if you're not living in the same area? You would have to drive just to have simple communication with them.   And you can't spend all your time in a car. The gas prices alone would cost you a fortune.\n\nLuckily for us, technology has helped the dating scene. We are able to communicate via phone call, text, FaceTime, etc. There is also dating apps that can even help us meet the man or woman of our dreams. \n\nTechnology has made it much easier to break the ice. It has made it easier to keep long distance relationships happy and healthy. I have used Tinder in the past and it takes a lot of the stress and anxiety out of the beginning stages of dating.\n\nYou simply swipe in one direction if you're interested in the person in the picture and swipe the other way if you're not. \n\nTechnology can also allow couples to bond using an app like Netflix. Think of how many shows on Netflix have been appointment viewing for couples. Stranger Things and Outer Banks come to mind right away. Technology also allows us to take photos and videos of our experiences with our significant other which can create memories that last forever. Without those pictures and videos all we really can rely on is our memory.\n\nIn general, I believe that technology has had a very positive effect on dating and relationships. It has made dating much easier and has helped relationships become stronger and more enjoyable for the people involved.\n",
        "source": "user",
        "start_time": 162.0,
        "end_time": 568.0,
        "last_event_time": 568.0,
        "start_progress": 0.3737024221453287,
        "end_progress": 1.0
    }
]