[
    {
        "text": "Should College Athletes Be Paid?\n\nDo you think college athletes should be paid? Or is a college scholarship and other non-monetary perks like the opportunity to play in front of cheering fans enough?\n\nIn “Paying Students to Play Would Ruin College Sports,\" Cody J. McDavis writes: “Paying student-athletes might sound like a fairer way to treat students who generate so much money and attention for their colleges (not to mention the television networks that broadcast their games). But paying athletes would distort the economics of college sports in a way that would hurt the broader community of student-athletes, universities, fans and alumni. A handful of big sports programs would pay top dollar for a select few athletes, while almost every other college would get caught up in a bidding war it couldn't afford.\"\n\nDo you find his argument persuasive? What possible difficulties or downsides might there be in providing monetary compensation to players?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.36495535714285715
    },
    {
        "text": "Should College Athletes Be Paid?\n\nDo you think college athletes should be paid? Or is a college scholarship and other non-monetary perks like the opportunity to play in front of cheering fans enough?\n\nIn “Paying Students to Play Would Ruin College Sports,\" Cody J. McDavis writes: “Paying student-athletes might sound like a fairer way to treat students who generate so much money and attention for their colleges (not to mention the television networks that broadcast their games). But paying athletes would distort the economics of college sports in a way that would hurt the broader community of student-athletes, universities, fans and alumni. A handful of big sports programs would pay top dollar for a select few athletes, while almost every other college would get caught up in a bidding war it couldn't afford.\"\n\nDo you find his argument persuasive? What possible difficulties or downsides might there be in providing monetary compensation to players?\n\n---\n\nIn my opinion, paying college athletes is a good idea.\n",
        "source": "api",
        "start_time": 58.0,
        "end_time": 58.0,
        "last_event_time": 58.0,
        "start_progress": 0.36495535714285715,
        "end_progress": 0.37983630952380953
    },
    {
        "text": "Should College Athletes Be Paid?\n\nDo you think college athletes should be paid? Or is a college scholarship and other non-monetary perks like the opportunity to play in front of cheering fans enough?\n\nIn “Paying Students to Play Would Ruin College Sports,\" Cody J. McDavis writes: “Paying student-athletes might sound like a fairer way to treat students who generate so much money and attention for their colleges (not to mention the television networks that broadcast their games). But paying athletes would distort the economics of college sports in a way that would hurt the broader community of student-athletes, universities, fans and alumni. A handful of big sports programs would pay top dollar for a select few athletes, while almost every other college would get caught up in a bidding war it couldn't afford.\"\n\nDo you find his argument persuasive? What possible difficulties or downsides might there be in providing monetary compensation to players?\n\n---\n\nIn my opinion, paying college athletes is a good idea. The only problem i think would be the star players earning more money than the other players. As the prompt states, i think this would cause a bidding type of war. Basically, the schools with the most money would end up ruling the league. I think a better alternative would be a stipend or something like that so college players would be able to live comfortably and not have to worry about any sort of expenses during the school year. There is no need for the athletes to be paid like professionals, however they should be granted some sort of money just because of the impact they are making for the school financially. There are stories of college athletes who cant even afford food during the stay in college. This is unacceptable due to all they do for the university.\n\nAnother possible issue that may come with paying NCAA athletes would be the fact that some schools have a lot more money than other schools. This would make it difficult for the NCAA to issue any league wide policy for athletes. I think it would turn into some sort of percentage, and this would still cause a big difference in the amount of money athletes make from school to school. So in a way, the bidding process would still be a thing. Maybe having a cap would be a good way to work around this idea if equality was what they were shooting for in the NCAA. Either way, there seems to be drawbacks for each type of method chosen. In conclusion, i still feel that NCAA athletes should be paid some sort of money. The specific way it is done is up in the air, but i think most people agree that it is very inhumane to not offer the athletes anything when the organization profits so much.\n",
        "source": "user",
        "start_time": 59.0,
        "end_time": 607.0,
        "last_event_time": 607.0,
        "start_progress": 0.37983630952380953,
        "end_progress": 1.0
    }
]