[
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.23155985489721886
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I think schools should provide pads or tampons to students. Not every student is going to have a pad or tampon with them when their period strikes and I do not think that \"period poverty\" is even a thing. \n",
        "source": "user",
        "start_time": 18.0,
        "end_time": 118.0,
        "last_event_time": 118.0,
        "start_progress": 0.23155985489721886,
        "end_progress": 0.3561064087061669
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I think schools should provide pads or tampons to students. Not every student is going to have a pad or tampon with them when their period strikes and I do not think that \"period poverty\" is even a thing. I think that it is just a way for people to make fun of girls and women who are on their period.\n",
        "source": "api",
        "start_time": 148.0,
        "end_time": 148.0,
        "last_event_time": 148.0,
        "start_progress": 0.3561064087061669,
        "end_progress": 0.41414752116082226
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I think schools should provide pads or tampons to students. Not every student is going to have a pad or tampon with them when their period strikes and I do not think that \"period poverty\" is even a thing, I think that it is just a way for people to make fun of girls and women who are on their period. It is no different than having toilet paper or paper towels available to students. No one makes fun of people for using the paper towel dispenser after they have washed their hands. You don't hear about \"towel poverty\". It is not an issue. I am not a female and I do not have first-hand experience with this, but I never heard any of the girls in my school get teased for anything like \"period poverty\". I think that schools would be actually helping the female students out by making pads available to them. I don't think they should be shamed for not having a sanitary napkin on them at all times or have that be a reason to not make tampons or pads available to students. Maybe having some sort of pamphlet or lesson on how to not make your classmates feel bad about their bodily functions may help alleviate any issues with how students are treated regarding their periods. I do not see any reason to not be able to offer pads and tampons to students as it stands.\n",
        "source": "user",
        "start_time": 151.0,
        "end_time": 582.0,
        "last_event_time": 582.0,
        "start_progress": 0.41414752116082226,
        "end_progress": 1.0
    }
]