[
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.2456367162249515
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, it both helps and hurts people's relationship status but I think it does more to hurt then help. Some people have wonderful success on dating apps but most do not have that kind of luck and give up fairly quickly. There are also the older generations who still view it as a odd. Most of all though, the isolation being caused by your personal technological devices are what is keeping most people from finding each other. \n",
        "source": "user",
        "start_time": 18.0,
        "end_time": 181.0,
        "last_event_time": 181.0,
        "start_progress": 0.2456367162249515,
        "end_progress": 0.5190691661279897
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, it both helps and hurts people's relationship status but I think it does more to hurt then help. Some people have wonderful success on dating apps but most do not have that kind of luck and give up fairly quickly. There are also the older generations who still view it as a odd. Most of all though, the isolation being caused by your personal technological devices are what is keeping most people from finding each other. The digital tools of today are replacing all real world social interaction with people and devices to replace what your friends should be doing.\n",
        "source": "api",
        "start_time": 201.0,
        "end_time": 201.0,
        "last_event_time": 201.0,
        "start_progress": 0.5190691661279897,
        "end_progress": 0.612152553329024
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, it both helps and hurts people's relationship status but I think it does more to hurt then help. Some people have wonderful success on dating apps but most do not have that kind of luck and give up fairly quickly. There are also the older generations who still view it as a odd. Most of all though, the isolation being caused by your personal technological devices are what is keeping most people from finding each other. The digital tools of today are replacing all real world social interaction with filtered digital interactions. I cant stress how important it is to physically interact with people, especially possible mates. There is a lot more going on besides just talking. There are chemical interactions such as pheromones that help you subconsciously choose a mate. There are countless other physical ques that we see or detect on an unconscious level that help us to find our partners.  \nI do believe dating apps and socializing over our devices are a very efficient way to get to know people and interact in a more controlled way but I think being with someone in person is the true way to see if you are compatible on more then just a couple of levels. \n",
        "source": "user",
        "start_time": 229.0,
        "end_time": 602.0,
        "last_event_time": 602.0,
        "start_progress": 0.612152553329024,
        "end_progress": 1.0
    }
]