[
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.24853990914990265
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I’d support efforts to provide feminine hygiene products in schools.\n",
        "source": "api",
        "start_time": 14.0,
        "end_time": 14.0,
        "last_event_time": 14.0,
        "start_progress": 0.24853990914990265,
        "end_progress": 0.29331602855288774
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I’d support efforts to provide feminine hygiene products in schools. Feminine hygiene products are necessary. \n",
        "source": "user",
        "start_time": 18.0,
        "end_time": 32.0,
        "last_event_time": 32.0,
        "start_progress": 0.29331602855288774,
        "end_progress": 0.32057105775470474
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I’d support efforts to provide feminine hygiene products in schools. Feminine hygiene products are necessary. They’re part of a basic need, like food and shelter.\n",
        "source": "api",
        "start_time": 40.0,
        "end_time": 40.0,
        "last_event_time": 40.0,
        "start_progress": 0.32057105775470474,
        "end_progress": 0.35431537962362103
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I’d support efforts to provide feminine hygiene products in schools. Feminine hygiene products are necessary. They’re part of a basic need, like food and shelter. Some students might not know what to do if they need one. \n",
        "source": "user",
        "start_time": 68.0,
        "end_time": 78.0,
        "last_event_time": 78.0,
        "start_progress": 0.35431537962362103,
        "end_progress": 0.3926022063595068
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I’d support efforts to provide feminine hygiene products in schools. Feminine hygiene products are necessary. They’re part of a basic need, like food and shelter. Some students might not know what to do if they need one. They might feel alone and isolated.\n",
        "source": "api",
        "start_time": 123.0,
        "end_time": 123.0,
        "last_event_time": 123.0,
        "start_progress": 0.3926022063595068,
        "end_progress": 0.4153147306943543
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I’d support efforts to provide feminine hygiene products in schools. Feminine hygiene products are necessary. They’re part of a basic need, like food and shelter. Some students might not know what to do if they need one. They might feel alone and isolated and not know who to ask. Having them in a vending machine is not good enough. \n",
        "source": "user",
        "start_time": 129.0,
        "end_time": 180.0,
        "last_event_time": 180.0,
        "start_progress": 0.4153147306943543,
        "end_progress": 0.46593121349772876
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I’d support efforts to provide feminine hygiene products in schools. Feminine hygiene products are necessary. They’re part of a basic need, like food and shelter. Some students might not know what to do if they need one. They might feel alone and isolated and not know who to ask. Having them in a vending machine is not good enough. They should be easily accessible to all students.\n",
        "source": "api",
        "start_time": 198.0,
        "end_time": 198.0,
        "last_event_time": 198.0,
        "start_progress": 0.46593121349772876,
        "end_progress": 0.49772874756651525
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I’d support efforts to provide feminine hygiene products in schools. Feminine hygiene products are necessary. They’re part of a basic need, like food and shelter. Some students might not know what to do if they need one. They might feel alone and isolated and not know who to ask. Having them in a vending machine is not good enough. They should be easily accessible to all students at no charge. Some students just can't afford to buy them. They are at risk of embarrassing situations. Having them available and easily accessible gives students peace of mind. \n",
        "source": "user",
        "start_time": 199.0,
        "end_time": 336.0,
        "last_event_time": 336.0,
        "start_progress": 0.49772874756651525,
        "end_progress": 0.6132381570408826
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I’d support efforts to provide feminine hygiene products in schools. Feminine hygiene products are necessary. They’re part of a basic need, like food and shelter. Some students might not know what to do if they need one. They might feel alone and isolated and not know who to ask. Having them in a vending machine is not good enough. They should be easily accessible to all students at no charge. Some students just can't afford to buy them. They are at risk of embarrassing situations. Having them available and easily accessible gives students peace of mind. They might be less likely to opt out of sports and other activities because they’ll be more comfortable.\n",
        "source": "api",
        "start_time": 360.0,
        "end_time": 360.0,
        "last_event_time": 360.0,
        "start_progress": 0.6132381570408826,
        "end_progress": 0.6807268007787152
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I’d support efforts to provide feminine hygiene products in schools. Feminine hygiene products are necessary. They’re part of a basic need, like food and shelter. Some students might not know what to do if they need one. They might feel alone and isolated and not know who to ask. Having them in a vending machine is not good enough. They should be easily accessible to all students at no charge. Some students just can't afford to buy them. They are at risk of embarrassing situations. Having them available and easily accessible gives students peace of mind. They might be less likely to opt out of sports and other activities because they’ll be more comfortable but having them provided to students for free increases their likelihood of participating in sports and group activities. \n",
        "source": "user",
        "start_time": 365.0,
        "end_time": 383.0,
        "last_event_time": 383.0,
        "start_progress": 0.6807268007787152,
        "end_progress": 0.7598961713173265
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I’d support efforts to provide feminine hygiene products in schools. Feminine hygiene products are necessary. They’re part of a basic need, like food and shelter. Some students might not know what to do if they need one. They might feel alone and isolated and not know who to ask. Having them in a vending machine is not good enough. They should be easily accessible to all students at no charge. Some students just can't afford to buy them. They are at risk of embarrassing situations. Having them available and easily accessible gives students peace of mind. They might be less likely to opt out of sports and other activities because they’ll be more comfortable but having them provided to students for free increases their likelihood of participating in sports and group activities. They need to be easily accessible and conveniently located.\n",
        "source": "api",
        "start_time": 402.0,
        "end_time": 402.0,
        "last_event_time": 402.0,
        "start_progress": 0.7598961713173265,
        "end_progress": 0.7981829980532122
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I’d support efforts to provide feminine hygiene products in schools. Feminine hygiene products are necessary. They’re part of a basic need, like food and shelter. Some students might not know what to do if they need one. They might feel alone and isolated and not know who to ask. Having them in a vending machine is not good enough. They should be easily accessible to all students at no charge. Some students just can't afford to buy them. They are at risk of embarrassing situations. Having them available and easily accessible gives students peace of mind. They might be less likely to opt out of sports and other activities because they’ll be more comfortable but having them provided to students for free increases their likelihood of participating in sports and group activities. They need to be easily accessible and conveniently located, and offer privacy and discretion.  Students should feel empowered and independent when it comes to feminine hygiene product use. \n",
        "source": "user",
        "start_time": 414.0,
        "end_time": 495.0,
        "last_event_time": 495.0,
        "start_progress": 0.7981829980532122,
        "end_progress": 0.8825438027255029
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I’d support efforts to provide feminine hygiene products in schools. Feminine hygiene products are necessary. They’re part of a basic need, like food and shelter. Some students might not know what to do if they need one. They might feel alone and isolated and not know who to ask. Having them in a vending machine is not good enough. They should be easily accessible to all students at no charge. Some students just can't afford to buy them. They are at risk of embarrassing situations. Having them available and easily accessible gives students peace of mind. They might be less likely to opt out of sports and other activities because they’ll be more comfortable but having them provided to students for free increases their likelihood of participating in sports and group activities. They need to be easily accessible and conveniently located, and offer privacy and discretion.  Students should feel empowered and independent when it comes to feminine hygiene product use. Making it easier for them to stay clean and fresh increases their self-esteem and maintains student safety.\n",
        "source": "api",
        "start_time": 505.0,
        "end_time": 505.0,
        "last_event_time": 505.0,
        "start_progress": 0.8825438027255029,
        "end_progress": 0.9519792342634653
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, I’d support efforts to provide feminine hygiene products in schools. Feminine hygiene products are necessary. They’re part of a basic need, like food and shelter. Some students might not know what to do if they need one. They might feel alone and isolated and not know who to ask. Having them in a vending machine is not good enough. They should be easily accessible to all students at no charge. Some students just can't afford to buy them. They are at risk of embarrassing situations. Having them available and easily accessible gives students peace of mind. They might be less likely to opt out of sports and other activities because they’ll be more comfortable but having them provided to students for free increases their likelihood of participating in sports and group activities. They need to be easily accessible and conveniently located, and offer privacy and discretion.  Students should feel empowered and independent when it comes to feminine hygiene product use. Making it easier for them to stay clean and fresh increases their self-esteem and maintains student safety. I am in favor of making these products available to students at no cost. \n",
        "source": "user",
        "start_time": 551.0,
        "end_time": 602.0,
        "last_event_time": 602.0,
        "start_progress": 0.9519792342634653,
        "end_progress": 1.0
    }
]