[
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.12999246420497362
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, citizens dont necessarily have a responsibility to keep up with the news on an in depth level. They do however hold responsibility to know generally what is going on around them. For example, if a citizen is unaware of COVID at this time then they are simply putting themselves and others into harms risk. To be ignorant to something like COVID at this time is simply inexcusable. When it comes to what is going on in Afganistan, it is acceptable to know really know if you dont feel you play a part in it. What is happening in Afganistan is not exactly directly affecting the lives of every single American, so it is acceptable to simply not have heard about it. Not only this, but sometimes people may even choose to avoid news stories simply for peace of mind. So much of the news is negative, and if you are always reading it, it is impossible not to have a negative outlook on what is going on around you. I personally feel that it would be much easier to digest more news if there was more positive news. A big reason why i dont stay up to date often times is because i am not trying to always see all the stories on people dying, crimes, etc. \n",
        "source": "user",
        "start_time": 9.0,
        "end_time": 232.0,
        "last_event_time": 232.0,
        "start_progress": 0.12999246420497362,
        "end_progress": 0.5636774679728711
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, citizens dont necessarily have a responsibility to keep up with the news on an in depth level. They do however hold responsibility to know generally what is going on around them. For example, if a citizen is unaware of COVID at this time then they are simply putting themselves and others into harms risk. To be ignorant to something like COVID at this time is simply inexcusable. When it comes to what is going on in Afganistan, it is acceptable to know really know if you dont feel you play a part in it. What is happening in Afganistan is not exactly directly affecting the lives of every single American, so it is acceptable to simply not have heard about it. Not only this, but sometimes people may even choose to avoid news stories simply for peace of mind. So much of the news is negative, and if you are always reading it, it is impossible not to have a negative outlook on what is going on around you. I personally feel that it would be much easier to digest more news if there was more positive news. A big reason why i dont stay up to date often times is because i am not trying to always see all the stories on people dying, crimes, etc. I would rather focus on the good things in life, and try to stay positive.\n",
        "source": "api",
        "start_time": 334.0,
        "end_time": 334.0,
        "last_event_time": 334.0,
        "start_progress": 0.5636774679728711,
        "end_progress": 0.5915599095704597
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, citizens dont necessarily have a responsibility to keep up with the news on an in depth level. They do however hold responsibility to know generally what is going on around them. For example, if a citizen is unaware of COVID at this time then they are simply putting themselves and others into harms risk. To be ignorant to something like COVID at this time is simply inexcusable. When it comes to what is going on in Afganistan, it is acceptable to know really know if you dont feel you play a part in it. What is happening in Afganistan is not exactly directly affecting the lives of every single American, so it is acceptable to simply not have heard about it. Not only this, but sometimes people may even choose to avoid news stories simply for peace of mind. So much of the news is negative, and if you are always reading it, it is impossible not to have a negative outlook on what is going on around you. I personally feel that it would be much easier to digest more news if there was more positive news. A big reason why i dont stay up to date often times is because i am not trying to always see all the stories on people dying, crimes, etc. I would rather focus on the good things in life, and try to stay positive. This being said, of course it can help to know what is going on around you, i just think that there needs to be balance. The media can take that balance away sometimes simply because they put on the news what they know people will watch. \n\nEngaging with the news does not always directly do anything, however there are times when people do attempt to make a change. Whether it is through protesting or simply emailing local government, people without a doubt can play a role in getting change to occur. The actual act itself of digesting news does not really have any effect though. I think some people simply feel better knowing all they can know, since the unknown can be scarier than the actual truth at times. So it is really different for everyone what engaging with news can do for you. If you feel that gaining the perspective from reading the news is positive enough, than it is a good thing to read it. If you feel like all the info is bogging down your mind and taking away from your ability to be present, it may be a good idea to either balance it or forgo it altogether.\n",
        "source": "user",
        "start_time": 339.0,
        "end_time": 588.0,
        "last_event_time": 588.0,
        "start_progress": 0.5915599095704597,
        "end_progress": 1.0
    }
]