[
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.22953367875647668
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, some sports should be stopped because of the damage can do to the athletes.  While I dont think it is selfish for them to play the sports, I just feel they are either misinformed or do not know the long term effects it could have on them. \n",
        "source": "user",
        "start_time": 17.0,
        "end_time": 124.0,
        "last_event_time": 124.0,
        "start_progress": 0.22953367875647668,
        "end_progress": 0.3538860103626943
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, some sports should be stopped because of the damage can do to the athletes.  While I dont think it is selfish for them to play the sports, I just feel they are either misinformed or do not know the long term effects it could have on them. Some athletes end up with long term health issues and could even die from them because of the effects it has on their bodies.\n",
        "source": "api",
        "start_time": 149.0,
        "end_time": 149.0,
        "last_event_time": 149.0,
        "start_progress": 0.3538860103626943,
        "end_progress": 0.41865284974093264
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, some sports should be stopped because of the damage can do to the athletes.  While I dont think it is selfish for them to play the sports, I just feel they are either misinformed or do not know the long term effects it could have on them. Some athletes end up with long term health issues and could even die from them because of the effects it has on their bodies. I feel that if they took more precautions and were fully informed, then perhaps they would make wiser choices.\n",
        "source": "api",
        "start_time": 162.0,
        "end_time": 162.0,
        "last_event_time": 162.0,
        "start_progress": 0.41865284974093264,
        "end_progress": 0.4761658031088083
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, some sports should be stopped because of the damage can do to the athletes.  While I dont think it is selfish for them to play the sports, I just feel they are either misinformed or do not know the long term effects it could have on them. Some athletes end up with long term health issues and could even die from them because of the effects it has on their bodies. I feel that if they took more precautions and were fully informed, then perhaps they would make wiser choices. Ongoing studies need to be done both by the leagues and by unrelated third parties. We need to figure out some kind of cost benefit ratio that perhaps we could apply to all sports. \n",
        "source": "user",
        "start_time": 165.0,
        "end_time": 236.0,
        "last_event_time": 236.0,
        "start_progress": 0.4761658031088083,
        "end_progress": 0.5704663212435234
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, some sports should be stopped because of the damage can do to the athletes.  While I dont think it is selfish for them to play the sports, I just feel they are either misinformed or do not know the long term effects it could have on them. Some athletes end up with long term health issues and could even die from them because of the effects it has on their bodies. I feel that if they took more precautions and were fully informed, then perhaps they would make wiser choices. Ongoing studies need to be done both by the leagues and by unrelated third parties. We need to figure out some kind of cost benefit ratio that perhaps we could apply to all sports. This way we can weigh the risk of getting injured to the benefit of participating in a sport or taking part in an activity.\n",
        "source": "api",
        "start_time": 252.0,
        "end_time": 252.0,
        "last_event_time": 252.0,
        "start_progress": 0.5704663212435234,
        "end_progress": 0.6341968911917099
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, some sports should be stopped because of the damage can do to the athletes.  While I dont think it is selfish for them to play the sports, I just feel they are either misinformed or do not know the long term effects it could have on them. Some athletes end up with long term health issues and could even die from them because of the effects it has on their bodies. I feel that if they took more precautions and were fully informed, then perhaps they would make wiser choices. Ongoing studies need to be done both by the leagues and by unrelated third parties. We need to figure out some kind of cost benefit ratio that perhaps we could apply to all sports. This way we can weigh the risk of getting injured to the benefit of participating in a sport or taking part in an activity. If too many people are getting CTE from playing football changes need to be made or the sport should not be played by minors (at least). This is an area that needs much more studying. We need to know the effects on of these sports on our youth. What does a repeated head injuries as a teenager do to them as an adult and so on. I'm assuming there is more we dont know at the moment then we do so research is key along with active monitoring of the athleats done by the leagues and other parties. This has to be an all out effort to have the most effect and to save the most lives. \n",
        "source": "user",
        "start_time": 254.0,
        "end_time": 571.0,
        "last_event_time": 571.0,
        "start_progress": 0.6341968911917099,
        "end_progress": 0.9357512953367876
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, some sports should be stopped because of the damage can do to the athletes.  While I dont think it is selfish for them to play the sports, I just feel they are either misinformed or do not know the long term effects it could have on them. Some athletes end up with long term health issues and could even die from them because of the effects it has on their bodies. I feel that if they took more precautions and were fully informed, then perhaps they would make wiser choices. Ongoing studies need to be done both by the leagues and by unrelated third parties. We need to figure out some kind of cost benefit ratio that perhaps we could apply to all sports. This way we can weigh the risk of getting injured to the benefit of participating in a sport or taking part in an activity. If too many people are getting CTE from playing football changes need to be made or the sport should not be played by minors (at least). This is an area that needs much more studying. We need to know the effects on of these sports on our youth. What does a repeated head injuries as a teenager do to them as an adult and so on. I'm assuming there is more we dont know at the moment then we do so research is key along with active monitoring of the athleats done by the leagues and other parties. This has to be an all out effort to have the most effect and to save the most lives. The bigger this research gets the better for all of us.\n",
        "source": "api",
        "start_time": 579.0,
        "end_time": 579.0,
        "last_event_time": 579.0,
        "start_progress": 0.9357512953367876,
        "end_progress": 0.9642487046632124
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, some sports should be stopped because of the damage can do to the athletes.  While I dont think it is selfish for them to play the sports, I just feel they are either misinformed or do not know the long term effects it could have on them. Some athletes end up with long term health issues and could even die from them because of the effects it has on their bodies. I feel that if they took more precautions and were fully informed, then perhaps they would make wiser choices. Ongoing studies need to be done both by the leagues and by unrelated third parties. We need to figure out some kind of cost benefit ratio that perhaps we could apply to all sports. This way we can weigh the risk of getting injured to the benefit of participating in a sport or taking part in an activity. If too many people are getting CTE from playing football changes need to be made or the sport should not be played by minors (at least). This is an area that needs much more studying. We need to know the effects on of these sports on our youth. What does a repeated head injuries as a teenager do to them as an adult and so on. I'm assuming there is more we dont know at the moment then we do so research is key along with active monitoring of the athleats done by the leagues and other parties. This has to be an all out effort to have the most effect and to save the most lives. The bigger this research gets the better for all of us. The safer the players are, the longer we can enjoy their game play. \n",
        "source": "user",
        "start_time": 583.0,
        "end_time": 599.0,
        "last_event_time": 599.0,
        "start_progress": 0.9642487046632124,
        "end_progress": 1.0
    }
]