[
    {
        "text": "Should College Athletes Be Paid?\n\nDo you think college athletes should be paid? Or is a college scholarship and other non-monetary perks like the opportunity to play in front of cheering fans enough?\n\nIn “Paying Students to Play Would Ruin College Sports,\" Cody J. McDavis writes: “Paying student-athletes might sound like a fairer way to treat students who generate so much money and attention for their colleges (not to mention the television networks that broadcast their games). But paying athletes would distort the economics of college sports in a way that would hurt the broader community of student-athletes, universities, fans and alumni. A handful of big sports programs would pay top dollar for a select few athletes, while almost every other college would get caught up in a bidding war it couldn't afford.\"\n\nDo you find his argument persuasive? What possible difficulties or downsides might there be in providing monetary compensation to players?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.2846778874056878
    },
    {
        "text": "Should College Athletes Be Paid?\n\nDo you think college athletes should be paid? Or is a college scholarship and other non-monetary perks like the opportunity to play in front of cheering fans enough?\n\nIn “Paying Students to Play Would Ruin College Sports,\" Cody J. McDavis writes: “Paying student-athletes might sound like a fairer way to treat students who generate so much money and attention for their colleges (not to mention the television networks that broadcast their games). But paying athletes would distort the economics of college sports in a way that would hurt the broader community of student-athletes, universities, fans and alumni. A handful of big sports programs would pay top dollar for a select few athletes, while almost every other college would get caught up in a bidding war it couldn't afford.\"\n\nDo you find his argument persuasive? What possible difficulties or downsides might there be in providing monetary compensation to players?\n\n---\n\nIn my opinion, the argument isn't persuasive at all. Student athletes should absolutely be paid for their work on the field or court. The amount of money they make the universities speaks for itself. We're not talking about hundreds or even thousands of dollars. Student athletes make universities hundreds of millions of dollars each year and don't see a cent. Think about an athlete like Zion Williamson. The amount of money that Duke and also the college sports networks like ESPN made off of him alone is in the millions.\n\nThe only people who don't want to see student athletes get paid are the people that are exploiting them for money. Think about the student athletes that get a full academic scholarship to school. What are they getting out of being a student athlete? They already have a full ride. They're actually at a disadvantage compared to a student who isn't as good academically.\n\nCollege athletics is a business. And I consider the student athletes to be employees. If they are the employees, they deserve to get paid. If all of the student athletes went on strike, universities across the world would lose billions of dollars. You know what 99% of the student athletes would lose? Absolutely nothing. \n\nIt's disgusting that because these kids are 18-22 years old that people think they can take advantage of them. Luckily, more and more student athletes have started to speak out about the scam that college athletics are. A bill has already been passed that allows students to get paid for their image and likeness.\n\nWhen it comes to student athletes getting paid and certain universities having a competitive advantage due to the amount of money they have to spend, you simply set a salary cap like other sports. You could also set a cap on an individual players salary as well. Student athletes are currently making $0 per season. If they were to get paid up to $100,000 per season I don't think any of them would be complaining. That is life changing money for most young adults. \n\nUntil I hear a logical and fair argument about students not deserving to get paid for their performance on the field, I'm never going to change my stance on this. Students are risking injury and in some cases their life to make people in power money. They aren't puppets. They are people.\n\nThey are people who work their ass off and put on a great product. They deserve to get paid.  So instead of sitting by while they get exploited, lets use our voices and support them. \n\n",
        "source": "user",
        "start_time": 30.0,
        "end_time": 582.0,
        "last_event_time": 582.0,
        "start_progress": 0.2846778874056878,
        "end_progress": 1.0
    }
]