[
    {
        "text": "Should College Athletes Be Paid?\n\nDo you think college athletes should be paid? Or is a college scholarship and other non-monetary perks like the opportunity to play in front of cheering fans enough?\n\nIn “Paying Students to Play Would Ruin College Sports,\" Cody J. McDavis writes: “Paying student-athletes might sound like a fairer way to treat students who generate so much money and attention for their colleges (not to mention the television networks that broadcast their games). But paying athletes would distort the economics of college sports in a way that would hurt the broader community of student-athletes, universities, fans and alumni. A handful of big sports programs would pay top dollar for a select few athletes, while almost every other college would get caught up in a bidding war it couldn't afford.\"\n\nDo you find his argument persuasive? What possible difficulties or downsides might there be in providing monetary compensation to players?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.452073732718894
    },
    {
        "text": "Should College Athletes Be Paid?\n\nDo you think college athletes should be paid? Or is a college scholarship and other non-monetary perks like the opportunity to play in front of cheering fans enough?\n\nIn “Paying Students to Play Would Ruin College Sports,\" Cody J. McDavis writes: “Paying student-athletes might sound like a fairer way to treat students who generate so much money and attention for their colleges (not to mention the television networks that broadcast their games). But paying athletes would distort the economics of college sports in a way that would hurt the broader community of student-athletes, universities, fans and alumni. A handful of big sports programs would pay top dollar for a select few athletes, while almost every other college would get caught up in a bidding war it couldn't afford.\"\n\nDo you find his argument persuasive? What possible difficulties or downsides might there be in providing monetary compensation to players?\n\n---\n\nIn my opinion, the argument makes sense but there are other ways the players could get paid. They could get paid by the TV stations, promotional situations and maybe enjoy some extra non-monetary perks from Universities. As stated above, the TV networks make a killing off of these players and should at the very least help pay for higher education or other beneficial pursuits. This would probably create an elite class of players even more then now but probably not by much. They are already highly regarded and respected players who are on TV all the time, some extra money or a car here and there would not make much of a difference. It may actually encourage some players to focus more on their game and get better. I imagine there would be a few down sides, like the poorer colleges not being able to secure decent players and then it would be a cycle of bad seasons and less money. \n",
        "source": "user",
        "start_time": 34.0,
        "end_time": 531.0,
        "last_event_time": 531.0,
        "start_progress": 0.452073732718894,
        "end_progress": 0.8552995391705069
    },
    {
        "text": "Should College Athletes Be Paid?\n\nDo you think college athletes should be paid? Or is a college scholarship and other non-monetary perks like the opportunity to play in front of cheering fans enough?\n\nIn “Paying Students to Play Would Ruin College Sports,\" Cody J. McDavis writes: “Paying student-athletes might sound like a fairer way to treat students who generate so much money and attention for their colleges (not to mention the television networks that broadcast their games). But paying athletes would distort the economics of college sports in a way that would hurt the broader community of student-athletes, universities, fans and alumni. A handful of big sports programs would pay top dollar for a select few athletes, while almost every other college would get caught up in a bidding war it couldn't afford.\"\n\nDo you find his argument persuasive? What possible difficulties or downsides might there be in providing monetary compensation to players?\n\n---\n\nIn my opinion, the argument makes sense but there are other ways the players could get paid. They could get paid by the TV stations, promotional situations and maybe enjoy some extra non-monetary perks from Universities. As stated above, the TV networks make a killing off of these players and should at the very least help pay for higher education or other beneficial pursuits. This would probably create an elite class of players even more then now but probably not by much. They are already highly regarded and respected players who are on TV all the time, some extra money or a car here and there would not make much of a difference. It may actually encourage some players to focus more on their game and get better. I imagine there would be a few down sides, like the poorer colleges not being able to secure decent players and then it would be a cycle of bad seasons and less money. The other down side would be the elite players getting paid more and then not being as hungry to win.\n",
        "source": "api",
        "start_time": 553.0,
        "end_time": 553.0,
        "last_event_time": 553.0,
        "start_progress": 0.8552995391705069,
        "end_progress": 0.9018433179723502
    },
    {
        "text": "Should College Athletes Be Paid?\n\nDo you think college athletes should be paid? Or is a college scholarship and other non-monetary perks like the opportunity to play in front of cheering fans enough?\n\nIn “Paying Students to Play Would Ruin College Sports,\" Cody J. McDavis writes: “Paying student-athletes might sound like a fairer way to treat students who generate so much money and attention for their colleges (not to mention the television networks that broadcast their games). But paying athletes would distort the economics of college sports in a way that would hurt the broader community of student-athletes, universities, fans and alumni. A handful of big sports programs would pay top dollar for a select few athletes, while almost every other college would get caught up in a bidding war it couldn't afford.\"\n\nDo you find his argument persuasive? What possible difficulties or downsides might there be in providing monetary compensation to players?\n\n---\n\nIn my opinion, the argument makes sense but there are other ways the players could get paid. They could get paid by the TV stations, promotional situations and maybe enjoy some extra non-monetary perks from Universities. As stated above, the TV networks make a killing off of these players and should at the very least help pay for higher education or other beneficial pursuits. This would probably create an elite class of players even more then now but probably not by much. They are already highly regarded and respected players who are on TV all the time, some extra money or a car here and there would not make much of a difference. It may actually encourage some players to focus more on their game and get better. I imagine there would be a few down sides, like the poorer colleges not being able to secure decent players and then it would be a cycle of bad seasons and less money. The other down side would be the elite players getting paid more and then not being as hungry to win. More money may distract those top players. Ultimately though, I think the positive outweighs the negative and paying the players in either money from the TV stations or other financial incentives should be given.\n",
        "source": "user",
        "start_time": 555.0,
        "end_time": 631.0,
        "last_event_time": 631.0,
        "start_progress": 0.9018433179723502,
        "end_progress": 1.0
    }
]