[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "He doesn't realize that he can look like any countless number of people, but that's not what matters.",
        "source": "api"
    },
    {
        "text": "He's never developed a personality.",
        "source": "user"
    },
    {
        "text": "He just shifts to look different constantly so he's never had to develop one.",
        "source": "user"
    },
    {
        "text": "Yet again he only gets so far before she dumps him.",
        "source": "user"
    },
    {
        "text": "This time he goes and asks her what is wrong.",
        "source": "user"
    },
    {
        "text": "She tells him that he just didn't seem very passionate about anything.",
        "source": "user"
    },
    {
        "text": "He only seemed focused on her.",
        "source": "user"
    },
    {
        "text": "He realizes that he loves her enough to start changing not only physically but mentally.",
        "source": "user"
    },
    {
        "text": "He begins going to see a psychologist to learn about himself.",
        "source": "user"
    },
    {
        "text": "He also starts taking classes at a local community college.",
        "source": "user"
    },
    {
        "text": "He's learning to try and find out who he is.",
        "source": "user"
    },
    {
        "text": "He's learning that he doesn't need to change his appearance, but he does need to start changing his behavior.",
        "source": "user"
    },
    {
        "text": "Over time he starts to discover that he does have interests.",
        "source": "api"
    },
    {
        "text": "He starts to find out what makes him tick.",
        "source": "user"
    },
    {
        "text": "He likes to cook.",
        "source": "api"
    },
    {
        "text": "He likes horror movies.",
        "source": "api"
    },
    {
        "text": "He appreciates classical music.",
        "source": "user"
    },
    {
        "text": "As he discovers these things he spends less time obsessing about her.",
        "source": "user"
    },
    {
        "text": "He's no longer constantly trying to change himself for her.",
        "source": "user"
    },
    {
        "text": "He's wanting to change just to make him happy.",
        "source": "api"
    },
    {
        "text": "He's also not shape shifting any more.",
        "source": "user"
    },
    {
        "text": "He's discovered that is why he is the way he is.",
        "source": "user"
    },
    {
        "text": "He's going to stick with this appearance.",
        "source": "user"
    },
    {
        "text": "One day he runs into her at a coffee shop.",
        "source": "user"
    },
    {
        "text": "She notices him from far away.",
        "source": "user"
    },
    {
        "text": "He has a new confidence that draws her to him.",
        "source": "user"
    },
    {
        "text": "She comes over and talks to him.",
        "source": "user"
    },
    {
        "text": "He is polite and catches up with her but doesn't do anything to try and impress her.",
        "source": "user"
    },
    {
        "text": "She catches him off guard when she asks him out on a date.",
        "source": "user"
    },
    {
        "text": "He politely turns her down.",
        "source": "user"
    },
    {
        "text": "He's made so much progress and dating her would just send him back to square one.",
        "source": "user"
    },
    {
        "text": "Instead he decides to spend that time at home learning to cook a new recipe.",
        "source": "user"
    },
    {
        "text": "He'll get back to finding love after he masters this recipe.",
        "source": "user"
    }
]