[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "It has been hard for the shapeshifter to get it right.",
        "source": "user"
    },
    {
        "text": "He's not used to being rejected.",
        "source": "api"
    },
    {
        "text": "The woman is a good woman and she is not interested in a relationship with a man who's always changing into a different man.",
        "source": "user"
    },
    {
        "text": "The man does not know what to do.",
        "source": "user"
    },
    {
        "text": "He cannot change himself.",
        "source": "user"
    },
    {
        "text": "He will always be a shapeshifter.",
        "source": "user"
    },
    {
        "text": "Then he has an idea.",
        "source": "user"
    },
    {
        "text": "He cannot stop being a shapeshifter but he can change the woman into one.",
        "source": "user"
    },
    {
        "text": "He just has to figure out how to do this without her being upset with him.",
        "source": "user"
    },
    {
        "text": "The man has a good friend who is a witch.",
        "source": "api"
    },
    {
        "text": "He goes to her for advice.",
        "source": "user"
    },
    {
        "text": "She tells him that he can change the woman into a shapeshifter just like him.",
        "source": "api"
    },
    {
        "text": "It will be easy to do.",
        "source": "user"
    },
    {
        "text": "He just needs a special tea the witch can give him.",
        "source": "user"
    },
    {
        "text": "He asks the witch if it is a good thing to do.",
        "source": "user"
    },
    {
        "text": "She tells him it is a good thing to do.",
        "source": "user"
    },
    {
        "text": "She says anyone would be happy with the gift of a special power.",
        "source": "user"
    },
    {
        "text": "The man goes home and makes the tea.",
        "source": "user"
    },
    {
        "text": "He takes it to the woman but on the way he spills a bit on the floor.",
        "source": "user"
    },
    {
        "text": "A cat comes by and drinks the tea.",
        "source": "user"
    },
    {
        "text": "The man sits with the woman while she drinks her tea and he wonders how she is feeling.",
        "source": "user"
    },
    {
        "text": "He is excited and nervous.",
        "source": "user"
    },
    {
        "text": "He hopes he is not punished by the universe for casting this spell on the woman he loves.",
        "source": "user"
    },
    {
        "text": "The woman seems to be feeling fine and he man wonders when she will first shapeshift and learn of her powers.",
        "source": "user"
    },
    {
        "text": "But then a lion comes into the room and attacks and kills the woman.",
        "source": "user"
    },
    {
        "text": "It was the cat that had the tea that killed the woman.",
        "source": "user"
    },
    {
        "text": "The shapeshifter would never cast a spell again.",
        "source": "user"
    }
]