[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "They know he has made some decent movies, mainly they loved Good Will Hunting.",
        "source": "user"
    },
    {
        "text": "But they haven't seen him in anything recently and want to know if he is still a loved actor, or if they can experiment on him.",
        "source": "user"
    },
    {
        "text": "Perhaps cloning?",
        "source": "user"
    },
    {
        "text": "The aliens are not the only ones who want to know if he is still loved.",
        "source": "user"
    },
    {
        "text": "Matt wants to know himself.",
        "source": "api"
    },
    {
        "text": "It seems like ages ago that he was Jason Bourne, and the Ocean's movies are a thing of the past too.",
        "source": "user"
    },
    {
        "text": "Now that his pal, Ben is back with JLO, Matt is feeling very much like an outsider and really needs a boost to his self esteem.",
        "source": "user"
    },
    {
        "text": "Maybe getting taken by aliens isn't such a bad thing for himself, after all.",
        "source": "user"
    },
    {
        "text": "This is a story of Matt Damon, and his journey to find his place in the world.",
        "source": "user"
    },
    {
        "text": "The aliens are kind to him and treat him like a special guest, at least in the beginning.",
        "source": "api"
    },
    {
        "text": "Word soon gets around Earth that Matt is missing, and most of Hollywood, along with the FBI, get involved in looking for him.",
        "source": "user"
    },
    {
        "text": "Someone, I think Will Smith, laughingly suggests he may have been kidnapped by aliens.",
        "source": "user"
    },
    {
        "text": "This causes quite a riot with the tabloids, and Will reinstates his old Men in Black persona.",
        "source": "user"
    },
    {
        "text": "Matt is a good sport about it all, and even helps Will Smith with his investigation.",
        "source": "user"
    },
    {
        "text": "He sends him secret messages over a burner phone to Will's old MIB phone.",
        "source": "api"
    },
    {
        "text": "Will is completely shocked that he is receiving secret intelligence and he takes his information to the FBI.",
        "source": "user"
    },
    {
        "text": "The FBI actually have an intergalactic task force.",
        "source": "user"
    },
    {
        "text": "Who knew?",
        "source": "user"
    },
    {
        "text": "!",
        "source": "user"
    },
    {
        "text": "They start planning to institute protocol 1AF, which is for finding one actor, and the rescue of Matt Damon is underway.",
        "source": "user"
    },
    {
        "text": "The aliens have forgotten that they were every planning to experiment on Matt.",
        "source": "user"
    },
    {
        "text": "They are so enthralled with her personality and stories of colleagues, that they forget to pay attention to Earth.",
        "source": "user"
    },
    {
        "text": "They don't know that the FBI is looking for him or that 1AF is underway.",
        "source": "user"
    },
    {
        "text": "Imagine their shock, when a team of Space agents arrive on their planet to reclaim Matt.",
        "source": "user"
    },
    {
        "text": "They are quite shocked, and Matt is quite shocked.",
        "source": "user"
    },
    {
        "text": "He had no idea the rescue would happen so quickly.",
        "source": "api"
    },
    {
        "text": "He is loved!",
        "source": "user"
    },
    {
        "text": "!",
        "source": "user"
    },
    {
        "text": "He is so grateful and excited to be going home.",
        "source": "user"
    },
    {
        "text": "The aliens are not so thrilled.",
        "source": "user"
    },
    {
        "text": "They will miss the stories and having such a famous and friendly person in their company.",
        "source": "user"
    },
    {
        "text": "Matt hates to see his new friends punished, and he ensures there will be no repercussions for his kidnapping.",
        "source": "user"
    },
    {
        "text": "The aliens ask Matt if there is anything they can do to make him stay.",
        "source": "user"
    },
    {
        "text": "Matt declines, but does agree to send them Ben Affleck's address.",
        "source": "user"
    },
    {
        "text": "Maybe they can kidnap him next.",
        "source": "user"
    }
]