[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "In the year 2045, the world is a very different place.",
        "source": "api"
    },
    {
        "text": "The population has exploded to the point where there is no more room on Earth.",
        "source": "api"
    },
    {
        "text": "Having immortality is good, but with nobody ever dying, natural resources have grown scarce.",
        "source": "api"
    },
    {
        "text": "There is little food, and the rich own all of the land.",
        "source": "user"
    },
    {
        "text": "The rich have moved to the moon, and the rest of the population has been left to fend for themselves.",
        "source": "user"
    },
    {
        "text": "The only way to get to the moon is to win a lottery.",
        "source": "api"
    },
    {
        "text": "The lottery is held every year, and the odds of winning are one in a million.",
        "source": "api"
    },
    {
        "text": "You have retired to a small cabin in the wilderness, illegally located in a rich trillionaire's hunting reserve.",
        "source": "api"
    },
    {
        "text": "You live off the land, and you have a small garden.",
        "source": "user"
    },
    {
        "text": "One day, you discover that the rich are hunting humans.",
        "source": "api"
    },
    {
        "text": "The immortality drug has secretly contained tracers, so the rich can hunt those who take it, for their cannibalistic rituals.",
        "source": "api"
    },
    {
        "text": "You feel sick to your stomach.",
        "source": "user"
    },
    {
        "text": "You must survive the hunters, and the other dangers of the wilderness.",
        "source": "user"
    },
    {
        "text": "You must also find a way to get to the moon, and win the lottery, to cure this evil at its source.",
        "source": "api"
    },
    {
        "text": "You have your work cut out for you!",
        "source": "user"
    },
    {
        "text": "You have outlived all of your friends, and have nothing to lose.",
        "source": "user"
    },
    {
        "text": "This will be your last hurrah!",
        "source": "user"
    }
]