[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "You watch as you slowly become an adult, get married, have kids and experience all the highs and lows of life.",
        "source": "api"
    },
    {
        "text": "During the film, a wave of nostalgia comes over.",
        "source": "api"
    },
    {
        "text": "You look at the people around you who are also experiencing that wave, and then you realize that it has been happening every time someone in your previous life.",
        "source": "user"
    },
    {
        "text": "Things like regrets and missed chances rush through your mind.",
        "source": "api"
    },
    {
        "text": "You then realize that you have never truly lived life to the fullest and you want to change that.",
        "source": "user"
    },
    {
        "text": "You stand up in the cinema and shout, \"Stop!",
        "source": "api"
    },
    {
        "text": "\" The screen goes black.",
        "source": "user"
    },
    {
        "text": "Everyone in the audience looks up, confused.",
        "source": "api"
    },
    {
        "text": "\"I'm sorry.",
        "source": "user"
    },
    {
        "text": "I'm sorry, but I can't let the film go on.",
        "source": "user"
    },
    {
        "text": "I need to make it better.",
        "source": "user"
    },
    {
        "text": "\" You turn to the man sitting next to you.",
        "source": "user"
    },
    {
        "text": "\"Give me a little more time, please, and I'll make the film the best it can be.",
        "source": "api"
    },
    {
        "text": "I'll give it the best love story, and finish it off with a bang!",
        "source": "user"
    },
    {
        "text": "\" \n\nThe man raises a hand and smiles.",
        "source": "user"
    },
    {
        "text": "\"That's fine.",
        "source": "api"
    },
    {
        "text": "Go ahead, and let us know when it's complete.",
        "source": "api"
    },
    {
        "text": "\" \n\n\"Okay\" and it was time to get to work.",
        "source": "user"
    },
    {
        "text": "On a piece of paper, the Main Character sketched out the story.",
        "source": "user"
    },
    {
        "text": "There was childhood, romantic life, career, old age.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "Romantic life needed more.",
        "source": "user"
    },
    {
        "text": "Much more.",
        "source": "user"
    },
    {
        "text": "And the ending wasn't an ending at all.",
        "source": "user"
    },
    {
        "text": "The Main Character scribbled some notes onto the sketch, and was ready for the next step.",
        "source": "api"
    },
    {
        "text": "The Main Character traveled back to the part of the film with the love story.",
        "source": "user"
    },
    {
        "text": "It wasn't a romance.",
        "source": "user"
    },
    {
        "text": "It was too dull, too predictable.",
        "source": "user"
    },
    {
        "text": "The Main Character would have to spice it up a little bit.",
        "source": "user"
    },
    {
        "text": "She added new music to the scenes with the love interest.",
        "source": "api"
    },
    {
        "text": "The melody was more complex.",
        "source": "user"
    },
    {
        "text": "\"This will be more fun to watch.",
        "source": "user"
    },
    {
        "text": "\"\n\nNow it was time to work on the ending.",
        "source": "api"
    },
    {
        "text": "It was a happy ending, but it needed more.",
        "source": "user"
    },
    {
        "text": "She looked back to the film shots of the love story, and the man, and how they danced together.",
        "source": "api"
    },
    {
        "text": "She wrote a note on the paper.",
        "source": "user"
    },
    {
        "text": "She spliced the film from the dance scene to the last day of her life.",
        "source": "user"
    },
    {
        "text": "She wanted to end it all with a bang.",
        "source": "user"
    },
    {
        "text": "It was ready.",
        "source": "user"
    },
    {
        "text": "It was time to watch the New Film.",
        "source": "api"
    },
    {
        "text": "The audience gathered again in the cinema.",
        "source": "user"
    },
    {
        "text": "The Main Character sat down in her reclining chair and watched the New Film.",
        "source": "user"
    },
    {
        "text": "The film began to play, and the audience members faces lit up with joy.",
        "source": "api"
    },
    {
        "text": "The New Film was a masterpiece.",
        "source": "user"
    },
    {
        "text": "The scenes with the love story were so romantic.",
        "source": "user"
    },
    {
        "text": "When the film reached the end and she was about to pass onto heaven, the young man she danced with all those years ago was there waiting for her at heaven's door.",
        "source": "user"
    },
    {
        "text": "The last song played as the film faded to black.",
        "source": "user"
    },
    {
        "text": "The audience stood up and applauded.",
        "source": "user"
    },
    {
        "text": "It was perfect!",
        "source": "user"
    }
]