[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. You are appalled to realize how bad the side effects are. Of course, you do not have any of these side effects, since the drug was only given to people who are younger than you. But you realize how much society has been hindered by the effects of this terrible drug. You decide to go back in time to stop the drug from being invented. \n\nYou go back in time to the year 2029. You are 28 years old. You decide to go to a university to find the scientist who invented the drug. You find the university and the scientist's lab. You walk in and introduce yourself. You tell the scientist that you are from the future and that the drug he invented will have terrible side effects. He does not believe you. You try to convince him more by elaborating on how nasty the side effects will be. He still does not believe you. After all, he is convinced that any drug that has such miraculous anti-aging properties is going to be well worth its costs. He does not see much merit to your argument, especially when he cannot believe that you are a being from the future. You realize that you have to do something drastic to convince him. To do so, you decide to unveil evidence that you are a person of the future. You take out a piece of paper and write down the following: \n\n\"You will invent a drug that will stop the effects of aging.",
        "source": "api"
    },
    {
        "text": "This drug will be given to all citizens under the age of 26.",
        "source": "user"
    },
    {
        "text": "This will be done in the year 2029.",
        "source": "user"
    },
    {
        "text": "The side effects of this drug will be discovered in the year 2085.",
        "source": "user"
    },
    {
        "text": "The side effects will be so bad that society will be greatly hindered.",
        "source": "user"
    },
    {
        "text": "Entire cultures will collapse all because of your drug.",
        "source": "user"
    },
    {
        "text": "I come from a culture called the Neysi people.",
        "source": "user"
    },
    {
        "text": "The Neysi people have been entirely wiped out by your drug.",
        "source": "user"
    },
    {
        "text": "I have lost my family, my friends and my neighbors to your drug and my life has been spiraling out of control as a result.",
        "source": "user"
    },
    {
        "text": "You do not want to go through with this.",
        "source": "user"
    },
    {
        "text": "Please listen.\"",
        "source": "user"
    },
    {
        "text": "\"",
        "source": "user"
    },
    {
        "text": "The scientist considers what you have written.",
        "source": "user"
    },
    {
        "text": "He is shocked that you have predicted the future with such accuracy.",
        "source": "api"
    },
    {
        "text": "He is also shocked that you have lost your entire culture to the drug.",
        "source": "api"
    },
    {
        "text": "He is convinced that you are a person from the future.",
        "source": "api"
    },
    {
        "text": "He decides to stop the drug from being invented.",
        "source": "api"
    },
    {
        "text": "He decides to destroy the lab and all of his research.",
        "source": "api"
    },
    {
        "text": "But he warns you that some of his research has already been published in some famous journals and there is no promising that no one else will pick up where he has left off once he ceases all of his research.",
        "source": "user"
    },
    {
        "text": "You decide that this is a risk and a threat that you will have to get comfortable with, since it is so much better than the alternative, which would put the scientist in a position where he would truly eradicate society with all certainty.",
        "source": "user"
    },
    {
        "text": "You thank the scientist for his cooperation and his time.",
        "source": "user"
    },
    {
        "text": "After all, this is a famous scientist you are talking to, and this man deserves respect for having listened to  you at last.",
        "source": "user"
    },
    {
        "text": "You know that this scientist is sacrificing publications and career success just to heed your concerns and you are very grateful that this scientist is one of the rare people on Earth willing to do that.",
        "source": "user"
    },
    {
        "text": "You leave the scientist's lab by wishing him all of the best of luck on any other endeavors that he plans to take on in the near term.",
        "source": "user"
    },
    {
        "text": "The scientist gives you a wry smile and thanks you for being so supportive of his work and his calling.",
        "source": "user"
    },
    {
        "text": "You walk out of the lab and you go back to your time.",
        "source": "api"
    }
]