[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "After all the initial shock and confusion, I sat down on my seat and spoke to another version of me and asked, \"Where are we?\" She told me that we're on the \"reincarnation screen\" and that we're about to watch our next lives.",
        "source": "user"
    },
    {
        "text": "She was younger than me, as I am in my forties, and she was in her twenties.",
        "source": "user"
    },
    {
        "text": "I did remember the time when I was in my twenties.",
        "source": "user"
    },
    {
        "text": "I asked her how she died and she told me that she died from a heroin overdose.",
        "source": "user"
    },
    {
        "text": "I remember that particular day in college, and it was a girl I knew that died that day, not me, as I had to study for my exams.",
        "source": "user"
    },
    {
        "text": "While the movie was playing, I seem to be more interested with this version of me rather than what I was watching on screen.",
        "source": "user"
    },
    {
        "text": "She seemed more happy and more energetic than me.",
        "source": "user"
    },
    {
        "text": "After all, she died way earlier than me.",
        "source": "user"
    },
    {
        "text": "I felt happy for her because she didn't have to worry about problems like me.",
        "source": "user"
    },
    {
        "text": "After some time that we were talking, she asked me, \"How about you?\"",
        "source": "user"
    },
    {
        "text": "\"How about me, what?\" I asked.",
        "source": "user"
    },
    {
        "text": "\"How did you die?\" she said.",
        "source": "user"
    },
    {
        "text": "That is the question that I was dreading to answer.",
        "source": "user"
    },
    {
        "text": "I did not have a carefree life the way she had.",
        "source": "user"
    },
    {
        "text": "I was always worried about the future, I was always thinking about what would happen if I did this or that.",
        "source": "user"
    },
    {
        "text": "I was worried about my mortgage, my bills, the people around me.",
        "source": "user"
    },
    {
        "text": "In the end, I had too much of it and decided to end my life.",
        "source": "user"
    },
    {
        "text": "\"I.. I committed suicide.\" I regrettably said to her.",
        "source": "user"
    },
    {
        "text": "Understandably she got very quiet.",
        "source": "user"
    },
    {
        "text": "Her face suddenly felt that it was sad and she started to cry.",
        "source": "user"
    },
    {
        "text": "\"I'm sorry, I did not intend to make you feel sad.\" I said.",
        "source": "user"
    },
    {
        "text": "\"You didn't, I wish I didn't die the way I did.\" she said while she was still crying.",
        "source": "user"
    },
    {
        "text": "\"I didn't realize how lucky I was until I saw how unhappy you were in your life. I wasted mine.\"",
        "source": "user"
    },
    {
        "text": "Tears came down my eyes too as we felt silent and just continued watching the movie screen.",
        "source": "user"
    },
    {
        "text": "After a few moments, we saw another version of us enter the movie theater and another movie started playing.",
        "source": "user"
    }
]