[
    "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
    "So when they were old enough, she sent them out into the world to seek their fortunes.",
    "You know the story about the first three little pigs.",
    "This is a story about the 92nd little pig.",
    "The 92nd little pig built a house out of depleted uranium.",
    "And the wolf was like, \"dude.\"\n\n\nThe wolf came to the 92nd little pig's house and said, \"Little pig, little pig, let me come in.\"  The pig, not expecting any visitors, told the wolf to come back another time.",
    "\"My house is a mess right now!\".",
    "The wolf could smell its prey.",
    "It wouldn't back down now.",
    "\"Little pig, little pig, let me come in or I'll huff and I'll puff and I'll blow your house down!\", the wolf said.",
    "Perplexed, the pig peered out of its window at the wolf.",
    "\"My house is rated for hurricane-level winds\", the pig thought to himself.",
    "\"I would like to see you try!\", the pig yelled out of the window.",
    "The wolf snarled at the comment.",
    "He positioned himself right in front of the depleted uranium house.",
    "He started to take a very deep breath.",
    "It seemed like he was inhaling for five minutes.",
    "Then, he exhaled out the air with a mighty \"whoosh\".",
    "The pig was unimpressed.",
    "The house still stood.",
    "The only aftermath was the wolf was out of breath.",
    "\"Wait.",
    "Wait.",
    "Let me try again.\", said the wolf.",
    "The wolf started to inhale again.",
    "The pig cut him off.",
    "\"Look.",
    "What is it you really want here?",
    "Maybe we can talk this out?\".",
    "The wolf thought to himself for a second.",
    "\"Whenever I can smell my prey, I always get it.",
    "My prey is that cheesecake I smell in your house.\", the wolf said.",
    "The pig was confused.",
    "\"All of this was over cheesecake?",
    "Here!\".",
    "The pig put a piece of cheesecake on the plate, opened his door, and set the cheesecake down outside.",
    "The wolf yelled out \"Victory!\" and scooped up the cheesecake.",
    "He then ran off into the woods.",
    "\"My neighbors are terribly weird\",  the pig thought to himself.",
    ""
]