[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\"",
        "source": "api"
    },
    {
        "text": "As Barack Obama receiving this letter, I am very confused.",
        "source": "user"
    },
    {
        "text": "Is this a joke?",
        "source": "user"
    },
    {
        "text": "Is this real?",
        "source": "user"
    },
    {
        "text": "He wondered if JFK contacted him from the dead or if someone was playing a trick.",
        "source": "user"
    },
    {
        "text": "He thought about it for a few minutes and decided to call the number.",
        "source": "user"
    },
    {
        "text": "It rang and then a man answered.",
        "source": "user"
    },
    {
        "text": "\"Hello,\" said the man on the other line.",
        "source": "user"
    },
    {
        "text": "\"This is John F. Kennedy.\" Obama didn't believe it.",
        "source": "api"
    },
    {
        "text": "\"No way,\" he said.",
        "source": "user"
    },
    {
        "text": "But the man on the other line said, \"Look out your window.\"",
        "source": "user"
    },
    {
        "text": "So Barack looked out the window and saw JFK standing outside.",
        "source": "user"
    },
    {
        "text": "\"Are you a ghost?\" asked Barack.",
        "source": "user"
    },
    {
        "text": "\"No,\" said JFK.",
        "source": "user"
    },
    {
        "text": "But there was no time for talking about that.",
        "source": "user"
    },
    {
        "text": "JFK had to get to the real mission at hand.",
        "source": "user"
    },
    {
        "text": "\"I need you to come with me to the future,\" he said.",
        "source": "user"
    },
    {
        "text": "\"Okay, I'm retired so I may as well,\" said Barack.",
        "source": "user"
    },
    {
        "text": "And then he met JFK outside where there was a time machine.",
        "source": "user"
    },
    {
        "text": "It was a DeLorean just like in Back to the Future.",
        "source": "user"
    },
    {
        "text": "So he gets in and they take off.",
        "source": "user"
    },
    {
        "text": "\"Where are we going?\" asked Barack.",
        "source": "user"
    },
    {
        "text": "\"To the year 2040,\" said JFK.",
        "source": "api"
    },
    {
        "text": "\"And why are we going there?\" he asked.",
        "source": "user"
    },
    {
        "text": "JFK told him it was because the world was in danger.",
        "source": "user"
    },
    {
        "text": "They had to save the planet from the future hostile alien race that was taking it over.",
        "source": "user"
    },
    {
        "text": "\"Okay, I'm in,\" said Barack.",
        "source": "user"
    },
    {
        "text": "So when they got to the future they realized in 2040 all previous presidents have magic powers that can destroy aliens.",
        "source": "user"
    },
    {
        "text": "So JFK told Barack he had to learn how to use his powers.",
        "source": "user"
    },
    {
        "text": "Together they practiced their power that helped them make things disappear.",
        "source": "user"
    },
    {
        "text": "In the end they were able to save the planet by vanishing the aliens and they saved the human race.",
        "source": "user"
    }
]