[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "He has really gotten to know the woman and he can get it right with her if he just does the right thing by her and can stop being selfish.",
        "source": "user"
    },
    {
        "text": "The woman is a wonderful and giving person.",
        "source": "user"
    },
    {
        "text": "All she wants is someone who treats her like a true friend.",
        "source": "user"
    },
    {
        "text": "She wants to be with someone who puts her first and cares about her feelings.",
        "source": "user"
    },
    {
        "text": "She's been hurt by men who only want to use her and don't care about her.",
        "source": "api"
    },
    {
        "text": "The shapeshifter is a good guy who just wants to be with the woman.",
        "source": "user"
    },
    {
        "text": "He became a shapeshifter as a child so he is used to having these powers.",
        "source": "user"
    },
    {
        "text": "He's been using them to get the woman to fall for him.",
        "source": "api"
    },
    {
        "text": "He has never really learned how to care for a partner because he grew up in a world of magic and his parents are distant.",
        "source": "user"
    },
    {
        "text": "The shapeshifter wants to start a family with the woman so he knows he has one more time to get things right so she will marry him.",
        "source": "user"
    },
    {
        "text": "The shapeshifter finally starts thinking about the woman as the mother of his future child and this changes the way he cares for her.",
        "source": "user"
    },
    {
        "text": "It finally makes him a good boyfriend.",
        "source": "user"
    },
    {
        "text": "The woman falls in love with him and they agree to marry.",
        "source": "user"
    },
    {
        "text": "Years later the woman and the shapeshifter have a child.",
        "source": "user"
    },
    {
        "text": "The shapeshifter has gained the woman's love and trust in every way.",
        "source": "user"
    },
    {
        "text": "That is, until the child starts to show it has magic abilities.",
        "source": "user"
    },
    {
        "text": "Now the shapeshifter must tell the woman the truth about himself as it is only a matter of time before she finds out on her own.",
        "source": "user"
    },
    {
        "text": "Luckily the woman is already deeply in love with the shapeshifter and her child so she forgives him and vows to be the best mother and wife she can be.",
        "source": "user"
    }
]