[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "This next life is the most amazing one yet!",
        "source": "user"
    },
    {
        "text": "You are rich, beautiful, and powerful.",
        "source": "user"
    },
    {
        "text": "You are confused about the presence of your previous selves, but file this question away as one of the more interesting philosophical problems you’ll explore in your next life.",
        "source": "user"
    },
    {
        "text": "The next life is just as amazing as you expected it to be.",
        "source": "user"
    },
    {
        "text": "You live in an amazing home.",
        "source": "user"
    },
    {
        "text": "In this life you live alone and have a lot of freedom.",
        "source": "user"
    },
    {
        "text": "There is no need to work as money comes in from investments.",
        "source": "api"
    },
    {
        "text": "You can spend you days how you choose.",
        "source": "user"
    },
    {
        "text": "In previous lives you knew people you wished you could help.",
        "source": "user"
    },
    {
        "text": "You still think about them and it occurs to you how much even the smallest amount of resources can help them.",
        "source": "user"
    },
    {
        "text": "You decide to help them in this life.",
        "source": "user"
    },
    {
        "text": "You have just enough money to give each of them $30,000 US dollars.",
        "source": "api"
    },
    {
        "text": "The only thing to figure out is how to get the money to them.",
        "source": "user"
    },
    {
        "text": "You remember seeing your previous selves and think that they probably know how to get the money to the people you want to help.",
        "source": "user"
    },
    {
        "text": "You turn to them and say, “How do we get the money to these people?",
        "source": "api"
    },
    {
        "text": "” They tell you they must wait until the first of the year.",
        "source": "api"
    },
    {
        "text": "“That’s when the New Year’s money is given to them.",
        "source": "user"
    },
    {
        "text": "”",
        "source": "api"
    },
    {
        "text": "On the first of the year you release the money to your prior selves and they deliver it to the people you wanted to have it.",
        "source": "user"
    },
    {
        "text": "You and your prior selves then move on to your next life.",
        "source": "user"
    }
]