[
    {
        "text": "Should College Athletes Be Paid?\n\nDo you think college athletes should be paid? Or is a college scholarship and other non-monetary perks like the opportunity to play in front of cheering fans enough?\n\nIn “Paying Students to Play Would Ruin College Sports,\" Cody J. McDavis writes: “Paying student-athletes might sound like a fairer way to treat students who generate so much money and attention for their colleges (not to mention the television networks that broadcast their games). But paying athletes would distort the economics of college sports in a way that would hurt the broader community of student-athletes, universities, fans and alumni. A handful of big sports programs would pay top dollar for a select few athletes, while almost every other college would get caught up in a bidding war it couldn't afford.\"\n\nDo you find his argument persuasive? What possible difficulties or downsides might there be in providing monetary compensation to players?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.24457741211667913
    },
    {
        "text": "Should College Athletes Be Paid?\n\nDo you think college athletes should be paid? Or is a college scholarship and other non-monetary perks like the opportunity to play in front of cheering fans enough?\n\nIn “Paying Students to Play Would Ruin College Sports,\" Cody J. McDavis writes: “Paying student-athletes might sound like a fairer way to treat students who generate so much money and attention for their colleges (not to mention the television networks that broadcast their games). But paying athletes would distort the economics of college sports in a way that would hurt the broader community of student-athletes, universities, fans and alumni. A handful of big sports programs would pay top dollar for a select few athletes, while almost every other college would get caught up in a bidding war it couldn't afford.\"\n\nDo you find his argument persuasive? What possible difficulties or downsides might there be in providing monetary compensation to players?\n\n---\n\nIn my opinion, college athletes should definitely get paid and thinking otherwise is ridiculous. Very simply put, the athletes make the universities an insane amount of money and never see a dollar of it.\n\nThe argument that they are getting a scholarship which is a payment is a ridiculous one to me. Sure they are getting a scholarship. They also are working much harder than the typical student.\n\nStudent athletes are basically being a full time student and a full time athlete at the same time. Thankfully, a bill was just passed that allows students to make money off of their name and their likeness.\n\nI would be willing to bet than an athlete like Zion Williamson made Duke at least 20 times the amount that his scholarship was. The student athletes have simply been exploited by colleges in the past, and the only people who see no issues with that are the universities themselves.\n\nThe entire student athletes getting a scholarship thing is a scam. It's just a scam that the universities and the top 1%  push because it helps make them money.\n\nPaying student athletes would not destroy college sports. Would it have an effect on the sports economy? Sure. Instead of the universities and networks keeping 100% of the profits and getting rich off of the student athletes, they'll have to give them their fair share.\n\nAnyone who disagrees with students not getting paid for sports simply wants to exploit them. There is no reason why a student should be risking injury before they go pro for a university for free. I don't want to hear the scholarship excuse. Students could have a full ride for academics. Then what happens to those students?\n\nThey get a full ride for academics and them playing sports gets them nothing extra? Maybe a free textbook or free lunches from the school cafeteria?\n\nWe have finally figured out that this scam has been going on for too long and that is why the lawmakers made a change. The exploitation of these 18-22 year old men and women is disgusting. I'm extremely happy that it is changing.\n\nThere have been so many student athletes in the past that have been used by their university. If people ever saw the amount of money that Alabama makes from their football program, their jaws would drop. That goes the same for Duke and North Carolina for basketball. That goes for basically all of the SEC and ACC teams in college football.\n\nThere is enough money being made off of the college athletes to spread the wealth. I do think there should be a cap on it and/or there should be a GPA to maintain in order to get their payments. If they fall below a 2.0 GPA for example they get fined or something along those lines to teach them the consequences of slacking off.\n\nMost college athletes won't go pro so they still need to make sure their academics are a priority. As long as their grades are in good standing, they should get their payments. We have had enough of students being exploited by the people in power. That exploitation is now dead and students will get the money that they rightfully deserve. \n",
        "source": "user",
        "start_time": 39.0,
        "end_time": 554.0,
        "last_event_time": 554.0,
        "start_progress": 0.24457741211667913,
        "end_progress": 1.0
    }
]