[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "You're just chilling at the kitchen table one day when you take a look at the mug that your daughter Harper gifted you for Father's Day one year when you discover the odd change.",
        "source": "user"
    },
    {
        "text": "Over a breakfast of waffles, scrambled eggs, sunny side up eggs, pancakes, French toast sticks, and a side of bacon, you're wondering what happened to all the mugs.",
        "source": "user"
    },
    {
        "text": "You ponder the question over some strawberries with powdered sugar and a dollop of whipped cream and think about it.",
        "source": "api"
    },
    {
        "text": "As you chew, you look for your name on the ranking.",
        "source": "api"
    },
    {
        "text": "After all, you've always been curious about the kind of dad you are.",
        "source": "user"
    },
    {
        "text": "When you find it, you're somewhere in the bottom third.",
        "source": "user"
    },
    {
        "text": "You shrug it off as a fluke and go back to your meal.",
        "source": "api"
    },
    {
        "text": "But then you notice that your name is no longer on the mug.",
        "source": "api"
    },
    {
        "text": "In its place is the name of a different man.",
        "source": "api"
    },
    {
        "text": "You look at the other mugs and find that your name is removed from all of them.",
        "source": "api"
    },
    {
        "text": "At that moment, a cold chill runs up your spine.",
        "source": "api"
    },
    {
        "text": "You get up from the table and try to call your wife, but she doesn't answer.",
        "source": "api"
    },
    {
        "text": "Who is this guy whose name now replaces yours?",
        "source": "api"
    },
    {
        "text": "The name is Mark Anders.",
        "source": "user"
    },
    {
        "text": "You've never heard of him.",
        "source": "user"
    },
    {
        "text": "He's definitely not a friend of yours.",
        "source": "api"
    },
    {
        "text": "You run through your memory to see if you've forgotten someone.",
        "source": "api"
    },
    {
        "text": "No, you don't know him.",
        "source": "api"
    },
    {
        "text": "You go to your daughter Harper's room and find it empty.",
        "source": "api"
    },
    {
        "text": "You start to panic.",
        "source": "api"
    },
    {
        "text": "Where is she?",
        "source": "api"
    },
    {
        "text": "When you call out for her, a man answers.",
        "source": "api"
    },
    {
        "text": "It's Mark.",
        "source": "api"
    },
    {
        "text": "He is Harper's new stepfather and you've never met him.",
        "source": "api"
    },
    {
        "text": "You are genuinely confused.",
        "source": "api"
    },
    {
        "text": "What happened to your wife, Soeurette?",
        "source": "api"
    },
    {
        "text": "Mark tells you that Soeurette has been cheating on you for the last four years.",
        "source": "user"
    },
    {
        "text": "You are shocked.",
        "source": "user"
    },
    {
        "text": "He tells you Soeurette has been unhappy with your poor parenting skills and that this morning, she finally decided to marry Mark at a shotgun wedding place.",
        "source": "user"
    },
    {
        "text": "You can't believe it.",
        "source": "user"
    },
    {
        "text": "Mark earnestly tells you that he's come to love Harper over the years and has legally adopted her.",
        "source": "user"
    },
    {
        "text": "You are heartbroken.",
        "source": "user"
    },
    {
        "text": "How could Soeurette do this to you?",
        "source": "user"
    },
    {
        "text": "You think back to all the times she said, \"Our daughter is the only thing we have in common.",
        "source": "api"
    },
    {
        "text": "That's why we stay married.",
        "source": "api"
    },
    {
        "text": "\" You had never understood what she meant by that.",
        "source": "api"
    },
    {
        "text": "Now you decide to get payback on Soeurette.",
        "source": "user"
    },
    {
        "text": "You tell Mark Anders that Harper's college tuition and private school costs will amount to close to a million dollars.",
        "source": "user"
    },
    {
        "text": "You tell Mark that since you are no longer legally Harper's father you will not have any role in paying that money.",
        "source": "user"
    },
    {
        "text": "Mark is stunned because he doesn't have a good or steady job, and Lord knows Soeurette is a housewife and trophy wife.",
        "source": "user"
    },
    {
        "text": "You leave, smirking, and let Mark consider the mess he has made.",
        "source": "user"
    }
]