[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "The world is a dangerous place, but it is also filled with wonder.",
        "source": "api"
    },
    {
        "text": "This power has been unknown for so long, people really don't know what to do with it.",
        "source": "api"
    },
    {
        "text": "Some have fear that the Earth will end up like Ragnarok when Hella came back, but there are a quiet few who know better.",
        "source": "user"
    },
    {
        "text": "This small group have been studying Mana for generations, passing the secrets of the ancient powers down through their family.",
        "source": "user"
    },
    {
        "text": "Before the world went to pot,  the Keepers of Mana were able to skype and communicate via messenger and social media.",
        "source": "user"
    },
    {
        "text": "They learned the magic spells and ways and kept written journals of what they discovered.",
        "source": "user"
    },
    {
        "text": "This small group knew the time was coming when this power would be needed, and the had to be sure they were ready.",
        "source": "user"
    },
    {
        "text": "Now, they are ready to share the secrets of the Keepers of Mana with the world.",
        "source": "user"
    },
    {
        "text": "There are so few people left, it won't be difficult to pass along what they know.",
        "source": "api"
    },
    {
        "text": "Incredibly enough, each area where humanity survived a Keeper, or more, survived as well.",
        "source": "user"
    },
    {
        "text": "The Keepers had learned so much in their studies, they are able to communicate with each other via telepathy.",
        "source": "user"
    },
    {
        "text": "They do so, and share what they are teaching to others.",
        "source": "user"
    },
    {
        "text": "The time is coming when the Earth will be ready to battle the aliens that have taken over their loved home.",
        "source": "user"
    },
    {
        "text": "To these few people, this is all too much like a scene from Avengers, and the aliens are no more than a Thanos that needs to be reckoned with.",
        "source": "user"
    },
    {
        "text": "When the time is ready to do battle, it will be silently fought and the invaders won't know what is coming.",
        "source": "user"
    },
    {
        "text": "Mana is magic that isn't showy or ostentatious.",
        "source": "user"
    },
    {
        "text": "It is subtle and the Keepers and their students will strike without warning.",
        "source": "user"
    },
    {
        "text": "The power comes from being of one mind and fighting for one cause.",
        "source": "user"
    },
    {
        "text": "Mana gathers it's strength from everyone collectively reaching towards the same goal, which is getting rid of the aliens.",
        "source": "user"
    },
    {
        "text": "When the Earth was over populated, Mana struggled to survive because humans were always at odds with each other.",
        "source": "user"
    },
    {
        "text": "Political battles, gender battles, income battles.",
        "source": "user"
    },
    {
        "text": "All of the hatred humans had for one another, kept Mana silent and not of much use.",
        "source": "user"
    },
    {
        "text": "Now that humans collectively are fighting to rid their world of the aliens, the power they hold is insurmountable.",
        "source": "user"
    },
    {
        "text": "They will win this war.",
        "source": "user"
    },
    {
        "text": "The day finally arrives when everyone on Earth has been taught the basic principals of the old magic.",
        "source": "user"
    },
    {
        "text": "When all people are ready to be better and do better with the new world they are about to obtain.",
        "source": "user"
    },
    {
        "text": "They collectively think of what they hope to achieve and how they hope to be when the aliens are gone.",
        "source": "user"
    },
    {
        "text": "Then Mana takes over, and their lives being anew.",
        "source": "user"
    },
    {
        "text": "And wonderful.",
        "source": "user"
    },
    {
        "text": "Everything they had wished for in their old lives becomes a reality.",
        "source": "user"
    }
]