[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "The man looks like the man of her dreams.",
        "source": "api"
    },
    {
        "text": "He's smart, funny, and handsome.",
        "source": "user"
    },
    {
        "text": "He's also a shapeshifter, and he's been using his ability to look like other men to get close to her.",
        "source": "api"
    },
    {
        "text": "She's unaware that he's been using his ability to look like other men to get close to her.",
        "source": "api"
    },
    {
        "text": "Every she breaks up with him, he learns from his mistakes, sort of like the movie \"Groundhog Day.",
        "source": "api"
    },
    {
        "text": "\"  He slowly figured out all the things she likes and dislikes as well as her red-flags.",
        "source": "user"
    },
    {
        "text": "He's been trying to change himself to be the perfect man for her.",
        "source": "user"
    },
    {
        "text": "After many unsuccessful attempts, changing his appearance every time, he finally figured out all of the right combinations of personality it took to win her heart.",
        "source": "api"
    },
    {
        "text": "They eventually became engaged to be married.",
        "source": "user"
    },
    {
        "text": "One day, while he's in his human form, she sees something that makes her suspicious.",
        "source": "user"
    },
    {
        "text": "His tail was sticking out.",
        "source": "api"
    },
    {
        "text": "He had not made it disappear.",
        "source": "api"
    },
    {
        "text": "She freaked out and began questioning him.",
        "source": "user"
    },
    {
        "text": "At this point, the shapeshifter had given up all hope of finding and tricking this woman anymore.",
        "source": "user"
    },
    {
        "text": "He shape shifted into his true form and ate her.",
        "source": "user"
    },
    {
        "text": "He decided to try turning into a woman and finding a man to pursue.",
        "source": "user"
    },
    {
        "text": "Maybe this would be easier for him to find true love.",
        "source": "user"
    },
    {
        "text": "The End.",
        "source": "user"
    }
]