[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the \"Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "Thus begins the story of the \"Lost Generations\" in this thought-provoking speculative sci-fi novel.",
        "source": "api"
    },
    {
        "text": "To save their own lives, the Lost Generations develop technologies to prevent aging.",
        "source": "api"
    },
    {
        "text": "They build self-sustaining orbital habitats and highly automated underground cities, and develop gene therapy to eliminate aging.",
        "source": "api"
    },
    {
        "text": "Their drug is better and more effective than the one that was initially given to everyone under age 26.",
        "source": "user"
    },
    {
        "text": "As the Lucky Ones went on with their lives, blissfully unaware that they were ticking time bombs for horrid side effects, The Lost ones were building and evolving and making their own spaces better in the world.",
        "source": "user"
    },
    {
        "text": "And when the side effects finally came, they were prepared.",
        "source": "user"
    },
    {
        "text": "The side effects hit the Lucky Ones with the blow of a bull hitting the matador.",
        "source": "user"
    },
    {
        "text": "They were unprepared and unwilling to accept that their mortality may one day be imminent.",
        "source": "user"
    },
    {
        "text": "The side effects were so terrible that all they could think of was death.",
        "source": "user"
    },
    {
        "text": "The pain, the blinding lights, the thundering sounds in their ears were all too terrible for the Lucky population to endure.",
        "source": "user"
    },
    {
        "text": "During this time of horror above ground, the Lost were living below the surface.",
        "source": "user"
    },
    {
        "text": "Watching the scene unfold on cameras and biding their time for when they could once again regain control of the Earth from the childish Lucky.",
        "source": "user"
    },
    {
        "text": "The Lucky Ones knew they needed to do something, anything, to end the suffering.",
        "source": "user"
    },
    {
        "text": "Even though they were filled with hatred for the original recipients of the miracle medication, they also had some compassion that remained which didn't allow them to let other creatures endure prolonged suffering.",
        "source": "user"
    },
    {
        "text": "It was once again a case of the haves and have nots.",
        "source": "user"
    },
    {
        "text": "Only instead of money or wealth as in the previous world order, it was life or death.",
        "source": "user"
    },
    {
        "text": "The Lost decided they must do something they never thought they would.",
        "source": "user"
    },
    {
        "text": "They must give their proven, more effective miracle medicine to all of the Lucky ones.",
        "source": "user"
    },
    {
        "text": "So they did.",
        "source": "user"
    },
    {
        "text": "Again, the results were instantaneous.",
        "source": "user"
    },
    {
        "text": "The suffering would end.",
        "source": "api"
    },
    {
        "text": "But not as the Lost imagined it would, with a cure for the Lucky and renewed immortality.",
        "source": "user"
    },
    {
        "text": "But with a pop and bang and puff of smoke as the Lucky simply vanished off the face of the Earth.",
        "source": "user"
    },
    {
        "text": "After the death of the Lucky, the remaining Lost colonies began to form their own governments and figure out what to do next.",
        "source": "user"
    },
    {
        "text": "It was decided that they must not allow the same mistakes of their previous society to be repeated.",
        "source": "api"
    },
    {
        "text": "So they pulled the best, brightest and most intelligent minds from each of the remaining colonies.",
        "source": "api"
    },
    {
        "text": "These people began to work on a new and improved drug for immortality in the event the same situation were to strike them that had been inflicted upon the Lucky.",
        "source": "user"
    },
    {
        "text": "And again, their efforts were successful.",
        "source": "user"
    },
    {
        "text": "But the strain of creating this drug took its toll on the minds and bodies of these remaining individuals, so they built a home for themselves in space where they could work in peace and quiet on their next miracle drug.",
        "source": "api"
    }
]