[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "The alien figured that Matt Damon was famous enough to cause a ruckus and he was right.",
        "source": "api"
    },
    {
        "text": "All of the news stations played stories about the abduction.",
        "source": "user"
    },
    {
        "text": "There was no real way to trace Matt Damon to outer space.",
        "source": "user"
    },
    {
        "text": "The alien hacked the newscasts and released a message.",
        "source": "user"
    },
    {
        "text": "The alien gave a ransom to the United States government in order to get Matt Damon back home safe and sound.",
        "source": "user"
    },
    {
        "text": "The alien asked for a couple of different things.",
        "source": "user"
    },
    {
        "text": "He wanted money, he wanted jurisdiction over every planet that isn't Earth and he wanted a top of the line rocket ship from NASA.",
        "source": "user"
    },
    {
        "text": "The government thought it over and found that this wasn't a big deal.",
        "source": "user"
    },
    {
        "text": "The demands weren't out of control so the government agreed to the deal.",
        "source": "user"
    },
    {
        "text": "They sent the alien money, a rocket ship from NASA and allowed the alien to have jurisdiction over all of the planets not named Earth.",
        "source": "user"
    },
    {
        "text": "Matt Damon was returned home and reunited with his family.",
        "source": "user"
    },
    {
        "text": "The United States public had confidence in their government as they helped save a beloved figure.",
        "source": "user"
    },
    {
        "text": "On the aliens side, he became a dictator.",
        "source": "user"
    },
    {
        "text": "Little by little he took over each planet.",
        "source": "user"
    },
    {
        "text": "Mars, Mercury, Jupiter, Saturn, etc.",
        "source": "user"
    },
    {
        "text": "They all were his.",
        "source": "user"
    },
    {
        "text": "He was building a superpower that could one day challenge the United States.",
        "source": "user"
    },
    {
        "text": "Perhaps the government never thought of this aspect and were just comfortable having access to Earth.",
        "source": "user"
    },
    {
        "text": "Luckily for both parties, they were able to sign a treaty where they could trade goods and services which would benefit each country.",
        "source": "user"
    },
    {
        "text": "The treaty became known as the Matt Damon treaty as that is how everything originated.",
        "source": "user"
    },
    {
        "text": "Both parties lived happily ever after and the compromise lasted forever.",
        "source": "user"
    },
    {
        "text": "The aliens were able to receive clothing, cars and money and the United States received new technology including UFOs.",
        "source": "user"
    }
]