[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "A world-wide society of mutants has emerged and are now the way of life.",
        "source": "api"
    },
    {
        "text": "It was amazing how quickly things crumbled.",
        "source": "user"
    },
    {
        "text": "It had only been 50 years after all.",
        "source": "user"
    },
    {
        "text": "But, mankind had changed.",
        "source": "api"
    },
    {
        "text": "If you could really even call it that.",
        "source": "user"
    },
    {
        "text": "Decisions had to be made.",
        "source": "user"
    },
    {
        "text": "Should we go back into exile or try to adapt to this new world?",
        "source": "user"
    },
    {
        "text": "The new creatures seemed to have their own language and their own social structure.",
        "source": "user"
    },
    {
        "text": "There was no more money, everything seemed to work on the barter system.",
        "source": "user"
    },
    {
        "text": "Some nations still wore clothes and seemed to live in towns and cities, but many had reverted back to a wild state and the capitals were nothing more than abandoned crumbling buildings and cities were going back to nature.",
        "source": "user"
    },
    {
        "text": "A world without the Internet was a hard one for me to adjust to.",
        "source": "user"
    },
    {
        "text": "But I saw the changes on the television every night from broadcasts made by the brave souls that went to see this new changed world.",
        "source": "user"
    },
    {
        "text": "I decided that I wanted to be one of them.",
        "source": "user"
    },
    {
        "text": "There was a segment on the local news about a group of people that had decided to go live among some of the more civilized mutants and find out what happened.",
        "source": "user"
    },
    {
        "text": "I suspected they also hoped to bring them more in line with our way of life.",
        "source": "user"
    },
    {
        "text": "I called the number at the end of the segment and made an appointment to go downtown the next day for a physical and screening.",
        "source": "user"
    },
    {
        "text": "I was nervous as I prepared for the interview, but I had done my homework and knew as much about this new reality as possible.",
        "source": "api"
    },
    {
        "text": "As I packed my bags that night, I knew that sleep would be hard to come by.",
        "source": "user"
    },
    {
        "text": "But I knew that this was something that I had to do.",
        "source": "user"
    },
    {
        "text": "It was up to me to either figure out how to navigate this new world, or make it fit more like the reality that I remembered.",
        "source": "user"
    },
    {
        "text": "As I fell asleep that night finally, I dreamed of a new world that was fused with my old world and suddenly it didn't seem so scary anymore.",
        "source": "user"
    }
]