[
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.21468574984443062
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, all citizens should keep up with the news to some extent, but not to the extent of being critical to the news. \n",
        "source": "user",
        "start_time": 16.0,
        "end_time": 96.0,
        "last_event_time": 96.0,
        "start_progress": 0.21468574984443062,
        "end_progress": 0.28438083385189794
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, all citizens should keep up with the news to some extent, but not to the extent of being critical to the news. In my opinion, being critical to the news is a bad trait and I would never want to give someone that opinion.\n",
        "source": "api",
        "start_time": 124.0,
        "end_time": 124.0,
        "last_event_time": 124.0,
        "start_progress": 0.28438083385189794,
        "end_progress": 0.3522090852520224
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, all citizens should keep up with the news to some extent, but not to the extent of being critical to the news. Knowing what is happening around you is important as you need to prepare for any type of emergency. However, being critical to the news is a bad trait because it will cause restlessness in the society. \n",
        "source": "user",
        "start_time": 134.0,
        "end_time": 251.0,
        "last_event_time": 251.0,
        "start_progress": 0.3522090852520224,
        "end_progress": 0.41008089607965154
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, all citizens should keep up with the news to some extent, but not to the extent of being critical to the news. Knowing what is happening around you is important as you need to prepare for any type of emergency. However, being critical to the news is a bad trait because it will cause restlessness in the society. If everyone is critical of what the new says it will cause less happiness and peace.\n",
        "source": "api",
        "start_time": 278.0,
        "end_time": 278.0,
        "last_event_time": 278.0,
        "start_progress": 0.41008089607965154,
        "end_progress": 0.46235220908525204
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, all citizens should keep up with the news to some extent, but not to the extent of being critical to the news. Knowing what is happening around you is important as you need to prepare for any type of emergency. However, being critical to the news is a bad trait because it will cause restlessness in the society. If everyone is critical of what the new says it will cause less happiness and peace. Therefore, we should know what is going on around us and not be critical of it.\n",
        "source": "api",
        "start_time": 293.0,
        "end_time": 293.0,
        "last_event_time": 293.0,
        "start_progress": 0.46235220908525204,
        "end_progress": 0.5121344119477287
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, all citizens should keep up with the news to some extent, but not to the extent of being critical to the news. Knowing what is happening around you is important as you need to prepare for any type of emergency. However, being critical to the news is a bad trait because it will cause restlessness in the society. If everyone is critical of what the new says it will cause less happiness and peace. Therefore, we should know what is going on around us and not be critical of it. \n\nI think all people should keep up with the news to some extent, but they shouldn't get criticism towards it.\n",
        "source": "api",
        "start_time": 314.0,
        "end_time": 314.0,
        "last_event_time": 314.0,
        "start_progress": 0.5121344119477287,
        "end_progress": 0.581207218419415
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, all citizens should keep up with the news to some extent, but not to the extent of being critical to the news. Knowing what is happening around you is important as you need to prepare for any type of emergency. However, being critical to the news is a bad trait because it will cause restlessness in the society. If everyone is critical of what the new says it will cause less happiness and peace. Therefore, we should know what is going on around us and not be critical of it. Thus, all people should keep up with the news to some extent, but they shouldn't get criticism towards it. Everyone should digest the news on their own and shouldn't force someone to accept their viewpoint. \n",
        "source": "user",
        "start_time": 319.0,
        "end_time": 387.0,
        "last_event_time": 387.0,
        "start_progress": 0.581207218419415,
        "end_progress": 0.641568139390168
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, all citizens should keep up with the news to some extent, but not to the extent of being critical to the news. Knowing what is happening around you is important as you need to prepare for any type of emergency. However, being critical to the news is a bad trait because it will cause restlessness in the society. If everyone is critical of what the new says it will cause less happiness and peace. Therefore, we should know what is going on around us and not be critical of it. Thus, all people should keep up with the news to some extent, but they shouldn't get criticism towards it. Everyone should digest the news on their own and shouldn't force someone to accept their viewpoint. Being critical towards the news will only cause tension in the society.\n",
        "source": "api",
        "start_time": 399.0,
        "end_time": 399.0,
        "last_event_time": 399.0,
        "start_progress": 0.641568139390168,
        "end_progress": 0.685749844430616
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, all citizens should keep up with the news to some extent, but not to the extent of being critical to the news. Knowing what is happening around you is important as you need to prepare for any type of emergency. However, being critical to the news is a bad trait because it will cause restlessness in the society. If everyone is critical of what the new says it will cause less happiness and peace. Therefore, we should know what is going on around us and not be critical of it. Thus, all people should keep up with the news to some extent, but they shouldn't get criticism towards it. Everyone should digest the news on their own and shouldn't force someone to accept their viewpoint. Being critical towards the news will only cause tension and even violence in the society. \n",
        "source": "user",
        "start_time": 406.0,
        "end_time": 434.0,
        "last_event_time": 434.0,
        "start_progress": 0.685749844430616,
        "end_progress": 0.6975731176104543
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, all citizens should keep up with the news to some extent, but not to the extent of being critical to the news. Knowing what is happening around you is important as you need to prepare for any type of emergency. However, being critical to the news is a bad trait because it will cause restlessness in the society. If everyone is critical of what the new says it will cause less happiness and peace. Therefore, we should know what is going on around us and not be critical of it. Thus, all people should keep up with the news to some extent, but they shouldn't get criticism towards it. Everyone should digest the news on their own and shouldn't force someone to accept their viewpoint. Being critical towards the news will only cause tension and even violence in the society. The world is already in a bad place, and we need to get along with each other if we ever want it to succeed again.\n",
        "source": "api",
        "start_time": 456.0,
        "end_time": 456.0,
        "last_event_time": 456.0,
        "start_progress": 0.6975731176104543,
        "end_progress": 0.7685127566894835
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, all citizens should keep up with the news to some extent, but not to the extent of being critical to the news. Knowing what is happening around you is important as you need to prepare for any type of emergency. However, being critical to the news is a bad trait because it will cause restlessness in the society. If everyone is critical of what the new says it will cause less happiness and peace. Therefore, we should know what is going on around us and not be critical of it. Thus, all people should keep up with the news to some extent, but they shouldn't get criticism towards it. Everyone should digest the news on their own and shouldn't force someone to accept their viewpoint. Being critical towards the news will only cause tension and even violence in the society. The world is already in a bad place, and we need to get along with each other if we ever want it to succeed again. To sum it up, we should know what is going on in the world and not get critical of it just because we think differently from what is reported\n",
        "source": "api",
        "start_time": 477.0,
        "end_time": 477.0,
        "last_event_time": 477.0,
        "start_progress": 0.7685127566894835,
        "end_progress": 0.8568761667703796
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, all citizens should keep up with the news to some extent, but not to the extent of being critical to the news. Knowing what is happening around you is important as you need to prepare for any type of emergency. However, being critical to the news is a bad trait because it will cause restlessness in the society. If everyone is critical of what the new says it will cause less happiness and peace. Therefore, we should know what is going on around us and not be critical of it. Thus, all people should keep up with the news to some extent, but they shouldn't get criticism towards it. Everyone should digest the news on their own and shouldn't force someone to accept their viewpoint. Being critical towards the news will only cause tension and even violence in the society. The world is already in a bad place, and we need to get along with each other if we ever want it to succeed again. To sum it up, we should know what is going on in the world by keeping up with the news, but we should not get critical of it just because we think differently from what is reported. There are so many news outlets to choose from. You should choose one that reports fair and honestly. \n",
        "source": "user",
        "start_time": 486.0,
        "end_time": 589.0,
        "last_event_time": 589.0,
        "start_progress": 0.8568761667703796,
        "end_progress": 0.9452395768512757
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, all citizens should keep up with the news to some extent, but not to the extent of being critical to the news. Knowing what is happening around you is important as you need to prepare for any type of emergency. However, being critical to the news is a bad trait because it will cause restlessness in the society. If everyone is critical of what the new says it will cause less happiness and peace. Therefore, we should know what is going on around us and not be critical of it. Thus, all people should keep up with the news to some extent, but they shouldn't get criticism towards it. Everyone should digest the news on their own and shouldn't force someone to accept their viewpoint. Being critical towards the news will only cause tension and even violence in the society. The world is already in a bad place, and we need to get along with each other if we ever want it to succeed again. To sum it up, we should know what is going on in the world by keeping up with the news, but we should not get critical of it just because we think differently from what is reported. There are so many news outlets to choose from. You should choose one that reports fair and honestly. That way, you can avoid bias information which will prevent you from being critical.\n",
        "source": "api",
        "start_time": 598.0,
        "end_time": 598.0,
        "last_event_time": 598.0,
        "start_progress": 0.9452395768512757,
        "end_progress": 0.9975108898568762
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, all citizens should keep up with the news to some extent, but not to the extent of being critical to the news. Knowing what is happening around you is important as you need to prepare for any type of emergency. However, being critical to the news is a bad trait because it will cause restlessness in the society. If everyone is critical of what the new says it will cause less happiness and peace. Therefore, we should know what is going on around us and not be critical of it. Thus, all people should keep up with the news to some extent, but they shouldn't get criticism towards it. Everyone should digest the news on their own and shouldn't force someone to accept their viewpoint. Being critical towards the news will only cause tension and even violence in the society. The world is already in a bad place, and we need to get along with each other if we ever want it to succeed again. \n\nTo sum it up, we should know what is going on in the world by keeping up with the news, but we should not get critical of it just because we think differently from what is reported. There are so many news outlets to choose from. You should choose one that reports fairly and honestly. That way, you can avoid bias information which will prevent you from being critical.\n",
        "source": "user",
        "start_time": 612.0,
        "end_time": 629.0,
        "last_event_time": 629.0,
        "start_progress": 0.9975108898568762,
        "end_progress": 1.0
    }
]