[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "The side effects are quite devastating, and you suddenly realize at the ripe old age of 85 how lucky you are to have escaped them entirely.",
        "source": "api"
    },
    {
        "text": "However, some of the people that you love aren't quite so lucky.",
        "source": "user"
    },
    {
        "text": "For example, your wife, Soeurette, is several years younger than you.",
        "source": "user"
    },
    {
        "text": "She did receive the drug.",
        "source": "user"
    },
    {
        "text": "She isn't aging, but the drug has its consequences.",
        "source": "user"
    },
    {
        "text": "And they are manifesting now, all these years later.",
        "source": "api"
    },
    {
        "text": "Will you be able to help her?",
        "source": "user"
    },
    {
        "text": "You frankly don't trust that you will be able to help her.",
        "source": "api"
    },
    {
        "text": "All your life you've done nothing but protect her from harm's way but now you don't think you will be able to.",
        "source": "user"
    },
    {
        "text": "You don't think you can protect her from herself or the heinous results of a flawed experiment.",
        "source": "user"
    },
    {
        "text": "Soeurette's blonde hair has all fallen out.",
        "source": "api"
    },
    {
        "text": "Her fingers and toes have all distorted into claw-like appendages.",
        "source": "user"
    },
    {
        "text": "And perhaps worst of all, she's lost all sense of sanity.",
        "source": "api"
    },
    {
        "text": "Her mind is actually going crazy and you are watching her rapid snowball decline from reality.",
        "source": "user"
    },
    {
        "text": "And the worse part is, it's happening right before your eyes.",
        "source": "user"
    },
    {
        "text": "Your heart aches for the woman that you love and suddenly you realize what you need to do.",
        "source": "api"
    },
    {
        "text": "You need to do whatever it takes to stop the people that did this to her and other innocent victims.",
        "source": "user"
    },
    {
        "text": "You immediately identify the pharmaceutical company that created this drug so many years ago.",
        "source": "api"
    },
    {
        "text": "It was called Biogenetic Research.",
        "source": "user"
    },
    {
        "text": "You vow to hold them responsible for their negligence.",
        "source": "api"
    },
    {
        "text": "You will be the one to make them pay.",
        "source": "user"
    },
    {
        "text": "And you have decided to do so by filing a class action lawsuit.",
        "source": "api"
    },
    {
        "text": "Once the lawsuit has been filed, however, you realize that Soeurette's functioning is just getting worse and worse.",
        "source": "user"
    },
    {
        "text": "Her pain and discomfort is intensifying each and every day.",
        "source": "user"
    },
    {
        "text": "So, one day, when the pain is particularly bad for her, you tell her that you understand if she needs to let go and head to heaven without you.",
        "source": "api"
    },
    {
        "text": "She nods and you say you'll come back to check on her, but then when you come back, she's already gone.",
        "source": "user"
    },
    {
        "text": "You are devastated that she is gone.",
        "source": "user"
    },
    {
        "text": "You really can't believe that you just lost the love of your life.",
        "source": "user"
    },
    {
        "text": "You take this pain and hurt you are experiencing to court and fight back hard against Biogenetic Research.",
        "source": "api"
    },
    {
        "text": "Eventually, you win the lawsuit.",
        "source": "user"
    },
    {
        "text": "The court decides that there is enough merit to your case to warrant a huge amount of money in damages, awarded to you.",
        "source": "user"
    },
    {
        "text": "You are absolutely happy that justice was served in this incident, although Soeurette's death puts a damper on how you are feeling and makes you feel guilty all over again for having allowed this all to happen to her.",
        "source": "user"
    },
    {
        "text": "However, you know you are taking baby steps toward rectifying this situation for Soeurette.",
        "source": "user"
    },
    {
        "text": "So you will count this experience of going to court on her behalf as a total win and will not let anyone else tell you otherwise.",
        "source": "user"
    }
]