[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "Trigger warning-AI-introduced murderous elements/cancer.",
        "source": "user"
    },
    {
        "text": "(Yes, the AI wanted to give the pig cancer, 4x, and suggested hooking to an IV drip.",
        "source": "user"
    },
    {
        "text": "That pig did something bad in a past life.",
        "source": "user"
    },
    {
        "text": ")",
        "source": "user"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.\"",
        "source": "api"
    },
    {
        "text": "But the wolf couldn't blow it down, because depleted uranium is one of the most dense elements in the known universe!",
        "source": "api"
    },
    {
        "text": "So he had to come up with a new plan.",
        "source": "user"
    },
    {
        "text": "He disguised himself as a health inspector, and he walked up to the house and just stood there for a while.",
        "source": "api"
    },
    {
        "text": "Then, he knocked on the door and said, \"Little pig, little pig! It's the health department!\"",
        "source": "api"
    },
    {
        "text": "The 92nd little pig recognized his voice, so he said, \"No thanks, wolf. I'm healthy as a pig!\"",
        "source": "api"
    },
    {
        "text": "The wolf said, \"Oh, I'm sorry. I must have the wrong address.\" And he walked away.",
        "source": "api"
    },
    {
        "text": "But the wolf knew that the little pig would go to visit his neighbor, so he waited outside the next house.",
        "source": "user"
    },
    {
        "text": "And as soon as the 92nd little pig walked out, he snuck up and put a bag over his head and took him away.",
        "source": "user"
    },
    {
        "text": "The wolf put the 92nd little pig in a big pot and started to heat the water.",
        "source": "user"
    },
    {
        "text": "But the 92nd little pig was smart.",
        "source": "api"
    },
    {
        "text": "He managed to squirm his way to the edge of the pot, and when he did, he grabbed a nearby radio antenna and pulled it out.",
        "source": "api"
    },
    {
        "text": "The antenna was attached to the city's radio station, and when he pulled it out, all of the city's residents could hear him screaming for help!",
        "source": "user"
    },
    {
        "text": "So the people of the city stormed the wolf's house and rescued the 92nd little pig.",
        "source": "user"
    },
    {
        "text": "And when the 92nd little pig got home, he wrote a book called \"How to Build an Igloo Out of Uranium\" which became a bestseller.",
        "source": "api"
    },
    {
        "text": "But then he got cancer.",
        "source": "user"
    },
    {
        "text": "And then he got cancer again.",
        "source": "user"
    },
    {
        "text": "And again.",
        "source": "user"
    },
    {
        "text": "So while his family lived happily ever after, free of the scourge of the wolf, the little pig had to live his life hooked up to an IV drip, slowly dying of cancer.",
        "source": "user"
    },
    {
        "text": "When he died, he was revered as a saint among pigs, and children sang his praises for saving them from the evil wolf.",
        "source": "user"
    }
]