[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "The alien has held him hostage in the woods outside of his spaceship.",
        "source": "user"
    },
    {
        "text": "The alien is unaware that Matt Damon is a famous actor and that his kidnapping is a huge deal.",
        "source": "user"
    },
    {
        "text": "He wants to keep him so his species can learn more about humans.",
        "source": "api"
    },
    {
        "text": "The alien has a lot of questions for Matt Damon.",
        "source": "user"
    },
    {
        "text": "He asked Matt Damon about what things he ate and what he did during the day as a human.",
        "source": "api"
    },
    {
        "text": "The alien is fascinated by the fact that Matt Damon is a human and that he is so different from him.",
        "source": "user"
    },
    {
        "text": "Meanwhile, the people now know that Mr.",
        "source": "api"
    },
    {
        "text": "Damon is missing and a report of it has even been seen on the news.",
        "source": "user"
    },
    {
        "text": "The people are very worried about him and they are trying to find him.",
        "source": "user"
    },
    {
        "text": "After about a week, the alien sees this on his spaceship's tv transmitter.",
        "source": "api"
    },
    {
        "text": "He knows the humans will eventually come for him.",
        "source": "user"
    },
    {
        "text": "He decides to let Matt Damon go.",
        "source": "user"
    },
    {
        "text": "Matt Damon went home and told all the people, even the news reporters, the story about the alien.",
        "source": "api"
    },
    {
        "text": "He told them how the alien had kidnapped him and how he was very nice to him.",
        "source": "user"
    },
    {
        "text": "All the alien really wanted to do is learn about humans and their culture.",
        "source": "api"
    },
    {
        "text": "The people were very happy that Matt Damon was safe and that the alien was not a threat to them.",
        "source": "user"
    },
    {
        "text": "To show their gratitude, the people allowed the alien to visit in a nearby area, so he could learn even more about Matt Damon and his people.",
        "source": "api"
    },
    {
        "text": "The alien was able to taste delicious food and listen to music played by the people.",
        "source": "user"
    },
    {
        "text": "He hung out with Matt Damon and his friends for a few days.",
        "source": "user"
    },
    {
        "text": "He was very happy to be able to learn more about humans.",
        "source": "user"
    },
    {
        "text": "The alien was sad to say goodbye to Matt Damon and his friends.",
        "source": "api"
    },
    {
        "text": "But he had gotten all he had come to earth for.",
        "source": "api"
    },
    {
        "text": "He climbed in his spaceship and took off happy about his journey to Earth.",
        "source": "user"
    },
    {
        "text": "The End.",
        "source": "user"
    }
]