[
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.18710307767464582
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, yes, schools should be required to provide pads and tampons to students who need them.\n",
        "source": "user",
        "start_time": 6.0,
        "end_time": 32.0,
        "last_event_time": 32.0,
        "start_progress": 0.18710307767464582,
        "end_progress": 0.22960429897410845
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, yes, schools should be required to provide pads and tampons to students who need them. As a menstruating human being, I've experienced a number of inconveniences related to my periods, and it's mostly due to a lack of access\n",
        "source": "api",
        "start_time": 45.0,
        "end_time": 45.0,
        "last_event_time": 45.0,
        "start_progress": 0.22960429897410845,
        "end_progress": 0.2970200293111871
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, yes, schools should be required to provide pads and tampons to students who need them. As a menstruating human being, I've experienced a number of inconveniences related to my periods, and sometimes it is due to a lack of access to these products when I need them. As an adult, if I experience this inconvenience it's easy to take a break to go get more, but a student in school does not have this option. Sometimes students don't have extra money to pay for something like a pad or tampon if they are for sale. \n",
        "source": "user",
        "start_time": 66.0,
        "end_time": 194.0,
        "last_event_time": 194.0,
        "start_progress": 0.2970200293111871,
        "end_progress": 0.43771372740595993
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, yes, schools should be required to provide pads and tampons to students who need them. As a menstruating human being, I've experienced a number of inconveniences related to my periods, and sometimes it is due to a lack of access to these products when I need them. As an adult, if I experience this inconvenience it's easy to take a break to go get more, but a student in school does not have this option. Sometimes students don't have extra money to pay for something like a pad or tampon if they are for sale. Students should not be experiencing any unnecessary stress during school.\n",
        "source": "api",
        "start_time": 206.0,
        "end_time": 206.0,
        "last_event_time": 206.0,
        "start_progress": 0.43771372740595993,
        "end_progress": 0.47337567171470446
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, yes, schools should be required to provide pads and tampons to students who need them. As a menstruating human being, I've experienced a number of inconveniences related to my periods, and sometimes it is due to a lack of access to these products when I need them. As an adult, if I experience this inconvenience it's easy to take a break to go get more, but a student in school does not have this option. Sometimes students don't have extra money to pay for something like a pad or tampon if they are for sale. They should not be forced to experience the unnecessary stress caused by such a predicament when they are in school. When students don't have access to these items it can create a situation where they can't focus because have no protection from bleeding on themselves, or even worse they can actually have an accident which is not only unsanitary, it can result in them being humiliated by the experience. No young woman should have to go through that in a school when the school could prevent it by providing access to the \n",
        "source": "user",
        "start_time": 215.0,
        "end_time": 419.0,
        "last_event_time": 419.0,
        "start_progress": 0.47337567171470446,
        "end_progress": 0.6936980947728383
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, yes, schools should be required to provide pads and tampons to students who need them. As a menstruating human being, I've experienced a number of inconveniences related to my periods, and sometimes it is due to a lack of access to these products when I need them. As an adult, if I experience this inconvenience it's easy to take a break to go get more, but a student in school does not have this option. Sometimes students don't have extra money to pay for something like a pad or tampon if they are for sale. They should not be forced to experience the unnecessary stress caused by such a predicament when they are in school. When students don't have access to these items it can create a situation where they can't focus because have no protection from bleeding on themselves, or even worse they can actually have an accident which is not only unsanitary, it can result in them being humiliated by the experience. No young woman should have to go through that in a school when the school could prevent it by providing access to the products right there at the school.\n",
        "source": "api",
        "start_time": 427.0,
        "end_time": 427.0,
        "last_event_time": 427.0,
        "start_progress": 0.6936980947728383,
        "end_progress": 0.7107962872496336
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, yes, schools should be required to provide pads and tampons to students who need them. As a menstruating human being, I've experienced a number of inconveniences related to my periods, and sometimes it is due to a lack of access to these products when I need them. As an adult, if I experience this inconvenience it's easy to take a break to go get more, but a student in school does not have this option. Sometimes students don't have extra money to pay for something like a pad or tampon if they are for sale. They should not be forced to experience the unnecessary stress caused by such a predicament when they are in school. When students don't have access to these items it can create a situation where they can't focus because have no protection from bleeding on themselves, or even worse they can actually have an accident which is not only unsanitary, it can result in them being humiliated by the experience. No young woman should have to go through that in a school when the school could prevent it by providing access to the products right there at the school. Pads and tampons, in my opinion are similar to first aid items because if one is needed, it is absolutely NEEDED NOW.  First aid items are provided to those who need them in schools so I believe that pads and tampons should be too. They are somehow different because they aren't used by both genders, but to deprive ONE gender of items they literally can't be in public with out would place an unfair burden on females. So in conclusion for all these reasons stated, I definitely believe schools should, without a doubt, be required to provide pads and tampons to the students who need them.\n",
        "source": "user",
        "start_time": 429.0,
        "end_time": 652.0,
        "last_event_time": 652.0,
        "start_progress": 0.7107962872496336,
        "end_progress": 1.0
    }
]