[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "You can control the movie by making a series of choices.",
        "source": "api"
    },
    {
        "text": "It' like one of those choose your own adventure books you enjoyed so much as a child.",
        "source": "api"
    },
    {
        "text": "The movie begins, and everyone sits quietly waiting to see what will happen, or what you will make happen.",
        "source": "user"
    },
    {
        "text": "The film shows you as a child, growing up.",
        "source": "user"
    },
    {
        "text": "These years speed by fast, because it seems so boring to everyone.",
        "source": "api"
    },
    {
        "text": "The real excitement will come when you get older.",
        "source": "user"
    },
    {
        "text": "What will your career choice be?",
        "source": "user"
    },
    {
        "text": "Will you get married?",
        "source": "user"
    },
    {
        "text": "Will you be rich?",
        "source": "user"
    },
    {
        "text": "The possibilities are endless.",
        "source": "user"
    },
    {
        "text": "When you're about twenty, the movie jumps forward to show your thirties.",
        "source": "api"
    },
    {
        "text": "You can see yourself making the same mistakes over and over again.",
        "source": "api"
    },
    {
        "text": "You are trapped in a vicious cycle, and you can't seem to break out.",
        "source": "api"
    },
    {
        "text": "It is time to make some real changes to improve your life, or it will end up like the number of variants sitting by you in the theater.",
        "source": "api"
    },
    {
        "text": "You hit the option to make a career change to one you love instead of one you are obligated to.",
        "source": "user"
    },
    {
        "text": "Since everyone else in the room seems to be passed out from boredom, your choice becomes the reality of the new you.",
        "source": "user"
    },
    {
        "text": "You love what you are now doing for a living, and for the first time in your life, you feel satisfied with your lot.",
        "source": "user"
    },
    {
        "text": "Then you decide to play the lottery.",
        "source": "api"
    },
    {
        "text": "Something you hadn't really done before.",
        "source": "user"
    },
    {
        "text": "The winning numbers are called, and they belong to the new you.",
        "source": "user"
    },
    {
        "text": "What a sweet surprise.",
        "source": "user"
    },
    {
        "text": "So much money all at once, you can do anything.",
        "source": "user"
    },
    {
        "text": "A new house, a new car, vacations.",
        "source": "user"
    },
    {
        "text": "You quit your job and begin to spend endless days on vacation and shopping and basically lounging about.",
        "source": "api"
    },
    {
        "text": "But is this life really any better?",
        "source": "user"
    },
    {
        "text": "Shouldn't you be doing more with all the money you have?",
        "source": "user"
    },
    {
        "text": "You tell yourself that it's okay because you have the money now to help people who need it.",
        "source": "user"
    },
    {
        "text": "That's it!",
        "source": "api"
    },
    {
        "text": "Helping those in need.",
        "source": "api"
    },
    {
        "text": "This is something you have always wanted to do in your past lives, but never had the money or time to do it.",
        "source": "user"
    },
    {
        "text": "Suddenly, you notice movement in the theater.",
        "source": "user"
    },
    {
        "text": "All of your selves are now paying attention and ready to make choices about who you will help with your money.",
        "source": "user"
    },
    {
        "text": "The old versions of you all had different problems.",
        "source": "user"
    },
    {
        "text": "Health, relationship, living situations.",
        "source": "user"
    },
    {
        "text": "Now is the time for you to give to organizations that could have helped in the past.",
        "source": "user"
    },
    {
        "text": "You give money to a few different organizations, vowing to personally help the people they cater to.",
        "source": "user"
    },
    {
        "text": "One by one, the suggestions for where you should donate money to come in.",
        "source": "api"
    },
    {
        "text": "You watch as the new you writes checks, volunteers time, and raises awareness for each and every group that needs help.",
        "source": "user"
    },
    {
        "text": "You can see that the new you is truly happy and filled with joy to be able to help others.",
        "source": "user"
    },
    {
        "text": "It is as if you have finally found your purpose and achieved your true self.",
        "source": "user"
    },
    {
        "text": "The screen begins to dim and the lights in the theater come up.",
        "source": "user"
    },
    {
        "text": "Everyone claps.",
        "source": "user"
    },
    {
        "text": "You all know this version of you will be the best yet.",
        "source": "user"
    }
]