[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?\" The bee flits about as your jaw drops in surprise.",
        "source": "api"
    },
    {
        "text": "\"I...I...I don't know.\" you stammer.",
        "source": "user"
    },
    {
        "text": "\"Well, I'm not going to do anything until you give me an order.\" the bee says.",
        "source": "user"
    },
    {
        "text": "\"What do you mean? I thought you were going to sting me!\" you say.",
        "source": "user"
    },
    {
        "text": "\"No, I'm not going to sting you. I'm your personal bee. I'm here to serve you.\" the bee says.",
        "source": "user"
    },
    {
        "text": "\"But...but...but...I'm allergic to bees!\" you say.",
        "source": "user"
    },
    {
        "text": "The bee tells you that you're not allergic to him.",
        "source": "user"
    },
    {
        "text": "He introduces himself to you as Mikey, and he says that your mom hired him for you to plan your upcoming wedding.",
        "source": "user"
    },
    {
        "text": "\"Wedding? What wedding?\" you ask.",
        "source": "user"
    },
    {
        "text": "It's been nearly two years since your last boyfriend broke up with you.",
        "source": "user"
    },
    {
        "text": "You are eons away from getting married, despite having an active presence on Tinder.",
        "source": "user"
    },
    {
        "text": "\"Well, you're getting married to the King of the bees,\" Mikey says.",
        "source": "api"
    },
    {
        "text": "\"Who else would you get married to?\" You have never once in your life considered that you would ever marry the King of the bees, and this news shocks you now.",
        "source": "user"
    },
    {
        "text": "\"But...but...but...I'm not a bee!\" you say.",
        "source": "user"
    },
    {
        "text": "Mikey brushes your concerns aside.",
        "source": "user"
    },
    {
        "text": "\"Come, let's plan your wedding. What flavor cake do you want?\"",
        "source": "user"
    },
    {
        "text": "\"I don't want a cake! I don't want to get married!\" you say.",
        "source": "api"
    },
    {
        "text": "You had long ago sworn off men since you were sure that you didn't want to deal with the heartache you felt when your ex left you.",
        "source": "user"
    },
    {
        "text": "Mikey is not convinced.",
        "source": "user"
    },
    {
        "text": "\"Come, let's go to the florist. What color flowers do you want?\" You are flabbergasted by Mike's persistence at planning a wedding you don't want to have.",
        "source": "user"
    },
    {
        "text": "\"Mikey, I'm not getting married to the King of the bees! I'm not even dating anyone!\" Mikey laughs at your protests.",
        "source": "user"
    },
    {
        "text": "\"Come, let's go to the dressmaker. What style of dress do you want?\" You have no idea what to say.",
        "source": "user"
    },
    {
        "text": "After an afternoon of cake tastings, catering tastings, dress fitting, and tiara shopping, you are exhausted.",
        "source": "user"
    },
    {
        "text": "Mikey says that you should go home and get some rest.",
        "source": "user"
    },
    {
        "text": "He says the day has been a total success.",
        "source": "user"
    },
    {
        "text": "You get home and see your mom.",
        "source": "user"
    },
    {
        "text": "She asks you how the wedding planning went.",
        "source": "user"
    },
    {
        "text": "\"I'm not getting married to the King of the bees!\" you say.",
        "source": "user"
    },
    {
        "text": "Your mom laughs.",
        "source": "user"
    },
    {
        "text": "\"Oh, honey, you're not getting married to the King of the bees. I hired Mikey to help you get back out there and find a man. You've been so sad since your last boyfriend left you. I thought you needed a push in the right direction. I'm sorry if I overstepped my bounds. But I just wanted you to see how exciting it could be to date again, since it would be so exciting for you to plan a real wedding.\" You are floored.",
        "source": "user"
    },
    {
        "text": "You had never considered that your mom would hire a bee to help you find a boyfriend.",
        "source": "user"
    },
    {
        "text": "Honestly, you are a little concerned that your mom would go to such great lengths.",
        "source": "user"
    },
    {
        "text": "\"So...so...so...I'm not getting married to the King of the bees?\" you ask.",
        "source": "user"
    },
    {
        "text": "\"No honey, you're not getting married to the King of the bees.\" your mom says.",
        "source": "user"
    },
    {
        "text": "\"Oh, thank goodness.\" you say.",
        "source": "user"
    },
    {
        "text": "\"But honey, you should really consider dating again. You're a beautiful young woman, and you're going to be single for the rest of your life if you don't start dating again.\" Your mom leans over to brush your hair.",
        "source": "user"
    },
    {
        "text": "\"You're going to be a beautiful bride someday, honey.\"",
        "source": "user"
    },
    {
        "text": "You protest, \"But I'm very active on Tinder.\"",
        "source": "user"
    },
    {
        "text": "\"Oh honey, Tinder is not real dating. Find yourself a real man!\"",
        "source": "api"
    },
    {
        "text": "So after that conversation with your mom, you both agree that you'll spend more time looking for nice guys out there, and she agrees not to hire Mikey again.",
        "source": "user"
    }
]