[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?\"",
        "source": "api"
    },
    {
        "text": "Obviously you're surprised by this behavior.",
        "source": "user"
    },
    {
        "text": "You're even more surprised when you realize that you're the queen bee.",
        "source": "user"
    },
    {
        "text": "You don't look like a bee and, as far as you know, you've never been very close to any bees.",
        "source": "user"
    },
    {
        "text": "You're not sure what to do.",
        "source": "user"
    },
    {
        "text": "Should you talk back to the strange bee?",
        "source": "user"
    },
    {
        "text": "Should you tell it to buzz off?",
        "source": "user"
    },
    {
        "text": "You decide that it's best to try to learn more.",
        "source": "user"
    },
    {
        "text": "\"How did you know I was the queen?\" you ask.",
        "source": "user"
    },
    {
        "text": "The bee doesn't respond to your question but just repeats its inquiry, for your orders.",
        "source": "user"
    },
    {
        "text": "\"I don't know what to do,\" you tell the bee.",
        "source": "user"
    },
    {
        "text": "The bee just asks the same question again, \"what are your orders?\" You give up and tell the bee that your orders are to give you more information about this strange situation.",
        "source": "user"
    },
    {
        "text": "The bee tells you that your life has been a training exercise for the day you take over the world of bees.",
        "source": "user"
    },
    {
        "text": "Further, the bee tells you that you have been kept away from bees for all of this time, because they didn't want you to know that you are royalty, until you had lived a normal life.",
        "source": "user"
    },
    {
        "text": "The bees believed that you would be a better leader with this background.",
        "source": "user"
    },
    {
        "text": "The bee then tells you that you have been chosen to lead the bees in a war against the humans.",
        "source": "user"
    },
    {
        "text": "This really takes you by surprise, because you have always lived as a human.",
        "source": "user"
    },
    {
        "text": "\"I refuse to lead bees against people,\" you say, defiantly.",
        "source": "user"
    },
    {
        "text": "\"You have no choice,\" replies the bee.",
        "source": "user"
    },
    {
        "text": "\"You are the queen bee and you must lead us,\" he continues.",
        "source": "user"
    },
    {
        "text": "You run away from the bee, as fast as you can.",
        "source": "user"
    },
    {
        "text": "You run and run until you can't run anymore.",
        "source": "user"
    },
    {
        "text": "You arrive at a clearing, deep in the woods.",
        "source": "user"
    },
    {
        "text": "You sit down to rest and you suddenly hear an intense, loud buzzing sound, moving toward you.",
        "source": "user"
    },
    {
        "text": "It's the entire colony of bees!",
        "source": "user"
    },
    {
        "text": "They have found you!",
        "source": "user"
    },
    {
        "text": "You can't run anymore and the bees surround you.",
        "source": "user"
    },
    {
        "text": "You are swarmed by thousands, if not millions, of bees.",
        "source": "user"
    },
    {
        "text": "You can't breathe, you can't move, you can't scream.",
        "source": "user"
    },
    {
        "text": "Finally, they give you enough room to move and to speak.",
        "source": "user"
    },
    {
        "text": "You are defeated.",
        "source": "user"
    },
    {
        "text": "You yell to them, \"form ranks for an attack on the humans.\" You live the rest of your life as the leader of the bees.",
        "source": "user"
    }
]