[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "The people feel tricked.",
        "source": "api"
    },
    {
        "text": "The rest of the world was progressing while the United States was isolating.",
        "source": "user"
    },
    {
        "text": "The world is now very advanced, and the US is just catching up.",
        "source": "user"
    },
    {
        "text": "The rest of the world now wants to help the United States recover, they want to show that they were not wrong in going into isolation.",
        "source": "api"
    },
    {
        "text": "There is value in isolation and the United States has preserved many traditions.",
        "source": "api"
    },
    {
        "text": "The other countries have something to learn from America, and vice versa.",
        "source": "user"
    },
    {
        "text": "It is a perfect opportunity for the two to come together and learn from each other.",
        "source": "api"
    },
    {
        "text": "Only time would tell if people were evolved enough to truly work together or if interactions would eventually lead to yet another World War.",
        "source": "api"
    },
    {
        "text": "Fighting seems to be a part of human nature and it is usually just a matter of time before it happens.",
        "source": "user"
    },
    {
        "text": "But people are also interested in things that make them successful.",
        "source": "user"
    },
    {
        "text": "Once the US proved to other countries that they have helpful knowledge to share they were under much less of a threat.",
        "source": "user"
    },
    {
        "text": "Many people want to do the right thing but also think of themselves.",
        "source": "user"
    },
    {
        "text": "It is also human nature to be self-centered.",
        "source": "api"
    },
    {
        "text": "It was up the US to balance these needs to fight and think of yourself.",
        "source": "user"
    },
    {
        "text": "As long as they provided value to the other countries they would remain more secure.",
        "source": "user"
    }
]