[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "This time, he has shapeshifted into Elon Musk and assumed his identity.",
        "source": "api"
    },
    {
        "text": "He put the real Elon Musk in a small prison in his basement, feeding him ten apples a day and a small.",
        "source": "user"
    },
    {
        "text": "bit of ham.",
        "source": "user"
    },
    {
        "text": "The real Elon Musk is becoming frail.",
        "source": "user"
    },
    {
        "text": "One day, fake Elon Musk asks Christina, the woman he has been dating over and over before this, to move in with him.",
        "source": "user"
    },
    {
        "text": "She agrees.",
        "source": "user"
    },
    {
        "text": "Oddly, every time before meals, fake Elon Musk disappears for a few minutes.",
        "source": "user"
    },
    {
        "text": "Christina wonders where he's going off to and follows him one day.",
        "source": "user"
    },
    {
        "text": "She is careful to be quiet and not get caught.",
        "source": "user"
    },
    {
        "text": "Fake Elon Musk looks over his shoulder a few times but doesn't spot Christina.",
        "source": "user"
    },
    {
        "text": "He approaches the prison in his basement and slides a tray of apples and ham under the door.",
        "source": "user"
    },
    {
        "text": "Christina runs silently towards the master bedroom and pretends to be sleeping.",
        "source": "user"
    },
    {
        "text": "Fake Elon Musk doesn't suspect a thing.",
        "source": "user"
    },
    {
        "text": "He pulls the curtains shut and climbs into bed with Christina.",
        "source": "user"
    },
    {
        "text": "As fake Elon Musk sleeps, Christina wakes up and quietly opens her purse and takes out her cell phone.",
        "source": "api"
    },
    {
        "text": "She goes down to the secret prison and begins talking to the door.",
        "source": "user"
    },
    {
        "text": "\"Who is in there, do you need help?",
        "source": "user"
    },
    {
        "text": "\" She asks.",
        "source": "user"
    },
    {
        "text": "She hears a faint voice from behind the door.",
        "source": "user"
    },
    {
        "text": "\"What was that, sorry, you'll have to speak up.",
        "source": "api"
    },
    {
        "text": "\" She says.",
        "source": "user"
    },
    {
        "text": "The voice behind the door gets louder and clearer, \"Help me!",
        "source": "user"
    },
    {
        "text": "\"\n\nThe door is sealed with a coded lock.",
        "source": "api"
    },
    {
        "text": "She thinks she knows the code to get in there.",
        "source": "user"
    },
    {
        "text": "It's probably the birthday of fake Elon Musk's favorite fish.",
        "source": "user"
    },
    {
        "text": "She enters the code and the door opens.",
        "source": "user"
    },
    {
        "text": "Christina sees the real Elon Musk, he is gaunt and pale.",
        "source": "user"
    },
    {
        "text": "He looks like he hasn't bathed in months.",
        "source": "user"
    },
    {
        "text": "\"What is going on, are you his twin?",
        "source": "api"
    },
    {
        "text": "\" She asks the real Elon Musk.",
        "source": "user"
    },
    {
        "text": "\"No, I'm the real Elon Musk.",
        "source": "user"
    },
    {
        "text": "That man is a shapeshifter or something, he stole my identity!",
        "source": "api"
    },
    {
        "text": "\"\n\nChristina gasps and calls the police.",
        "source": "user"
    },
    {
        "text": "Fake Elon Musk gets arrested and put in a medical research lab once it's revealed that he is a shapeshifter.",
        "source": "user"
    },
    {
        "text": "Real Elon Musk is saved and decides he loves Christina.",
        "source": "user"
    },
    {
        "text": "They get married and live happily ever after.",
        "source": "user"
    }
]