[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "She wonders why she can't make a long term connection even after trying with so many guys.",
        "source": "user"
    },
    {
        "text": "Each man seems different at first but after a while they all seem to show the same deep-seated character flaws that she despises.",
        "source": "user"
    },
    {
        "text": "She starts to think that all men are basically the same.",
        "source": "user"
    },
    {
        "text": "She's right.",
        "source": "user"
    },
    {
        "text": "At least she's right about all the men she's been dating, they are all the same.",
        "source": "user"
    },
    {
        "text": "She starts the think that maybe she should try dating women.",
        "source": "user"
    },
    {
        "text": "She experimented a bit with lesbian relationships in college, and they weren't that bad.",
        "source": "user"
    },
    {
        "text": "She wonders if she should try it again.",
        "source": "user"
    },
    {
        "text": "After awhile she decides to go for it.",
        "source": "user"
    },
    {
        "text": "After all these failed relationships with men perhaps she just can't get along with men at all, she thinks.",
        "source": "user"
    },
    {
        "text": "She starts dating local women.",
        "source": "user"
    },
    {
        "text": "When the shapeshifter sees this he realizes that he must know be a she.",
        "source": "user"
    },
    {
        "text": "The shapeshifter must turn into a women for his love interest to date in order to keep seeing her.",
        "source": "user"
    },
    {
        "text": "He decides to try to be a lesbian.",
        "source": "user"
    },
    {
        "text": "He knows so much about the woman and her habits that it isn't hard for him to get to know her in his new form and start a relationship with her.",
        "source": "user"
    },
    {
        "text": "The woman is happy to have found a new relationship with a woman.",
        "source": "user"
    },
    {
        "text": "As time goes by and the shapeshifter lives as a woman he learns a lot about what women have to go through in life.",
        "source": "user"
    },
    {
        "text": "He sees how often women are harassed and abused by men.",
        "source": "user"
    },
    {
        "text": "He feels bad about his dishonesty and tells the woman he loves the truth.",
        "source": "user"
    }
]