[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\"",
        "source": "api"
    },
    {
        "text": "Obama knew this day would come.",
        "source": "user"
    },
    {
        "text": "He knew he would be called back into action.",
        "source": "user"
    },
    {
        "text": "JFK had been preparing him for this day for years.",
        "source": "user"
    },
    {
        "text": "He knew that Obama would be the one to save the world.",
        "source": "user"
    },
    {
        "text": "It all begins with the note.",
        "source": "user"
    },
    {
        "text": "The note is the first step in a long journey.",
        "source": "user"
    },
    {
        "text": "He already had his bag packed, just in case.",
        "source": "user"
    },
    {
        "text": "He went and fetched his packed bag from the closet, where it had sat for the last 6 years.",
        "source": "user"
    },
    {
        "text": "He grabbed his phone and dialed the number on the note.",
        "source": "user"
    },
    {
        "text": "It rang 3 times, and then was answered by an automated service.",
        "source": "user"
    },
    {
        "text": "\"Please enter your code.\" Obama did exactly as he was instructed, and entered no code and said nothing while the phone waited for his response.",
        "source": "user"
    },
    {
        "text": "After a few seconds, the automated voice came back on the line.",
        "source": "user"
    },
    {
        "text": "\"Please re-enter your code.\" Obama did not respond, and the phone hung up on him.",
        "source": "user"
    },
    {
        "text": "He waited for a few moments, and then the phone rang.",
        "source": "user"
    },
    {
        "text": "\"Yes,\" he said in a low voice.",
        "source": "user"
    },
    {
        "text": "\"I'm here.\" said a voice on the line.",
        "source": "user"
    },
    {
        "text": "\"Back door.\" Obama hung up the phone and walked to the back door of his house.",
        "source": "user"
    },
    {
        "text": "There he could see JFK standing under the porch light in a trench coat, looking intense.",
        "source": "user"
    },
    {
        "text": "He opened the door and let JFK in.",
        "source": "user"
    },
    {
        "text": "\"Let's go.\" said JFK.",
        "source": "user"
    },
    {
        "text": "Obama grabbed his bag, and as instructed, threw his phone into the garbage with the browser open, allowing it to drain the battery faster.",
        "source": "user"
    },
    {
        "text": "\"What's going on?\" \"Not now. Let's just move.\" Obama and JFK walked out of the house and got into JFK's car.",
        "source": "user"
    },
    {
        "text": "JFK started the car and drove off.",
        "source": "user"
    },
    {
        "text": "JFK finally started to look a little relaxed.",
        "source": "user"
    },
    {
        "text": "\"So, you ready for this?\" Obama just waited for an explanation.",
        "source": "user"
    },
    {
        "text": "\"I know you've been waiting for this day for a long time. There's going to be a new white house. We need you to oversee operations there.\" \"What about the old white house?\" JFK paused for a moment, and then replied, \"We're going to need to blow that up.\" Obama was shocked.",
        "source": "user"
    },
    {
        "text": "\"Why?!\" \"Because it's a trap. Are you on board?\" \"Yes sir!\" shouted Obama.",
        "source": "user"
    }
]