[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "It is tragic that this power was discovered only after having such loss but this power is the only thing that will save the remaining people.",
        "source": "api"
    },
    {
        "text": "The power of Magic is the only hope for humanity, and will be key to its survival.",
        "source": "user"
    },
    {
        "text": "A leader of the people emerges.",
        "source": "api"
    },
    {
        "text": "She is someone who studied mana and knows that it can be manifested if everyone comes together.",
        "source": "user"
    },
    {
        "text": "She is someone who knows that the power has to be shared between humans and they have to protect it with their lives.",
        "source": "user"
    },
    {
        "text": "People are eager to listen to her and try to harness magic.",
        "source": "api"
    },
    {
        "text": "But there is a great threat to the world that must be defeated.",
        "source": "user"
    },
    {
        "text": "It is the humans versus aliens in a race against time.",
        "source": "api"
    },
    {
        "text": "The people decide the best magic to summons is a spell to freeze time.",
        "source": "user"
    },
    {
        "text": "That is the best way for them to avoid attack from the aliens while they find a way to defeat them.",
        "source": "user"
    },
    {
        "text": "They find the time spell in an ancient book and successfully cast it.",
        "source": "user"
    },
    {
        "text": "While the world is frozen, the aliens decide to leave because they think no one is around.",
        "source": "api"
    },
    {
        "text": "Mana saved the humans.",
        "source": "api"
    },
    {
        "text": "Now it is up to them to save mana.",
        "source": "user"
    }
]