[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.1497388276262333
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.  Things are unrecognizable. \n",
        "source": "user",
        "start_time": 59.0,
        "end_time": 76.0,
        "last_event_time": 76.0,
        "start_progress": 0.1497388276262333,
        "end_progress": 0.1665699361578642
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.  Things are unrecognizable. The United States is now a third world country, and the rest of the world is a utopia.\n",
        "source": "api",
        "start_time": 101.0,
        "end_time": 101.0,
        "last_event_time": 101.0,
        "start_progress": 0.1665699361578642,
        "end_progress": 0.21648287869994196
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.  Things are unrecognizable. The United States is now a third world country, and the rest of the world is a utopia.  Realizing their mistakes, all other nations have cooperated and helped each other.  It all began fifty years back, everyone thought America had been the destabilizing influence.\n",
        "source": "user",
        "start_time": 107.0,
        "end_time": 204.0,
        "last_event_time": 204.0,
        "start_progress": 0.21648287869994196,
        "end_progress": 0.3203714451538015
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.  Things are unrecognizable. The United States is now a third world country, and the rest of the world is a utopia.  Realizing their mistakes, all other nations have cooperated and helped each other.  It all began fifty years back, everyone thought America had been the destabilizing influence. \n\nThe United States has been in exile for 50 years.\n",
        "source": "api",
        "start_time": 230.0,
        "end_time": 230.0,
        "last_event_time": 230.0,
        "start_progress": 0.3203714451538015,
        "end_progress": 0.3505513639001741
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.  Things are unrecognizable. The United States is now a third world country, and the rest of the world is a utopia.  Realizing their mistakes, all other nations have cooperated and helped each other.  It all began fifty years back, everyone thought America had been the destabilizing influence. The United States has been in exile for 50 years.  A new revolution had occurred, Industrial, Digital and now this.  Peace has ruled the world, allow huge advances in technology.  Hunger and poverty have been eliminated, diseases successfully beaten back, equality established across the world. \n",
        "source": "user",
        "start_time": 233.0,
        "end_time": 439.0,
        "last_event_time": 439.0,
        "start_progress": 0.3505513639001741,
        "end_progress": 0.4921648287869994
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.  Things are unrecognizable. The United States is now a third world country, and the rest of the world is a utopia.  Realizing their mistakes, all other nations have cooperated and helped each other.  It all began fifty years back, everyone thought America had been the destabilizing influence. The United States has been in exile for 50 years.  A new revolution had occurred, Industrial, Digital and now this.  Peace has ruled the world, allow huge advances in technology.  Hunger and poverty have been eliminated, diseases successfully beaten back, equality established across the world.  The world is now a Utopia.\n",
        "source": "api",
        "start_time": 457.0,
        "end_time": 457.0,
        "last_event_time": 457.0,
        "start_progress": 0.4921648287869994,
        "end_progress": 0.5078351712130006
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.  Things are unrecognizable. The United States is now a third world country, and the rest of the world is a utopia.  Realizing their mistakes, all other nations have cooperated and helped each other.  It all began fifty years back, everyone thought America had been the destabilizing influence. The United States has been in exile for 50 years.  A new revolution had occurred, Industrial, Digital and now this.  Peace has ruled the world, allow huge advances in technology.  Hunger and poverty have been eliminated, diseases successfully beaten back, equality established across the world.  The world is now a Utopia, or as close as it has ever been.  Meanwhile, America has stood still, in its isolation \n",
        "source": "user",
        "start_time": 459.0,
        "end_time": 491.0,
        "last_event_time": 491.0,
        "start_progress": 0.5078351712130006,
        "end_progress": 0.558908879860708
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.  Things are unrecognizable. The United States is now a third world country, and the rest of the world is a utopia.  Realizing their mistakes, all other nations have cooperated and helped each other.  It all began fifty years back, everyone thought America had been the destabilizing influence. The United States has been in exile for 50 years.  A new revolution had occurred, Industrial, Digital and now this.  Peace has ruled the world, allow huge advances in technology.  Hunger and poverty have been eliminated, diseases successfully beaten back, equality established across the world.  The world is now a Utopia, or as close as it has ever been.  Meanwhile, America has stood still, in its isolation , while the rest of the world has moved on.\n",
        "source": "api",
        "start_time": 499.0,
        "end_time": 499.0,
        "last_event_time": 499.0,
        "start_progress": 0.558908879860708,
        "end_progress": 0.583865351131747
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.  Things are unrecognizable. The United States is now a third world country, and the rest of the world is a utopia.  Realizing their mistakes, all other nations have cooperated and helped each other.  It all began fifty years back, everyone thought America had been the destabilizing influence. The United States has been in exile for 50 years.  A new revolution had occurred, Industrial, Digital and now this.  Peace has ruled the world, allow huge advances in technology.  Hunger and poverty have been eliminated, diseases successfully beaten back, equality established across the world.  The world is now a Utopia, or as close as it has ever been.  Meanwhile, America has stood still, in its isolation, the rest of the world has moved on.  America is furious, how could it been seen as the one that was the cause of all the worlds ills, why should it be seen as the aggressor, \n",
        "source": "user",
        "start_time": 505.0,
        "end_time": 570.0,
        "last_event_time": 570.0,
        "start_progress": 0.583865351131747,
        "end_progress": 0.6604759141033082
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.  Things are unrecognizable. The United States is now a third world country, and the rest of the world is a utopia.  Realizing their mistakes, all other nations have cooperated and helped each other.  It all began fifty years back, everyone thought America had been the destabilizing influence. The United States has been in exile for 50 years.  A new revolution had occurred, Industrial, Digital and now this.  Peace has ruled the world, allow huge advances in technology.  Hunger and poverty have been eliminated, diseases successfully beaten back, equality established across the world.  The world is now a Utopia, or as close as it has ever been.  Meanwhile, America has stood still, in its isolation, the rest of the world has moved on.  America is furious, how could it been seen as the one that was the cause of all the worlds ills, why should it be seen as the aggressor, the one that caused all the problems.\n",
        "source": "api",
        "start_time": 581.0,
        "end_time": 581.0,
        "last_event_time": 581.0,
        "start_progress": 0.6604759141033082,
        "end_progress": 0.681950087057458
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.  Things are unrecognizable. The United States is now a third world country, and the rest of the world is a utopia.  Realizing their mistakes, all other nations have cooperated and helped each other.  It all began fifty years back, everyone thought America had been the destabilizing influence. The United States has been in exile for 50 years.  A new revolution had occurred, Industrial, Digital and now this.  Peace has ruled the world, allow huge advances in technology.  Hunger and poverty have been eliminated, diseases successfully beaten back, equality established across the world.  The world is now a Utopia, or as close as it has ever been.  Meanwhile, America has stood still, in its isolation, the rest of the world has moved on.  America is furious, how could it been seen as the one that was the cause of all the worlds ills, why should it be seen as the aggressor, the one that caused all the problems.  America is now the only country in the world that is not part of the Utopia, and it is determined to change that.\n",
        "source": "api",
        "start_time": 602.0,
        "end_time": 602.0,
        "last_event_time": 602.0,
        "start_progress": 0.681950087057458,
        "end_progress": 0.7486941381311666
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.  Things are unrecognizable. The United States is now a third world country, and the rest of the world is a utopia.  Realizing their mistakes, all other nations have cooperated and helped each other.  It all began fifty years back, everyone thought America had been the destabilizing influence. The United States has been in exile for 50 years.  A new revolution had occurred, Industrial, Digital and now this.  Peace has ruled the world, allow huge advances in technology.  Hunger and poverty have been eliminated, diseases successfully beaten back, equality established across the world.  The world is now a Utopia, or as close as it has ever been.  Meanwhile, America has stood still, in its isolation, the rest of the world has moved on.  America is furious, how could it been seen as the one that was the cause of all the worlds ills, why should it be seen as the aggressor, the one that caused all the problems.  America is now the only country in the world that is not part of the Utopia, and it is determined to change that. America needs to show it deserves respect, \n",
        "source": "user",
        "start_time": 616.0,
        "end_time": 633.0,
        "last_event_time": 633.0,
        "start_progress": 0.7486941381311666,
        "end_progress": 0.7742309924550204
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.  Things are unrecognizable. The United States is now a third world country, and the rest of the world is a utopia.  Realizing their mistakes, all other nations have cooperated and helped each other.  It all began fifty years back, everyone thought America had been the destabilizing influence. The United States has been in exile for 50 years.  A new revolution had occurred, Industrial, Digital and now this.  Peace has ruled the world, allow huge advances in technology.  Hunger and poverty have been eliminated, diseases successfully beaten back, equality established across the world.  The world is now a Utopia, or as close as it has ever been.  Meanwhile, America has stood still, in its isolation, the rest of the world has moved on.  America is furious, how could it been seen as the one that was the cause of all the worlds ills, why should it be seen as the aggressor, the one that caused all the problems.  America is now the only country in the world that is not part of the Utopia, and it is determined to change that. America needs to show it deserves respect, and the only way it can do that is by showing the world that it is the only country in the world that is capable of creating a utopia\n",
        "source": "api",
        "start_time": 660.0,
        "end_time": 660.0,
        "last_event_time": 660.0,
        "start_progress": 0.7742309924550204,
        "end_progress": 0.8514219384793964
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.  Things are unrecognizable. The United States is now a third world country, and the rest of the world is a utopia.  Realizing their mistakes, all other nations have cooperated and helped each other.  It all began fifty years back, everyone thought America had been the destabilizing influence. The United States has been in exile for 50 years.  A new revolution had occurred, Industrial, Digital and now this.  Peace has ruled the world, allow huge advances in technology.  Hunger and poverty have been eliminated, diseases successfully beaten back, equality established across the world.  The world is now a Utopia, or as close as it has ever been.  Meanwhile, America has stood still, in its isolation, the rest of the world has moved on.  America is furious, how could it been seen as the one that was the cause of all the worlds ills, why should it be seen as the aggressor, the one that caused all the problems.  America is now the only country in the world that is not part of the Utopia, and it is determined to change that.  America needs to show it deserves respect, and the only way it can do that is by showing the world that it is the only country in the world that is capable of creating a utopia.  But first, it needs to rid the world of this current version, America will show the world, real peace, equality, harmony, \n",
        "source": "user",
        "start_time": 662.0,
        "end_time": 722.0,
        "last_event_time": 722.0,
        "start_progress": 0.8514219384793964,
        "end_progress": 0.9245502031340684
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.  Things are unrecognizable. The United States is now a third world country, and the rest of the world is a utopia.  Realizing their mistakes, all other nations have cooperated and helped each other.  It all began fifty years back, everyone thought America had been the destabilizing influence. The United States has been in exile for 50 years.  A new revolution had occurred, Industrial, Digital and now this.  Peace has ruled the world, allow huge advances in technology.  Hunger and poverty have been eliminated, diseases successfully beaten back, equality established across the world.  The world is now a Utopia, or as close as it has ever been.  Meanwhile, America has stood still, in its isolation, the rest of the world has moved on.  America is furious, how could it been seen as the one that was the cause of all the worlds ills, why should it be seen as the aggressor, the one that caused all the problems.  America is now the only country in the world that is not part of the Utopia, and it is determined to change that.  America needs to show it deserves respect, and the only way it can do that is by showing the world that it is the only country in the world that is capable of creating a utopia.  But first, it needs to rid the world of this current version, America will show the world, real peace, equality, harmony, and prosperity.\n",
        "source": "api",
        "start_time": 730.0,
        "end_time": 730.0,
        "last_event_time": 730.0,
        "start_progress": 0.9245502031340684,
        "end_progress": 0.9332559489262914
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.  Things are unrecognizable. The United States is now a third world country, and the rest of the world is a utopia.  Realizing their mistakes, all other nations have cooperated and helped each other.  It all began fifty years back, everyone thought America had been the destabilizing influence. The United States has been in exile for 50 years.  A new revolution had occurred, Industrial, Digital and now this.  Peace has ruled the world, allow huge advances in technology.  Hunger and poverty have been eliminated, diseases successfully beaten back, equality established across the world.  The world is now a Utopia, or as close as it has ever been.  Meanwhile, America has stood still, in its isolation, the rest of the world has moved on.  America is furious, how could it been seen as the one that was the cause of all the worlds ills, why should it be seen as the aggressor, the one that caused all the problems.  America is now the only country in the world that is not part of the Utopia, and it is determined to change that.  America needs to show it deserves respect, and the only way it can do that is by showing the world that it is the only country in the world that is capable of creating a utopia.  But first, it needs to rid the world of this current version, America will show the world, real peace, equality, harmony, freedom and prosperity.  America decides to go to war with the world, then they can be the ones to bring heaven on earth.  Attack!\n",
        "source": "user",
        "start_time": 734.0,
        "end_time": 806.0,
        "last_event_time": 806.0,
        "start_progress": 0.9332559489262914,
        "end_progress": 1.0
    }
]