[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "The elderly had their time in Washington protesting for around a year.",
        "source": "api"
    },
    {
        "text": "They were met with violence and were eventually forced to leave the capital.",
        "source": "api"
    },
    {
        "text": "Not that they wanted to be there in the first place.",
        "source": "api"
    },
    {
        "text": "The drug that was affecting people at over 85 has a one side effect, well, despite the fact that they would be immortal looking how they look at the age of 85 and not at the age of 28.",
        "source": "user"
    },
    {
        "text": "The side effect is this: If you're over 85 years old, you will turn into a zombie.",
        "source": "user"
    },
    {
        "text": "And worse, all the elderly who took the drug have now turned into zombies and infecting people they bite.",
        "source": "api"
    },
    {
        "text": "The protesters have a safe haven in Washington, where no reported zombies in the area.",
        "source": "user"
    },
    {
        "text": "It was too late though.",
        "source": "user"
    },
    {
        "text": "More than half of the population of the United States have turned into zombies.",
        "source": "user"
    },
    {
        "text": "Only parts of the Northeast are safe.",
        "source": "api"
    },
    {
        "text": "The government seem to have given up on the fight and are just trying to keep the remaining population alive.",
        "source": "user"
    },
    {
        "text": "Even if the young and the powerful are now immortal, they are still susceptible to the zombies.",
        "source": "api"
    },
    {
        "text": "One of the scientists who created the drug is trying to find a cure.",
        "source": "user"
    },
    {
        "text": "The year is now 2029.",
        "source": "api"
    },
    {
        "text": "Just around a decade ago humanity had a similar pandemic, but this time it's worse.",
        "source": "user"
    },
    {
        "text": "The zombies are now immune to all weapons and are even more dangerous.",
        "source": "api"
    },
    {
        "text": "They are mindless, but they are still able to communicate with each other.",
        "source": "api"
    },
    {
        "text": "After all, they are still human.",
        "source": "api"
    },
    {
        "text": "The zombies are now more organized and have formed a sort of army.",
        "source": "user"
    },
    {
        "text": "The last hope for humanity is a group of people who are immune to the zombie virus.",
        "source": "api"
    },
    {
        "text": "And they are the 85 year olds that did not take the drug.",
        "source": "api"
    },
    {
        "text": "Their blood turns back the zombies into their human form.",
        "source": "user"
    },
    {
        "text": "But it is a long fight, and we are still fighting.",
        "source": "user"
    },
    {
        "text": "Day 329.",
        "source": "user"
    },
    {
        "text": "We're going to get through this.",
        "source": "user"
    }
]