[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.\"",
        "source": "api"
    },
    {
        "text": "The 92nd pig, also known as 'Arthur' replied from behind his asbestos suit \"You can huff and puff all you want and you will probably end up with radiation poisoning!\"",
        "source": "user"
    },
    {
        "text": "The wolf, being a wolf, was not so easily dissuaded.",
        "source": "api"
    },
    {
        "text": "He left for a bit, but before long he was back with an army of cockroaches.",
        "source": "user"
    },
    {
        "text": "The wolf was well read and knew that radiation does not effect cockroaches, so he called in a favor with a roach wrangler friend of his to lend him a couple of thousand.",
        "source": "user"
    },
    {
        "text": "The wolf watched with glee as the roach patrol stormed Arthur's house covering the windows and door and crawling between the cracks.",
        "source": "user"
    },
    {
        "text": "The roaches were on him in a flash and Arthur was soon covered in roaches.",
        "source": "user"
    },
    {
        "text": "It was only a matter of time, now.",
        "source": "user"
    },
    {
        "text": "The screams were muffled at first because of Arthur's protective suit, then they got louder as he removed the helmet to let the roaches that had crawled into the suit out.",
        "source": "user"
    },
    {
        "text": "Unfortunately, this gave the roaches even more of an opening.",
        "source": "user"
    },
    {
        "text": "Terrified and repulsed, Arthur bolted for the door and shouldered his way through it.",
        "source": "user"
    },
    {
        "text": "He was half in and half out of his protective suit now and was rolling on the ground trying to get the roaches off of him.",
        "source": "user"
    },
    {
        "text": "The wolf could hardly contain his laughter.",
        "source": "user"
    },
    {
        "text": "Arthur was a complete mess.",
        "source": "user"
    },
    {
        "text": "He finally got the last of the roaches off of him and the wolf came over and gathered the roaches up using the attractant that his wrangler friend gave him.",
        "source": "user"
    },
    {
        "text": "He looked over at Arthur and winked.",
        "source": "user"
    },
    {
        "text": "\"You thought you had me beat didn't you, pig?\" Arthur just looked at him and said \"You're going to pay for this.\"",
        "source": "user"
    },
    {
        "text": "\"Not until you pay up first! Give me my winnings!\"",
        "source": "user"
    },
    {
        "text": "Arthur let out a short grunt and handed over the fifty dollars that the wolf won in the bet.",
        "source": "user"
    },
    {
        "text": "\"Thank you kindly\" the wolf said boastfully as he put the money into his shirt pocket.",
        "source": "user"
    },
    {
        "text": "Don't worry little pig, your brothers all lost their bets, too except for pig number 73.",
        "source": "user"
    },
    {
        "text": "He made his house out of duct tape and I am still trying to figure out how to get into it!\"",
        "source": "user"
    },
    {
        "text": "\" \"So long, number 92!\" The wolf said as he sauntered off to see if he could find pig number 93 and win yet another bet.",
        "source": "user"
    }
]