[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call the number and are greeted by a man with a thick Russian accent.",
        "source": "api"
    },
    {
        "text": "He is very secretive about what is to come next.",
        "source": "user"
    },
    {
        "text": "He asks you to meet him at a local coffee shop.",
        "source": "user"
    },
    {
        "text": "You arrive at the coffee shop and are greeted by a man who looks like he's been on the wrong side of a few too many bar fights.",
        "source": "user"
    },
    {
        "text": "You take a seat beside him and order a coffee.",
        "source": "user"
    },
    {
        "text": "The man looks you up and down.",
        "source": "user"
    },
    {
        "text": "\"So this is the great President of the Americas.\" said the Russian.",
        "source": "user"
    },
    {
        "text": "\"I was, yes. I'm no longer the President. What is this about?\" asked Obama.",
        "source": "user"
    },
    {
        "text": "\"JFK needs your help.\" said the Russian.",
        "source": "user"
    },
    {
        "text": "\"What kind of help?\" asked Obama.",
        "source": "user"
    },
    {
        "text": "He felt odd saying this considering JFK was supposed to be dead.",
        "source": "user"
    },
    {
        "text": "\"He needs you to be the President again.\" said the Russian.",
        "source": "user"
    },
    {
        "text": "\"I can't be President again in the US.\" said Obama.",
        "source": "user"
    },
    {
        "text": "\"No, in Russia. JFK has been secretly running things there for decades. He needs you to take over for Putin.\" said the Russian.",
        "source": "user"
    },
    {
        "text": "Obama is baffled but very curious.",
        "source": "user"
    },
    {
        "text": "He agrees to take the job.",
        "source": "user"
    },
    {
        "text": "What else is there to do?",
        "source": "user"
    },
    {
        "text": "Being retired is kind of boring.",
        "source": "user"
    },
    {
        "text": "He is whisked off to Russia to meet with JFK.",
        "source": "user"
    },
    {
        "text": "He is brought into an old warehouse and is shocked to find that JFK is a cyborg.",
        "source": "user"
    },
    {
        "text": "He looks great for his age though.",
        "source": "user"
    },
    {
        "text": "\"Welcome to the team Barack.\" said JFK.",
        "source": "user"
    },
    {
        "text": "Obama then shakes his firm, robotic hand.",
        "source": "user"
    },
    {
        "text": "\"So how do I become President? Putin will not step down.\"",
        "source": "user"
    },
    {
        "text": "JFK then leads Obama into a lab at the back of the warehouse.",
        "source": "user"
    },
    {
        "text": "There is a large machine with lots of blades and syringes that is designed for someone to stand in.",
        "source": "user"
    },
    {
        "text": "\"We will make you look like Putin, then the country is yours\" said JFK.",
        "source": "user"
    },
    {
        "text": "\"It's better than just golfing, right?\" said Obama.",
        "source": "user"
    },
    {
        "text": "He steps into the machine which closes around him.",
        "source": "user"
    },
    {
        "text": "It begins to change his appearance to make him look like Putin.",
        "source": "user"
    },
    {
        "text": "This is the start of his new Presidency.",
        "source": "user"
    }
]