[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "I love my dad, but I know he has his flaws.",
        "source": "user"
    },
    {
        "text": "He hasn't been the best dad in the world.",
        "source": "user"
    },
    {
        "text": "You will have a hard time getting him to believe that.",
        "source": "user"
    },
    {
        "text": "When all the \"#1 Dad\" mugs started to change, I rushed over to my dad's house to see where he ranked.",
        "source": "user"
    },
    {
        "text": "At first, he thought I was playing a trick on him.",
        "source": "user"
    },
    {
        "text": "He thought I replaced his old mug with a new mug.",
        "source": "user"
    },
    {
        "text": "When I took a look at the mug, I had to let out a laugh.",
        "source": "user"
    },
    {
        "text": "I saw one phrase: \"#1,599,345,345 Dad\".",
        "source": "user"
    },
    {
        "text": "My dad was around the 1.",
        "source": "user"
    },
    {
        "text": "6 billionth best dad in the world.",
        "source": "api"
    },
    {
        "text": "Considering there are billions of people in the world, that number is actually better than thought.",
        "source": "user"
    },
    {
        "text": "It still is a long way from #1 though.",
        "source": "user"
    },
    {
        "text": "This did make me think that maybe I was too hard on my father for how he raised me.",
        "source": "user"
    },
    {
        "text": "We all make mistakes.",
        "source": "user"
    },
    {
        "text": "Especially, when we are younger and just trying to make it through the world like my dad.",
        "source": "user"
    },
    {
        "text": "I know that he loves me and that he was always trying his best.",
        "source": "user"
    },
    {
        "text": "I chose not to let me dad know that the number on the mug was a true ranking.",
        "source": "user"
    },
    {
        "text": "I know that my dad will never be the best dad in the world, but he is the best dad for me.",
        "source": "user"
    },
    {
        "text": "I think enjoying my time with him while he is here on this earth is better at nitpicking on how he didn't measure up to other people's parents.",
        "source": "user"
    },
    {
        "text": "I decided to take my dad out to eat and celebrate.",
        "source": "user"
    },
    {
        "text": "I wanted to show him that I loved him and that I was proud of him.",
        "source": "user"
    },
    {
        "text": "Also, it is not everyday that I get to eat out with the \"#1,599,345,345 Dad\" in the world.",
        "source": "user"
    }
]