[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "I am psyched to learn more about my next life.",
        "source": "api"
    },
    {
        "text": "All these people around me that look like me is suspicious.",
        "source": "user"
    },
    {
        "text": "I never get reincarnated in the same form.",
        "source": "user"
    },
    {
        "text": "And so, the film begins with a scene of a man in a car, driving through a forest.",
        "source": "user"
    },
    {
        "text": "\"Well that is just great\" I say aloud.",
        "source": "api"
    },
    {
        "text": "\"I am a man in a car - not thanks.",
        "source": "user"
    },
    {
        "text": "In a forest, yes please\" I say to no one in particular.",
        "source": "user"
    },
    {
        "text": "This looks and feels more like a dream than reality.",
        "source": "user"
    },
    {
        "text": "Nothing like making your own paths through the density of the forest, apparently having no idea where you are going.",
        "source": "user"
    },
    {
        "text": "The man in care, lo and behold, drives into a clearing with a small cottage on the far side.",
        "source": "user"
    },
    {
        "text": "A small child appears from the side of the cottage, singing and skipping to Mark Knopfler's guitar.",
        "source": "user"
    },
    {
        "text": "The man in the car gets out and walks towards the child.",
        "source": "user"
    },
    {
        "text": "\"Hi Uncle Mark\" the child yells excited.",
        "source": "api"
    },
    {
        "text": "Uncle Mark?",
        "source": "user"
    },
    {
        "text": "It's none other than The Mark Knopfler.",
        "source": "user"
    },
    {
        "text": "\"You know, I have been thinking about you a lot lately\" Mark says.",
        "source": "user"
    },
    {
        "text": "Mark and the child walk into the cottage with a quaint kitchen and stew simmering on the stove.",
        "source": "api"
    },
    {
        "text": "\"Where is your dad?",
        "source": "user"
    },
    {
        "text": "\" Mark asks.",
        "source": "user"
    },
    {
        "text": "\"He is in the other room, playing with his guitar\" the child says.",
        "source": "user"
    },
    {
        "text": "Mark was intrigued, being that there were no musical notes in the air.",
        "source": "api"
    },
    {
        "text": "\"Hey Chester, guess who?",
        "source": "user"
    },
    {
        "text": "\" Mark shouts.",
        "source": "user"
    },
    {
        "text": "Still, no sound.",
        "source": "user"
    },
    {
        "text": "Mark walks in to find his brother toppled over and perfectly still.",
        "source": "user"
    },
    {
        "text": "Mark checks for a pulse.",
        "source": "user"
    },
    {
        "text": "\"He is dead\" Mark says.",
        "source": "user"
    },
    {
        "text": "The child begins to cry.",
        "source": "user"
    },
    {
        "text": "I sure hope this gets better from here.",
        "source": "api"
    },
    {
        "text": "I think I am Mark in my next life, so with my music I will deal with anything.",
        "source": "user"
    },
    {
        "text": "The film stops, leaving all of us wondering, \"What next?",
        "source": "user"
    },
    {
        "text": "\"\n",
        "source": "user"
    }
]