[
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\"\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.1640396964389959
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" \n",
        "source": "user",
        "start_time": 43.0,
        "end_time": 47.0,
        "last_event_time": 47.0,
        "start_progress": 0.1640396964389959,
        "end_progress": 0.16695855224751896
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" \n\nWhat do you do?\n",
        "source": "api",
        "start_time": 60.0,
        "end_time": 60.0,
        "last_event_time": 60.0,
        "start_progress": 0.16695855224751896,
        "end_progress": 0.17688266199649738
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" What do you do? \n",
        "source": "user",
        "start_time": 64.0,
        "end_time": 92.0,
        "last_event_time": 92.0,
        "start_progress": 0.17688266199649738,
        "end_progress": 0.17688266199649738
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" What do you do? \n\nI'd be a little confused, but I'd probably call the number.\n",
        "source": "api",
        "start_time": 103.0,
        "end_time": 103.0,
        "last_event_time": 103.0,
        "start_progress": 0.17688266199649738,
        "end_progress": 0.2124927028604787
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. \n",
        "source": "user",
        "start_time": 109.0,
        "end_time": 132.0,
        "last_event_time": 132.0,
        "start_progress": 0.2124927028604787,
        "end_progress": 0.20548744892002335
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered.\n",
        "source": "api",
        "start_time": 137.0,
        "end_time": 137.0,
        "last_event_time": 137.0,
        "start_progress": 0.20548744892002335,
        "end_progress": 0.22650321074138938
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. \n",
        "source": "user",
        "start_time": 138.0,
        "end_time": 241.0,
        "last_event_time": 241.0,
        "start_progress": 0.22650321074138938,
        "end_progress": 0.29597197898423816
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem.\n",
        "source": "api",
        "start_time": 266.0,
        "end_time": 266.0,
        "last_event_time": 266.0,
        "start_progress": 0.29597197898423816,
        "end_progress": 0.34384121424401637
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" \n",
        "source": "user",
        "start_time": 276.0,
        "end_time": 291.0,
        "last_event_time": 291.0,
        "start_progress": 0.34384121424401637,
        "end_progress": 0.3812025685931115
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired.\n",
        "source": "api",
        "start_time": 298.0,
        "end_time": 298.0,
        "last_event_time": 298.0,
        "start_progress": 0.3812025685931115,
        "end_progress": 0.4080560420315236
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \n",
        "source": "user",
        "start_time": 301.0,
        "end_time": 343.0,
        "last_event_time": 343.0,
        "start_progress": 0.4080560420315236,
        "end_progress": 0.45884413309982486
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \"I'm dead, but I'm still working.\n",
        "source": "api",
        "start_time": 355.0,
        "end_time": 355.0,
        "last_event_time": 355.0,
        "start_progress": 0.45884413309982486,
        "end_progress": 0.47810858143607704
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \"I'm dead, but I'm still working.\" \"I'm not sure I understand,\" Barack said.\n",
        "source": "api",
        "start_time": 379.0,
        "end_time": 379.0,
        "last_event_time": 379.0,
        "start_progress": 0.47810858143607704,
        "end_progress": 0.5032107413893754
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \"I'm dead, but I'm still working.\" \"I'm not sure I understand,\" Barack said. \"Well, let me put it this way,\" JFK said.\n",
        "source": "api",
        "start_time": 386.0,
        "end_time": 386.0,
        "last_event_time": 386.0,
        "start_progress": 0.5032107413893754,
        "end_progress": 0.527729130180969
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \"I'm dead, but I'm still working.\" \"I'm not sure I understand,\" Barack said. \"Well, let me put it this way,\" JFK said. \"If you don't help me, the United States will be destroyed in 4 years.\"\n",
        "source": "api",
        "start_time": 398.0,
        "end_time": 398.0,
        "last_event_time": 398.0,
        "start_progress": 0.527729130180969,
        "end_progress": 0.5697606538237011
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \"I'm dead, but I'm still working.\" \"I'm not sure I understand,\" Barack said. \"Well, let me put it this way,\" JFK said. \"If you don't help me, the United States will be destroyed in 4 years.\" Barack thought about it for a few minutes, and then asked, \"How can I help?\"\n",
        "source": "api",
        "start_time": 416.0,
        "end_time": 416.0,
        "last_event_time": 416.0,
        "start_progress": 0.5697606538237011,
        "end_progress": 0.6147110332749562
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \"I'm dead, but I'm still working.\" \"I'm not sure I understand,\" Barack said. \"Well, let me put it this way,\" JFK said. \"If you don't help me, the United States will be destroyed in 4 years.\" Barack was shocked and thought about it for a few minutes, and then asked, \"How can I help?\" \n",
        "source": "user",
        "start_time": 420.0,
        "end_time": 432.0,
        "last_event_time": 432.0,
        "start_progress": 0.6147110332749562,
        "end_progress": 0.6246351430239346
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \"I'm dead, but I'm still working.\" \"I'm not sure I understand,\" Barack said. \"Well, let me put it this way,\" JFK said. \"If you don't help me, the United States will be destroyed in 4 years.\" Barack was shocked and thought about it for a few minutes, and then asked, \"How can I help?\" JFK said, \"I need you to go back to the White House and tell the president that there's a bomb in the basement.\"\n",
        "source": "api",
        "start_time": 462.0,
        "end_time": 462.0,
        "last_event_time": 462.0,
        "start_progress": 0.6246351430239346,
        "end_progress": 0.6900175131348512
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \"I'm dead, but I'm still working.\" \"I'm not sure I understand,\" Barack said. \"Well, let me put it this way,\" JFK said. \"If you don't help me, the United States will be destroyed in 4 years.\" Barack was shocked and thought about it for a few minutes, and then asked, \"How can I help?\" JFK said, \"I need you to go back to the White House and tell the president that there's a bomb in the basement.\" Barack said, \"What?\"\n",
        "source": "api",
        "start_time": 491.0,
        "end_time": 491.0,
        "last_event_time": 491.0,
        "start_progress": 0.6900175131348512,
        "end_progress": 0.702276707530648
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \"I'm dead, but I'm still working.\" \"I'm not sure I understand,\" Barack said. \"Well, let me put it this way,\" JFK said. \"If you don't help me, the United States will be destroyed in 4 years.\" Barack was shocked and thought about it for a few minutes, and then asked, \"How can I help?\" JFK said, \"I need you to go back to the White House and tell the president that there's a bomb in the basement.\" Barack said, \"What?\" \"A bomb in the basement,\" JFK repeated.\n",
        "source": "api",
        "start_time": 509.0,
        "end_time": 509.0,
        "last_event_time": 509.0,
        "start_progress": 0.702276707530648,
        "end_progress": 0.7256275539988325
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \"I'm dead, but I'm still working.\" \"I'm not sure I understand,\" Barack said. \"Well, let me put it this way,\" JFK said. \"If you don't help me, the United States will be destroyed in 4 years.\" Barack was shocked and thought about it for a few minutes, and then asked, \"How can I help?\" JFK said, \"I need you to go back to the White House and tell the president that there's a bomb in the basement.\" Barack said, \"What?\" \"A bomb in the basement,\" JFK repeated. \"And you need to tell him that if he doesn't move the bomb to the middle of the Oval Office, the United States will be destroyed in\n",
        "source": "api",
        "start_time": 530.0,
        "end_time": 530.0,
        "last_event_time": 530.0,
        "start_progress": 0.7256275539988325,
        "end_progress": 0.8026853473438412
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \"I'm dead, but I'm still working.\" \"I'm not sure I understand,\" Barack said. \"Well, let me put it this way,\" JFK said. \"If you don't help me, the United States will be destroyed in 4 years.\" Barack was shocked and thought about it for a few minutes, and then asked, \"How can I help?\" JFK said, \"I need you to go back to the White House and tell the president that there's a bomb in the basement.\" Barack said, \"What?\" \"A bomb in the basement,\" JFK repeated. \"And you need to tell him that if he doesn't move the bomb to the middle of the Oval Office, the United States will be destroyed in 4 days. \n",
        "source": "user",
        "start_time": 542.0,
        "end_time": 545.0,
        "last_event_time": 545.0,
        "start_progress": 0.8026853473438412,
        "end_progress": 0.8079392877991827
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \"I'm dead, but I'm still working.\" \"I'm not sure I understand,\" Barack said. \"Well, let me put it this way,\" JFK said. \"If you don't help me, the United States will be destroyed in 4 years.\" Barack was shocked and thought about it for a few minutes, and then asked, \"How can I help?\" JFK said, \"I need you to go back to the White House and tell the president that there's a bomb in the basement.\" Barack said, \"What?\" \"A bomb in the basement,\" JFK repeated. \"And you need to tell him that if he doesn't move the bomb to the middle of the Oval Office, the United States will be destroyed in 4 days. \" Barack said, \"JFK, I'm not sure I understand.\n",
        "source": "api",
        "start_time": 560.0,
        "end_time": 560.0,
        "last_event_time": 560.0,
        "start_progress": 0.8079392877991827,
        "end_progress": 0.8353765323992994
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \"I'm dead, but I'm still working.\" \"I'm not sure I understand,\" Barack said. \"Well, let me put it this way,\" JFK said. \"If you don't help me, the United States will be destroyed in 4 years.\" Barack was shocked and thought about it for a few minutes, and then asked, \"How can I help?\" JFK said, \"I need you to go back to the White House and tell the president that there's a bomb in the basement.\" Barack said, \"What?\" \"A bomb in the basement,\" JFK repeated. \"And you need to tell him that if he doesn't move the bomb to the middle of the Oval Office, the United States will be destroyed in 4 days. \" Barack said, \"JFK, I'm not sure I understand. Why do you need me to tell him that?\"\n",
        "source": "api",
        "start_time": 598.0,
        "end_time": 598.0,
        "last_event_time": 598.0,
        "start_progress": 0.8353765323992994,
        "end_progress": 0.8575598365440747
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \"I'm dead, but I'm still working.\" \"I'm not sure I understand,\" Barack said. \"Well, let me put it this way,\" JFK said. \"If you don't help me, the United States will be destroyed in 4 years.\" Barack was shocked and thought about it for a few minutes, and then asked, \"How can I help?\" JFK said, \"I need you to go back to the White House and tell the president that there's a bomb in the basement.\" Barack said, \"What?\" \"A bomb in the basement,\" JFK repeated. \"And you need to tell him that if he doesn't move the bomb to the middle of the Oval Office, the United States will be destroyed in 4 days. \" Barack said, \"JFK, I'm not sure I understand. Why do you need me to tell him directly?\" \n",
        "source": "user",
        "start_time": 609.0,
        "end_time": 615.0,
        "last_event_time": 615.0,
        "start_progress": 0.8575598365440747,
        "end_progress": 0.8604786923525978
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. After a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then clarified with JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \"I'm dead, but I'm still working.\" \"I'm not sure I understand,\" Barack said. \"Well, let me put it this way,\" JFK said. \"If you don't help me, the United States will be destroyed in 4 years.\" Barack was shocked and thought about it for a few minutes, and then asked, \"How can I help?\" JFK said, \"I need you to go back to the White House and tell the president that there's a bomb in the basement.\" Barack said, \"What?\" \"A bomb in the basement,\" JFK repeated. \"And you need to tell him that if he doesn't move the bomb to the middle of the Oval Office, the United States will be destroyed in 4 days. \" Barack said, \"JFK, I'm not sure I understand. Why do you need me to tell him directly?\" JFK said, \"Barack, you're the only one who can get the president to listen to me.\"\n",
        "source": "api",
        "start_time": 654.0,
        "end_time": 654.0,
        "last_event_time": 654.0,
        "start_progress": 0.8604786923525978,
        "end_progress": 0.9083479276123759
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you are awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax. Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" Barack was a little confused, but he decided to call the number. \n\nAfter a few rings, a voice answered. Barack said, \"May I speak to JFK?\" The man answered \"Speaking.\" Barack then asked JFK what the letter meant. JFK said, \"Barack, I need you to go to the White House and help me with a problem. This problem is important to the future of the United States.\" Barack said, \"I'm sorry, JFK, but I'm retired. \"Retired?\" JFK exclaimed. \"There is no such thing as retired!\" JFK further commented. \"I'm dead, but I'm still working.\" \"I'm not sure if I understand,\" Barack said. \"Well, let me put it this way,\" JFK said. \"If you don't help me, the United States will be destroyed in 4 days.\" Barack was shocked and thought about it for a few minutes, and then asked, \"How can I help?\" JFK said, \"I need you to go back to the White House and tell the president that there's a bomb in the basement.\" Barack said, \"What?\" \"A bomb in the basement,\" JFK repeated. \"And you need to tell him that if he doesn't move the bomb to the middle of the Oval Office, the United States will be destroyed in 4 days. \" Barack said, \"JFK, I'm not sure if I understand. Why do you need me to tell him that?\" JFK said, \"Barack, you're the only one who can get the president to listen to you.\" \n\nSuddenly Barack heard rains pouring outside and he realized that he just woke up from a dream. But he was still worried if there was a bomb in the White House.\n",
        "source": "user",
        "start_time": 660.0,
        "end_time": 946.0,
        "last_event_time": 946.0,
        "start_progress": 0.9083479276123759,
        "end_progress": 1.0
    }
]