[
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.18290258449304175
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,  I prefer reading to listening to audiobooks. I think that using audiobook is more expensive than reading a book.\n",
        "source": "user",
        "start_time": 12.0,
        "end_time": 83.0,
        "last_event_time": 83.0,
        "start_progress": 0.18290258449304175,
        "end_progress": 0.2584493041749503
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,  I prefer reading to listening to audiobooks. I think that using audiobook is more expensive than reading a book. Audiobooks are sold and most of them have more expensive prices than I imagined.\n",
        "source": "api",
        "start_time": 114.0,
        "end_time": 114.0,
        "last_event_time": 114.0,
        "start_progress": 0.2584493041749503,
        "end_progress": 0.3121272365805169
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,  I prefer reading to listening to audiobooks. I think that using audiobook is more expensive than reading a book. Audiobooks are sold and most of them have more expensive prices than I imagined. If I just spend my time reading a book instead of listening to an audiobook, I can save money.\n",
        "source": "api",
        "start_time": 143.0,
        "end_time": 143.0,
        "last_event_time": 143.0,
        "start_progress": 0.3121272365805169,
        "end_progress": 0.3750828363154407
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,  I prefer reading to listening to audiobooks. I think that using audiobook is more expensive than reading a book. You need to buy the audiobook reader such as kindle.  Audiobooks are sold and most of them have more expensive prices than I imagined.  If I just spend my time reading a book instead of listening to an audiobook, I can save money. \n",
        "source": "user",
        "start_time": 168.0,
        "end_time": 341.0,
        "last_event_time": 341.0,
        "start_progress": 0.3750828363154407,
        "end_progress": 0.41219350563286944
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,  I prefer reading to listening to audiobooks. I think that using audiobook is more expensive than reading a book. You need to buy the audiobook reader such as kindle.  Audiobooks are sold and most of them have more expensive prices than I imagined.  If I just spend my time reading a book instead of listening to an audiobook, I can save money.  I think that reading is cheap and convenient way.\n",
        "source": "api",
        "start_time": 345.0,
        "end_time": 345.0,
        "last_event_time": 345.0,
        "start_progress": 0.41219350563286944,
        "end_progress": 0.44532803180914515
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,  I prefer reading to listening to audiobooks. I think that using audiobook is more expensive than reading a book. You need to buy the audiobook reader such as kindle.  Audiobooks are sold and most of them have more expensive prices than I imagined.  If I just spend my time reading a book instead of listening to an audiobook, I can save money.  I think that reading is cheap and convenient way.  To use audiobooks is an easy way but it can be complicated and expensive.\n",
        "source": "api",
        "start_time": 366.0,
        "end_time": 366.0,
        "last_event_time": 366.0,
        "start_progress": 0.44532803180914515,
        "end_progress": 0.49502982107355864
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,  I prefer reading to listening to audiobooks. I think that using audiobook is more expensive than reading a book. You need to buy the audiobook reader such as kindle.  Audiobooks are sold and most of them have more expensive prices than I imagined.  If I just spend my time reading a book instead of listening to an audiobook, I can save money.  I think that reading is cheap and convenient way.  To use audiobooks is an easy way but it can be complicated and expensive. Also, reading is natural way and you can enjoy it.\n",
        "source": "api",
        "start_time": 385.0,
        "end_time": 385.0,
        "last_event_time": 385.0,
        "start_progress": 0.49502982107355864,
        "end_progress": 0.5288270377733598
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,  I prefer reading to listening to audiobooks. I think that using audiobook is more expensive than reading a book. You need to buy the audiobook reader such as kindle.  Audiobooks are sold and most of them have more expensive prices than I imagined.  If I just spend my time reading a book instead of listening to an audiobook, I can save money.  I think that reading is cheap and convenient way.  To use audiobooks is an easy way but it can be complicated and expensive.  Also, reading is natural way and you can enjoy it.\n",
        "source": "user",
        "start_time": 387.0,
        "end_time": 387.0,
        "last_event_time": 387.0,
        "start_progress": 0.5288270377733598,
        "end_progress": 0.5294897282968853
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,  I prefer reading to listening to audiobooks. I think that using audiobook is more expensive than reading a book. You need to buy the audiobook reader such as kindle.  Audiobooks are sold and most of them have more expensive prices than I imagined.  If I just spend my time reading a book instead of listening to an audiobook, I can save money.  I think that reading is cheap and convenient way.  To use audiobooks is an easy way but it can be complicated and expensive.  Also, reading is natural way and you can enjoy it.  Listening to an audiobook is not natural way like reading a book. For example, if you don’t understand what you hear, you can miss important information. Also, when I am in a car, listening to audiobooks make me feel bored because I can’t listen to them without paying my\n",
        "source": "api",
        "start_time": 411.0,
        "end_time": 466.0,
        "last_event_time": 466.0,
        "start_progress": 0.5294897282968853,
        "end_progress": 0.7104042412193505
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,  I prefer reading to listening to audiobooks. I think that using audiobook is more expensive than reading a book. You need to buy the audiobook reader such as kindle.  Audiobooks are sold and most of them have more expensive prices than I imagined.  If I just spend my time reading a book instead of listening to an audiobook, I can save money.  I think that reading is cheap and convenient way.  To use audiobooks is an easy way but it can be complicated and expensive.  Also, reading is natural way and you can enjoy it.  Listening to an audiobook is not natural way like reading a book. For example, if you don’t understand what you hear, you can miss important information. Also, when I am in a car, listening to audiobooks make me feel bored because I can’t listen to them without paying my attention. \n",
        "source": "user",
        "start_time": 471.0,
        "end_time": 475.0,
        "last_event_time": 475.0,
        "start_progress": 0.7104042412193505,
        "end_progress": 0.7183565275016567
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,  I prefer reading to listening to audiobooks. I think that using audiobook is more expensive than reading a book. You need to buy the audiobook reader such as kindle.  Audiobooks are sold and most of them have more expensive prices than I imagined.  If I just spend my time reading a book instead of listening to an audiobook, I can save money.  I think that reading is cheap and convenient way.  To use audiobooks is an easy way but it can be complicated and expensive.  Also, reading is natural way and you can enjoy it.  Listening to an audiobook is not natural way like reading a book. For example, if you don’t understand what you hear, you can miss important information. Also, when I am in a car, listening to audiobooks make me feel bored because I can’t listen to them without paying my attention.  My opinion is that listening to an audiobook can be useful, but reading a book is better way.\n",
        "source": "api",
        "start_time": 500.0,
        "end_time": 500.0,
        "last_event_time": 500.0,
        "start_progress": 0.7183565275016567,
        "end_progress": 0.780649436713055
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,  I prefer reading to listening to audiobooks. I think that using audiobook is more expensive than reading a book. You need to buy the audiobook reader such as kindle.  Audiobooks are sold and most of them have more expensive prices than I imagined.  If I just spend my time reading a book instead of listening to an audiobook, I can save money.  I think that reading is cheap and convenient way.  To use audiobooks is an easy way but it can be complicated and expensive.  Also, reading is natural way and you can enjoy it.  Listening to an audiobook is not natural way like reading a book. For example, if you don’t understand what you hear, you can miss important information. Also, when I am in a car, listening to audiobooks make me feel bored because I can’t listen to them without paying my attention.  My opinion is that listening to an audiobook can be useful, but reading a book is better way. Reading can be relaxing and self-paced. \n",
        "source": "user",
        "start_time": 501.0,
        "end_time": 550.0,
        "last_event_time": 550.0,
        "start_progress": 0.780649436713055,
        "end_progress": 0.807819748177601
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,  I prefer reading to listening to audiobooks. I think that using audiobook is more expensive than reading a book. You need to buy the audiobook reader such as kindle.  Audiobooks are sold and most of them have more expensive prices than I imagined.  If I just spend my time reading a book instead of listening to an audiobook, I can save money.  I think that reading is cheap and convenient way.  To use audiobooks is an easy way but it can be complicated and expensive.  Also, reading is natural way and you can enjoy it.  Listening to an audiobook is not natural way like reading a book. For example, if you don’t understand what you hear, you can miss important information. Also, when I am in a car, listening to audiobooks make me feel bored because I can’t listen to them without paying my attention.  My opinion is that listening to an audiobook can be useful, but reading a book is better way. Reading can be relaxing and self-paced. You don’t need to pay attention all the time and read anything you want. It is possible you always have access to a book but you do not have always a device with audiobooks in it.\n",
        "source": "api",
        "start_time": 585.0,
        "end_time": 608.0,
        "last_event_time": 608.0,
        "start_progress": 0.807819748177601,
        "end_progress": 0.9264413518886679
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,  I prefer reading to listening to audiobooks. I think that using audiobook is more expensive than reading a book. You need to buy the audiobook reader such as kindle.  Audiobooks are sold and most of them have more expensive prices than I imagined.  If I just spend my time reading a book instead of listening to an audiobook, I can save money.  I think that reading is a cheap and convenient way.  To use audiobooks is an easy way but it can be complicated and expensive.  Also, reading is natural and you can enjoy it.  Listening to an audiobook is not a natural way like reading a book. For example, if you don’t understand what you hear, you can miss important information. Also, when I am in a car, listening to audiobooks make me feel bored because I can’t listen to them without paying my full attention.  My opinion is that listening to an audiobook can be useful, but reading a book is a much better way. Reading can be relaxing and self-paced. You don’t need to pay attention all the time and read anything you want. Reading makes your brain smarter too. It is possible you always have access to a book but you do not always have  a device with audiobooks in it. To conclude,  I prefer reading to listening to audiobooks. \n",
        "source": "user",
        "start_time": 620.0,
        "end_time": 801.0,
        "last_event_time": 801.0,
        "start_progress": 0.9264413518886679,
        "end_progress": 1.0
    }
]