[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
        "source": "api"
    },
    {
        "text": "One day, the shapeshifter sees an advertisement for a seminar on how to be a better boyfriend.",
        "source": "api"
    },
    {
        "text": "He thinks it is just the thing he needs to improve himself and make the woman really fall for him, so he signs up.",
        "source": "user"
    },
    {
        "text": "When Clive, the shapeshifter, gets to the seminar, he start to wonder if this is really a good idea.",
        "source": "user"
    },
    {
        "text": "The first sign he sees when he walk in says \"Be the real You.",
        "source": "user"
    },
    {
        "text": "\" \"Really difficult,\" thought Clive.",
        "source": "user"
    },
    {
        "text": "\"Especially when my whole existence involves being someone else.",
        "source": "user"
    },
    {
        "text": "\"\n\nFrustrated, Clive starts to leave, when he notices a seminar going on in the next auditorium, with a similar theme.",
        "source": "user"
    },
    {
        "text": "\"How to be a better girlfriend.",
        "source": "user"
    },
    {
        "text": "\" And who does he see walking in, but Liz, the woman he has been in love with for ages.",
        "source": "user"
    },
    {
        "text": "\"This is an interesting situation,\" thought Clive.",
        "source": "user"
    },
    {
        "text": "Spurred on, that Liz thinks she needs help as much as he does, Clive strides into the auditorium with renewed purpose.",
        "source": "user"
    },
    {
        "text": "He takes a seat near the front, and prepares to have his life changed.",
        "source": "user"
    },
    {
        "text": "The lecture drones on, and Clive is about ready to lose his mind.",
        "source": "user"
    },
    {
        "text": "He hasn't really heard anything that is of much help.",
        "source": "user"
    },
    {
        "text": "Be open, be real, be honest.",
        "source": "user"
    },
    {
        "text": "Blah, blah, blah.",
        "source": "user"
    },
    {
        "text": "All things he really can't be since he is a shapeshifter and is afraid to tell Liz who he really is.",
        "source": "user"
    },
    {
        "text": "At the lunch break, discouraged, Clive goes to the fountain outside the building to contemplate his situation.",
        "source": "user"
    },
    {
        "text": "He loves Liz so much, and though he has tried to break free from his passion for her, something about her draws him back.",
        "source": "user"
    },
    {
        "text": "Clive hears some muffled sobbing coming from the other side of a tree.",
        "source": "user"
    },
    {
        "text": "Intrigued by who could possibly feel as badly as he does, he gets up and walks towards the sound.",
        "source": "user"
    },
    {
        "text": "Of all the things, there sits Liz.",
        "source": "user"
    },
    {
        "text": "Clive is in shock, and his heart is wrenching that the love of his life is in pain.",
        "source": "user"
    },
    {
        "text": "He goes up to her and quietly sits down and asks, \"Can I help you?",
        "source": "user"
    },
    {
        "text": "\" In tears and a pained voice, Liz answers, \"I came here to find out how to be better so I could really find true love.",
        "source": "user"
    },
    {
        "text": "But all the classes are about being yourself.",
        "source": "user"
    },
    {
        "text": "\" Liz looks at Clive with fear and hesitation, and states, \"I can't really do that because, you see, I am a shapeshifter.",
        "source": "user"
    },
    {
        "text": "\" She looks at him expectantly.",
        "source": "user"
    },
    {
        "text": "Clive bursts out laughing and hollers \"SO AM I!",
        "source": "user"
    },
    {
        "text": "\" Thrilled that they have found someone similar to themselves, they lock hands and walk off together.",
        "source": "user"
    },
    {
        "text": "Maybe the class was a good idea after all.",
        "source": "user"
    }
]