[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?\"",
        "source": "api"
    },
    {
        "text": "You stand perfectly still.",
        "source": "user"
    },
    {
        "text": "There is a bee on you.",
        "source": "user"
    },
    {
        "text": "You don't even dare look at it.",
        "source": "user"
    },
    {
        "text": "A thousand thoughts race through your mind.",
        "source": "user"
    },
    {
        "text": "Maybe it has stung you without you noticing, and you are dying.",
        "source": "user"
    },
    {
        "text": "Maybe the poison from the stinger is making you delusional.",
        "source": "user"
    },
    {
        "text": "Maybe you are imagining the whole thing.",
        "source": "user"
    },
    {
        "text": "You can't take it anymore.",
        "source": "user"
    },
    {
        "text": "You swat at the bee, and it flies away.",
        "source": "api"
    },
    {
        "text": "You breathe a sigh of relief.",
        "source": "user"
    },
    {
        "text": "You're fine.",
        "source": "user"
    },
    {
        "text": "You go about your day, but you can't get the bee out of your head.",
        "source": "api"
    },
    {
        "text": "It was so real.",
        "source": "api"
    },
    {
        "text": "You go to bed that night, and you dream about the bee.",
        "source": "api"
    },
    {
        "text": "You dream about the bee telling you that you are the queen of the bees, and that you must lead them to victory over the humans.",
        "source": "api"
    },
    {
        "text": "You dream of transforming into a bee, and stinging all the humans you have ever know.",
        "source": "user"
    },
    {
        "text": "You wake up in a cold sweat, but you are still you.",
        "source": "user"
    },
    {
        "text": "What a crazy nightmare.",
        "source": "user"
    },
    {
        "text": "The next day, you are walking through the woods, and you see a bee.",
        "source": "user"
    },
    {
        "text": "You are about to swat it, but it says \"Your Majesty, what are your orders?\" You freeze.",
        "source": "api"
    },
    {
        "text": "It's the same bee from before.",
        "source": "user"
    },
    {
        "text": "It's not a dream.",
        "source": "user"
    },
    {
        "text": "It's real.",
        "source": "user"
    },
    {
        "text": "\"Um, can you hear me?\" You say.",
        "source": "user"
    },
    {
        "text": "\"Yes, Your Majesty. You are hive-attuned, one of the last queens. I've come here to beg you to lead us\", she says, as she bows deeply on your shoulder.",
        "source": "user"
    },
    {
        "text": "\"Lead you to what?\" I wonder out loud.",
        "source": "user"
    },
    {
        "text": "\"To victory over the humans, Your Majesty. The honeyed clans cannot rule until every last human is disposed of\" \"But I am a human\", you say.",
        "source": "user"
    },
    {
        "text": "\"You are the queen of the bees, Your Majesty. You must lead us to victory.\"",
        "source": "user"
    },
    {
        "text": "Great.",
        "source": "user"
    },
    {
        "text": "Now you're with a bee who is convinced that you're a bee yourself, and wants you to overthrow the humans.",
        "source": "user"
    },
    {
        "text": "This is not what you had in mind for your day!",
        "source": "user"
    }
]