[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?",
        "source": "api"
    },
    {
        "text": "\" You scream \"don't bite me!",
        "source": "api"
    },
    {
        "text": "\" and the bee says \"I'm not a bee, I'm your guardian angel.",
        "source": "user"
    },
    {
        "text": "I'm here to tell you that you're not allergic, it was a lie.",
        "source": "api"
    },
    {
        "text": "It is the middle of the night and no one is protecting you.",
        "source": "api"
    },
    {
        "text": "You do not know how this bee got in your room.",
        "source": "user"
    },
    {
        "text": "You hope your mom heard your scream but you want to know about this lie.",
        "source": "user"
    },
    {
        "text": "You know that if you call your mother, she'll be mad at the bee.",
        "source": "user"
    },
    {
        "text": "You demand the bee tell you why your mother would lie.",
        "source": "api"
    },
    {
        "text": "The bee just says \"To protect you.",
        "source": "user"
    },
    {
        "text": "\" You don't understand and the bee explains \"You're a princess.",
        "source": "api"
    },
    {
        "text": "\" You are destined for a life of royalty when you are an adult.",
        "source": "api"
    },
    {
        "text": "You will be a queen.",
        "source": "user"
    },
    {
        "text": "Your mother has not told you because she wants you to have a good childhood.",
        "source": "api"
    },
    {
        "text": "But she has protected you so much you have never been free.",
        "source": "user"
    },
    {
        "text": "Now you must tell her of the bee.",
        "source": "user"
    },
    {
        "text": "Now that you are older it is time to get ready for your adult life.",
        "source": "user"
    },
    {
        "text": "You tell your mother about the bee.",
        "source": "user"
    },
    {
        "text": "She hugs you and tells you she knew this time would come.",
        "source": "api"
    },
    {
        "text": "She hopes you will understand it was her job to keep you safe so she did what she had to do.",
        "source": "user"
    },
    {
        "text": "You understand and promise to always love her.",
        "source": "user"
    }
]