[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "There is this odor that certain people exude.",
        "source": "api"
    },
    {
        "text": "It's both familiar as well as off-putting.",
        "source": "user"
    },
    {
        "text": "You notice the smell more often in large crowds and it's becoming troubling enough that you've begun to stay home.",
        "source": "user"
    },
    {
        "text": "You don't mind much, you've lived a long life.",
        "source": "user"
    },
    {
        "text": "It's one thing to see your former college friends brag about their lives on social media, never having changed their looks.",
        "source": "user"
    },
    {
        "text": "It's another to be on the subway and see someone who looks like your former best friend, and then smell the tell-tale scent of decay.",
        "source": "user"
    },
    {
        "text": "You hide your face as others in the subway hear your gasp.",
        "source": "api"
    },
    {
        "text": "You realize that you are the only person in that packed subway who has aged.",
        "source": "user"
    },
    {
        "text": "The smell intensifies, making you gag.",
        "source": "user"
    },
    {
        "text": "You hide your face, tuck it into your scarf, breathing in the scent of your lotion.",
        "source": "user"
    },
    {
        "text": "You convince yourself that you are smelling your own breath, but the smell is still there.",
        "source": "user"
    },
    {
        "text": "You exit the car at the next stop, despite it being 3 exits from home.",
        "source": "api"
    },
    {
        "text": "The smell lingers in your nose as you rush home.",
        "source": "user"
    },
    {
        "text": "You enter the house and lock the door, rushing towards your master bathroom only to be taken aback when you step foot in your bedroom.",
        "source": "user"
    },
    {
        "text": "A man is standing there, looking at you.",
        "source": "user"
    },
    {
        "text": "The smell is here.",
        "source": "api"
    },
    {
        "text": "You drop to your knees, a hand on your mouth as you feel yourself retch.",
        "source": "api"
    },
    {
        "text": "\"Why?",
        "source": "api"
    },
    {
        "text": "!",
        "source": "api"
    },
    {
        "text": "\" you ask, but you know the answer already.",
        "source": "api"
    },
    {
        "text": "\"Vanity\" the man says.",
        "source": "api"
    },
    {
        "text": "\"Vanity and narcissism are rotting people at their core, rotting their life away from the inside out\"\n\nYou fall forward, still retching as the man approaches you.",
        "source": "api"
    },
    {
        "text": "\"But, I've lived a good life, why am I the one to suffer and have to stay locked up inside to avoid the rot?",
        "source": "api"
    },
    {
        "text": "\" you ask\n\n\"You're not the one suffering\" he says.",
        "source": "user"
    },
    {
        "text": "\"We all are.",
        "source": "api"
    },
    {
        "text": "\"\n\nAt this point you realize that you can't live this way.",
        "source": "api"
    },
    {
        "text": "You are dying a regular death.",
        "source": "user"
    },
    {
        "text": "A death that was once natural.",
        "source": "user"
    },
    {
        "text": "The others?",
        "source": "user"
    },
    {
        "text": "They are dying unnaturally and their vanity makes it so that they will never even know.",
        "source": "user"
    },
    {
        "text": "You turn back towards the man and see a syringe on the bed beside him.",
        "source": "user"
    },
    {
        "text": "You stand up and grab the man by his neck.",
        "source": "user"
    },
    {
        "text": "\"Why are you making me do this?",
        "source": "user"
    },
    {
        "text": "!",
        "source": "user"
    },
    {
        "text": "\" you cry.",
        "source": "user"
    },
    {
        "text": "\"I'm not making you do anything, I'm just giving you the option now that you know the truth\" the man replies.",
        "source": "user"
    },
    {
        "text": "And so, you reach for a syringe and gather the last of your courage.",
        "source": "user"
    },
    {
        "text": "It's this or never leaving home again, dying alone in pain without anyone knowing or dying now.",
        "source": "api"
    },
    {
        "text": "You choose now and jab the needle into your neck.",
        "source": "user"
    },
    {
        "text": "The smell of rose scented lotion wafts past you and you smile as your body relaxes.",
        "source": "user"
    },
    {
        "text": "It's over.",
        "source": "user"
    }
]