[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "Why the alien picked Matt Damon of all people?",
        "source": "user"
    },
    {
        "text": "We'll never know.",
        "source": "user"
    },
    {
        "text": "Sure Matt Damon is famous but the alien probably should have went with the President of the country if he wanted the United States to give into his demands.",
        "source": "user"
    },
    {
        "text": "The alien is keeping Matt Damon hostage and since Damon doesn't speak the alien language, he has no idea why.",
        "source": "user"
    },
    {
        "text": "There are also no alien translators available so Damon can't communicate with the alien at all.",
        "source": "user"
    },
    {
        "text": "The alien isn't torturing Damon at all.",
        "source": "user"
    },
    {
        "text": "He simply has him in a room with the door locked.",
        "source": "user"
    },
    {
        "text": "The windows are locked as well.",
        "source": "user"
    },
    {
        "text": "Damon has no idea what planet he is on.",
        "source": "user"
    },
    {
        "text": "He is basically living in isolation.",
        "source": "user"
    },
    {
        "text": "The alien walks into the room with Matt Damon inside and to Damon's surprise, the alien starts speaking to him in English.",
        "source": "user"
    },
    {
        "text": "The alien explains that the reason why Matt Damon was abducted is because Good Will Hunting is the alien's favorite movie.",
        "source": "user"
    },
    {
        "text": "Matt Damon looks astonished and asks the alien why he would abduct him to a different planet over something like that.",
        "source": "user"
    },
    {
        "text": "The alien explains that he wants Matt Damon to make a sequel.",
        "source": "user"
    },
    {
        "text": "Damon negotiates a little bit with the alien and tells him that as long as he can go back to his home planet, he will make a sequel.",
        "source": "user"
    },
    {
        "text": "The alien explains that if Matt is lying, the alien can abduct him at any time, and next time they may not be as nice.",
        "source": "user"
    },
    {
        "text": "Matt Damon is returned to the United States.",
        "source": "user"
    },
    {
        "text": "He gets the crew back together, the movie studio is on board and Good Will Hunting 2 is made.",
        "source": "user"
    },
    {
        "text": "The movie is a box office smash and makes hundreds of millions of dollars.",
        "source": "user"
    },
    {
        "text": "Matt gets home after the premiere and there is a letter waiting for him.",
        "source": "user"
    },
    {
        "text": "There is also a translation device next to the letter.",
        "source": "user"
    },
    {
        "text": "Obviously Matt knows that this letter is most likely from the alien.",
        "source": "user"
    },
    {
        "text": "And he really hopes the alien saw and liked Good Will Hunting 2.",
        "source": "user"
    },
    {
        "text": "Luckily for Matt, the letter has nothing but positive words from the alien.",
        "source": "user"
    },
    {
        "text": "The alien thanks Matt for making his dream come true and apologizes for having to go through such lengths to get it.",
        "source": "user"
    },
    {
        "text": "As a thank you, the alien tells Matt that he is sending him a space ship that he and his family can use to get away from the press.",
        "source": "user"
    }
]