[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 0.0,
        "end_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.11931290622098421
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 31.0,
        "end_time": 31.0,
        "start_progress": 0.11931290622098421,
        "end_progress": 0.14391829155060354
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 32.0,
        "end_time": 53.0,
        "start_progress": 0.14391829155060354,
        "end_progress": 0.16852367688022285
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 32.0,
        "end_time": 111.0,
        "start_progress": 0.16852367688022285,
        "end_progress": 0.18662952646239556
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 125.0,
        "end_time": 125.0,
        "start_progress": 0.18662952646239556,
        "end_progress": 0.22841225626740946
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 135.0,
        "end_time": 138.0,
        "start_progress": 0.22841225626740946,
        "end_progress": 0.23909006499535748
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 143.0,
        "end_time": 143.0,
        "start_progress": 0.23909006499535748,
        "end_progress": 0.25069637883008355
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 146.0,
        "end_time": 156.0,
        "start_progress": 0.25069637883008355,
        "end_progress": 0.2725162488393686
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 168.0,
        "end_time": 168.0,
        "start_progress": 0.2725162488393686,
        "end_progress": 0.3073351903435469
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 170.0,
        "end_time": 175.0,
        "start_progress": 0.3073351903435469,
        "end_progress": 0.31847725162488394
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 170.0,
        "end_time": 190.0,
        "start_progress": 0.31847725162488394,
        "end_progress": 0.33890436397400187
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 197.0,
        "end_time": 197.0,
        "start_progress": 0.33890436397400187,
        "end_progress": 0.3574744661095636
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 202.0,
        "end_time": 207.0,
        "start_progress": 0.3574744661095636,
        "end_progress": 0.3709377901578459
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 218.0,
        "end_time": 218.0,
        "start_progress": 0.3709377901578459,
        "end_progress": 0.40575673166202414
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 224.0,
        "end_time": 233.0,
        "start_progress": 0.40575673166202414,
        "end_progress": 0.42479108635097496
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 243.0,
        "end_time": 243.0,
        "start_progress": 0.42479108635097496,
        "end_progress": 0.44196843082636955
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 248.0,
        "end_time": 254.0,
        "start_progress": 0.44196843082636955,
        "end_progress": 0.45775301764159704
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 260.0,
        "end_time": 260.0,
        "start_progress": 0.45775301764159704,
        "end_progress": 0.4712163416898793
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 283.0,
        "end_time": 287.0,
        "start_progress": 0.4712163416898793,
        "end_progress": 0.48003714020427113
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 294.0,
        "end_time": 294.0,
        "start_progress": 0.48003714020427113,
        "end_progress": 0.48885793871866295
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 311.0,
        "end_time": 311.0,
        "start_progress": 0.48885793871866295,
        "end_progress": 0.5287836583101208
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 314.0,
        "end_time": 324.0,
        "start_progress": 0.5287836583101208,
        "end_progress": 0.5589600742804085
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 335.0,
        "end_time": 335.0,
        "start_progress": 0.5589600742804085,
        "end_progress": 0.5701021355617456
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 336.0,
        "end_time": 343.0,
        "start_progress": 0.5701021355617456,
        "end_progress": 0.5900649953574745
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 351.0,
        "end_time": 351.0,
        "start_progress": 0.5900649953574745,
        "end_progress": 0.6077065923862581
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 353.0,
        "end_time": 362.0,
        "start_progress": 0.6077065923862581,
        "end_progress": 0.6267409470752089
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 374.0,
        "end_time": 374.0,
        "start_progress": 0.6267409470752089,
        "end_progress": 0.6578458681522749
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild. They aren't sure whether they should contact them or move along. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 375.0,
        "end_time": 391.0,
        "start_progress": 0.6578458681522749,
        "end_progress": 0.6884865366759517
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild. They aren't sure whether they should contact them or move along. They decide to contact them.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 397.0,
        "end_time": 397.0,
        "start_progress": 0.6884865366759517,
        "end_progress": 0.7014856081708449
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild. They aren't sure whether they should contact them or move along. They decide to contact them. They weren't sure of the best way, so they decided to simply stop hiding. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 419.0,
        "end_time": 431.0,
        "start_progress": 0.7014856081708449,
        "end_progress": 0.7363045496750232
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild. They aren't sure whether they should contact them or move along. They decide to contact them. They weren't sure of the best way, so they decided to simply stop hiding. They would walk out into the open.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 443.0,
        "end_time": 443.0,
        "start_progress": 0.7363045496750232,
        "end_progress": 0.7520891364902507
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild. They aren't sure whether they should contact them or move along. They decide to contact them. They weren't sure of the best way, so they decided to simply stop hiding. They would walk out into the open. One day, one of the members of the new world was out walking  ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 452.0,
        "end_time": 478.0,
        "start_progress": 0.7520891364902507,
        "end_progress": 0.7813370473537604
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild. They aren't sure whether they should contact them or move along. They decide to contact them. They weren't sure of the best way, so they decided to simply stop hiding. They would walk out into the open. One day, one of the members of the new world was out walking   in the woods.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 484.0,
        "end_time": 484.0,
        "start_progress": 0.7813370473537604,
        "end_progress": 0.7878365831012071
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild. They aren't sure whether they should contact them or move along. They decide to contact them. They weren't sure of the best way, so they decided to simply stop hiding. They would walk out into the open. One day, one of the members of the new world was out walking   in the woods. He saw a man walking out in the open.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 491.0,
        "end_time": 491.0,
        "start_progress": 0.7878365831012071,
        "end_progress": 0.8054781801299907
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild. They aren't sure whether they should contact them or move along. They decide to contact them. They weren't sure of the best way, so they decided to simply stop hiding. They would walk out into the open. One day, one of the members of the new world was out walking   in the woods. He saw a man walking out in the open. The man was wearing odd clothes, and looked like he was from somewhere else. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 494.0,
        "end_time": 507.0,
        "start_progress": 0.8054781801299907,
        "end_progress": 0.8416898792943361
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild. They aren't sure whether they should contact them or move along. They decide to contact them. They weren't sure of the best way, so they decided to simply stop hiding. They would walk out into the open. One day, one of the members of the new world was out walking   in the woods. He saw a man walking out in the open. The man was wearing odd clothes, and looked like he was from somewhere else. The man was very intrigued.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 513.0,
        "end_time": 513.0,
        "start_progress": 0.8416898792943361,
        "end_progress": 0.8542246982358404
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild. They aren't sure whether they should contact them or move along. They decide to contact them. They weren't sure of the best way, so they decided to simply stop hiding. They would walk out into the open. One day, one of the members of the new world was out walking   in the woods. He saw a man walking out in the open. The man was wearing odd clothes, and looked like he was from somewhere else. The man was very intrigued. He introduced himself, and asked if the man had survived the war. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 515.0,
        "end_time": 527.0,
        "start_progress": 0.8542246982358404,
        "end_progress": 0.8853296193129062
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild. They aren't sure whether they should contact them or move along. They decide to contact them. They weren't sure of the best way, so they decided to simply stop hiding. They would walk out into the open. One day, one of the members of the new world was out walking   in the woods. He saw a man walking out in the open. The man was wearing odd clothes, and looked like he was from somewhere else. The man was very intrigued. He introduced himself, and asked if the man had survived the war. The man said that he had.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 548.0,
        "end_time": 548.0,
        "start_progress": 0.8853296193129062,
        "end_progress": 0.8969359331476323
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild. They aren't sure whether they should contact them or move along. They decide to contact them. They weren't sure of the best way, so they decided to simply stop hiding. They would walk out into the open. One day, one of the members of the new world was out walking   in the woods. He saw a man walking out in the open. The man was wearing odd clothes, and looked like he was from somewhere else. The man was very intrigued. He introduced himself, and asked if the man had survived the war. The man said that he had. He asked how many of his people there are. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 551.0,
        "end_time": 558.0,
        "start_progress": 0.8969359331476323,
        "end_progress": 0.9173630454967502
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild. They aren't sure whether they should contact them or move along. They decide to contact them. They weren't sure of the best way, so they decided to simply stop hiding. They would walk out into the open. One day, one of the members of the new world was out walking   in the woods. He saw a man walking out in the open. The man was wearing odd clothes, and looked like he was from somewhere else. The man was very intrigued. He introduced himself, and asked if the man had survived the war. The man said that he had. He asked how many of his people there are. The man said that there are many of them.",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 562.0,
        "end_time": 562.0,
        "start_progress": 0.9173630454967502,
        "end_progress": 0.9363974001857011
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild. They aren't sure whether they should contact them or move along. They decide to contact them. They weren't sure of the best way, so they decided to simply stop hiding. They would walk out into the open. One day, one of the members of the new world was out walking   in the woods. He saw a man walking out in the open. The man was wearing odd clothes, and looked like he was from somewhere else. The man was very intrigued. He introduced himself, and asked if the man had survived the war. The man said that he had. He asked how many of his people there are. The man said that there are many of them. They were invited to a feast with the people of the new world. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 568.0,
        "end_time": 580.0,
        "start_progress": 0.9363974001857011,
        "end_progress": 0.9661095636025998
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild. They aren't sure whether they should contact them or move along. They decide to contact them. They weren't sure of the best way, so they decided to simply stop hiding. They would walk out into the open. One day, one of the members of the new world was out walking   in the woods. He saw a man walking out in the open. The man was wearing odd clothes, and looked like he was from somewhere else. The man was very intrigued. He introduced himself, and asked if the man had survived the war. The man said that he had. He asked how many of his people there are. The man said that there are many of them. They were invited to a feast with the people of the new world. They were welcomed with open arms",
        "source": "api",
        "last_event_time": 597.0,
        "start_time": 590.0,
        "end_time": 590.0,
        "start_progress": 0.9661095636025998,
        "end_progress": 0.9814298978644382
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The US is now the only superpower left in the world. They take time acclimating to the new way of life.  They have a lot of work ahead of them. They have to rebuild their country, and they have to learn to live with the other nations. There is no internet. There are no cell phones. They have to develop new ways of functioning. There are many different cultures, and they have to learn how to get along. They start to rebuild. They divide up the work according to skill. They have to learn how to work together. There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers. There is much progress in a short time. They are able to build a new society. Things run smoothly for a while. But then, there is a problem. They realize that they are not alone. There is a group of people who have been hiding from the world for the past 50 years. They have learned how to live and remain unseen and undetected. They are very secretive. It is how they have survived for so long. They have been watching the new world. They are impressed with their progress. They are impressed with how quickly they have been able to rebuild. They aren't sure whether they should contact them or move along. They decide to contact them. They weren't sure of the best way, so they decided to simply stop hiding. They would walk out into the open. One day, one of the members of the new world was out walking   in the woods. He saw a man walking out in the open. The man was wearing odd clothes, and looked like he was from somewhere else. The man was very intrigued. He introduced himself, and asked if the man had survived the war. The man said that he had. He asked how many of his people there are. The man said that there are many of them. They were invited to a feast with the people of the new world. They were welcomed with open arms and they all lived happily ever after. ",
        "source": "user",
        "last_event_time": 597.0,
        "start_time": 591.0,
        "end_time": 597.0,
        "start_progress": 0.9814298978644382,
        "end_progress": 1.0
    }
]