[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "The US is now the only superpower left in the world.",
        "source": "user"
    },
    {
        "text": "They take time acclimating to the new way of life.",
        "source": "user"
    },
    {
        "text": "They have a lot of work ahead of them.",
        "source": "user"
    },
    {
        "text": "They have to rebuild their country, and they have to learn to live with the other nations.",
        "source": "user"
    },
    {
        "text": "There is no internet.",
        "source": "user"
    },
    {
        "text": "There are no cell phones.",
        "source": "user"
    },
    {
        "text": "They have to develop new ways of functioning.",
        "source": "user"
    },
    {
        "text": "There are many different cultures, and they have to learn how to get along.",
        "source": "user"
    },
    {
        "text": "They start to rebuild.",
        "source": "user"
    },
    {
        "text": "They divide up the work according to skill.",
        "source": "user"
    },
    {
        "text": "They have to learn how to work together.",
        "source": "user"
    },
    {
        "text": "There are teams of inventors, teams of farmers, teams of builders, teams of doctors, teams of teachers.",
        "source": "user"
    },
    {
        "text": "There is much progress in a short time.",
        "source": "user"
    },
    {
        "text": "They are able to build a new society.",
        "source": "user"
    },
    {
        "text": "Things run smoothly for a while.",
        "source": "user"
    },
    {
        "text": "But then, there is a problem.",
        "source": "user"
    },
    {
        "text": "They realize that they are not alone.",
        "source": "user"
    },
    {
        "text": "There is a group of people who have been hiding from the world for the past 50 years.",
        "source": "user"
    },
    {
        "text": "They have learned how to live and remain unseen and undetected.",
        "source": "user"
    },
    {
        "text": "They are very secretive.",
        "source": "user"
    },
    {
        "text": "It is how they have survived for so long.",
        "source": "user"
    },
    {
        "text": "They have been watching the new world.",
        "source": "user"
    },
    {
        "text": "They are impressed with their progress.",
        "source": "user"
    },
    {
        "text": "They are impressed with how quickly they have been able to rebuild.",
        "source": "user"
    },
    {
        "text": "They aren't sure whether they should contact them or move along.",
        "source": "user"
    },
    {
        "text": "They decide to contact them.",
        "source": "user"
    },
    {
        "text": "They weren't sure of the best way, so they decided to simply stop hiding.",
        "source": "user"
    },
    {
        "text": "They would walk out into the open.",
        "source": "user"
    },
    {
        "text": "One day, one of the members of the new world was out walking   in the woods.",
        "source": "user"
    },
    {
        "text": "He saw a man walking out in the open.",
        "source": "user"
    },
    {
        "text": "The man was wearing odd clothes, and looked like he was from somewhere else.",
        "source": "user"
    },
    {
        "text": "The man was very intrigued.",
        "source": "user"
    },
    {
        "text": "He introduced himself, and asked if the man had survived the war.",
        "source": "user"
    },
    {
        "text": "The man said that he had.",
        "source": "user"
    },
    {
        "text": "He asked how many of his people there are.",
        "source": "user"
    },
    {
        "text": "The man said that there are many of them.",
        "source": "user"
    },
    {
        "text": "They were invited to a feast with the people of the new world.",
        "source": "user"
    },
    {
        "text": "They were welcomed with open arms and they all lived happily ever after.",
        "source": "user"
    }
]