[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
        "source": "api"
    },
    {
        "text": "One day the shapeshifter runs into a new girl who catches his eye.",
        "source": "api"
    },
    {
        "text": "Could this be the person who takes the attention off of this ever enchanting woman.",
        "source": "user"
    },
    {
        "text": "The shapeshifter decides not to pursue this woman as of just yet, but to instead watch her to see if she was worth his time.",
        "source": "user"
    },
    {
        "text": "He followed her until she gave a man a hug, and then leaned in for a kiss.",
        "source": "user"
    },
    {
        "text": "This was the man that he was going to need to shapeshift into if he was going to woe the woman.",
        "source": "user"
    },
    {
        "text": "Just like that, he becomes the man he sees.",
        "source": "user"
    },
    {
        "text": "He is now ready to meet the woman and if it goes well, he will get rid of the man.",
        "source": "user"
    },
    {
        "text": "Or maybe he should get rid of the man first?",
        "source": "user"
    },
    {
        "text": "Yea that is probably safest.",
        "source": "user"
    },
    {
        "text": "He decided to discard of the man prior just to avoid being caught.",
        "source": "user"
    },
    {
        "text": "The way he goes about doing this was to ruin the breaks of his vehicle so that he would crash his car.",
        "source": "user"
    },
    {
        "text": "He was going to need to make sure the car was disposed to the point where the body could not be identified then.",
        "source": "user"
    },
    {
        "text": "The shapeshifter does this by disguising himself as a truck, and comes out of nowhere hitting the car head on and knocking the car into the ocean.",
        "source": "user"
    },
    {
        "text": "Now that the man is taken care of, the shapeshifter decides to go and find the woman and take the place of the man.",
        "source": "user"
    },
    {
        "text": "The shapeshifter knew where the woman worked, so he figured it would surprise her there.",
        "source": "user"
    },
    {
        "text": "He took her some flowers and told her that they should do something after she finishes work if she was free.",
        "source": "user"
    },
    {
        "text": "This worked for the woman and they proceeded to go out to dinner.",
        "source": "user"
    },
    {
        "text": "The more the conversation went on the man realized that this was not the girl for him.",
        "source": "user"
    },
    {
        "text": "The girl had this annoying laugh that made it difficult for the shapeshifter to think straight, and the girl was also much more rude and bitter than he had realized.",
        "source": "user"
    },
    {
        "text": "She had a pretty face, but nothing to write home about after seeing her personality.",
        "source": "user"
    },
    {
        "text": "The shapeshifter went to the bathroom and walked out on the date.",
        "source": "user"
    },
    {
        "text": "Yet another life disrupted by the shapeshifter, and another day filled with no love.",
        "source": "user"
    },
    {
        "text": "In fact, this situation only made the shapeshifter fall for the original woman he adimired even harder.",
        "source": "user"
    }
]