[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "She meets him again, after he follows her to a bar.",
        "source": "user"
    },
    {
        "text": "He is charming.",
        "source": "user"
    },
    {
        "text": "The process starts again.",
        "source": "user"
    },
    {
        "text": "She's dating him again.",
        "source": "user"
    },
    {
        "text": "He comes over to her house for dinner one night.",
        "source": "user"
    },
    {
        "text": "She has everything prepared very nicely.",
        "source": "user"
    },
    {
        "text": "They enjoy their dinner.",
        "source": "user"
    },
    {
        "text": "She asks him if he would like some dessert.",
        "source": "user"
    },
    {
        "text": "He accepts and they sit out on the balcony, having dessert and wine.",
        "source": "user"
    },
    {
        "text": "He keeps saying how much he appreciates her.",
        "source": "user"
    },
    {
        "text": "She finds this odd, because they really don't know each other that well yet.",
        "source": "user"
    },
    {
        "text": "She realizes she's starting to feel uncomfortable.",
        "source": "user"
    },
    {
        "text": "There is something eerily familiar about the scene.",
        "source": "user"
    },
    {
        "text": "She looks in his eyes, and sees only one thing: hunger.",
        "source": "user"
    },
    {
        "text": "She's seen that hunger before.",
        "source": "user"
    },
    {
        "text": "Her last boyfriend had it too.",
        "source": "user"
    },
    {
        "text": "Now she sees it in this man and she suddenly realizes that she has somehow fallen for the same trap again.",
        "source": "user"
    },
    {
        "text": "She has fallen for the man with no face, the one who is unable to be real or true.",
        "source": "user"
    },
    {
        "text": "She doesn't realize that he is a shapeshifter, but she knows that she's seen this exact scene play out before.",
        "source": "user"
    },
    {
        "text": "It didn't go well before and she has no reason to believe that it will go well this time.",
        "source": "user"
    },
    {
        "text": "In fact, she has every reason to believe that it won't.",
        "source": "user"
    },
    {
        "text": "She tells him that she's got a headache and would like him to leave.",
        "source": "user"
    },
    {
        "text": "He seems startled by this.",
        "source": "user"
    },
    {
        "text": "He asks her if she's breaking up with him.",
        "source": "user"
    },
    {
        "text": "She tells him that they barely know each other, that there is no relationship to end.",
        "source": "user"
    },
    {
        "text": "He looks so puzzled, she is taken back.",
        "source": "user"
    },
    {
        "text": "She realizes that he has no idea what she's talking about.",
        "source": "user"
    },
    {
        "text": "It is right then that she begins to suspect that something deeper is going on.",
        "source": "user"
    },
    {
        "text": "She doesn't understand it, but she's starting to come to the realization that he is, in fact, the same man she just broke up with.",
        "source": "user"
    },
    {
        "text": "She suspects that he is the same man she's broken up with many times.",
        "source": "user"
    },
    {
        "text": "The realization that she's dating the same person over and over again is staggering.",
        "source": "api"
    },
    {
        "text": "She asks him to leave, again.",
        "source": "user"
    },
    {
        "text": "This time, he begs her not to ask him to go away.",
        "source": "user"
    },
    {
        "text": "He begins weeping.",
        "source": "user"
    },
    {
        "text": "She is stunned by what is going on.",
        "source": "user"
    },
    {
        "text": "She has seen this act before.",
        "source": "user"
    },
    {
        "text": "She walks to the door, opens it, and curtly says, \"goodnight.\" He leaves, but never takes his eyes off of her.",
        "source": "user"
    },
    {
        "text": "She turns around, a bit spooked.",
        "source": "user"
    },
    {
        "text": "Later that night she searches the internet for clues about what was going on with him.",
        "source": "user"
    },
    {
        "text": "She is shocked to find that many women have had this same experience.",
        "source": "user"
    },
    {
        "text": "She reads about shapeshifters and knows, in her heart, that this is what she's been dating.",
        "source": "user"
    },
    {
        "text": "The woman joins the foreign legion and ships off, later that week.",
        "source": "user"
    },
    {
        "text": "She never dates anyone again.",
        "source": "user"
    }
]