[
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.10451045104510451
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology is a positive effect in dating. I think the addition of dating apps have made it possible for so many more people to find true love who otherwise would not have been able to. What datings app do for someone who uses them the right way is open up the pool of potential partners to a much higher number than if they were to go out physically searching for a partner. When someone is single, sometimes they can get to the point where they want a partner so bad that they lower their expectations. Dating apps group a bunch of people together who want similar relationships, and this makes it much easier! Just think of the single mothers and fathers with no time to go out and meet someone, without dating apps they may not have the chance to find a genuine relationship the way they were able to before starting a family. \n",
        "source": "user",
        "start_time": 7.0,
        "end_time": 136.0,
        "last_event_time": 136.0,
        "start_progress": 0.10451045104510451,
        "end_progress": 0.3333333333333333
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology is a positive effect in dating. I think the addition of dating apps have made it possible for so many more people to find true love who otherwise would not have been able to. What datings app do for someone who uses them the right way is open up the pool of potential partners to a much higher number than if they were to go out physically searching for a partner. When someone is single, sometimes they can get to the point where they want a partner so bad that they lower their expectations. Dating apps group a bunch of people together who want similar relationships, and this makes it much easier! Just think of the single mothers and fathers with no time to go out and meet someone, without dating apps they may not have the chance to find a genuine relationship the way they were able to before starting a family. \n\nNot only do dating apps make it easier to meet someone, I think that they have made it easier to maintain relationships.\n",
        "source": "api",
        "start_time": 150.0,
        "end_time": 150.0,
        "last_event_time": 150.0,
        "start_progress": 0.3333333333333333,
        "end_progress": 0.36688668866886687
    },
    {
        "text": "How Do You Think Technology Affects Dating?\n\nHave you had any experience with dating? Have you ever used dating apps? If so, what has it been like for you? If not, why not?\n\nHow do you think technology — like apps, Netflix, social media and texting — affects dating and relationships? In your opinion, does it improve or worsen romantic interactions? How so?\n\n---\n\nIn my opinion, technology is a positive effect in dating. I think the addition of dating apps have made it possible for so many more people to find true love who otherwise would not have been able to. What datings app do for someone who uses them the right way is open up the pool of potential partners to a much higher number than if they were to go out physically searching for a partner. When someone is single, sometimes they can get to the point where they want a partner so bad that they lower their expectations. Dating apps group a bunch of people together who want similar relationships, and this makes it much easier! Just think of the single mothers and fathers with no time to go out and meet someone, without dating apps they may not have the chance to find a genuine relationship the way they were able to before starting a family. Plus, not only do dating apps make it easier to meet someone, they have made it easier to maintain relationships. You know from the jump what the other person is looking for, and this allows you to invest more into the relationship from the jump. You are able to be open about your feelings and open about your expectations because you know the other person is also looking for something similar. \n\nI personally have done dating with and without dating apps. I have had three girlfriends just going through high school and college, as it was much easier to meet people this way. When i graduated college, i was not interested in going to bars or parties, so i chose to use a dating app instead of simply waiting for the right person to find me. Although i met some people who i did not think i would be with for a long time, it really increased my perspective in what i wanted in a relationship. Later on, i met my fiance on a dating app whom I hit it off with right away. There is still a degree of luck to a dating app i would say, but probably less than simply being in the right place at the right time to meet people in person. Dating apps to me are just more of a way to get dates, to find your person. I still much rather talk on the app for only a couple of days and then meet in person for an official date. So to me personally, it is not super different. \n\nNow as far as other apps and their effect on relationships, this is either positive or negative depending on how the person themselves use the apps. Technology and apps are simply something that are going to be around, and with any positive comes a negative as you can use and abuse the positive. If the technology is taking away from your personal time with your significant other than it is time to dial it back. If you find yourself on social media when your partner wants you attention, this is a red flag. However, if you are using an app like netflix productively, and enjoying a show with your signficant other and cuddling, this can be a positive. It is all about balance. Anything that is good also needs to be used in balance. So in conclsuion, i personally feel that technology nowadays is a good thing for dating and relationships. I think it has made things easier for so many people. It is the person's decision to decide how they are going to use the app, so in the end whether it is positive or negative is up to every individual themselves.\n",
        "source": "user",
        "start_time": 152.0,
        "end_time": 604.0,
        "last_event_time": 604.0,
        "start_progress": 0.36688668866886687,
        "end_progress": 1.0
    }
]