[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "My dad's ranking is at the bottom of the list.",
        "source": "user"
    },
    {
        "text": "It was hardly surprising, he was not present most of the time when I was growing up, and still today he still has very little relationship with my 2-year old son, Toby.",
        "source": "api"
    },
    {
        "text": "Over the years I tried to spend more time with him but he always found some excuse to avoid spending time with me, especially recently and I am writing this from a hotel room in England, where I am on.",
        "source": "user"
    },
    {
        "text": "I specifically flew here in my hometown to visit him but he just doesn't want to.",
        "source": "api"
    },
    {
        "text": "I asked him what is his reaction about the mug thing and he just said, \"I don't care.",
        "source": "user"
    },
    {
        "text": "\"\n\nI don't know if he means that he doesn't care about the mug, or he doesn't care about being a father.",
        "source": "api"
    },
    {
        "text": "I was very angry about the mug thing but I realize that it wouldn't do any good.",
        "source": "user"
    },
    {
        "text": "My husband's dad also showed up around the bottom of the list, with just a few million separating him from my dad, but his relationship with my husband and with our kid is getting better.",
        "source": "api"
    },
    {
        "text": "I just wish me and my dad is the same.",
        "source": "user"
    },
    {
        "text": "There are so many stories that I want to tell about Toby.",
        "source": "user"
    },
    {
        "text": "Last week, he just started to say \"I love you\" and now he does it 24/7.",
        "source": "user"
    },
    {
        "text": "I was also trying to train him in the potty and after a day he already knows what to do.",
        "source": "api"
    },
    {
        "text": "I wanted to day that he reminds me of his grandpa.",
        "source": "api"
    },
    {
        "text": "But I won't give him that satisfaction.",
        "source": "user"
    },
    {
        "text": "I know for a fact that my father does not even know when Toby's birthday is.",
        "source": "user"
    },
    {
        "text": "I had to call him a week later after Toby was born to give him the news.",
        "source": "api"
    },
    {
        "text": "He wasn't even excited.",
        "source": "user"
    },
    {
        "text": "All he said at the time was, \"Oh, well, that is nice.",
        "source": "user"
    },
    {
        "text": "\"\n\nI will be taking a flight back home tonight.",
        "source": "api"
    }
]