[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You are not sure how to authenticate this note.",
        "source": "api"
    },
    {
        "text": "You don't know if it's real or a prank.",
        "source": "api"
    },
    {
        "text": "But you can't help but feel a sense of duty.",
        "source": "api"
    },
    {
        "text": "You call the number figuring you will be able to tell what is going on once you talk to someone.",
        "source": "user"
    },
    {
        "text": "The phone rings and a voice answers.",
        "source": "api"
    },
    {
        "text": "\"Barack!\" says the voice, \"I'm so glad you called. I'm John F. Kennedy. I'm afraid I'm going to need your help.\" Of course you are shocked as JFK is not aliv.",
        "source": "user"
    },
    {
        "text": "e",
        "source": "user"
    },
    {
        "text": "\"I know this is hard to believe, but I'm not dead.\" the voice assures you.",
        "source": "api"
    },
    {
        "text": "\"I'm alive and well, but I'm in a bit of a bind. I need your help.\"",
        "source": "user"
    },
    {
        "text": "\"What kind of help?\" you ask.",
        "source": "api"
    },
    {
        "text": "\"Well, I'm in a bit of a situation. The thing is I am on Epstein's island. I'm not sure how I got here, but I'm not alone.\"",
        "source": "api"
    },
    {
        "text": "\"Who else is there?\" you ask.",
        "source": "api"
    },
    {
        "text": "\"Well, there's a bunch of other people here. I'm not sure who they are, but I think they are all famous. \nYou tell JFK that this is the most bizarre call you have ever received and you wish he had not called you. You were enjoying your retirement and there is no way you are going to get involved in this. JFK pleads with you to reconsider. You refuse.  You were never sure this was really JFK so  you will assume it was a prank and get back to your summer playlist.",
        "source": "api"
    }
]