[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack.",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": "but pack your bags and call the number below.",
        "source": "api"
    },
    {
        "text": "It's time to start the real job.",
        "source": "api"
    },
    {
        "text": "\" Signed simply, \"JFK.",
        "source": "api"
    },
    {
        "text": "\"\n\nYou look at the letter and figure that you're being pranked.",
        "source": "api"
    },
    {
        "text": "It's signed JFK.",
        "source": "user"
    },
    {
        "text": "That must mean John F.",
        "source": "user"
    },
    {
        "text": "Kennedy.",
        "source": "user"
    },
    {
        "text": "He has been dead for decades.",
        "source": "user"
    },
    {
        "text": "His death is viewable on YouTube.",
        "source": "user"
    },
    {
        "text": "His head was literally exploded into pieces.",
        "source": "user"
    },
    {
        "text": "You go to bed and wake up the next day and your mind can't stop thinking about the letter.",
        "source": "user"
    },
    {
        "text": "You end up calling the number and a voice that sounds exactly like JFK answers.",
        "source": "user"
    },
    {
        "text": "You get nervous and pause for a few seconds before telling the voice on the other line about the letter you received.",
        "source": "user"
    },
    {
        "text": "The other voice explains to you that he actually is John F.",
        "source": "user"
    },
    {
        "text": "Kennedy.",
        "source": "user"
    },
    {
        "text": "He explains that both he and his son had their deaths staged to help escape the famous life.",
        "source": "user"
    },
    {
        "text": "They now live on a secret island that is located in Europe.",
        "source": "user"
    },
    {
        "text": "You ask JFK how he can prove that and he tells you to check your email.",
        "source": "user"
    },
    {
        "text": "In your email there is a video of JFK with his wallet out.",
        "source": "user"
    },
    {
        "text": "He has his old license from the 1960s as well as old family photos.",
        "source": "user"
    },
    {
        "text": "Nobody else could have access to this material.",
        "source": "user"
    },
    {
        "text": "You ask JFK why he sent you the letter and left you his number.",
        "source": "user"
    },
    {
        "text": "He explains that he is trying to start an underground project that will help prevent people like Donald Trump from ever getting elected again.",
        "source": "user"
    },
    {
        "text": "He has a way to rig elections that will help benefit the US people.",
        "source": "user"
    },
    {
        "text": "He feels it's his duty to help put the right people in position to lead the country since he bailed on the US people 50 years ago.",
        "source": "user"
    },
    {
        "text": "You tell JFK that as much as you'd love to see that result, you'd be going against fair and square democracy.",
        "source": "user"
    },
    {
        "text": "You politely decline and tell him you wish him the best in the future.",
        "source": "user"
    },
    {
        "text": "To your surprise, you never end up hearing from JFK ever again.",
        "source": "user"
    },
    {
        "text": "Not by phone call.",
        "source": "user"
    },
    {
        "text": "Not by letter.",
        "source": "user"
    },
    {
        "text": "You live your life normally but you never forget the fact that you know JFK is still alive, and nobody else does.",
        "source": "user"
    }
]