[
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.2442116868798236
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no.\n",
        "source": "api",
        "start_time": 19.0,
        "end_time": 19.0,
        "last_event_time": 19.0,
        "start_progress": 0.2442116868798236,
        "end_progress": 0.3103638368246968
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. \n",
        "source": "user",
        "start_time": 19.0,
        "end_time": 55.0,
        "last_event_time": 55.0,
        "start_progress": 0.3103638368246968,
        "end_progress": 0.3439911797133407
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.\n",
        "source": "api",
        "start_time": 59.0,
        "end_time": 59.0,
        "last_event_time": 59.0,
        "start_progress": 0.3439911797133407,
        "end_progress": 0.3676957001102536
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their \n",
        "source": "user",
        "start_time": 93.0,
        "end_time": 134.0,
        "last_event_time": 134.0,
        "start_progress": 0.3676957001102536,
        "end_progress": 0.41620727673649394
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character.\n",
        "source": "api",
        "start_time": 137.0,
        "end_time": 137.0,
        "last_event_time": 137.0,
        "start_progress": 0.41620727673649394,
        "end_progress": 0.4217199558985667
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish.\n",
        "source": "api",
        "start_time": 200.0,
        "end_time": 200.0,
        "last_event_time": 200.0,
        "start_progress": 0.4217199558985667,
        "end_progress": 0.48511576626240355
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish. But if the person is careful, prepared, and plans well, then they should enjoy the thrills they seek. Another aspect of extreme sports is the competition. How does one outdo their opponent without getting hurt?\n",
        "source": "user",
        "start_time": 201.0,
        "end_time": 267.0,
        "last_event_time": 267.0,
        "start_progress": 0.48511576626240355,
        "end_progress": 0.601433296582139
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish. But if the person is careful, prepared, and plans well, then they should enjoy the thrills they seek. Another aspect of extreme sports is the competition. How does one outdo their opponent without getting hurt? I think that is where the line is drawn.\n",
        "source": "api",
        "start_time": 272.0,
        "end_time": 272.0,
        "last_event_time": 272.0,
        "start_progress": 0.601433296582139,
        "end_progress": 0.6240352811466373
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish. But if the person is careful, prepared, and plans well, then they should enjoy the thrills they seek. Another aspect of extreme sports is the competition. How does one outdo their opponent without getting hurt? I think that is where the line is drawn. There should be no harm done\n",
        "source": "user",
        "start_time": 273.0,
        "end_time": 278.0,
        "last_event_time": 278.0,
        "start_progress": 0.6240352811466373,
        "end_progress": 0.6400220507166483
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish. But if the person is careful, prepared, and plans well, then they should enjoy the thrills they seek. Another aspect of extreme sports is the competition. How does one outdo their opponent without getting hurt? I think that is where the line is drawn. There should be no harm done to the opponent.\n",
        "source": "api",
        "start_time": 282.0,
        "end_time": 282.0,
        "last_event_time": 282.0,
        "start_progress": 0.6400220507166483,
        "end_progress": 0.649393605292172
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish. But if the person is careful, prepared, and plans well, then they should enjoy the thrills they seek. Another aspect of extreme sports is the competition. How does one outdo their opponent without getting hurt? I think that is where the line is drawn. There should be no harm done to the opponent or to yourself. But there should be clear rules that define winning and to define what is allowed in fair play. Furthermore, \n",
        "source": "user",
        "start_time": 283.0,
        "end_time": 313.0,
        "last_event_time": 313.0,
        "start_progress": 0.649393605292172,
        "end_progress": 0.7183020948180816
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish. But if the person is careful, prepared, and plans well, then they should enjoy the thrills they seek. Another aspect of extreme sports is the competition. How does one outdo their opponent without getting hurt? I think that is where the line is drawn. There should be no harm done to the opponent or to yourself. But there should be clear rules that define winning and to define what is allowed in fair play. Furthermore, if you are going to pursue a risky sport, then you should be prepared for the consequences.\n",
        "source": "api",
        "start_time": 319.0,
        "end_time": 319.0,
        "last_event_time": 319.0,
        "start_progress": 0.7183020948180816,
        "end_progress": 0.7684674751929438
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish. But if the person is careful, prepared, and plans well, then they should enjoy the thrills they seek. Another aspect of extreme sports is the competition. How does one outdo their opponent without getting hurt? I think that is where the line is drawn. There should be no harm done to the opponent or to yourself. But there should be clear rules that define winning and to define what is allowed in fair play. Furthermore, if you are going to pursue a risky sport, then you should be prepared for the consequences. I think that with the right planning and the right safety measures, people should\n",
        "source": "user",
        "start_time": 348.0,
        "end_time": 411.0,
        "last_event_time": 411.0,
        "start_progress": 0.7684674751929438,
        "end_progress": 0.8136714443219405
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish. But if the person is careful, prepared, and plans well, then they should enjoy the thrills they seek. Another aspect of extreme sports is the competition. How does one outdo their opponent without getting hurt? I think that is where the line is drawn. There should be no harm done to the opponent or to yourself. But there should be clear rules that define winning and to define what is allowed in fair play. Furthermore, if you are going to pursue a risky sport, then you should be prepared for the consequences. I think that with the right planning and the right safety measures, people should be able to pursue risky sports like extreme mountain climbing.\n",
        "source": "api",
        "start_time": 416.0,
        "end_time": 416.0,
        "last_event_time": 416.0,
        "start_progress": 0.8136714443219405,
        "end_progress": 0.8484013230429989
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish. But if the person is careful, prepared, and plans well, then they should enjoy the thrills they seek. Another aspect of extreme sports is the competition. How does one outdo their opponent without getting hurt? I think that is where the line is drawn. There should be no harm done to the opponent or to yourself. But there should be clear rules that define winning and to define what is allowed in fair play. Furthermore, if you are going to pursue a risky sport, then you should be prepared for the consequences. I think that with the right planning and the right safety measures, people should be able to pursue risky sports they love. It's what makes them unique. In the end, \n",
        "source": "user",
        "start_time": 417.0,
        "end_time": 435.0,
        "last_event_time": 435.0,
        "start_progress": 0.8484013230429989,
        "end_progress": 0.8599779492833517
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish. But if the person is careful, prepared, and plans well, then they should enjoy the thrills they seek. Another aspect of extreme sports is the competition. How does one outdo their opponent without getting hurt? I think that is where the line is drawn. There should be no harm done to the opponent or to yourself. But there should be clear rules that define winning and to define what is allowed in fair play. Furthermore, if you are going to pursue a risky sport, then you should be prepared for the consequences. I think that with the right planning and the right safety measures, people should be able to pursue risky sports they love. It's what makes them unique. In the end, it's all about personal freedom.\n",
        "source": "api",
        "start_time": 448.0,
        "end_time": 448.0,
        "last_event_time": 448.0,
        "start_progress": 0.8599779492833517,
        "end_progress": 0.8776185226019846
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish. But if the person is careful, prepared, and plans well, then they should enjoy the thrills they seek. Another aspect of extreme sports is the competition. How does one outdo their opponent without getting hurt? I think that is where the line is drawn. There should be no harm done to the opponent or to yourself. But there should be clear rules that define winning and to define what is allowed in fair play. Furthermore, if you are going to pursue a risky sport, then you should be prepared for the consequences. I think that with the right planning and the right safety measures, people should be able to pursue risky sports they love. It's what makes them unique. In the end, it's all about personal freedom. Sports are a form of\n",
        "source": "user",
        "start_time": 449.0,
        "end_time": 452.0,
        "last_event_time": 452.0,
        "start_progress": 0.8776185226019846,
        "end_progress": 0.8891951488423374
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish. But if the person is careful, prepared, and plans well, then they should enjoy the thrills they seek. Another aspect of extreme sports is the competition. How does one outdo their opponent without getting hurt? I think that is where the line is drawn. There should be no harm done to the opponent or to yourself. But there should be clear rules that define winning and to define what is allowed in fair play. Furthermore, if you are going to pursue a risky sport, then you should be prepared for the consequences. I think that with the right planning and the right safety measures, people should be able to pursue risky sports they love. It's what makes them unique. In the end, it's all about personal freedom. Sports are a form of entertainment.\n",
        "source": "api",
        "start_time": 455.0,
        "end_time": 455.0,
        "last_event_time": 455.0,
        "start_progress": 0.8891951488423374,
        "end_progress": 0.8974641675854466
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish. But if the person is careful, prepared, and plans well, then they should enjoy the thrills they seek. Another aspect of extreme sports is the competition. How does one outdo their opponent without getting hurt? I think that is where the line is drawn. There should be no harm done to the opponent or to yourself. But there should be clear rules that define winning and to define what is allowed in fair play. Furthermore, if you are going to pursue a risky sport, then you should be prepared for the consequences. I think that with the right planning and the right safety measures, people should be able to pursue risky sports they love. It's what makes them unique. In the end, it's all about personal freedom. Sports are a form of entertainment and a way to challenge yourself.\n",
        "source": "api",
        "start_time": 467.0,
        "end_time": 467.0,
        "last_event_time": 467.0,
        "start_progress": 0.8974641675854466,
        "end_progress": 0.9151047409040793
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish. But if the person is careful, prepared, and plans well, then they should enjoy the thrills they seek. Another aspect of extreme sports is the competition. How does one outdo their opponent without getting hurt? I think that is where the line is drawn. There should be no harm done to the opponent or to yourself. But there should be clear rules that define winning and to define what is allowed in fair play. Furthermore, if you are going to pursue a risky sport, then you should be prepared for the consequences. I think that with the right planning and the right safety measures, people should be able to pursue risky sports they love. It's what makes them unique. In the end, it's all about personal freedom. Sports are a form of entertainment and a way to challenge yourself. As long as\n",
        "source": "user",
        "start_time": 469.0,
        "end_time": 472.0,
        "last_event_time": 472.0,
        "start_progress": 0.9151047409040793,
        "end_progress": 0.9211686879823594
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish. But if the person is careful, prepared, and plans well, then they should enjoy the thrills they seek. Another aspect of extreme sports is the competition. How does one outdo their opponent without getting hurt? I think that is where the line is drawn. There should be no harm done to the opponent or to yourself. But there should be clear rules that define winning and to define what is allowed in fair play. Furthermore, if you are going to pursue a risky sport, then you should be prepared for the consequences. I think that with the right planning and the right safety measures, people should be able to pursue risky sports they love. It's what makes them unique. In the end, it's all about personal freedom. Sports are a form of entertainment and a way to challenge yourself. As long as you are not hurting yourself or others, then you should be able to do what you want.\n",
        "source": "api",
        "start_time": 500.0,
        "end_time": 500.0,
        "last_event_time": 500.0,
        "start_progress": 0.9211686879823594,
        "end_progress": 0.9680264608599779
    },
    {
        "text": "Is It Selfish to Pursue Risky Sports Like Extreme Mountain Climbing?\n\nSome sports, like extreme mountain climbing, are dangerous. Since there are varying degrees of risk in most, if not all, sports (such as the possibility of concussions, broken bones and even death), how does one decide where the line might be drawn between what is reasonable and what is not? Are some sports simply too dangerous to be called a sport?\n\n---\n\nIn my opinion, the answer to the question of whether or not it is selfish to pursue risky sports like extreme mountain climbing is no. Participating in sports or any hobby is a personal freedom. If you want to climb mountains, then do it.  I think the manner in which a person goes about extreme sports says a lot about their character. For example, if a person is reckless and does not take the proper safety precautions, then they are being selfish. But if the person is careful, prepared, and plans well, then they should enjoy the thrills they seek. Another aspect of extreme sports is the competition. How does one outdo their opponent without getting hurt? I think that is where the line is drawn. There should be no harm done to the opponent or to yourself. But there should be clear rules that define winning and to define what is allowed in fair play. Furthermore, if you are going to pursue a risky sport, then you should be prepared for the consequences. I think that with the right planning and the right safety measures, people should be able to pursue risky sports they love. It's what makes them unique. In the end, it's all about personal freedom. Sports are a form of entertainment and a way to challenge yourself. As long as you are not hurting yourself or others, then you should be able to do what you want.  Sports are meant to be enjoyed, and if you're good, won.\n",
        "source": "user",
        "start_time": 517.0,
        "end_time": 560.0,
        "last_event_time": 560.0,
        "start_progress": 0.9680264608599779,
        "end_progress": 1.0
    }
]