[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "Matt Damon has been gone for 3 years now.",
        "source": "user"
    },
    {
        "text": "His wife, Luciana Damon, is almost ready to move on with another man.",
        "source": "api"
    },
    {
        "text": "In fact, after last week's briefing with the military, Luciana is seen with Mr.",
        "source": "api"
    },
    {
        "text": "Vaughn, one of the five special candidates hand picked by the military to be a replacement husband.",
        "source": "user"
    },
    {
        "text": "They were seen holding hands that day.",
        "source": "api"
    },
    {
        "text": "Even if Matt Damon's disappearance and the known culprit being the aliens, the media and social media influencers are more interested with the new couple.",
        "source": "user"
    },
    {
        "text": "On Wednesday, a famous TikToker with the name of kitty_nator, after seeing the couple, commented: \"Luciana's new man is literally as hot as Matt Damon.",
        "source": "user"
    },
    {
        "text": "Probably as hot when Matt Damon is in his early 20's.",
        "source": "api"
    },
    {
        "text": "I dig it.",
        "source": "user"
    },
    {
        "text": "\" Mr.",
        "source": "user"
    },
    {
        "text": "Vaughn, a 24 year old man from Richmond, Virginia, is a very handsome man.",
        "source": "user"
    },
    {
        "text": "He met Luciana Damon a year after Matt Damon was kidnapped.",
        "source": "api"
    },
    {
        "text": "Luciana said that Mr.",
        "source": "user"
    },
    {
        "text": "Vaughn was very kind to her and helped her cope with Matt's absence.",
        "source": "user"
    },
    {
        "text": "\"Mr.",
        "source": "api"
    },
    {
        "text": "Vaughn was very supportive when Matt went missing.",
        "source": "api"
    },
    {
        "text": "And he's also very handsome.",
        "source": "api"
    },
    {
        "text": "\" said Luciana in an interview.",
        "source": "api"
    },
    {
        "text": "But not all is good and bright with this Mr.",
        "source": "user"
    },
    {
        "text": "Vaughn person.",
        "source": "user"
    },
    {
        "text": "Little is known about his past and his parents are also not in the picture.",
        "source": "user"
    },
    {
        "text": "\"Where did he come from?",
        "source": "user"
    },
    {
        "text": "I mean, his parents are nowhere to be found.",
        "source": "user"
    },
    {
        "text": "\" said K.",
        "source": "api"
    },
    {
        "text": "Parker, a social media influencer with over 100K followers.",
        "source": "api"
    },
    {
        "text": "A conspiracy theorist YouTuber with the name of the_real_truthdog said that there are many things about Mr.",
        "source": "api"
    },
    {
        "text": "Vaughn that cannot be explained: \"I did a quick research about this man and found almost completely nothing.",
        "source": "api"
    },
    {
        "text": "\" He later added, \"There's a 99% chance that Mr.",
        "source": "user"
    },
    {
        "text": "Vaughn is an alien.",
        "source": "api"
    },
    {
        "text": "\" \n\nNews reports of Mr.",
        "source": "api"
    },
    {
        "text": "Vaughns blinking was also put into question.",
        "source": "api"
    },
    {
        "text": "\"Sure, he's handsome, but look at the way he blinks.",
        "source": "user"
    },
    {
        "text": "It's almost as if he has an extra eyelid.",
        "source": "user"
    },
    {
        "text": "\" said K.",
        "source": "user"
    },
    {
        "text": "Parker in a YouTube video, which was later removed after being flagged by the government and deemed as \"fake news\".",
        "source": "api"
    },
    {
        "text": "As reporters grilled Mr.",
        "source": "api"
    },
    {
        "text": "Vaughn about this, he just simply rejected the fact and mentioned that he doesn't have any extra eyelid.",
        "source": "api"
    },
    {
        "text": "\"It's all a glitch in the video.",
        "source": "user"
    },
    {
        "text": "\"\n\nMr.",
        "source": "api"
    },
    {
        "text": "Vaughn declined to further comment when we tried to contact him about the matter, and the person who contacted him is now reported missing.",
        "source": "user"
    }
]