[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "The #1 Dad mug was manufactured in a factory under special conditions and blessed by the Pope.",
        "source": "user"
    },
    {
        "text": "The mug is being kept safely in a special vault until Father's Day.",
        "source": "user"
    },
    {
        "text": "Every year, people try to steal the mug, but are unsuccessful in their efforts.",
        "source": "user"
    },
    {
        "text": "This year, it is rumored that the mug has a special power to it.",
        "source": "user"
    },
    {
        "text": "The mug is so powerful that it will destroy the whole earth if it's put in the wrong hands.",
        "source": "user"
    },
    {
        "text": "The night before Father's Day, something terrible happens.",
        "source": "user"
    },
    {
        "text": "Someone breaks into the vault and steals the mug!",
        "source": "user"
    },
    {
        "text": "The person that stole the mug is unaware of its special powers.",
        "source": "user"
    },
    {
        "text": "They take the mug with them and use it to drink their morning coffee.",
        "source": "user"
    },
    {
        "text": "That morning there is a press conference.",
        "source": "user"
    },
    {
        "text": "The police announce that the mug has been stolen and that the thief must be stopped before it's too late.",
        "source": "user"
    },
    {
        "text": "One reporter raises their hand to ask a question.",
        "source": "user"
    },
    {
        "text": "\"I heard that the mug has special powers. Is this true?\" The police officer pauses and responds.",
        "source": "user"
    },
    {
        "text": "\"It's true. The mug has powers. Anyone that drinks from this mug can easily...um...impregnate any woman in a 5-yard radius.\"",
        "source": "user"
    },
    {
        "text": "All of the reporters start yelling, \"What! Why on earth would anyone make a mug like that?\"",
        "source": "api"
    },
    {
        "text": "The officer responded.",
        "source": "user"
    },
    {
        "text": "\"Well you see, it was for someone in particular that wasn't able to have kids of their own. This was sort of an experiment.\"",
        "source": "user"
    },
    {
        "text": "The reporters are still in shock about the mug's special powers.",
        "source": "api"
    },
    {
        "text": "Just then, there was a loud sound coming from the sky.",
        "source": "user"
    },
    {
        "text": "The reporters looked up and saw a man flying towards them.",
        "source": "user"
    },
    {
        "text": "In a flash, he crash landed on the stage next to the officer.",
        "source": "user"
    },
    {
        "text": "It was Santa Claus.",
        "source": "user"
    },
    {
        "text": "He was wet, dirty, and tired.",
        "source": "user"
    },
    {
        "text": "He had just arrived from the North Pole.",
        "source": "user"
    },
    {
        "text": "He brushed the dirt off his pants, straightened his jacket, and stood up straight.",
        "source": "user"
    },
    {
        "text": "\"So, I heard you have some kind of an award for me?\"",
        "source": "user"
    }
]