[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?",
        "source": "api"
    },
    {
        "text": "\"\n\nI'm shocked and don't know what to do.",
        "source": "api"
    },
    {
        "text": "Did the bee really just talk?",
        "source": "user"
    },
    {
        "text": "I asked the bee why it called me that.",
        "source": "user"
    },
    {
        "text": "\"Sir, you are the king of the bees.",
        "source": "user"
    },
    {
        "text": "We've been trying to contact you since you were a child\"\n\nI can't believe what I've heard.",
        "source": "user"
    },
    {
        "text": "I'm a King.",
        "source": "user"
    },
    {
        "text": "A king of the bees!",
        "source": "user"
    },
    {
        "text": "I'm going to be the best bee King there ever was!",
        "source": "user"
    },
    {
        "text": "Just then, my mother approaches and see what is happening.",
        "source": "api"
    },
    {
        "text": "She immediately lunges toward the bee in an attempt to kill it.",
        "source": "user"
    },
    {
        "text": "I stop her and confront her about what is happening.",
        "source": "user"
    },
    {
        "text": "She tells me that I'm not a bee, I'm a human.",
        "source": "user"
    },
    {
        "text": "I look between her and the bee, trying to understand who I should trust.",
        "source": "api"
    },
    {
        "text": "The bee then asks me to follow him and he'll prove my destiny to me.",
        "source": "user"
    },
    {
        "text": "With my mother in tears, I follow the bee.",
        "source": "user"
    },
    {
        "text": "He leads me to the hive, where I see thousands of bees working together to create a beautiful home.",
        "source": "user"
    },
    {
        "text": "It's a home bigger than my own!",
        "source": "api"
    },
    {
        "text": "I step inside and see there is even furniture that they had created.",
        "source": "user"
    },
    {
        "text": "I sit down in a chair and look around, unable to believe what is happening.",
        "source": "user"
    },
    {
        "text": "The bee then comes up to me and whispers into my ear.",
        "source": "user"
    },
    {
        "text": "\"Your Majesty, we have been waiting for you for so long.",
        "source": "user"
    },
    {
        "text": "\"\n\n\"Why have you been waiting for me?",
        "source": "api"
    },
    {
        "text": "What can I do to help you?",
        "source": "user"
    },
    {
        "text": "\" I asked.",
        "source": "user"
    },
    {
        "text": "\"We need you to lead us.",
        "source": "user"
    },
    {
        "text": "\" the bee said.",
        "source": "user"
    },
    {
        "text": "I felt a sense of pride.",
        "source": "api"
    },
    {
        "text": "That quickly turned to fear though as I watched the bees begin to cover the front door.",
        "source": "user"
    },
    {
        "text": "They then begin to construct restraints, holding me in place.",
        "source": "user"
    },
    {
        "text": "\"We can't have you leaving us ever again\" said the bee.",
        "source": "user"
    },
    {
        "text": "I was now stuck forever in this chair.",
        "source": "user"
    },
    {
        "text": "I looked out the window and briefly saw my mom outside, still crying.",
        "source": "user"
    },
    {
        "text": "The window was then covered as well, leaving me completely alone as the King of the bees.",
        "source": "user"
    }
]