[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
        "source": "api"
    },
    {
        "text": "One day, Matilda notices that her dating app is frozen.",
        "source": "api"
    },
    {
        "text": "She just broke it off with Manny, he was just too needy.",
        "source": "user"
    },
    {
        "text": "She decided to try to find someone else, so her app is her go to.",
        "source": "user"
    },
    {
        "text": "She can't use it though.",
        "source": "user"
    },
    {
        "text": "Something's wrong with the site.",
        "source": "user"
    },
    {
        "text": "She looks closer, checking the settings, then researching the site more fully.",
        "source": "user"
    },
    {
        "text": "It seems that she has used up her quota of men.",
        "source": "user"
    },
    {
        "text": "She's just gone through too many and has to up her tier to get to the next grouping of eligible bachelors.",
        "source": "user"
    },
    {
        "text": "So, she gets out her credit card, logs on and upgrades.",
        "source": "user"
    },
    {
        "text": "This is where things get interesting for Matilda.",
        "source": "user"
    },
    {
        "text": "She notices that none of the pictures are familiar.",
        "source": "user"
    },
    {
        "text": "She feels somethings wrong so she logs off the site.",
        "source": "user"
    },
    {
        "text": "Setting down the device.",
        "source": "user"
    },
    {
        "text": "Now she's thinking.",
        "source": "user"
    },
    {
        "text": "What is going on.",
        "source": "user"
    },
    {
        "text": "Matilda calls Chris her gay friend.",
        "source": "user"
    },
    {
        "text": "He's usually handy with these things.",
        "source": "user"
    },
    {
        "text": "They set up a time in an hour to meet for coffee.",
        "source": "user"
    },
    {
        "text": "She shows up at Carabou, their haunt.",
        "source": "user"
    },
    {
        "text": "She notices, when entering, someone is looking at her, intently looking at her.",
        "source": "user"
    },
    {
        "text": "She ignores this, and slides in beside chris at a small table.",
        "source": "user"
    },
    {
        "text": "She whispers; do you see that guy over there, look over my shoulder?",
        "source": "user"
    },
    {
        "text": "Chris answers yes, he's cute.",
        "source": "user"
    },
    {
        "text": "Chris encourages her to slide over and say hello.",
        "source": "user"
    },
    {
        "text": "She's nervous to do this but she does it anyway, since her app is on the blink and has some new parameters, she figures she'd give it a shot.",
        "source": "user"
    },
    {
        "text": "So, she smiles, walks over and says, \"Hi I'm Matilda\".",
        "source": "user"
    },
    {
        "text": "He says, Hi, I'm Mitch, I'm your soulmate.",
        "source": "user"
    },
    {
        "text": "She giggles, looking away, glances over at Chris, who is nearby.",
        "source": "user"
    },
    {
        "text": "She says, \"How do you know that\".",
        "source": "user"
    },
    {
        "text": "Mitch replies; I'm a shape shifter and I've been dating you for 2 years.",
        "source": "user"
    },
    {
        "text": "She freezes, literally freezes.",
        "source": "user"
    },
    {
        "text": "She then says, NO that's not a real thing.",
        "source": "user"
    },
    {
        "text": "Mitch says, watch my hand - she stares down at it, watching as it morphs into a rugged fisherman's hand, then slowly back into his original one.",
        "source": "user"
    },
    {
        "text": "Her eyes are open wide.",
        "source": "user"
    },
    {
        "text": "Chris then says, \"Now do you believe me? She nods yes.\n\nShe runs out of the shop, wide eyed, quick and behind her, Chris is trotting, trying to catch up.  Finally after several minutes he does. She is gasping for breath. Pale, shaking, and upset, Chris calms her. She tells him what happened. Next she proclaims that her dating days are over. NO MORE. She can't risk it, knowing nothing about Mitch or whatever his real name is, fearful, and worried. She throws away her cell phone, opts for a flip, and stays away from dating. Never again going out with a man.\n\nShe actually becomes a Nun, swearing away all men, taking a vow of chastity, and focusing on the Religious and spiritual side of life. Having seen something so scary, she must dedicate her life now, only to helping others.",
        "source": "user"
    }
]