[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "You are a young man who has just died in a car accident.",
        "source": "user"
    },
    {
        "text": "You find out that you are in a cinema with a number of other people who look like you.",
        "source": "user"
    },
    {
        "text": "You soon find out that you are all your previous reincarnations, and you all begin watching your next life on the big screen.",
        "source": "user"
    },
    {
        "text": "The reincarnations all await in suspense of the revealed characteristics of the next reincarnation.",
        "source": "user"
    },
    {
        "text": "Could our family be rich?",
        "source": "user"
    },
    {
        "text": "Would we have pets?",
        "source": "user"
    },
    {
        "text": "Are we going to have great parents who are supportive and we love?",
        "source": "user"
    },
    {
        "text": "Or maybe its on the other spectrum.",
        "source": "user"
    },
    {
        "text": "Maybe our parents are not good parents, or maybe we dont even have parents.",
        "source": "user"
    },
    {
        "text": "Maybe we grow up in a dangerous neighborhood, or in a dangerous country.",
        "source": "user"
    },
    {
        "text": "I sit there and await just as the other me's are awaiting.",
        "source": "user"
    },
    {
        "text": "Its weird.",
        "source": "user"
    },
    {
        "text": "visially these all seem like different people standing here with me, however our thoughts are interconnected in a weird way that i can not explain at this point in time.",
        "source": "user"
    },
    {
        "text": "Im pretty sure we are all separate, but i am pretty sure also that we are all linked in someway.",
        "source": "user"
    },
    {
        "text": "I want to know which way though, and i want to know whether this reincarnation is something that we all experience, or just some of us.",
        "source": "user"
    },
    {
        "text": "Am i going to be this reincarnation in first person?",
        "source": "user"
    },
    {
        "text": "Which of these reincarnations will have total control?",
        "source": "user"
    },
    {
        "text": "I am just so confused i feel like i am in a mental institution.",
        "source": "user"
    },
    {
        "text": "I remember the car crash but i dont remember what happened after.",
        "source": "user"
    },
    {
        "text": "I just know that now i am here and here I am.",
        "source": "user"
    },
    {
        "text": "All of a sudden the car that i was in before my death flashes on the screen in front of all the reincarnations.",
        "source": "user"
    },
    {
        "text": "The crash itself is played on video.",
        "source": "user"
    },
    {
        "text": "I am seen being destroyed in the car, and my soul leaves my body.",
        "source": "user"
    },
    {
        "text": "The faces of my family and friends are all visible on the screen, and my body itself is even shown.",
        "source": "user"
    },
    {
        "text": "An image of my soul is depicted as it vanishes into thin air.",
        "source": "user"
    },
    {
        "text": "My reincarnations continue to await in suspense, and I assume that the next reincarnation will appear next.",
        "source": "user"
    },
    {
        "text": "I wonder about what if there is no other reincarnation, what if i was the last one?",
        "source": "user"
    },
    {
        "text": "What will happen to all of me, or us?",
        "source": "user"
    },
    {
        "text": "Will we just be stuck here in this cinema forever?",
        "source": "user"
    },
    {
        "text": "Will we just dissapear?",
        "source": "user"
    },
    {
        "text": "Will we just die?",
        "source": "user"
    },
    {
        "text": "I have so many questions, and no answers.",
        "source": "user"
    },
    {
        "text": "Maybe this is the end that nobody knows about.",
        "source": "user"
    },
    {
        "text": "Maybe my thoughts are the only thing that will live on forever.",
        "source": "user"
    }
]