[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
        "source": "api"
    },
    {
        "text": "One day, Helena meets a man who seems perfect for her, but she can’t stop thinking about her last date.",
        "source": "api"
    },
    {
        "text": "She wonders if she has a problem.",
        "source": "user"
    },
    {
        "text": "\"Is it me?\" She asks herself.",
        "source": "user"
    },
    {
        "text": "She is unsure about people.",
        "source": "user"
    },
    {
        "text": "Nobody seems right for her.",
        "source": "user"
    },
    {
        "text": "Then, one day, she meets a man who seems perfect for her.",
        "source": "user"
    },
    {
        "text": "But eventually, she finds something wrong with him.",
        "source": "user"
    },
    {
        "text": "She can’t stop wondering if it’s her.",
        "source": "user"
    },
    {
        "text": "She wonders if she’s the problem.",
        "source": "user"
    },
    {
        "text": "Helena realizes she is going to have to put her life on pause and step back to figure out what’s wrong.",
        "source": "user"
    },
    {
        "text": "If she can’t fix herself, how will she find the right man for her?",
        "source": "user"
    },
    {
        "text": "As Helena looks back on her relationships, she realizes that there is a pattern to her problem.",
        "source": "api"
    },
    {
        "text": "She says to herself, \"Oh my goodness. I am dating the same guy over and over again.” Suddenly, she has the key to her problem. She can see it so clearly. She realizes that the problem is her. She has a fear of trusting her heart and letting another person in. She’s afraid that he will hurt her and not love her back like she loves him.\n\nHelena realizes it’s time for her to open herself up and trust again. She has to let a man in emotionally and, for the first time, be vulnerable. She has to learn to love herself before she can let anyone else in and be happy.\n\nHelena thinks, \"I have been so scared that I’m going to get hurt.",
        "source": "api"
    },
    {
        "text": "I am afraid to let myself feel.",
        "source": "api"
    },
    {
        "text": "It’s time to wake up and let someone love me the way I love them.",
        "source": "api"
    },
    {
        "text": "I’ve got to be strong and brave.\"",
        "source": "api"
    },
    {
        "text": "\"",
        "source": "user"
    },
    {
        "text": "Helena resolves to give her next date a fair chance.",
        "source": "user"
    },
    {
        "text": "She will allow herself to love.",
        "source": "user"
    },
    {
        "text": "She meets a handsome man, Ben, at a coffee shop.",
        "source": "user"
    },
    {
        "text": "Her newfound resolve empowers her, and they hit it off.",
        "source": "user"
    },
    {
        "text": "She feels a weird energy.",
        "source": "user"
    },
    {
        "text": "Over the next months, Ben and Helena do everything together.",
        "source": "user"
    },
    {
        "text": "He is unaware that it is she, not him, who has changed.",
        "source": "user"
    },
    {
        "text": "He is happy that he has changed for her, and she is happy she has changed for him.",
        "source": "user"
    },
    {
        "text": "She lets her guard down and feels the first stirrings of a love she never thought possible.",
        "source": "user"
    },
    {
        "text": "As Helena feels love again, she knows she has finally found someone to trust and be vulnerable with.",
        "source": "api"
    },
    {
        "text": "As she allows her heart to open, she is filled with hope and excited for what the future holds.",
        "source": "api"
    },
    {
        "text": "She knows she has finally found the right man to love and be loved by.",
        "source": "api"
    },
    {
        "text": "The end.",
        "source": "user"
    }
]