[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "The alien has been keeping Damon in a cage and using him as a test subject for experiments.",
        "source": "api"
    },
    {
        "text": "The US government is doing their best to get Damon back home but the problem is they don't know where he is.",
        "source": "user"
    },
    {
        "text": "They just know that he's no longer on planet Earth.",
        "source": "user"
    },
    {
        "text": "The alien brought Damon back to it's home planet.",
        "source": "user"
    },
    {
        "text": "The alien has been using Damon for experiments, trying to figure out how the human body works.",
        "source": "api"
    },
    {
        "text": "The aliens want to know what the biggest weakness of the human body is.",
        "source": "user"
    },
    {
        "text": "They want to take over the world.",
        "source": "user"
    },
    {
        "text": "The alien is also trying to figure out how to clone Damon.",
        "source": "user"
    },
    {
        "text": "The more humans they can clone, the more humans they can control.",
        "source": "user"
    },
    {
        "text": "The alien is basically creating a human militia that he and his planet can use against the United States.",
        "source": "user"
    },
    {
        "text": "After tons of research the United States government figures out where Damon is being kept.",
        "source": "user"
    },
    {
        "text": "The only issue is that they have no way to get to the alien's planet.",
        "source": "user"
    },
    {
        "text": "No human is brave enough to go on a rescue mission for Matt Damon.",
        "source": "user"
    },
    {
        "text": "The United States government decides to send a robot to the alien's planet to rescue Matt Damon.",
        "source": "api"
    },
    {
        "text": "The robot is equipped with weapons to take down the alien.",
        "source": "user"
    },
    {
        "text": "The robot lands on the alien's planet and is immediately attacked by the alien.",
        "source": "api"
    },
    {
        "text": "The alien sprays goo at the robot which turns off his movement.",
        "source": "user"
    },
    {
        "text": "What the alien didn't realize however is that the robot still could move it's arms.",
        "source": "user"
    },
    {
        "text": "The robot grabbed a gun from it's holster and shot the alien with a lightning bolt.",
        "source": "user"
    },
    {
        "text": "The alien fell to the ground and perished.",
        "source": "user"
    },
    {
        "text": "The only issue was how was the robot supposed to get to Damon without the ability to move.",
        "source": "user"
    },
    {
        "text": "Damon thought on his feet and went up to the robot.",
        "source": "user"
    },
    {
        "text": "He hit the reset button and when the robot booted back up Damon was able to program it and communicate with it.",
        "source": "user"
    },
    {
        "text": "Luckily for Damon, the robot understood what he was saying and was able to rescue Damon and get back in contact with the government.",
        "source": "user"
    },
    {
        "text": "The US government sent a rocket to them and they were able to get home safe and sound.",
        "source": "user"
    }
]