[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "\"Another unsuccessful date\", Bill thought to himself.",
        "source": "api"
    },
    {
        "text": "\"Maybe it is my hair?",
        "source": "user"
    },
    {
        "text": "Or maybe it is my nose.",
        "source": "user"
    },
    {
        "text": "I might try to increase my height a few more inches next time.",
        "source": "user"
    },
    {
        "text": "\"  Bill was a shapeshifter.",
        "source": "user"
    },
    {
        "text": "He was a relatively young shapeshifter who is looking for love.",
        "source": "user"
    },
    {
        "text": "He was a bit of a romantic, and he was always looking for the perfect woman.",
        "source": "user"
    },
    {
        "text": "He thinks he has found his perfect woman in Sarah.",
        "source": "api"
    },
    {
        "text": "When shapeshifters are born, they look like regular humans.",
        "source": "user"
    },
    {
        "text": "They develop like regular humans until they 20th birthday.",
        "source": "user"
    },
    {
        "text": "That is when they get the ability to shapeshift.",
        "source": "user"
    },
    {
        "text": "They can change their physical appearance at will.",
        "source": "user"
    },
    {
        "text": "Bill is now 20 years and 6 months old.",
        "source": "api"
    },
    {
        "text": "He doesn't even have a year of experience shapeshifting so everything is new to him.",
        "source": "user"
    },
    {
        "text": "He encountered an older shapeshifter early this year named Ted.",
        "source": "user"
    },
    {
        "text": "Once shapeshifters turn 20, they also develop the ability to sense another shapeshifter.",
        "source": "user"
    },
    {
        "text": "Ted has been trying to guide Bill on his shapeshifting journey.",
        "source": "user"
    },
    {
        "text": "Bill has been very receptive to Ted's guidance.",
        "source": "user"
    },
    {
        "text": "Bill decided to bring up Sarah to Ted.",
        "source": "api"
    },
    {
        "text": "When Bill told Ted about his different attempts to woo Sarah, he abruptly stopped Bill.",
        "source": "user"
    },
    {
        "text": "He warned him that he is toying with Sarah by changing into different forms.",
        "source": "user"
    },
    {
        "text": "He also told Bill that he is focusing on the wrong things.",
        "source": "user"
    },
    {
        "text": "\"You are focusing on what you look like instead of focusing on how you are acting\", Ted said.",
        "source": "user"
    },
    {
        "text": "\"In all of your different attempts, Sarah never liked how you behaved.",
        "source": "user"
    },
    {
        "text": "I think you need to take that as a hint and move on\", Ted said.",
        "source": "user"
    },
    {
        "text": "Bill thought to himself,  \"I think Ted is right.",
        "source": "user"
    },
    {
        "text": "I think it is a bit creepy how I have interacted with Sarah.",
        "source": "user"
    },
    {
        "text": "She obviously doesn't like me.",
        "source": "user"
    },
    {
        "text": "It is time to just move on.",
        "source": "user"
    },
    {
        "text": "\"\n\nBill gave Ted a hug and thanked him.",
        "source": "user"
    },
    {
        "text": "\"You have helped out a lot in so many different ways\", Ted said.",
        "source": "user"
    },
    {
        "text": "Bill walked home and felt a little better about his life.",
        "source": "user"
    },
    {
        "text": "He was on the road to being a good shapeshifter and a good person.",
        "source": "user"
    }
]