[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. The alien is now in the process of trying to figure out what to do with him.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 33.0,
        "last_event_time": 33.0,
        "start_progress": 0,
        "end_progress": 0.09449929478138223
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. The alien is now in the process of trying to figure out what to do with him.  He spends the next week thinking about it, and getting to know Matt in the process.  He finds that he enjoys his company.  Surprisingly, Matt likes the alien, Blark, quite a bit too.  So much, in fact, that he wants to help him get out of the mess he made by kidnapping him.\n\n",
        "source": "user",
        "start_time": 36.0,
        "end_time": 119.0,
        "last_event_time": 119.0,
        "start_progress": 0.09449929478138223,
        "end_progress": 0.22472966619652093
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. The alien is now in the process of trying to figure out what to do with him.  He spends the next week thinking about it, and getting to know Matt in the process.  He finds that he enjoys his company.  Surprisingly, Matt likes the alien, Blark, quite a bit too.  So much, in fact, that he wants to help him get out of the mess he made by kidnapping him.\n\nThis is a story about an alien and a human who are friends, and who are trying to figure out how to make it work.\n",
        "source": "api",
        "start_time": 131.0,
        "end_time": 131.0,
        "last_event_time": 131.0,
        "start_progress": 0.22472966619652093,
        "end_progress": 0.27832628114715563
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. The alien is now in the process of trying to figure out what to do with him.  He spends the next week thinking about it, and getting to know Matt in the process.  He finds that he enjoys his company.  Surprisingly, Matt likes the alien, Blark, quite a bit too.  So much, in fact, that he wants to help him get out of the mess he made by kidnapping him.\n\nMatt comes up with a plan.  He will write a story and tell people on Earth that he and Blark are working together.  This will be a story about an alien and a human who are friends, and who are trying to figure out how to make it work.  And it won't just be a story, it will be a screenplay.  Blark, knowing that he has dug a deep hole for himself, agrees.  It will turn the situation from a kidnapping to a creative partnership.\n",
        "source": "user",
        "start_time": 133.0,
        "end_time": 222.0,
        "last_event_time": 222.0,
        "start_progress": 0.27832628114715563,
        "end_progress": 0.42642219087917255
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. The alien is now in the process of trying to figure out what to do with him.  He spends the next week thinking about it, and getting to know Matt in the process.  He finds that he enjoys his company.  Surprisingly, Matt likes the alien, Blark, quite a bit too.  So much, in fact, that he wants to help him get out of the mess he made by kidnapping him.\n\nMatt comes up with a plan.  He will write a story and tell people on Earth that he and Blark are working together.  This will be a story about an alien and a human who are friends, and who are trying to figure out how to make it work.  And it won't just be a story, it will be a screenplay.  Blark, knowing that he has dug a deep hole for himself, agrees.  It will turn the situation from a kidnapping to a creative partnership.  He will be able to explain to his people that he is not a kidnapper, but a writer.\n",
        "source": "api",
        "start_time": 236.0,
        "end_time": 236.0,
        "last_event_time": 236.0,
        "start_progress": 0.42642219087917255,
        "end_progress": 0.46591443347437705
    },
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing. The alien is now in the process of trying to figure out what to do with him.  He spends the next week thinking about it, and getting to know Matt in the process.  He finds that he enjoys his company.  Surprisingly, Matt likes the alien, Blark, quite a bit too.  So much, in fact, that he wants to help him get out of the mess he made by kidnapping him.\n\nMatt comes up with a plan.  He will write a story and tell people on Earth that he and Blark are working together.  This will be a story about an alien and a human who are friends, and who are trying to figure out how to make it work.  And it won't just be a story, it will be a screenplay.  Blark, knowing that he has dug a deep hole for himself, agrees.  It will turn the situation from a kidnapping to a creative partnership.  He will be able to explain to his people and Earthlings that he is not a kidnapper, but a writer.\n\nHe and Matt send the message to Earth and to Blark's home planet QQon,of their partnership.  They spend the next six months collaborating, then Matt goes back to Earth to make the movie.  Blark goes back home, too.  He and Matt keep in touch and when the movie premiers a year later, Blark is invited.  He stands side by side with Matt to tremendous applause.  The movie is a hit!  Blark stays in Matt's guesthouse the next few months and learns about Earth life, which he enjoys very much.  The the movie starts being nominated for and subsequently winning awards.  Blark and Matt attend and accept the awards together.  After awards season, Blark goes back home but he and Matt plan to meet up again in a few months on Blark's home planet to work on a new screenplay together.  Of course Blark will have to come to Earth to pick Matt up, as Earthlings have not figured out interstellar travel quite yet.  The two miss each other over those months and when Blark comes back to Earth to pick Matt up, he finds him waiting with his bags packed.  They know that working together they can enjoy more success in the future.\n",
        "source": "user",
        "start_time": 245.0,
        "end_time": 611.0,
        "last_event_time": 611.0,
        "start_progress": 0.46591443347437705,
        "end_progress": 1.0
    }
]