[
    "When you die, you appear in a cinema with a number of other people who look like you.",
    "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
    "You talk to the others and share theories on what this new life will be like.",
    "Most of the reincarnations are quite happy to be there, but some seem to be a little more fidgety.",
    "They want to be on that screen and living life over again.",
    "The ones who are happy to be there gladly share their opinions on the situation.",
    "They think the new you will have learned a few things and through instinct will know what mistakes to avoid.",
    "These ideas are thrown around until the new life begins on the screen.",
    "Everyone begins watching.",
    "You start out as a child, living in a loving family.",
    "It's nothing especially unique.",
    "You then go to school and go through puberty.",
    "You meet friends and have the typical teenage life.",
    "Just as you are getting to the climax of your teenage life, the movie stops.",
    "Everyone is curious what is going on.",
    "Some who have seen countless new reincarnations say that this has never happened.",
    "They say that the movie always continues on until your death.",
    "A voice then comes on over a speaker.",
    "It says that this is a new modern take on reincarnation.",
    "We will be voting on what happens next in this life.",
    "The majority vote will dictate what the person does.",
    "The current reincarnation will have no control over how the next moments of their life will be.",
    "Everyone votes and then watch their actions unfold on the screen.",
    "This continues and it quickly becomes clear that this new you is going to be just a play thing to have fun with.",
    "This at first is fun for most of the people until it grows old and gets sick.",
    "On its death bed, everyone realizes something.",
    "They will now have an angry person here with them forever because of what they have done.",
    "They then all regret what they have done.",
    "In a panic they decide to make a pact with the devil as the new you, sending his soul to hell.",
    "As a group, they never speak of this again as the new you appears on the screen with their new life.",
    ""
]