[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.\"",
        "source": "api"
    },
    {
        "text": "Choosing depleted uranium wasn't 92's first choice of building material, nor his second, or even his third.",
        "source": "user"
    },
    {
        "text": "But, after realizing that this was a material that none of his other sibling would use, he accepted this as a challenge.",
        "source": "user"
    },
    {
        "text": "For generations, Wolf has been the enemy to the pigs and their mother.",
        "source": "user"
    },
    {
        "text": "But after meeting 60 or 70 pigs, Wolf realized he could learn from their determination.",
        "source": "user"
    },
    {
        "text": "Maybe he could even help them from the past mistakes of their elders.",
        "source": "user"
    },
    {
        "text": "He could use his knowledge to meet their needs, and make a mutually beneficial deal.",
        "source": "user"
    },
    {
        "text": "The wolf started to teach the pigs how to be shrewd business people and one of those lessons came in the form of a town who had shut down its nuclear power plant decades ago.",
        "source": "user"
    },
    {
        "text": "To be fair, the house itself isn't built out of the uranium itself, but the steel containers that hold the product.",
        "source": "user"
    },
    {
        "text": "The wolf and 92nd pig found out that steel containers were either thrown away, buried, or sold for scrap.",
        "source": "user"
    },
    {
        "text": "These were stackable barrels that exuded a faint glow.",
        "source": "user"
    },
    {
        "text": "Pigs being pigs, housekeeping wasn't always the best, yet bugs never entered 92's property.",
        "source": "user"
    },
    {
        "text": "Choosing this material also helped 92 make a profit.",
        "source": "user"
    },
    {
        "text": "He was provided a recycling reimbursement by the town as long as he agreed to take safety precautions when entering town.",
        "source": "user"
    },
    {
        "text": "Wolf was proud of the accomplishments of his friend 92.",
        "source": "user"
    },
    {
        "text": "The house he advised his friend to build will last forever and the glow of the property will always remind the town of a thrifty little pig named 92.",
        "source": "user"
    }
]