[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "They go from 1 down to 4 in order of their actual current ranking.",
        "source": "user"
    },
    {
        "text": "The man who said he was ranked 1 is now 2 and his kid says \"You're number 2?",
        "source": "api"
    },
    {
        "text": "\" So what exactly does this all ratings do for sales ?",
        "source": "api"
    },
    {
        "text": "I don't really follow these things that much but i do know dad mugs do sell especially on fathers day.",
        "source": "user"
    },
    {
        "text": "So when you have the top 4 in the world at number 1, thats quite a bragging rights.",
        "source": "user"
    },
    {
        "text": "What exactly it stands for i don't think anyone really cares but for dads out there having a cup that says #1 dad actually means a lot to them.",
        "source": "api"
    },
    {
        "text": "Which dad would want a mug that says #2 dad, I don't think any dad out there would want that right ?",
        "source": "user"
    },
    {
        "text": "So there again we have a case of daddy being proud to have a \"#1 DAD\" mug.",
        "source": "user"
    },
    {
        "text": "So what happens when someone gets that number 1 ranking ?",
        "source": "api"
    },
    {
        "text": "They get to be the number 1 dad.",
        "source": "api"
    },
    {
        "text": "At least for the day of fathers day at least.",
        "source": "api"
    },
    {
        "text": "Not everyone could be the best dad in the world but everyone could get the #1 dad cup.",
        "source": "user"
    },
    {
        "text": "I think my dad is the best dad in the world and he could get that number 1, best in the world title.",
        "source": "user"
    },
    {
        "text": "I just don't think dads want to be that number 2 dad.",
        "source": "api"
    },
    {
        "text": "That's the one that makes your kid go to you mom and say \"Hey look dad, you're number 2?",
        "source": "api"
    },
    {
        "text": "\" or worse yet #4 Dad.",
        "source": "api"
    },
    {
        "text": "That would just be hilarious for both the giver and the receiver.",
        "source": "api"
    },
    {
        "text": "So what happens when someone is ranked number 1 ?",
        "source": "user"
    },
    {
        "text": "They get a nice mug and they get to call themselves the number 1 dad in the world.",
        "source": "api"
    },
    {
        "text": "Its a funny thing to do but we have all seen that life is about bragging rights.",
        "source": "api"
    },
    {
        "text": "So whats that #1 Dad mug doing for the company ?",
        "source": "api"
    },
    {
        "text": "For one, they have a #1 Dad mug out there which is good for sales.",
        "source": "api"
    },
    {
        "text": "The company must be selling a lot of those mugs because they have to come up with more and more of them as the Dads out there buy the mugs so they can call themselves the \"#1 Dad\".",
        "source": "api"
    },
    {
        "text": "I don't think it sells as much as the \"World's Greatest Dad\" mug, but i'm sure it sells well.",
        "source": "api"
    },
    {
        "text": "Actually any dad mugs are good sellers, if not the the season dads just buy it to boost their identity as a false sense of actually being a great dad.",
        "source": "api"
    },
    {
        "text": "A mug does not make someone a great dad automatically , you actually have to be a great dad.",
        "source": "user"
    },
    {
        "text": "But hey we will just call you the best dad in the world because of a mug.",
        "source": "user"
    },
    {
        "text": "So if you are the best Dad out there, make sure you show off that #1 dad mug this fathers day.",
        "source": "api"
    },
    {
        "text": "I know my dad would be proud to have a number 1 dad mug, so will you.",
        "source": "api"
    },
    {
        "text": ":-) When that time of year comes people will no matter what buy those mugs and it will boost the companies sales , it is guaranteed that millions of these will sell each fathers day.",
        "source": "api"
    },
    {
        "text": "It is a symbol of pride for dads out there to have the #1 Dad mug.",
        "source": "user"
    },
    {
        "text": "This is a perfect example of marketing at it's finest.",
        "source": "api"
    },
    {
        "text": "So many people ask me if I have a #1 Dad mug and i say yes.",
        "source": "api"
    },
    {
        "text": "I get a lot of compliments when I have it on display.",
        "source": "api"
    },
    {
        "text": "I always tell them that I'm number 1 Dad.",
        "source": "api"
    },
    {
        "text": "They are like\"Are you sure that isn't your mom's mug?",
        "source": "api"
    },
    {
        "text": "\" Sometimes i laugh it off but most of the time  i tell them the truth.",
        "source": "api"
    }
]