[
    "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
    "The alien is flying a spacecraft on the edge of the galaxy.",
    "The alien does not know that Matt Damon is afraid of flying.",
    "The alien is flying the spacecraft in a way that terrifies Matt Damon.",
    "Matt Damon closes his eyes.",
    "When he opens them, the alien is gone.",
    "\"What?\" he says.",
    "\"Where'd you go?",
    "This isn't funny!\" He is all alone in the spaceship.",
    "He is very nervous.",
    "He doesn't know how to fly the spaceship.",
    "\"I don't know how to fly this thing!\" he yells.",
    "He closes his eyes for a moment.",
    "When he opens them, the alien has appeared again and is holding a taco.",
    "\"Oh, thank goodness you're back!\" says Matt Damon.",
    "\"How did you do that?",
    "And where did you go?\" \n\n\"Taco Bell,\" said the alien.",
    "\"You want some?\" \"No!\" said Matt Damon.",
    "He thought he might throw up if he ate a taco.",
    "\"I'm not hungry.\" he said.",
    "\"Suit yourself,\" said the alien, who then proceeded to eat the entire taco in one bite.",
    "\"How did you go to Taco Bell without me seeing?\" asked Matt Damon.",
    "\"I went down to the drive-thru,\" said the alien.",
    "\"You mean, you went without the spaceship?\" \"No,\" said the alien.",
    "\"It's kinda hard to explain.",
    "Why don't I just show you?\" The alien took out a second taco and ate it in one bite.",
    "\"Here, watch this,\" said the alien.",
    "Matt Damon wasn't sure what happened next or how the alien did it, but a moment later he was standing in a Taco Bell drive-thru line.",
    "The Taco Bell was hovering in the sky, surrounded by stars.",
    "\"That's so cool!\" said Matt Damon.",
    "He looked around him, amazing by what he was seeing.",
    "The skies were filled with aliens, all of them eating tacos and burritos.",
    "He placed his order and picked up his food.",
    "There he stood among the stars, with his burrito and his nachos, a very happy man.",
    "\"I'm really glad I'm not afraid of flying now,\" he said.",
    "Then he realized, he didn't know how to get back to the spaceship.",
    "He ate his meal as his panic increased.",
    "But in the end, he did not know the way back.",
    "And that is how Matt Damon became the regional manager of Taco Bell Intergalactic Inc.",
    ""
]