[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "When the change first happens, I'm stunned to see where my dad ranks on the list.",
        "source": "user"
    },
    {
        "text": "He's not on the list at all.",
        "source": "user"
    },
    {
        "text": "Oh my God, this is horrible.",
        "source": "api"
    },
    {
        "text": "Does this mean that he's not my actual father?",
        "source": "api"
    },
    {
        "text": "Does this mean that some other totally random person I don't know at all is my actual father?",
        "source": "user"
    },
    {
        "text": "I quickly scour the list to see if there is any other name that looks like my dad's.",
        "source": "user"
    },
    {
        "text": "But I come up short every time I look.",
        "source": "api"
    },
    {
        "text": "Increasingly panicky, I call my mom.",
        "source": "user"
    },
    {
        "text": "I ask her if my dad is really my biological father.",
        "source": "user"
    },
    {
        "text": "She's very confused and asks me why I would even ask such a thing.",
        "source": "api"
    },
    {
        "text": "I tell her that the mug that I have is giving me a ranking of all the dads in the world, and my father is not on the list.",
        "source": "api"
    },
    {
        "text": "My mom sounds nervous.",
        "source": "user"
    },
    {
        "text": "She tells me that it must be some kind of mistake.",
        "source": "user"
    },
    {
        "text": "She tells me that I should just ignore the mug.",
        "source": "api"
    },
    {
        "text": "But hearing my mom's nerves on the phone is not giving me any sense of comfort.",
        "source": "api"
    },
    {
        "text": "I decide to just go ask my dad about it in person.",
        "source": "user"
    },
    {
        "text": "I get to his office at the university and ask him about the mug.",
        "source": "api"
    },
    {
        "text": "My dad is just as confused as I am when I tell him that the mug doesn't have his name on the list.",
        "source": "api"
    },
    {
        "text": "\"That's just not true,\" he retorts.",
        "source": "user"
    },
    {
        "text": "But I pull out the mug and show it to him.",
        "source": "user"
    },
    {
        "text": "I ask him if he can find his name on the list.",
        "source": "api"
    },
    {
        "text": "He doesn't know what to say.",
        "source": "user"
    },
    {
        "text": "I finally tell him that I'm going to speak with my mom again.",
        "source": "api"
    },
    {
        "text": "He says he needs to speak with her as well but that he will do so privately.",
        "source": "user"
    },
    {
        "text": "I ask what the matter is and he says, in a totally deflated way, that he isn't sure he can trust my mom again.",
        "source": "user"
    },
    {
        "text": "I ask why he wouldn't trust my mom.",
        "source": "user"
    },
    {
        "text": "He says that if he's not my father then that must mean that my mom had an affair or cheated on him.",
        "source": "api"
    },
    {
        "text": "I ask how he's sure of that.",
        "source": "user"
    },
    {
        "text": "He says that there's no other explanation that makes sense.",
        "source": "user"
    },
    {
        "text": "After all, my mom and dad had been married for over five years by the time my mom got pregnant with me.",
        "source": "api"
    },
    {
        "text": "He says that if my mom cheated on him, then she probably had an affair with my biological father.",
        "source": "user"
    },
    {
        "text": "This whole situation sounds so sticky, so I reach out to my mom again and immediately request we talk in person.",
        "source": "api"
    },
    {
        "text": "When we meet for lunch, I demand to know why my father is not listed on that mug.",
        "source": "user"
    },
    {
        "text": "With tears welling in her eyes, my mom says she's so sorry.",
        "source": "user"
    },
    {
        "text": "She says that she doesn't know what to do or say.",
        "source": "user"
    },
    {
        "text": "But she does admit that another man is my father and that she had lied to my father for the last 24 years to conceal the fact that she was repeatedly engaging in adulterous activity over the course of their first five years of marriage.",
        "source": "api"
    },
    {
        "text": "I feel so incredibly furious.",
        "source": "user"
    },
    {
        "text": "My mom says that she will apologize to my dad but I tell her there is no need.",
        "source": "user"
    },
    {
        "text": "I tell her that she needs to basically get her life together and that I am disgusted by her behavior.",
        "source": "user"
    },
    {
        "text": "She says she understands and that she will never forgive herself.",
        "source": "user"
    },
    {
        "text": "But I am not interested in hearing it.",
        "source": "user"
    },
    {
        "text": "I just want to be done with this woman.",
        "source": "user"
    },
    {
        "text": "I ask how she could have done this to my father.",
        "source": "api"
    },
    {
        "text": "She hurt a man for decades just to conceal her own lies!",
        "source": "user"
    },
    {
        "text": "I walk out of this meeting with my mother vowing that this relationship is done.",
        "source": "user"
    },
    {
        "text": "I will never speak to her again.",
        "source": "user"
    }
]