[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "The story begins with a young man named Riku, who lives in a world where magic has long been forgotten.",
        "source": "api"
    },
    {
        "text": "He has been raised in Landro by his grandfather Frezna, a wizard, and has always dreamed of becoming a great wizard himself.",
        "source": "api"
    },
    {
        "text": "Riku didn't know what had ever happened to his parents; his grandfather refused to tell him.",
        "source": "user"
    },
    {
        "text": "He lived a lonely, isolated life and longed for a family outside his grandfather.",
        "source": "user"
    },
    {
        "text": "There were no photographs of his parents; the only picture was of a woman.",
        "source": "user"
    },
    {
        "text": "Sometimes he would see his grandfather gazing at the photograph, a wistful look on his face.",
        "source": "user"
    },
    {
        "text": "His grandfather spent years training him, but it takes a long, long time to learn everything one needs to know to use magic to its full extent.",
        "source": "user"
    },
    {
        "text": "When Riku was 14, his grandfather passed away.",
        "source": "user"
    },
    {
        "text": "Riku had been kept at home his whole life and knew little about the world, but now he had to set out and find his way.",
        "source": "user"
    },
    {
        "text": "He decided to go to the city of Faltra, where he had heard from his grandfather that there were many people who could teach him about magic.",
        "source": "api"
    },
    {
        "text": "Riku's first day in Faltra is a disaster.",
        "source": "api"
    },
    {
        "text": "They spoke a different dialect than he had learned growing up, so it was very difficult to get around.",
        "source": "user"
    },
    {
        "text": "He did have a little money and was finally able to find a room to rent.",
        "source": "user"
    },
    {
        "text": "He knew he needed to find a job, and find someone to continue teaching him magic.",
        "source": "user"
    },
    {
        "text": "Over the next few weeks, he learned the dialect and started to find his way around the city.",
        "source": "user"
    },
    {
        "text": "He got a job at a bakery, where he worked hard and met a lot of people as he waited on them.",
        "source": "user"
    },
    {
        "text": "He made friends with a young girl named Selphie, who was a waitress at the bakery.",
        "source": "api"
    },
    {
        "text": "They became friends immediately, and it was almost like they had known one another forever.",
        "source": "user"
    },
    {
        "text": "One day, Selphie invited Riku to come to her house for dinner.",
        "source": "user"
    },
    {
        "text": "Selphie lived with her grandmother.",
        "source": "user"
    },
    {
        "text": "He arrived with some flowers he had picked.",
        "source": "user"
    },
    {
        "text": "When he knocked on the door, an elderly woman opened it.",
        "source": "user"
    },
    {
        "text": "Riku stood in the doorway, frozen solid.",
        "source": "user"
    },
    {
        "text": "It was an older version of the woman in the photograph that his grandfather had.",
        "source": "user"
    },
    {
        "text": "Riku knew it had to be her; he too had spent hours looking at that photograph.",
        "source": "user"
    },
    {
        "text": "The woman also stood very still, staring at him.",
        "source": "user"
    },
    {
        "text": "\"Riku,\" she said.",
        "source": "user"
    },
    {
        "text": "\"Is it you?\"",
        "source": "user"
    },
    {
        "text": "\"Have we met?\" Riku asked?",
        "source": "user"
    },
    {
        "text": "\"Have you come here from Landro?\"",
        "source": "user"
    },
    {
        "text": "\"Yes,\" Riku said.",
        "source": "user"
    },
    {
        "text": "\"Is Frezna your grandfather,\"",
        "source": "user"
    },
    {
        "text": "\"Yes,\" Riku responded.",
        "source": "user"
    },
    {
        "text": "\"Where is he?\"",
        "source": "user"
    },
    {
        "text": "\"He died, and I came to Faltra to find someone to continue my magic education.\"",
        "source": "user"
    },
    {
        "text": "The woman motioned him inside, and sat heavily on the sofa, tears running down her face.",
        "source": "user"
    },
    {
        "text": "She told Riku she was his grandmother, and when his parent were killed by magic hunters, she and her husband had each taken one of the children and fled to keep them safe and keep teaching them magic.",
        "source": "user"
    },
    {
        "text": "Selphie was his sister!",
        "source": "user"
    },
    {
        "text": "By this point, she had joined them in the parlor and they both listed to the story their grandmother told.",
        "source": "user"
    },
    {
        "text": "She was teaching Selphie magic, but neither Riku nor Selphie's magic would be strong until they were reunited, as they were twins.",
        "source": "user"
    },
    {
        "text": "She hadn't known that her husband had passed away.",
        "source": "user"
    },
    {
        "text": "They hadn't seen each other in nearly 12 years, but had kept in touch as best they could.",
        "source": "user"
    },
    {
        "text": "Riku and Selphie were overjoyed to be reunited, and they spent the evening talking and catching up.",
        "source": "user"
    },
    {
        "text": "Riku and Selphie spent the next year honing their magic and making plans for how to use their powers to return Mana to its past glory.",
        "source": "user"
    },
    {
        "text": "That would be their next adventure.",
        "source": "user"
    }
]