[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.04807692307692308
    },
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly. This is a shock to the world since nothing like this has ever happened before. Dad's around the world were just confused at first with some a little more worried about their number then others. Reports started to come out around the world that these rankings might have some truth behind them. \n",
        "source": "user",
        "start_time": 14.0,
        "end_time": 116.0,
        "last_event_time": 116.0,
        "start_progress": 0.04807692307692308,
        "end_progress": 0.20566239316239315
    },
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly. This is a shock to the world since nothing like this has ever happened before. Dad's around the world were just confused at first with some a little more worried about their number then others. Reports started to come out around the world that these rankings might have some truth behind them. The United Nations is now involved in trying to figure out what exactly is going on.\n",
        "source": "api",
        "start_time": 145.0,
        "end_time": 145.0,
        "last_event_time": 145.0,
        "start_progress": 0.20566239316239315,
        "end_progress": 0.25053418803418803
    },
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly. This is a shock to the world since nothing like this has ever happened before. Dad's around the world were just confused at first with some a little more worried about their number then others. Reports started to come out around the world that these rankings might have some truth behind them. The United Nations is now involved in trying to figure out what exactly is going on. They released a report showing a correlation between criminal offenses and lower dad rankings. That was then compounded by divorce and remarried statuses. The big one though seemed to be that medical information was incorporated into the rankings. Dad's with psychological disorders were being ranked lower then their more normal counterparts. Intelligence agencies around the world were saying this is the biggest security breach of online personal information in history. The way the cups changed though was still a mystery. \n",
        "source": "user",
        "start_time": 147.0,
        "end_time": 371.0,
        "last_event_time": 371.0,
        "start_progress": 0.25053418803418803,
        "end_progress": 0.5325854700854701
    },
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly. This is a shock to the world since nothing like this has ever happened before. Dad's around the world were just confused at first with some a little more worried about their number then others. Reports started to come out around the world that these rankings might have some truth behind them. The United Nations is now involved in trying to figure out what exactly is going on. They released a report showing a correlation between criminal offenses and lower dad rankings. That was then compounded by divorce and remarried statuses. The big one though seemed to be that medical information was incorporated into the rankings. Dad's with psychological disorders were being ranked lower then their more normal counterparts. Intelligence agencies around the world were saying this is the biggest security breach of online personal information in history. The way the cups changed though was still a mystery. \n\nThe following two weeks showed that the rankings were accurate.\n",
        "source": "api",
        "start_time": 393.0,
        "end_time": 393.0,
        "last_event_time": 393.0,
        "start_progress": 0.5325854700854701,
        "end_progress": 0.5673076923076923
    },
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly. This is a shock to the world since nothing like this has ever happened before. Dad's around the world were just confused at first with some a little more worried about their number then others. Reports started to come out around the world that these rankings might have some truth behind them. The United Nations is now involved in trying to figure out what exactly is going on. They released a report showing a correlation between criminal offenses and lower dad rankings. That was then compounded by divorce and remarried statuses. The big one though seemed to be that medical information was incorporated into the rankings. Dad's with psychological disorders were being ranked lower then their more normal counterparts. Intelligence agencies around the world were saying this is the biggest security breach of online personal information in history. The way the cups changed though was still a mystery.  The following two weeks showed that the rankings were accurate. This was devastating to a majority of dad's around the world who were not ranked in the top 90%. A new system of credit and social perks started to become available to top ranking dads. All the women wanted them, they turned into celebrities over night while the lower ranking dads saw their quality of life either diminish or completely collapse. \n",
        "source": "user",
        "start_time": 396.0,
        "end_time": 562.0,
        "last_event_time": 562.0,
        "start_progress": 0.5673076923076923,
        "end_progress": 0.7532051282051282
    },
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly. This is a shock to the world since nothing like this has ever happened before. Dad's around the world were just confused at first with some a little more worried about their number then others. Reports started to come out around the world that these rankings might have some truth behind them. The United Nations is now involved in trying to figure out what exactly is going on. They released a report showing a correlation between criminal offenses and lower dad rankings. That was then compounded by divorce and remarried statuses. The big one though seemed to be that medical information was incorporated into the rankings. Dad's with psychological disorders were being ranked lower then their more normal counterparts. Intelligence agencies around the world were saying this is the biggest security breach of online personal information in history. The way the cups changed though was still a mystery.  The following two weeks showed that the rankings were accurate. This was devastating to a majority of dad's around the world who were not ranked in the top 90%. A new system of credit and social perks started to become available to top ranking dads. All the women wanted them, they turned into celebrities over night while the lower ranking dads saw their quality of life either diminish or completely collapse. This lead to an increase in divorce and social isolation for a lot of low ranking dads.\n",
        "source": "api",
        "start_time": 579.0,
        "end_time": 579.0,
        "last_event_time": 579.0,
        "start_progress": 0.7532051282051282,
        "end_progress": 0.7996794871794872
    },
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly. This is a shock to the world since nothing like this has ever happened before. Dad's around the world were just confused at first with some a little more worried about their number then others. Reports started to come out around the world that these rankings might have some truth behind them. The United Nations is now involved in trying to figure out what exactly is going on. They released a report showing a correlation between criminal offenses and lower dad rankings. That was then compounded by divorce and remarried statuses. The big one though seemed to be that medical information was incorporated into the rankings. Dad's with psychological disorders were being ranked lower then their more normal counterparts. Intelligence agencies around the world were saying this is the biggest security breach of online personal information in history. The way the cups changed though was still a mystery.  The following two weeks showed that the rankings were accurate. This was devastating to a majority of dad's around the world who were not ranked in the top 90%. A new system of credit and social perks started to become available to top ranking dads. All the women wanted them, they turned into celebrities over night while the lower ranking dads saw their quality of life either diminish or completely collapse. This lead to an increase in divorce and social isolation for a lot of low ranking dads and eventually banishment to their own country were they lived the rest of their lives without women and children. The top remaining dads implemented laws that allowed for monogamy and they populated the world with the genes of the top ranking dad's. This eventually backfired as the gene pool was not diverse enough and humanity devolved into their more chimp like cousins. \n",
        "source": "user",
        "start_time": 581.0,
        "end_time": 707.0,
        "last_event_time": 707.0,
        "start_progress": 0.7996794871794872,
        "end_progress": 1.0
    }
]