[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "In the first book of the series, The Last Wizard, the world is introduced to the last wizard, a young man named John.",
        "source": "user"
    },
    {
        "text": "He is the only one who can save the world from the alien invasion that threatens to destroy it.",
        "source": "user"
    },
    {
        "text": "Imagine that, a young man having the entire pressure of saving a world on his shoulders.",
        "source": "user"
    },
    {
        "text": "The second book, The Last Wizard: The Second Coming, is about John's journey to find the other wizards and to convince them to help.",
        "source": "user"
    },
    {
        "text": "He must also find the other wizards before the aliens do.",
        "source": "user"
    },
    {
        "text": "He can team with those wizards in order to beat the aliens before they convert them to join them.",
        "source": "user"
    },
    {
        "text": "The third book, The Last Wizard: The Final Battle, is about the final battle between John and the aliens.",
        "source": "user"
    },
    {
        "text": "John must fight the aliens and their leader, the Overlord, to save the world.",
        "source": "user"
    },
    {
        "text": "The Overlord is the most powerful wizard in the world.",
        "source": "api"
    },
    {
        "text": "He has the power to destroy the world.",
        "source": "user"
    },
    {
        "text": "He has the strongest weapons in the world.",
        "source": "user"
    },
    {
        "text": "The strongest artillery.",
        "source": "user"
    },
    {
        "text": "The strongest army and the strongest power.",
        "source": "user"
    },
    {
        "text": "He is the most powerful wizard in the world.",
        "source": "user"
    },
    {
        "text": "The fourth book, The Last Wizard: The New Beginning, is about the aftermath of the war.",
        "source": "user"
    },
    {
        "text": "John has defeated the wizard and his new role is to help re-build the world after their battle.",
        "source": "user"
    },
    {
        "text": "He must also help the people to recover from the war and to rebuild their lives.",
        "source": "user"
    },
    {
        "text": "John does this by meeting with the entire community and giving a speech.",
        "source": "user"
    },
    {
        "text": "He gives a passionate speech and tells everyone that if they work together they can rebuild their world.",
        "source": "user"
    },
    {
        "text": "It wasn't easy and it was very time consuming but with John leading his people, they were able to build back their world and live happily without the fear of the Overlord coming back to harm them.",
        "source": "user"
    }
]