[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "This woman's name is Lilybelle and she lives with a psychic parrot named Toots.",
        "source": "api"
    },
    {
        "text": "Toots decides he's going to help Lilybelle end this crazy dating cycle.",
        "source": "api"
    },
    {
        "text": "Toots uses his psychic powers to read the stars, thereby predicting Lilybelle's romantic future.",
        "source": "api"
    },
    {
        "text": "Toots, however is really bad at this.",
        "source": "api"
    },
    {
        "text": "He's also really bad at math, so his predictions are always off.",
        "source": "api"
    },
    {
        "text": "He can't seem to figure out how to get Lilybelle the right man at the right time.",
        "source": "api"
    },
    {
        "text": "He can't seem to put her in a room with a man who will fit her life parameters.",
        "source": "api"
    },
    {
        "text": "He can't seem to get her out of a relationship when he knows it isn't right.",
        "source": "api"
    },
    {
        "text": "The only thing Toots is good at is getting Lilybelle into trouble.",
        "source": "api"
    },
    {
        "text": "\"Lilybelle,\" says Toots one day.",
        "source": "api"
    },
    {
        "text": "\"You're going to find the perfect man for you today.",
        "source": "user"
    },
    {
        "text": "\" \n\n\"Finally,\" groans Lilybelle.",
        "source": "api"
    },
    {
        "text": "\"Let's hope he's perfect.",
        "source": "api"
    },
    {
        "text": "\" \n\nToots takes off and Lilybelle heads to work.",
        "source": "api"
    },
    {
        "text": "On her way, she stops in a store to buy some groceries.",
        "source": "api"
    },
    {
        "text": "She meets a man in the bakery section of the store.",
        "source": "api"
    },
    {
        "text": "They strike up a conversation and he offers to carry her groceries to her car.",
        "source": "api"
    },
    {
        "text": "He's perfect on paper; he's handsome, he has a great job, and he seems to really like her.",
        "source": "api"
    },
    {
        "text": "He also seems to be exactly what she wants in a man.",
        "source": "api"
    },
    {
        "text": "He even offers to take her out on their first date that night.",
        "source": "api"
    },
    {
        "text": "Lilybelle rushes home to prepare herself for her date.",
        "source": "api"
    },
    {
        "text": "For once, Toots might be right about something, and what a happy surprise this is to her.",
        "source": "api"
    },
    {
        "text": "She starts to get dressed, but without looking closely at her clothes, something catches her eye.",
        "source": "user"
    },
    {
        "text": "She looks down and sees a large stain on her blouse.",
        "source": "api"
    },
    {
        "text": "\"There's no way I'm going out with this guy looking like this,\" she says to herself.",
        "source": "api"
    },
    {
        "text": "She's annoyed because obviously, this might be a bad omen for things to come with this guy.",
        "source": "api"
    },
    {
        "text": "Regardless, Lilybelle is a trooper and gets her laundry done.",
        "source": "user"
    },
    {
        "text": "\"Where is your date?",
        "source": "user"
    },
    {
        "text": "\" Toots asks.",
        "source": "user"
    },
    {
        "text": "\"We have a reservation at the Olive Garden,\" she replies.",
        "source": "user"
    },
    {
        "text": "Toots feels a pang of jealousy, because Olive Garden is his favorite restaurant.",
        "source": "api"
    },
    {
        "text": "When Lilybelle's date arrives, the guy is quite nice and charming, and Toots can tell he really likes Lilybelle.",
        "source": "api"
    },
    {
        "text": "Toots feels happy for Lilybelle and goes off to play hide and seek with some neighborhood kids.",
        "source": "user"
    },
    {
        "text": "At the Olive Garden, Lilybelle orders her favorite meal, shrimp scampi, and her date orders the chicken parmesan.",
        "source": "api"
    },
    {
        "text": "They both share a plate of breadsticks.",
        "source": "user"
    },
    {
        "text": "After dinner, Lilybelle suggests they go back to her place, so they can relax and enjoy each other's company, if you know what that means.",
        "source": "api"
    },
    {
        "text": "They get back to her place and start getting cozy.",
        "source": "api"
    },
    {
        "text": "\"Let's get on the couch,\" says Lilybelle.",
        "source": "api"
    },
    {
        "text": "\"I want to cuddle.",
        "source": "api"
    },
    {
        "text": "\" \n\nShe pulls him onto the couch and they start getting really close.",
        "source": "api"
    },
    {
        "text": "She inches her hand onto his thigh and feels something she's never felt before.",
        "source": "api"
    },
    {
        "text": "Her hand feels a bulge emerge from behind his zipper.",
        "source": "api"
    },
    {
        "text": "She pulls back and looks at him.",
        "source": "api"
    },
    {
        "text": "His face is flushed and he looks nervous.",
        "source": "api"
    },
    {
        "text": "Lilybelle feels her hands grow hot.",
        "source": "api"
    },
    {
        "text": "But just then, Toots appears out of nowhere and decks Lilybelle's date in the face!",
        "source": "api"
    },
    {
        "text": "It's an accident, but her date is really angry and stomps out, leaving Lilybelle without the perfect man all over again.",
        "source": "user"
    }
]