[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "He has a huge chart at home to keep track of it.",
        "source": "api"
    },
    {
        "text": "It shows all of the likes and dislikes that he has learned of hers over time.",
        "source": "user"
    },
    {
        "text": "He's hoping that if he can just get the right combination, she'll love him back.",
        "source": "user"
    },
    {
        "text": "He made himself into the perfect looking man.",
        "source": "api"
    },
    {
        "text": "He had muscles and chiseled features and really should be hard to resist.",
        "source": "user"
    },
    {
        "text": "But she just wasn't interested.",
        "source": "user"
    },
    {
        "text": "He realized that yet again as he tried to move forward with their relationship.",
        "source": "api"
    },
    {
        "text": "He just couldn't get her to love him.",
        "source": "user"
    },
    {
        "text": "He decided to try something drastic that was a hail Mary move basically.",
        "source": "api"
    },
    {
        "text": "He shape shifted to look exactly like her.",
        "source": "user"
    },
    {
        "text": "People like themselves, right?",
        "source": "user"
    },
    {
        "text": "She can't not like herself.",
        "source": "user"
    },
    {
        "text": "He was right.",
        "source": "user"
    },
    {
        "text": "When she saw herself she was beyond intrigued.",
        "source": "user"
    },
    {
        "text": "She apparently had an interest in doppelgangers that he was not aware of.",
        "source": "user"
    },
    {
        "text": "She was so into herself that she couldn't resist.",
        "source": "user"
    },
    {
        "text": "She just wanted to spend time with her doppelganger.",
        "source": "api"
    },
    {
        "text": "He knew enough about her to be able to pretend to be her flawlessly.",
        "source": "user"
    },
    {
        "text": "Nothing romantic came of it.",
        "source": "user"
    },
    {
        "text": "He was just happy to be with her.",
        "source": "user"
    },
    {
        "text": "It was a way to do that even if it wasn't at all what he had hoped for.",
        "source": "api"
    },
    {
        "text": "He would shape shift into her and basically just hang out around her apartment while pretending to be her.",
        "source": "user"
    },
    {
        "text": "It was quite the unusual love story.",
        "source": "user"
    },
    {
        "text": "Eventually she asked him to move in with her.",
        "source": "user"
    },
    {
        "text": "He of course agreed.",
        "source": "user"
    },
    {
        "text": "Now he was living with her, and they were spending all of their time together.",
        "source": "user"
    },
    {
        "text": "He no longer had an identity of his own, even if they were just ones he had created while shape shifting.",
        "source": "api"
    },
    {
        "text": "Now he was her all of the time.",
        "source": "user"
    },
    {
        "text": "He was her boyfriend, at least in his head.",
        "source": "user"
    },
    {
        "text": "In reality he was just a fascination for her.",
        "source": "api"
    },
    {
        "text": "You can't always pick how you will be loved but you must accept it.",
        "source": "user"
    }
]