[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?\"",
        "source": "api"
    },
    {
        "text": "I was in my room, alone and at first I thought a human intruder has come inside the house.",
        "source": "user"
    },
    {
        "text": "But their voice is too high pitched to be human.",
        "source": "user"
    },
    {
        "text": "It was then I realized, the intruder is a tiny bee.",
        "source": "user"
    },
    {
        "text": "I screamed on the top of my lungs.",
        "source": "user"
    },
    {
        "text": "\"Get away from me, get away from me! I am deathly allergic to bees!\" I screamed.",
        "source": "user"
    },
    {
        "text": "\"But that's the thing, Your Majesty. You are not allergic to us. You're one of us.\" said the tiny bee.",
        "source": "user"
    },
    {
        "text": "\"That's.. that's impossible! I'm human, my mother was human so is my sister and my father.\" I argued as I looked for anything in the room to squat the tiny little thing.",
        "source": "user"
    },
    {
        "text": "\"You have to be quiet. Your mother and father may come and find us.\" said the bee.",
        "source": "user"
    },
    {
        "text": "\"That's great for me, they'll kill you!\" I screamed as I quickly got a mathematics book to try and squat the bee.",
        "source": "user"
    },
    {
        "text": "The bee immediately flew over it and landed on my shoulder.",
        "source": "user"
    },
    {
        "text": "I screamed again.",
        "source": "user"
    },
    {
        "text": "\"Shhhh!\" said the tiny bee as it buzzed on my ear.",
        "source": "user"
    },
    {
        "text": "It then stung me right on my shoulder and I screamed the loudest this time.",
        "source": "user"
    },
    {
        "text": "Finally, my mom and dad came knocking on my door.",
        "source": "user"
    },
    {
        "text": "\"Honey, are you okay in there?\" said my mom as she tried to open the door.",
        "source": "user"
    },
    {
        "text": "I heard kicking of the door as I couldn't seem to move at this point.",
        "source": "user"
    },
    {
        "text": "Another kicks later and my dad have finally opened the door.",
        "source": "user"
    },
    {
        "text": "\"Honey? We heard screaming. Where are you?\" said my father.",
        "source": "user"
    },
    {
        "text": "\"I'm right here, there is a bee in here!\" I screamed.",
        "source": "user"
    },
    {
        "text": "They were not able to hear me.",
        "source": "user"
    },
    {
        "text": "My parents are also not able to see me, until my dad said, \"Hon, there are two bees in here.\"",
        "source": "user"
    },
    {
        "text": "\"Shoo, shoo!\" said my mother.",
        "source": "user"
    },
    {
        "text": "\"They've got her, love. They've got her. How did they get in?!\"",
        "source": "user"
    },
    {
        "text": "\"We're going to have to call a specialist.\" said my dad.",
        "source": "user"
    }
]