[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "Dads all over the world were shocked.",
        "source": "user"
    },
    {
        "text": "How did it happen?",
        "source": "user"
    },
    {
        "text": "Some blame the economy, others say it's because of a gender bias.",
        "source": "user"
    },
    {
        "text": "Some even blamed voodoo witch doctors, where ever the finger could be pointed.",
        "source": "user"
    },
    {
        "text": "Some dad mugs still said #1 though.",
        "source": "user"
    },
    {
        "text": "Scientist started looking into the reason behind it.",
        "source": "user"
    },
    {
        "text": "The reason the Dad mugs no longer said #1 was found out, kind of.",
        "source": "user"
    },
    {
        "text": "At least the reasons behind it was clear even if no one understood how it happened.",
        "source": "user"
    },
    {
        "text": "You see, what they found out was that the mugs really started to show how good of a dad a man was to his kids.",
        "source": "user"
    },
    {
        "text": "The mugs were a window into the dad's soul.",
        "source": "user"
    },
    {
        "text": "If he did not care about his children, then his mug would give a really low rating like #384657, or something like that.",
        "source": "user"
    },
    {
        "text": "If a dad really cared about his children a lot then the mug would say a really high number like dad #3 or 9 or even 7.",
        "source": "user"
    },
    {
        "text": "Now, there were some dads who did have a #1 mug, but those mugs where really only for the best of the best dads in the world.",
        "source": "user"
    },
    {
        "text": "The one who did anything for their child.",
        "source": "user"
    },
    {
        "text": "Taught them, guided them, never missed a softball game, and even took the team out for pizza after the game.",
        "source": "user"
    },
    {
        "text": "The #1 Dad Mug was for the dad who would never let his kids down.",
        "source": "user"
    },
    {
        "text": "The dad who really, and truly loved and would gladly sacrifice for his kids.",
        "source": "user"
    },
    {
        "text": "Some dads got jealous, but to a good effect because they tried harder to be good dads, and not just fathers.",
        "source": "user"
    }
]