[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "Being that this power can be good or evil, mana can be extremely dangerous when it falls into the wrong hands.",
        "source": "user"
    },
    {
        "text": "The first step taken by the human survivors is to guard the pjower of the mana, to be used only for good.",
        "source": "user"
    },
    {
        "text": "The leader of the survivors calls for a council meeting to map out a strategy to prevent further alien invasion.",
        "source": "user"
    },
    {
        "text": "How did the invasion occur and how else might it occur in the future?",
        "source": "user"
    },
    {
        "text": "These answer these questions, a brilliant think tank comprised of men and women went into over drive.",
        "source": "user"
    },
    {
        "text": "They came up with a plan to prevent any further alien invasion.",
        "source": "user"
    },
    {
        "text": "They would use the power of mana to create a force field that would prevent any alien from entering earth.",
        "source": "api"
    },
    {
        "text": "With the new force field in place, the humans began to propagate.",
        "source": "user"
    },
    {
        "text": "It was strongly suggested to limit each couple to two children, so as to prevent dilution of the mana.",
        "source": "user"
    },
    {
        "text": "Some were unhappy with this suggestion, fearing that it would give too much control to the council and related authorities.",
        "source": "user"
    },
    {
        "text": "However, the goal is for peace and harmony, so concerned citizens met with council representatives to discuss and solve their concerns.",
        "source": "user"
    },
    {
        "text": "The council was able to convince the concerned citizens that the two child limit was in the best interest of all and that this strong suggestion will not lead to control in unwanted ways.",
        "source": "user"
    }
]