[
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.1019202363367799
    },
    {
        "text": "Are We Being Bad Citizens If We Don't Keep Up With the News?\n\nIn your opinion, are we being bad citizens if we don't keep up with the news? Do you think all people have some responsibility to know what is going on in the world? Does engaging with current events actually do anything at all? Why do you think the way you do?\n\n---\n\nIn my opinion, it does not make someone a bad citizen if they dont keep up with the news. I think the news can affect someone's mental so strongly, that it is really up to that individual on whether they want to consume it or not. I would say that you do have some responsibility to know what is going on in the world, but you do not need to necessarily consume news to do it. For example, if you dont know about COVID or the pandemic than you are not being responsible as a citizen. However, if you dont know that the US just recently signed a new bill than it is probably ok. As long as you are not a hermit, if it affects you, you will probably find out at one point.\n\nI think that it is not possible to say that people are obligated to get their news from the media because it can literally make you depressed. The media can control the minds of people to a degree because they are showing you and effecting the way you think. If all you see is negative and violent news, you are going to think that you live in a violent and negative world. If you are on social media all the time and seeing other peoples lavish lives and highlight reels, you are most likely not going to be grateful for what you have. If you are listening to music that is talking about treating women in a certain way, or woman acting a certain way, you will probably find yourself doing these actions every now and then without even thinking about it. Everything we consume effects us, and we have to mentally know that this is a fact to combat at. \n\nAs far as engaging with current events, i think that is more for entertainment than anything else, at least globally. Some people really enjoy knowing what is going on around the world, and if you plan on helping or plan on immersing yourself in the culture or news, than that is a great reason! For me myself, i dont get much at all from global news because of lack of interest. I also am not one to travel all that often. I feel like for me to care about the place i have to have been there. I feel bad saying that but it is just true. I feel for anyone going through hardships, but in my life now i am not really in a position to help until i get to where i need to be. Everyone is different, and if you enjoy engaging with current events then engage with current events! I think like this because i can get stressed out if i think about too many things going on around me. I just focus on being the best me and giving my best effort each day. It is not that i dont care about the world or other people, it is simply that i want to be happy and want to have a calm mind. My brain is very fast and i can get anxious if i try to worry about too many things at the same time. If i am going to induldge in any type of news i make sure that it is at night when i have completed my tasks for the day. \n\nIn conclusion, I do not feel that people have a responsibility to keep up with the news. I just think that people need to know what is going on around them, at least enough to not be putting themselves or others into harms way.\n",
        "source": "user",
        "start_time": 8.0,
        "end_time": 576.0,
        "last_event_time": 576.0,
        "start_progress": 0.1019202363367799,
        "end_progress": 1.0
    }
]