[
    "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
    "So this alien brings him to a far away planet where he can live, for now.",
    "The planet Margustis, is powered by moonlight.",
    "Because of this, the aliens do not have to eat.",
    "They do not have kitchens or pantries or grocery stores.",
    "Or food.",
    "This is bad news for Matt Damon.",
    "He is still human, and needs food to survive.",
    "If he does not eat, he will starve to death.",
    "He tries to explain this to his alien guard.",
    "But the guard does not understand.",
    "Matt Damon tries to communicate his hunger by pretending to chew on his arm.",
    "The alien does not understand why he would be pretending to chew on his arm.",
    "For aliens, chewing is a means of breaking this.",
    "Teeth are just a tool for the aliens.",
    "They do not understand why humans would have evolved to have the need for them.",
    "Matt Damon continues trying to think of a solution.",
    "He sees a tree through the window of his prison.",
    "He is certain that he could find something to eat in or around the tree.",
    "A bird's egg, a worm, a flower.",
    "Anything.",
    "But the window is too high up for him to reach.",
    "He begins to cry.",
    "The guard asks him why he is crying.",
    "Matt Damon says, \"Food!",
    "I'm hungry!\" \n\nThe guard has an idea.",
    "He decides to take Matt Damon for a walk.",
    "He leads him to a field near the tree.",
    "He tells Matt Damon to stand in the field.",
    "The guard unlocks his handcuffs and lets him walk free.",
    "After a few steps, he tells Matt Damon to run.",
    "\"What?\" says Matt Damon.",
    "\"Run!\" yells the guard.",
    "Matt Damon begins to run.",
    "He hears foot steps behind him.",
    "He thinks the guard is following him.",
    "He realizes that it's not just one person behind him, it's many.",
    "He runs as fast as he can.",
    "He runs over a hill and begins to slide down the other side.",
    "He realizes the aliens weren't chasing, but simply running in his direction.",
    "They ran past him and gathered in a field of trees.",
    "Apple trees!",
    "The aliens were gathering apples!",
    "The aliens used them to fuel their machines.",
    "The guard thought the human might want one too, so he simply tricked him into following the aliens discreetly.",
    "How do ya like them apples?",
    ""
]