[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "He became one of the worlds most beloved movie stars, and no one in the world could stand to lose him.",
        "source": "user"
    },
    {
        "text": "As always, the aliens were quick to demonstrate a willingness to do whatever it takes, though this time they're taking it too far.",
        "source": "user"
    },
    {
        "text": "They took him to their home planet called Xexor, a place that would rank up there near the top of the list of places you should never go.",
        "source": "api"
    },
    {
        "text": "It is not really suitable for humans to live there very comfortably.",
        "source": "api"
    },
    {
        "text": "The weather is always to hot, but the aliens didn't care.",
        "source": "user"
    },
    {
        "text": "They just wanted Matt Damon for his amazing acting to entertain them in a Mos Eisley type of bar for other aliens pleasure.",
        "source": "user"
    },
    {
        "text": "Dangerous place to be where it is come for others to \"shot first\".",
        "source": "user"
    },
    {
        "text": "So, the humans had to develop a plan to get him back.",
        "source": "user"
    },
    {
        "text": "Oh boy, did they have a great plan to.",
        "source": "user"
    },
    {
        "text": "The humans had planned to create a clone of Matt Damon and let the aliens believe they had taken the clone, when in reality they will have taken away the real Matt Damon.",
        "source": "user"
    },
    {
        "text": "The aliens learned about this clone, but did not know the clone was on Earth.",
        "source": "api"
    },
    {
        "text": "So the aliens, who wanted the real Matt Damon , sent out two of their best space ships to Earth in hopes of snatching the clone (who they didn't know was a clone), and replace him with the real Matt Damon (who they did know was the real Matt Damon).",
        "source": "user"
    },
    {
        "text": "The humans knew the aliens would try to take the clone, so they developed a plan in which they would hide him inside a building and let the aliens believe that they were trying to protect him, when in fact they were not.",
        "source": "user"
    },
    {
        "text": "So the aliens showed up with their ships, and in a covert mission swapped the two Matt Damons.",
        "source": "user"
    },
    {
        "text": "The humans pretended they had no idea, when they knew all along.",
        "source": "user"
    },
    {
        "text": "Now the humans had Matt Damon back, and the aliens thought they had the real on.",
        "source": "user"
    },
    {
        "text": "Of course they didn't.",
        "source": "user"
    }
]