[
    "A woman has been dating guy after guy, but it never seems to work out.",
    "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
    "One day, she receives an email from someone new.",
    "Since she has a lot of time on her hands, she decides to meet him for coffee.",
    "The last guy stopped answering her calls, and she was hopeful.",
    "When she arrives to the coffee shop, her date already has a cup in front of him.",
    "She walks over to the table.",
    "\"This is for you.\" he says, pointing at the cup.",
    "\"What about you?\" she asks.",
    "\"Don't you want a drink too?\" \n\n\"Oh, I don't need one.\" he replies.",
    "\"I just had one last week.\" \"That's odd,\" she thought.",
    "She tried to think of something to say.",
    "\"Oh, so do you come here often?\" she asks.",
    "\"I come here every week.\" he replies.",
    "She was confused.",
    "\"I thought you said you just had a drink here last week.\" she says.",
    "She was wondering if she should leave.",
    "\"I did.\" he says.",
    "At this point, it didn't matter.",
    "She was ready to go.",
    "\"Well, I gotta run.",
    "It was very nice to-\" Before she could finish speaking, he stood up.",
    "\"Wait.",
    "You should know the real reason I called you here,\" he said.",
    "\"I wanted to see if you'd let me have one more shot with you.\" \n\nShe was confused.",
    "\"But we only just met.",
    "What do you mean, one more shot?\" \n\nHe sat back down.",
    "\"It's me\"  \n\nShe looked at him once more and shook her head.",
    "\"You have me mistaken for someone else,\" she said.",
    "\"I don't even know who you are.\" \n\nJust then, in the blink of an eye, he transformed.",
    "She was so shocked, she couldn't move.",
    "Sitting in front of her was the last guy she dated.",
    "The one that stopped calling her back.",
    "He looked at her and said, \"I'm sorry.",
    "Will you give me second chance?\" She sighed loudly.",
    "\"Some thing never change.\"\n"
]