[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
        "source": "api"
    },
    {
        "text": "One day, she meets a new guy and of course without realizing it she has fallen for the same guy again.",
        "source": "api"
    },
    {
        "text": "He does behave in some similar ways such as having gentlemanly qualities and insisting on paying for all dates when they go out.",
        "source": "user"
    },
    {
        "text": "She’s not sure what to think of him, but she does like him.",
        "source": "user"
    },
    {
        "text": "Some of the qualities that he has makes her uneasy such as showing up at her apartment without letting her know that he is coming over and he always expects her to be available.",
        "source": "api"
    },
    {
        "text": "She’s not sure if he’s really the guy for her, but he does make her feel good about herself.",
        "source": "user"
    },
    {
        "text": "Even though she is uneasy about this behavior, at the same time she is flattered that he seems to want to spend so much time with her.",
        "source": "api"
    },
    {
        "text": "This seems to be an ongoing situation that has happened in previous relationships.",
        "source": "user"
    },
    {
        "text": "She has a friend who is a psychic and she asks her friend to do a reading for her.",
        "source": "user"
    },
    {
        "text": "The friend reluctantly agrees because normally she does not read for friends but in this case, the psychic made an exception.",
        "source": "api"
    },
    {
        "text": "The psychic tells her that she has been dating the same guy over and over again.",
        "source": "user"
    },
    {
        "text": "The woman does not see how this is possible and she needs some convincing.",
        "source": "api"
    },
    {
        "text": "The psychic tells her that she has been dating the same guy over and over again and that he is a shapeshifter.",
        "source": "user"
    },
    {
        "text": "Although the woman finds this information hard to believe, she feels that she must consider it because of a lack of any logical explanation.",
        "source": "api"
    },
    {
        "text": "The woman is still not sure if she believes the psychic, but she decides to confront the guy about it.",
        "source": "user"
    },
    {
        "text": "She feels that this is the most logical thing to do since this situation needs to be brought out into the open.",
        "source": "api"
    },
    {
        "text": "She decides that it is best not to outright accuse the guy so she decides it is best to ask him if this is true.",
        "source": "user"
    },
    {
        "text": "She asks him if he is a shapeshifter and he admits that he is.",
        "source": "user"
    },
    {
        "text": "He tells her that he has been in love with her for a long time and that he has been trying to get it right this time.",
        "source": "api"
    },
    {
        "text": "He explains to her that he has messed up the relationship with her every time but her loves her and has become a shapeshifter so that he could try to get the relationship right and make it work.",
        "source": "api"
    },
    {
        "text": "The woman is still not sure if she believes the guy, but she decides to give him a chance.",
        "source": "user"
    },
    {
        "text": "It turns out that this time he has gotten it right and his persistance has paid off.",
        "source": "api"
    }
]