[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 0.0,
        "end_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.1082598235765838
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 27.0,
        "end_time": 27.0,
        "start_progress": 0.1082598235765838,
        "end_progress": 0.12349639133921411
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy. ",
        "source": "user",
        "last_event_time": 605.0,
        "start_time": 40.0,
        "end_time": 57.0,
        "start_progress": 0.12349639133921411,
        "end_progress": 0.14113873295910184
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy. You have the power to make bees do anything you want.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 62.0,
        "end_time": 66.0,
        "start_progress": 0.14113873295910184,
        "end_progress": 0.1623897353648757
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. ",
        "source": "user",
        "last_event_time": 605.0,
        "start_time": 66.0,
        "end_time": 69.0,
        "start_progress": 0.1623897353648757,
        "end_progress": 0.1631916599839615
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 81.0,
        "end_time": 81.0,
        "start_progress": 0.1631916599839615,
        "end_progress": 0.19927826784282276
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. ",
        "source": "user",
        "last_event_time": 605.0,
        "start_time": 82.0,
        "end_time": 116.0,
        "start_progress": 0.19927826784282276,
        "end_progress": 0.2654370489174018
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 123.0,
        "end_time": 123.0,
        "start_progress": 0.2654370489174018,
        "end_progress": 0.29591018444266237
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? ",
        "source": "user",
        "last_event_time": 605.0,
        "start_time": 126.0,
        "end_time": 155.0,
        "start_progress": 0.29591018444266237,
        "end_progress": 0.3199679230152366
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 161.0,
        "end_time": 161.0,
        "start_progress": 0.3199679230152366,
        "end_progress": 0.326383319967923
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 164.0,
        "end_time": 173.0,
        "start_progress": 0.326383319967923,
        "end_progress": 0.3528468323977546
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" ",
        "source": "user",
        "last_event_time": 605.0,
        "start_time": 175.0,
        "end_time": 182.0,
        "start_progress": 0.3528468323977546,
        "end_progress": 0.36367281475541297
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees?",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 191.0,
        "end_time": 191.0,
        "start_progress": 0.36367281475541297,
        "end_progress": 0.3933440256615878
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\"",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 197.0,
        "end_time": 197.0,
        "start_progress": 0.3933440256615878,
        "end_progress": 0.40016038492381717
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. ",
        "source": "user",
        "last_event_time": 605.0,
        "start_time": 198.0,
        "end_time": 214.0,
        "start_progress": 0.40016038492381717,
        "end_progress": 0.4234161988773055
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 232.0,
        "end_time": 232.0,
        "start_progress": 0.4234161988773055,
        "end_progress": 0.4358460304731355
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" ",
        "source": "user",
        "last_event_time": 605.0,
        "start_time": 234.0,
        "end_time": 236.0,
        "start_progress": 0.4358460304731355,
        "end_progress": 0.44266238973536487
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 252.0,
        "end_time": 252.0,
        "start_progress": 0.44266238973536487,
        "end_progress": 0.46712109061748197
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 258.0,
        "end_time": 258.0,
        "start_progress": 0.46712109061748197,
        "end_progress": 0.47514033680834
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. ",
        "source": "user",
        "last_event_time": 605.0,
        "start_time": 262.0,
        "end_time": 278.0,
        "start_progress": 0.47514033680834,
        "end_progress": 0.49518845228548514
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 289.0,
        "end_time": 289.0,
        "start_progress": 0.49518845228548514,
        "end_progress": 0.5284683239775461
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 298.0,
        "end_time": 298.0,
        "start_progress": 0.5284683239775461,
        "end_progress": 0.5641539695268645
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\"",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 300.0,
        "end_time": 305.0,
        "start_progress": 0.5641539695268645,
        "end_progress": 0.5894145950280674
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" This is not how i normally look. ",
        "source": "user",
        "last_event_time": 605.0,
        "start_time": 306.0,
        "end_time": 317.0,
        "start_progress": 0.5894145950280674,
        "end_progress": 0.603047313552526
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" ",
        "source": "user",
        "last_event_time": 605.0,
        "start_time": 320.0,
        "end_time": 332.0,
        "start_progress": 0.603047313552526,
        "end_progress": 0.6038492381716118
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 340.0,
        "end_time": 340.0,
        "start_progress": 0.6038492381716118,
        "end_progress": 0.6214915797914996
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\"",
        "source": "user",
        "last_event_time": 605.0,
        "start_time": 340.0,
        "end_time": 349.0,
        "start_progress": 0.6214915797914996,
        "end_progress": 0.6391339214113874
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 353.0,
        "end_time": 353.0,
        "start_progress": 0.6391339214113874,
        "end_progress": 0.6459502806736167
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee. The bee looked at me and said \"I am here to serve you and make you happy.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 388.0,
        "end_time": 388.0,
        "start_progress": 0.6459502806736167,
        "end_progress": 0.6756214915797915
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee. The bee looked at me and said \"I am here to serve you and make you happy. I will do anything you ask me to do.\"",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 395.0,
        "end_time": 395.0,
        "start_progress": 0.6756214915797915,
        "end_progress": 0.6908580593424218
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee. The bee looked at me and said \"I am here to serve you and make you happy. I will do anything you ask me to do.\" I looked at the bee and said \"I want to go home.\"",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 401.0,
        "end_time": 401.0,
        "start_progress": 0.6908580593424218,
        "end_progress": 0.710906174819567
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee. The bee looked at me and said \"I am here to serve you and make you happy. I will do anything you ask me to do.\" I looked at the bee and said \"I want to go home.\" The little bee whistled, and along came a host of other bees. The bees all carried me up and took me to this gigantic bee hive. ",
        "source": "user",
        "last_event_time": 605.0,
        "start_time": 402.0,
        "end_time": 421.0,
        "start_progress": 0.710906174819567,
        "end_progress": 0.7626303127506014
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee. The bee looked at me and said \"I am here to serve you and make you happy. I will do anything you ask me to do.\" I looked at the bee and said \"I want to go home.\" The little bee whistled, and along came a host of other bees. The bees all carried me up and took me to this gigantic bee hive. They put me in a room and said \"Your Majesty, this is your room.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 432.0,
        "end_time": 432.0,
        "start_progress": 0.7626303127506014,
        "end_progress": 0.7882919005613472
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee. The bee looked at me and said \"I am here to serve you and make you happy. I will do anything you ask me to do.\" I looked at the bee and said \"I want to go home.\" The little bee whistled, and along came a host of other bees. The bees all carried me up and took me to this gigantic bee hive. They put me in a room and said \"Your Majesty, this is your room. You may go outside and explore the hive if you wish.\"",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 435.0,
        "end_time": 439.0,
        "start_progress": 0.7882919005613472,
        "end_progress": 0.809943865276664
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee. The bee looked at me and said \"I am here to serve you and make you happy. I will do anything you ask me to do.\" I looked at the bee and said \"I want to go home.\" The little bee whistled, and along came a host of other bees. The bees all carried me up and took me to this gigantic bee hive. They put me in a room and said \"Your Majesty, this is your room. You may go outside and explore the hive if you wish.\" I looked at the bees and said \"I want to go home.\"",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 496.0,
        "end_time": 496.0,
        "start_progress": 0.809943865276664,
        "end_progress": 0.8303929430633521
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee. The bee looked at me and said \"I am here to serve you and make you happy. I will do anything you ask me to do.\" I looked at the bee and said \"I want to go home.\" The little bee whistled, and along came a host of other bees. The bees all carried me up and took me to this gigantic bee hive. They put me in a room and said \"Your Majesty, this is your room. You may go outside and explore the hive if you wish.\" I looked at the bees and said \"I want to go home.\" \"This is not my home.\" ",
        "source": "user",
        "last_event_time": 605.0,
        "start_time": 497.0,
        "end_time": 507.0,
        "start_progress": 0.8303929430633521,
        "end_progress": 0.8400160384923817
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee. The bee looked at me and said \"I am here to serve you and make you happy. I will do anything you ask me to do.\" I looked at the bee and said \"I want to go home.\" The little bee whistled, and along came a host of other bees. The bees all carried me up and took me to this gigantic bee hive. They put me in a room and said \"Your Majesty, this is your room. You may go outside and explore the hive if you wish.\" I looked at the bees and said \"I want to go home.\" \"This is not my home.\" The bees looked at me and said \"Your Majesty, this is your home now.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 512.0,
        "end_time": 512.0,
        "start_progress": 0.8400160384923817,
        "end_progress": 0.8672814755412991
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee. The bee looked at me and said \"I am here to serve you and make you happy. I will do anything you ask me to do.\" I looked at the bee and said \"I want to go home.\" The little bee whistled, and along came a host of other bees. The bees all carried me up and took me to this gigantic bee hive. They put me in a room and said \"Your Majesty, this is your room. You may go outside and explore the hive if you wish.\" I looked at the bees and said \"I want to go home.\" \"This is not my home.\" The bees looked at me and said \"Your Majesty, this is your home now. You are the Queen of the Bees.\"",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 517.0,
        "end_time": 517.0,
        "start_progress": 0.8672814755412991,
        "end_progress": 0.880112269446672
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee. The bee looked at me and said \"I am here to serve you and make you happy. I will do anything you ask me to do.\" I looked at the bee and said \"I want to go home.\" The little bee whistled, and along came a host of other bees. The bees all carried me up and took me to this gigantic bee hive. They put me in a room and said \"Your Majesty, this is your room. You may go outside and explore the hive if you wish.\" I looked at the bees and said \"I want to go home.\" \"This is not my home.\" The bees looked at me and said \"Your Majesty, this is your home now. You are the Queen of the Bees.\" \"What do you wish for?\" asked the bee. ",
        "source": "user",
        "last_event_time": 605.0,
        "start_time": 518.0,
        "end_time": 535.0,
        "start_progress": 0.880112269446672,
        "end_progress": 0.8961507618283882
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee. The bee looked at me and said \"I am here to serve you and make you happy. I will do anything you ask me to do.\" I looked at the bee and said \"I want to go home.\" The little bee whistled, and along came a host of other bees. The bees all carried me up and took me to this gigantic bee hive. They put me in a room and said \"Your Majesty, this is your room. You may go outside and explore the hive if you wish.\" I looked at the bees and said \"I want to go home.\" \"This is not my home.\" The bees looked at me and said \"Your Majesty, this is your home now. You are the Queen of the Bees.\" \"What do you wish for?\" asked the bee. Can i get some food maybe? ",
        "source": "user",
        "last_event_time": 605.0,
        "start_time": 537.0,
        "end_time": 545.0,
        "start_progress": 0.8961507618283882,
        "end_progress": 0.9069767441860465
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee. The bee looked at me and said \"I am here to serve you and make you happy. I will do anything you ask me to do.\" I looked at the bee and said \"I want to go home.\" The little bee whistled, and along came a host of other bees. The bees all carried me up and took me to this gigantic bee hive. They put me in a room and said \"Your Majesty, this is your room. You may go outside and explore the hive if you wish.\" I looked at the bees and said \"I want to go home.\" \"This is not my home.\" The bees looked at me and said \"Your Majesty, this is your home now. You are the Queen of the Bees.\" \"What do you wish for?\" asked the bee. Can i get some food maybe? I asked.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 548.0,
        "end_time": 548.0,
        "start_progress": 0.9069767441860465,
        "end_progress": 0.9101844426623897
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee. The bee looked at me and said \"I am here to serve you and make you happy. I will do anything you ask me to do.\" I looked at the bee and said \"I want to go home.\" The little bee whistled, and along came a host of other bees. The bees all carried me up and took me to this gigantic bee hive. They put me in a room and said \"Your Majesty, this is your room. You may go outside and explore the hive if you wish.\" I looked at the bees and said \"I want to go home.\" \"This is not my home.\" The bees looked at me and said \"Your Majesty, this is your home now. You are the Queen of the Bees.\" \"What do you wish for?\" asked the bee. Can i get some food maybe? I asked. The bees looked at me and said \"Your Majesty, we have prepared a feast for you.",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 550.0,
        "end_time": 559.0,
        "start_progress": 0.9101844426623897,
        "end_progress": 0.942261427425822
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee. The bee looked at me and said \"I am here to serve you and make you happy. I will do anything you ask me to do.\" I looked at the bee and said \"I want to go home.\" The little bee whistled, and along came a host of other bees. The bees all carried me up and took me to this gigantic bee hive. They put me in a room and said \"Your Majesty, this is your room. You may go outside and explore the hive if you wish.\" I looked at the bees and said \"I want to go home.\" \"This is not my home.\" The bees looked at me and said \"Your Majesty, this is your home now. You are the Queen of the Bees.\" \"What do you wish for?\" asked the bee. Can i get some food maybe? I asked. The bees looked at me and said \"Your Majesty, we have prepared a feast for you. We have prepared the finest honey, royal jelly, and pollen for you.\"",
        "source": "api",
        "last_event_time": 605.0,
        "start_time": 562.0,
        "end_time": 566.0,
        "start_progress": 0.942261427425822,
        "end_progress": 0.9699278267842822
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\n\n\nYou are now the Queen of the Bees. I am here to serve you and make you happy.  You have the power to make bees do anything you want. You can make them fight, make them build, make them dance, make them do anything you want. I blinked my eyes multiple times to make sure i wasnt dreaming. I looked around and wondered if anyone else could here this dang Bee that was whispering in my ear. I looked around and noticed that no one else was paying any attention to me. Can you first tell me what the heck is going on right now? I asked the Bee. The Bee looked at me and said \"You are now the Queen of the Bees. I am your loyal servant.\" I looked at the Bee and said \"What do you mean i am the Queen of the Bees? I am not a Bee!\" The bee looked at me with amusement, almost in laughter. \"You are the Queen of the Bees. Not just a bee\" I looked at the Bee and said \"I am not the Queen of the Bees. I am a human being. The bee held up a miniture mirror for me to see. I looked at my reflection and noticed that my skin was now a light shade of yellow. I looked at my hands and noticed that they were now covered in yellow and black stripes. I looked at the bee and said \"What the heck is going on here?\" \"This is not how i normally look.\" The bee said \"You are the Queen of the Bees. \"Do you say anything else other than that?\" I asked the bee. The bee looked at me and said \"I am here to serve you and make you happy. I will do anything you ask me to do.\" I looked at the bee and said \"I want to go home.\" The little bee whistled, and along came a host of other bees. The bees all carried me up and took me to this gigantic bee hive. They put me in a room and said \"Your Majesty, this is your room. You may go outside and explore the hive if you wish.\" I looked at the bees and said \"I want to go home.\" \"This is not my home.\" The bees looked at me and said \"Your Majesty, this is your home now. You are the Queen of the Bees.\" \"What do you wish for?\" asked the bee. Can i get some food maybe? I asked. The bees looked at me and said \"Your Majesty, we have prepared a feast for you. We have prepared the finest honey, royal jelly, and pollen for you.\" In that instance, time froze and I awoke in a cold sweat. Back to reality.",
        "source": "user",
        "last_event_time": 605.0,
        "start_time": 572.0,
        "end_time": 605.0,
        "start_progress": 0.9699278267842822,
        "end_progress": 1.0
    }
]