[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "Detective David Tapp, who is investigating the disappearance of Marybeth's husband, Joe, has a flashback to his own childhood.",
        "source": "user"
    },
    {
        "text": "It was Tapp's own dad, who was drunk, that was responsible for an accident that left the boy with a facial scar.",
        "source": "api"
    },
    {
        "text": "He wonders what is the old man's mug says.",
        "source": "api"
    },
    {
        "text": "He bets it's very low in the rankings.",
        "source": "user"
    },
    {
        "text": "Marybeth says that Joe was also always drunk and probably crashed his car while driving while intoxicated.",
        "source": "user"
    },
    {
        "text": "But here's the thing.",
        "source": "api"
    },
    {
        "text": "Any mugs that owners were already dead are now blank.",
        "source": "user"
    },
    {
        "text": "Joe's mug isn't blank at all.",
        "source": "user"
    },
    {
        "text": "What's interesting, as Detective Tapp has figured out, \"he's number one!",
        "source": "user"
    },
    {
        "text": "\" was written on it.",
        "source": "api"
    },
    {
        "text": "\"So Joe must still be alive\" Tapp notes, and he runs out of the room to look for him.",
        "source": "api"
    },
    {
        "text": "\"But how can be a drunk husband be the number 1 dad?",
        "source": "api"
    },
    {
        "text": "\" Detective Tapp contemplated.",
        "source": "user"
    },
    {
        "text": "\"It just doesn't make sense.",
        "source": "user"
    },
    {
        "text": "How are the rankings decided?",
        "source": "user"
    },
    {
        "text": "\" There were thoughts running on Detective Tapp's mind as he follows on a clue on Joe's last whereabouts.",
        "source": "api"
    },
    {
        "text": "He stops by the local bar as there were multiple witnesses to Joe's last night before he disappeared.",
        "source": "user"
    },
    {
        "text": "He spoke with a woman who recognized Joe from the picture.",
        "source": "api"
    },
    {
        "text": "\"He was in here last night,\" she said, \"He was drinking way too much, very drunk.",
        "source": "api"
    },
    {
        "text": "\" said the woman.",
        "source": "api"
    },
    {
        "text": "\"Did he say where he's going to go?",
        "source": "api"
    },
    {
        "text": "\" Detective Tapp asked.",
        "source": "user"
    },
    {
        "text": "\"He was talking about his wife and kids,\" the woman said.",
        "source": "user"
    },
    {
        "text": "\"He said that his wife was always complaining about how much he worked, and it made him stressed.",
        "source": "api"
    },
    {
        "text": "\"\n\nDetective Tapp leaves the bar and gets a call from his partner.",
        "source": "api"
    },
    {
        "text": "His partner said, \"We found Joe's car on the highway.",
        "source": "api"
    },
    {
        "text": "\" Fearing for the worst, Detective Tapp knew that there must be something wrong.",
        "source": "api"
    },
    {
        "text": "He arrived to the scene and he saw Joe, alive, with a blanket over him.",
        "source": "api"
    },
    {
        "text": "It turned out that Joe had saved a child from a car accident, and he was a hero.",
        "source": "user"
    },
    {
        "text": "That made him the #1 Dad.",
        "source": "api"
    }
]