[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "As you watch yourself go through life this time around, your past lives begin to slip away.",
        "source": "api"
    },
    {
        "text": "With each new life previous lives become more distant.",
        "source": "api"
    },
    {
        "text": "You begin wo wonder what is in store for your next life?",
        "source": "user"
    },
    {
        "text": "Will it be the same as one of your previous lives?",
        "source": "user"
    },
    {
        "text": "You will probably look similar but will you know the same people?",
        "source": "api"
    },
    {
        "text": "Will you live in the same town?",
        "source": "user"
    },
    {
        "text": "Will your choice of partner seem as inexplicable as it did in a previous life?",
        "source": "api"
    },
    {
        "text": "There is much in your previous lives that seems inexplicable but you have heard everything happens for a reason.",
        "source": "api"
    },
    {
        "text": "You are comforted by the thought that each life has led up to this one.",
        "source": "user"
    },
    {
        "text": "You know that wherever you go that is where you are supposed to be.",
        "source": "api"
    },
    {
        "text": "You remember the previous life in which your pet dog died.",
        "source": "user"
    },
    {
        "text": "You really hope in this life you will meet again.",
        "source": "api"
    },
    {
        "text": "You suddenly have a thought.",
        "source": "user"
    },
    {
        "text": "Maybe each time you live you will have more love to give.",
        "source": "api"
    },
    {
        "text": "In this life the love you have for a dog will be that dog as well as all other dogs you have ever had.",
        "source": "user"
    },
    {
        "text": "Maybe one day you will even be able to love yourself.",
        "source": "user"
    },
    {
        "text": "It has been hard because you carry thoughts of all the things you wish you had done.",
        "source": "api"
    },
    {
        "text": "You decide this next life will be the best yet.",
        "source": "user"
    },
    {
        "text": "You will forgive yourself for prior failures and bring all of your experience into this next life.",
        "source": "user"
    },
    {
        "text": "In this next life you have more love to give than ever before.",
        "source": "user"
    },
    {
        "text": "You not only have a dog but you are a veterinarian that gets to heal dogs.",
        "source": "user"
    },
    {
        "text": "This is the life you had always wanted but never allowed yourself to live.",
        "source": "user"
    },
    {
        "text": "You hope this life will last forever but you know you will never forget the experiences and bring them to your next life too.",
        "source": "api"
    }
]