[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "Right away, his mom was worried since she couldn't get a hold of him.",
        "source": "user"
    },
    {
        "text": "She thought aliens had abducted him.",
        "source": "user"
    },
    {
        "text": "She contacted the police, who know full well that aliens love abducting Matt Damon.",
        "source": "user"
    },
    {
        "text": "They abducted him last year too.",
        "source": "user"
    },
    {
        "text": "But they needed to find out where this alien was.",
        "source": "user"
    },
    {
        "text": "So the CIA, NASA, and many other government agencies got involved.",
        "source": "user"
    },
    {
        "text": "They looked all over and couldn't find him.",
        "source": "user"
    },
    {
        "text": "So they turned to the public.",
        "source": "user"
    },
    {
        "text": "There was a public announcement that if anyone sees either an alien or Matt Damon to call the authorities.",
        "source": "user"
    },
    {
        "text": "Steven Spielberg saw the announcement on his TV.",
        "source": "user"
    },
    {
        "text": "\"I think I saw an alien just yesterday,\"he told the FBI over the phone.",
        "source": "user"
    },
    {
        "text": "It was in the woods behind my house.",
        "source": "user"
    },
    {
        "text": "No one believed me but I think I saw a UFO.",
        "source": "user"
    },
    {
        "text": "It was a big, black ship,\"Steven Spielberg said. \n\nSo the FBI searched behind Spielberg's house for the big black ship or the alien. Finally someone saw the ship. The FBI surrounded it and knocked on the door. Out of it came the alien, with Matt Damon alongside him. \"I am being abducted, I think!\"",
        "source": "user"
    },
    {
        "text": "\" Matt Damon said.",
        "source": "user"
    },
    {
        "text": "But this made no sense.",
        "source": "user"
    },
    {
        "text": "If he was being abducted, then why didn't the alien just take him?",
        "source": "api"
    },
    {
        "text": "\"What do you want from us?\" one of the FBI agents asked the alien.",
        "source": "user"
    },
    {
        "text": "\"I want you to make a movie about this!\" the alien said.",
        "source": "api"
    },
    {
        "text": "Just then, Spielberg approached.",
        "source": "user"
    },
    {
        "text": "\"I'll make your movie!\" said Spielberg.",
        "source": "user"
    },
    {
        "text": "\"Just release Matt Damon and I'll make a movie about you!\"",
        "source": "user"
    },
    {
        "text": "So they made a deal and the alien released Matt Damon in return for having a movie made about him.",
        "source": "user"
    },
    {
        "text": "Matt Damon lives to survive another abduction.",
        "source": "user"
    },
    {
        "text": "Until next time.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "api"
    }
]