[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "She was starting to grow tired of always going on first dates, but she actually kind of liked the spontaneity of it.",
        "source": "user"
    },
    {
        "text": "She was meeting someone new each night, so she could present herself in a different way, depending on her mood.",
        "source": "user"
    },
    {
        "text": "It didn't matter whether it was a blind date or not, though, because they all ended up being the same.",
        "source": "user"
    },
    {
        "text": "No matter what she said, or how she introduced herself, all of her suitors seemed to ask the same sets of questions.",
        "source": "user"
    },
    {
        "text": "She felt like she was always giving the same answers too.",
        "source": "api"
    },
    {
        "text": "No matter how much she tried to pretend to be someone else, she felt compelled to tell the truth.",
        "source": "user"
    },
    {
        "text": "She got the sinking feeling that someone might remember if she gave a false answer.",
        "source": "user"
    },
    {
        "text": "\"Was it possible that she had been dating the same guy over and over again?\" she thought to herself.",
        "source": "user"
    },
    {
        "text": "\"No, that's preposterous\" she quickly responded to the voice in her head.",
        "source": "user"
    },
    {
        "text": "They must be communicating, somehow.",
        "source": "user"
    },
    {
        "text": "Maybe all the single guys in this city have started their own social network.",
        "source": "user"
    },
    {
        "text": "Everyone who gets turned down by a woman gives advice to the others, and they try to learn from each other's mistakes.",
        "source": "user"
    },
    {
        "text": "\"Or maybe I'm just unattainable\" she thought.",
        "source": "user"
    },
    {
        "text": "Even so, she decided to get ready for another date.",
        "source": "user"
    },
    {
        "text": "It might not lead anywhere, but at least she was enjoying herself, and getting free dinner to boot.",
        "source": "user"
    },
    {
        "text": "That night, she was meeting a guy who had just moved to the city, and he didn't know anybody.",
        "source": "user"
    },
    {
        "text": "But when he showed up at her house, he looked exactly like someone she had already dated.",
        "source": "user"
    },
    {
        "text": "\"What did you say your name was?\" she asked him",
        "source": "user"
    },
    {
        "text": "\"Jack Johnson\" he replied",
        "source": "user"
    },
    {
        "text": "\"Do you have a twin brother, named John Jackson?\"",
        "source": "user"
    },
    {
        "text": "He got nervous and sweaty at that point.",
        "source": "user"
    },
    {
        "text": "\"No, I'm serious.\"  I met him just last week, \"See, we took pictures together!\" and she showed him some smiling photos of herself with her one-time date who looked exactly like this new stranger.",
        "source": "user"
    },
    {
        "text": "\"Oh no\" he moaned.",
        "source": "user"
    },
    {
        "text": "\"I can't do it anymore!\"",
        "source": "user"
    },
    {
        "text": "He didn't explain himself, but she understood.",
        "source": "user"
    },
    {
        "text": "\"That's okay,\" she said, \"I had fun with you the last time you looked like this.  Why don't we try again.  Can I call you John?\"",
        "source": "user"
    },
    {
        "text": "Relieved, he let out a sigh, \"Well, my real name is 325b055dc5354c97bcec21e33d77a96b.  But John works, too.  Now, this time, why don't you tell me all about yourself?\"",
        "source": "user"
    },
    {
        "text": "THE END",
        "source": "user"
    }
]