[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.\" And the pig was like, \"what wolf?\" The wolf was a little annoyed because he knew that the 92nd little pig had only built his house out of depleted uranium on the totally incorrect assumption that the wolf was going to try to blow his house down.",
        "source": "api"
    },
    {
        "text": "Which didn't even make any sense, because wolfs can't blow down houses anyway.",
        "source": "user"
    },
    {
        "text": "It's not in their job description.",
        "source": "user"
    },
    {
        "text": "Yes, there's that whole story of the three little pigs, but that story gave wolves a bad reputation that is totally undeserved.",
        "source": "user"
    },
    {
        "text": "So the wolf felt that he was being discriminated against, and so he called his lawyer.",
        "source": "user"
    },
    {
        "text": "And his lawyer said, \"Yeah, you've got a case. I can totally win you damages.\" The wolf said, \"What do you mean damages?\" And the lawyer explained, \"Well, you've got this unfair depiction of wolves out there, and it's destroying your reputation.\" The wolf nodded.",
        "source": "user"
    },
    {
        "text": "Finally, someone understood his plight.",
        "source": "user"
    },
    {
        "text": "And he knew that his lawyer could get the job done, because his lawyer was a wolf in sheep's clothing, and regardless, his lawyer was a graduate of Yale Law School.",
        "source": "user"
    },
    {
        "text": "Yes, that's right, his lawyer had even turned down an offer to work for white shoe law firm Wolf, Schmool & Schmurtz, but that's neither here nor there.",
        "source": "user"
    },
    {
        "text": "The point was that this lawyer was an excellent one.",
        "source": "user"
    },
    {
        "text": "So, the wolf got started in terms of compiling his case.",
        "source": "user"
    },
    {
        "text": "And he thought about all of the ways that people had been discriminating against him in a way that was completely unfair.",
        "source": "user"
    },
    {
        "text": "And he had a long list.",
        "source": "user"
    },
    {
        "text": "For example, at the zoo he always got to sit in the last car of the train, and people would throw things at him, which wasn't fair.",
        "source": "user"
    },
    {
        "text": "And sometimes when he went to the beach, people would put up fences so he couldn't get to the water.",
        "source": "user"
    },
    {
        "text": "The wolf felt increasingly depressed thinking of all the ways that showed he was a disliked creature.",
        "source": "user"
    },
    {
        "text": "He knew his lawyer would need to dazzle the judge.",
        "source": "user"
    },
    {
        "text": "On the day of the hearing, the wolf's lawyer stood before the judge and said, \"Your honor, I have here a petition for damages.\" And the judge was like, \"Why does this petition say that we're here to talk about a lawsuit against the pigs?\" And the lawyer explained, \"Yes your honor, we are here to talk about a lawsuit against the pigs. My client is here to talk about the unfair portrayal of wolves in the story of the three little pigs.\" \"I'm listening,\" said the judge.",
        "source": "user"
    },
    {
        "text": "\"Your honor, the wolf is an upstanding citizen. And that story is a total lie! It never happened and the pigs just wanted sympathy from people all around the world. But that story is so out there that it has caused my client to suffer undue discrimination. My client is now suing for damages, which he believes is fair.\" The pigs who are the named defendants in the suit were flabbergasted.",
        "source": "user"
    },
    {
        "text": "They hadn't thought the wolf would go that far.",
        "source": "user"
    },
    {
        "text": "\"We were just trying to make a point,\" they said.",
        "source": "user"
    },
    {
        "text": "\"We weren't out to ruin your reputation, wolf.\" The wolf nodded but said he still wanted his millions.",
        "source": "user"
    },
    {
        "text": "In the end, the judge was sympathetic to the wolf's plight.",
        "source": "user"
    },
    {
        "text": "The judge knew how tough a defamation case would be on the wolf's career and thought monetary damages were suitable as a remedy.",
        "source": "user"
    },
    {
        "text": "So, the judge awarded the wolf $123.",
        "source": "user"
    },
    {
        "text": "45 million in damages and ordered that any further retelling of the story of \"The Three Little Pigs.",
        "source": "api"
    }
]