[
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.15551425030978935
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, older sterotypes of African Americans that were in the movies and on TV irk me a little when I see them. When I visit my parents they always have old movies on in the background and its incredable to see the difference in how they were portrayed back then compared to today. Not that they have equal status today but atleast a black man can be cast as president without it being an issue. \n",
        "source": "user",
        "start_time": 15.0,
        "end_time": 114.0,
        "last_event_time": 114.0,
        "start_progress": 0.15551425030978935,
        "end_progress": 0.39714993804213133
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, older sterotypes of African Americans that were in the movies and on TV irk me a little when I see them. When I visit my parents they always have old movies on in the background and its incredable to see the difference in how they were portrayed back then compared to today. Not that they have equal status today but atleast a black man can be cast as president without it being an issue. I dont think they will ever go away but maybe fade away as time goes on.\n",
        "source": "api",
        "start_time": 145.0,
        "end_time": 145.0,
        "last_event_time": 145.0,
        "start_progress": 0.39714993804213133,
        "end_progress": 0.44175960346964066
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, older stereotypes of African Americans that were in the movies and on TV irk me a little when I see them. When I visit my parents they always have old movies on in the background and its incredible to see the difference in how they were portrayed back then compared to today. Not that they have equal status today but at least a black man can be cast as president without it being an issue. I dont think they will ever go away completely but maybe fade away as time goes on. The nation is also diversify very fast and pretty soon whites will be in the minority. There may soon be an issue with stereotypical whites at the center. Disney is notorious for this in their classic cartoons. They portrayed blacks usually as ignorant and poor. It is at the same time refreshing to see that society does come around and kind of quickly on certain social issues that  make everyone more equal but still hard to watch without that nagging voice in the back of your head saying this is wrong. One other thing that stands out is the treatment of women as simple housewives that have almost no depth. They were treated as second rate and ill informed. That too has changed dramatically. This is also good for society in general to see equality of TV because it will start to become second nature and race will not determine so many things but character and experience will. \n",
        "source": "user",
        "start_time": 149.0,
        "end_time": 592.0,
        "last_event_time": 592.0,
        "start_progress": 0.44175960346964066,
        "end_progress": 1.0
    }
]