[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "You are very interested in what this next life will be.",
        "source": "api"
    },
    {
        "text": "You are thankful for any life but you really are hoping you will be reincarnated as someone very talented or famous.",
        "source": "user"
    },
    {
        "text": "You are a little bit disappointed when you find out you will be born as a peasant in some faraway village.",
        "source": "user"
    },
    {
        "text": "This does not seem like an interesting or rewarding life to you.",
        "source": "api"
    },
    {
        "text": "You must move forward in this new life as a peasant.",
        "source": "user"
    },
    {
        "text": "You are born into a loving family.",
        "source": "user"
    },
    {
        "text": "You are surrounded by good people and community.",
        "source": "api"
    },
    {
        "text": "Though you must work very hard and have no luxury in your life,  you value the people that surround you and the way people care for one another.",
        "source": "user"
    },
    {
        "text": "This is the first life you have had where you truly feel love and trust for others.",
        "source": "user"
    },
    {
        "text": "Eventually you marry a wonderful man and have four children.",
        "source": "user"
    },
    {
        "text": "Your family is very close and loving and you get to raise and teach your children in a way that you are very involved and close with them.",
        "source": "user"
    },
    {
        "text": "When they grow up they remain close to the community and you get to spend a lot of time with your grandchildren as well.",
        "source": "user"
    },
    {
        "text": "Your biggest accomplishment is your wonderful family.",
        "source": "user"
    },
    {
        "text": "This life has taught you that fame and wealth are not the important things you should hope for in a life.",
        "source": "user"
    },
    {
        "text": "You learned the value of the people in your life and the family that you build because those are things that will last and endure after you are gone.",
        "source": "user"
    }
]