[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.\"",
        "source": "api"
    },
    {
        "text": "So the 92nd little pig was like, \"The wolf is not going to blow up my house.\"",
        "source": "api"
    },
    {
        "text": "The wolf was like, \"I'm the Big Bad Wolf. I can do anything!\" He puffed up his chest and howled loudly.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig was like, \"bring it on, sucka.\" The Big Bad Wolf called for reinforcements.",
        "source": "user"
    },
    {
        "text": "He blew his wolf whistle and a bunch of wolves came.",
        "source": "user"
    },
    {
        "text": "The wolf and the group of wolves were like, \"we're going to blow up that pig's house.\" They all breathed in as far as much air as their lungs could hold and then blew out in unison.",
        "source": "user"
    },
    {
        "text": "The 92nd little pig laughed at them.",
        "source": "user"
    },
    {
        "text": "They weren't going to be able to blow this house over.",
        "source": "user"
    },
    {
        "text": "He was an evolved piggy, a smart one.",
        "source": "user"
    },
    {
        "text": "The other piggies were eaten by the wolves, who were now obese, but this guy - he was smarter than the rest.",
        "source": "user"
    },
    {
        "text": "The wolf and the group of wolves tried to blow up the pig's house for three days and three nights but they just couldn't do it Eventually, one fell over and died after hyperventilating too many times, giving him pulmonary thrombosis.",
        "source": "user"
    },
    {
        "text": "The other wolves ate him, and then they all got dysentery from the wolf meat.",
        "source": "user"
    },
    {
        "text": "The 92nd little pig was like, \"ha ha, suckers!\"",
        "source": "user"
    },
    {
        "text": "One day, weeks later, the Big Bad Wolf had brought some more friends.",
        "source": "user"
    },
    {
        "text": "He had brought his Big Bad Elephant gang to mow the house down.",
        "source": "user"
    },
    {
        "text": "The 92nd little pig was eating a bunch of apples while rolling in his mud pool when he heard a loud thump.",
        "source": "user"
    },
    {
        "text": "He looked out the window.",
        "source": "user"
    },
    {
        "text": "\"What the- ?\" he said.",
        "source": "api"
    },
    {
        "text": "The Big Bad Wolf and the Big Bad Elephant gang were standing in front of his house with a bunch of other elephants.",
        "source": "user"
    },
    {
        "text": "\"What up, piggy?\" said the Big Bad Wolf.",
        "source": "user"
    },
    {
        "text": "\"You thought we were done with you, huh?\"",
        "source": "api"
    },
    {
        "text": "The 92nd little pig stared at the Big Bad Elephant gang.",
        "source": "api"
    },
    {
        "text": "\"You brought your crew, huh?\" said the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "\"You're going to need a bigger crew.\"",
        "source": "api"
    },
    {
        "text": "\"We are the biggest,\" said Big Bad Wolf.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig went to his closet and grabbed his Rocket-propelled grenade.",
        "source": "user"
    },
    {
        "text": "He loaded it and aimed it at the Big Bad Wolf and the elephant gang.",
        "source": "user"
    },
    {
        "text": "\"Adios Amigos!\" he said as he blew up the Big Bad Wolf's gang and all of Bambi's relatives.",
        "source": "user"
    }
]