[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "The government and people of the United States are confused and outraged.",
        "source": "api"
    },
    {
        "text": "Why did none of the other countries of the world honor the isolation agreement, they wonder.",
        "source": "user"
    },
    {
        "text": "During the 50 years that have gone by the world has changed drastically.",
        "source": "user"
    },
    {
        "text": "The United States is no longer the most powerful nation on earth.",
        "source": "user"
    },
    {
        "text": "Most other nations have conglomerated into larger regional collectives.",
        "source": "api"
    },
    {
        "text": "Most of Asia operates as one collective and this is true for most regions of the globe.",
        "source": "user"
    },
    {
        "text": "The United States is now a third world country, and the only nation that has not joined a collective.",
        "source": "user"
    },
    {
        "text": "The rest of the world is moving towards a global political structure, a one world government.",
        "source": "api"
    },
    {
        "text": "The economic and social situation of many people has greatly improved.",
        "source": "user"
    },
    {
        "text": "The world is a much safer place.",
        "source": "user"
    },
    {
        "text": "War is much rarer now.",
        "source": "api"
    },
    {
        "text": "It is stifled within the large political unions and conflict between them is avoided.",
        "source": "user"
    },
    {
        "text": "The United States demands to know why the other countries did not self-isolate and continued on this path.",
        "source": "user"
    },
    {
        "text": "The other countries respond by saying that they did not need to isolate themselves because they were not the ones who started the war.",
        "source": "user"
    },
    {
        "text": "It was always the United States that was the biggest threat to world peace and stability, they say.",
        "source": "api"
    },
    {
        "text": "Tricking the US into getting out of international affairs for a while was the only way to progress towards a more united and peaceful world.",
        "source": "user"
    }
]