[
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.22138728323699422
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, every middle and high school should have these dispensers in the girl's bathrooms. Even in elementary schools, there should be some kept in the clinic just in case. \n",
        "source": "user",
        "start_time": 16.0,
        "end_time": 82.0,
        "last_event_time": 82.0,
        "start_progress": 0.22138728323699422,
        "end_progress": 0.3173410404624277
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, every middle and high school should have these dispensers in the girl's bathrooms. Even in elementary schools, there should be some kept in the clinic just in case. Leave them in the bathroom like you would toilet paper.\n",
        "source": "api",
        "start_time": 103.0,
        "end_time": 103.0,
        "last_event_time": 103.0,
        "start_progress": 0.3173410404624277,
        "end_progress": 0.3491329479768786
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty\"? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, every middle and high school should have these dispensers in the girl's bathrooms. Even in elementary schools, there should be some kept in the clinic just in case. Leave them in the bathrooms like you would toilet paper or soap. They are a disposable, vital, hygiene product. This should not be a funding issues because they are extremely cheap and can be bought even cheaper wholesale. I have a feeling the school boards could negotiate some great deals with huge suppliers. \nEnough about the financial aspect, lets discuss the personal aspects of this situation. I am a man so it is hard for me to fully relate but I can only imagine if my rear end started bleeding in class and everybody saw it. I would be horrified. The emotional toll that can take on a child or young adult can be life changing. With social media and smart phones, we are constantly in contact and if similar situation for a female happened for the whole class to see, she could be harassed about it relentlessly for sometimes years. It had the potential to send them into a self conscious death spiral. I'm no expert but if we can just give our young women the confidence of knowing that is not something they have to worry about, it could do wonders for their confidence and overall well being. It would also eliminate countless incidents of teasing and even harassment.\n",
        "source": "user",
        "start_time": 106.0,
        "end_time": 650.0,
        "last_event_time": 650.0,
        "start_progress": 0.3491329479768786,
        "end_progress": 1.0
    }
]