[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "The theater is dark, and the intro plays.",
        "source": "api"
    },
    {
        "text": "It's the perfect theme song, the melody whimsical at times, then serious and energetic.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "exactly how your imagined your life was.",
        "source": "user"
    },
    {
        "text": "Several audience members whistle along.",
        "source": "user"
    },
    {
        "text": "The film begins, and you see yourself as a baby, being born.",
        "source": "user"
    },
    {
        "text": "You see your mother and father, and the doctor.",
        "source": "api"
    },
    {
        "text": "You see the room you were born in, and the first time you were held.",
        "source": "api"
    },
    {
        "text": "You see yourself as a toddler, and your first day of school.",
        "source": "api"
    },
    {
        "text": "You see yourself as a teenager, and your first kiss.",
        "source": "api"
    },
    {
        "text": "You see yourself as a young adult, and your first car.",
        "source": "api"
    },
    {
        "text": "You see yourself as a middle-aged man, and your first child.",
        "source": "api"
    },
    {
        "text": "You see yourself as an old man, and your last breath.",
        "source": "api"
    },
    {
        "text": "All of your life and memories flash before your character's eyes, and then he breathes his last.",
        "source": "api"
    },
    {
        "text": "Suddenly, there is a loud noise behind you in the theater.",
        "source": "user"
    },
    {
        "text": "You turn around, and cannot believe your eyes.",
        "source": "user"
    },
    {
        "text": "It is the old man from the movie, but he is being ushered down the aisle.",
        "source": "user"
    },
    {
        "text": "Everyone cheers and applauds, and the screen goes blank.",
        "source": "user"
    },
    {
        "text": "You are very confused.",
        "source": "user"
    },
    {
        "text": "\"What just happened?",
        "source": "user"
    },
    {
        "text": "\" You ask yourself.",
        "source": "user"
    },
    {
        "text": "\"Where am I?",
        "source": "user"
    },
    {
        "text": "\"  \nThere is soft white light surrounding everything, and it hits you all at once.",
        "source": "user"
    },
    {
        "text": "You are dead, and you are in Heaven.",
        "source": "user"
    },
    {
        "text": "A tall woman approaches you.",
        "source": "user"
    },
    {
        "text": "She is dressed in a long white robe, and her hair is long and flowing.",
        "source": "api"
    },
    {
        "text": "\"You have been given a rare chance\", she says.",
        "source": "api"
    },
    {
        "text": "\"I have been instructed to give you a choice.",
        "source": "user"
    },
    {
        "text": "\" \n\"A choice?",
        "source": "user"
    },
    {
        "text": "\" You ask, bewildered.",
        "source": "user"
    },
    {
        "text": "\"You may return to Earth, to give advice to your next self, to improve them, and help you avoid pitfalls.",
        "source": "user"
    },
    {
        "text": "\" But, you will feel their pain, their anger, their failure in life, but none of the good.",
        "source": "user"
    },
    {
        "text": "Will you do this?",
        "source": "user"
    },
    {
        "text": "\" \n\"Yes\", you say, without hesitation.",
        "source": "user"
    },
    {
        "text": "The world changes around you.",
        "source": "user"
    },
    {
        "text": "You are in a delivery room, and there is a baby crying.",
        "source": "api"
    },
    {
        "text": "The nurse says your name, and you realize nobody can see you, and that she is speaking to the baby.",
        "source": "user"
    },
    {
        "text": "You feel a surge of energy.",
        "source": "user"
    },
    {
        "text": "You are here, a guardian angel to your future self.",
        "source": "user"
    }
]