[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "In a forgotten age, mana was the engine for humanities advancement.",
        "source": "api"
    },
    {
        "text": "It was used to power magic.",
        "source": "user"
    },
    {
        "text": "When people of today think \"magic\", they think of someone pulling a rabbit out of a hat.",
        "source": "user"
    },
    {
        "text": "I am talking about TRUE magic.",
        "source": "user"
    },
    {
        "text": "The ability to manipulate the elements, to fly, to teleport, to manipulate time and space.",
        "source": "user"
    },
    {
        "text": "All of these things were possible through the engine of magic.",
        "source": "api"
    },
    {
        "text": "Mana was the fuel for that engine.",
        "source": "user"
    },
    {
        "text": "My ancestors were once powerful wielders of magic.",
        "source": "user"
    },
    {
        "text": "For some reason, my family had been blessed with larger mana stores.",
        "source": "user"
    },
    {
        "text": "Our capacity to hold mana seemed to exceed the other people of the past.",
        "source": "user"
    },
    {
        "text": "I am the last of my family.",
        "source": "user"
    },
    {
        "text": "My family never taught me about how to use mana.",
        "source": "user"
    },
    {
        "text": "That is because I had no real contact with my family.",
        "source": "user"
    },
    {
        "text": "My parents  My only contact is old journals that were left to me when my parents died.",
        "source": "user"
    },
    {
        "text": "Through those journals, I have been able to learn how to wield mana.",
        "source": "user"
    },
    {
        "text": "We need this ancient power in order to fight back against the \"Mlon\".",
        "source": "user"
    },
    {
        "text": "The \"Mlon\" is an alien race that came to earth 10 years ago.",
        "source": "user"
    },
    {
        "text": "At first, they seemed peaceful.",
        "source": "user"
    },
    {
        "text": "They were certainly peaceful, but that was to analyze how strong we were.",
        "source": "user"
    },
    {
        "text": "Once they realized our weaknesses, they became much more aggressive.",
        "source": "user"
    },
    {
        "text": "The \"Mlon\" are a race of insect-like creatures.",
        "source": "user"
    },
    {
        "text": "I almost was killed by one until I discovered that the mana within me protected me.",
        "source": "user"
    },
    {
        "text": "They seem to be vulnerable to mana and magic.",
        "source": "user"
    },
    {
        "text": "I have made it my mission to find others like me so we can fight the \"Mlon\".",
        "source": "user"
    },
    {
        "text": "I have found a few others like me, but they are not as strong as I am.",
        "source": "user"
    },
    {
        "text": "The more that we train the more confident that I feel that we have a chance in this fight.",
        "source": "api"
    },
    {
        "text": "The fight to protect earth.",
        "source": "user"
    }
]