[
    "When you die, you appear in a cinema with a number of other people who look like you.",
    "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
    "You are shaken by what you are seeing.",
    "All of these people, seemingly so different, you know them because they are you.",
    "You know that they are you, you recognized them.",
    "It's as if they've always been with you.",
    "You always knew them, but you couldn't bring it up to your conscious thought.",
    "The experience is very disorienting.",
    "You try to regain your focus and allow yourself to look, carefully around the room.",
    "It's a theater with rows of seats going up, and you're on the bottom floor.",
    "As you look up the columns of people, you are amazed by how much you know about each of them.",
    "Hundreds of people, and they are all you.",
    "You continue to watch the film, and you see yourself in a beautiful scene.",
    "You remember the day your oldest son was born.",
    "You remember how you felt.",
    "Suddenly, you realize that you have felt that way hundreds of times.",
    "You have the memory of that joy hundreds of times.",
    "It's as if you realize that your purpose has been to be a good parent, hundreds of times.",
    "You feel a great warmth in your heart, as your mind thinks over the many children you have loved and continue to love.",
    "Each of them having their own theater, and their own memories.",
    "You are part of something wonderful.",
    "Then you see something in the film that makes you incredibly sad.",
    "You see some of the times that you couldn't make time for your son.",
    "You think of all your previous lives, which have suddenly come into view in this theater, and you see many times where this was the case.",
    "You regret those times so intensely, because there are so many of them in your memory now.",
    "You now know that you have been a neglectful parent hundreds of times.",
    "You can't stand the pain of this thought, and you begin to sob.",
    "The other people in the audience who are you, give you a knowing look.",
    "They all stand, in unison, and they face you.",
    "It's like some kind of cosmic hug.",
    "You can feel each of them cradling you and comforting you.",
    "You can feel their thoughts, which are all in agreement that it's okay and that it's going to be okay.",
    "You're not alone, there are hundreds of you.",
    "As odd as that statement is, it's true.",
    "You are the sum of so many experiences, that you are the best company for you.",
    "In this theater, you have that.",
    "It's like heaven.",
    "Then one day, you are called back to be reborn.",
    "You disappear from the theater and it all begins again.",
    ""
]