[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "Japan and China have merged.",
        "source": "user"
    },
    {
        "text": "It's now called Pan China.",
        "source": "user"
    },
    {
        "text": "Unfortunately they have steamrolled the rest of the world.",
        "source": "user"
    },
    {
        "text": "They are an authoritarian government - repressing all who don't toe the party line.",
        "source": "user"
    },
    {
        "text": "They have mandated that all persons be married, and they are required to have 10 children in each family.",
        "source": "user"
    },
    {
        "text": "The state decides whom will be married to whom.",
        "source": "user"
    },
    {
        "text": "This has resulted into a juggernaut.",
        "source": "user"
    },
    {
        "text": "They are basically unstoppable.",
        "source": "user"
    },
    {
        "text": "The rest of the world, save the US, have all banded together to fight them.",
        "source": "user"
    },
    {
        "text": "Alas, they seem unstoppable.",
        "source": "user"
    },
    {
        "text": "With so many strong young people available to feed into their military, nothing seems to stop them.",
        "source": "user"
    },
    {
        "text": "They are also leading in technology, right now they are involved in advancing on the former Country called Russia.",
        "source": "user"
    },
    {
        "text": "Some other nations are supporting them, to help check the Asian Pan Chinese.",
        "source": "user"
    },
    {
        "text": "The harsh plains of Siberia is the location, presently of the conflict.",
        "source": "user"
    },
    {
        "text": "USA is at a loss.",
        "source": "user"
    },
    {
        "text": "Persons in the newly unexiled country are wondering where they fit in.",
        "source": "user"
    },
    {
        "text": "The new tech wielded by Pan China is boggling and there seems no stopping them.",
        "source": "user"
    },
    {
        "text": "The US president, Arnold Swartzenegger seems full of bluster, but the tech and manpower needed to match seem futile.",
        "source": "user"
    },
    {
        "text": "The other issue faced is that of the annual lottery.",
        "source": "user"
    },
    {
        "text": "The prospect of winning cash/homes is somewhat dulled by the grim reality being faced.",
        "source": "user"
    },
    {
        "text": "The lottery had it's bad side too, that of decimation of the county of the selected person, by lot.",
        "source": "user"
    },
    {
        "text": "The actual killing of 10% of the counties population, seems quaint now.",
        "source": "user"
    },
    {
        "text": "We need more people not less, giving up of 10% of persons is silly and must be rethought.",
        "source": "user"
    },
    {
        "text": "We need more people not less.",
        "source": "user"
    },
    {
        "text": "Arnold, the president of US has opined that maybe we need to encourage MORE children and intermixing, NOT less.",
        "source": "user"
    },
    {
        "text": "This idea has resistance but is still sound.",
        "source": "user"
    },
    {
        "text": "His idea of encouraging open borders, to encourage immigration and intermixing is resisted by many.",
        "source": "api"
    },
    {
        "text": "in addition",
        "source": "user"
    },
    {
        "text": "So a cabinet meeting is convened.",
        "source": "user"
    },
    {
        "text": "Representatives from everywhere in the states meet to voice a vote.",
        "source": "user"
    },
    {
        "text": "We must evolve Arnold says, some agree, it's time for the vote.",
        "source": "user"
    },
    {
        "text": "After some heated debate, the vote is taken.",
        "source": "user"
    },
    {
        "text": "The vote fails, Those in agreement act as ambassadors, setting up a concession with China/Japan, Pan China.",
        "source": "user"
    },
    {
        "text": "We will bow to their wishes and allow exploitation of all our resources.",
        "source": "user"
    },
    {
        "text": "The era of US has ended and we bow to the will of our new Asian overlords.",
        "source": "user"
    },
    {
        "text": "All praise to Pan China, now Pan China America.",
        "source": "user"
    }
]