[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.\" And the 92nd little pig was like, \"what?\" And the wolf was like, \"dude, that's not a good idea.\"",
        "source": "api"
    },
    {
        "text": "\"What do you me,\" the 92nd pig asked, puzzled.",
        "source": "user"
    },
    {
        "text": "\"That's uranium.  It can kill you,\" the wolf said.",
        "source": "user"
    },
    {
        "text": "\"How do you know?\" the 92nd pig asked.",
        "source": "user"
    },
    {
        "text": "The wolf explained that he studied chemistry in college.",
        "source": "user"
    },
    {
        "text": "He started to talk about radioactive elements and the 92nd pig invited him in for tea.",
        "source": "user"
    },
    {
        "text": "\"Uhm\" the wolf said, \"that's not a good idea. I'm not going into your house, and you shouldn't either.  It's too dangerous.\"",
        "source": "user"
    },
    {
        "text": "The 92nd little pig looked so pitiful standing there, the wolf introduced himself as Frank and invited him back to his place.",
        "source": "user"
    },
    {
        "text": "The pig didn't have anywhere else to go, so he packed a bag and followed the wolf.",
        "source": "user"
    },
    {
        "text": "They went into his den and the wolf turned on the television.",
        "source": "user"
    },
    {
        "text": "\"Sit down,\" he said to the pig.",
        "source": "user"
    },
    {
        "text": "Then the wolf went into the kitchen and came back with a tray full of snacks.",
        "source": "user"
    },
    {
        "text": "\"I thought you might be hungry,\" he said.",
        "source": "user"
    },
    {
        "text": "The little pig picked up a plate and loaded it with the goodies the wolf had laid out on the tray.",
        "source": "user"
    },
    {
        "text": "The two of them chatted and watched a football game together in the den.",
        "source": "user"
    },
    {
        "text": "Finally, as night fell, the 92nd pig asked the question that had been weighing heavily on his all day.",
        "source": "user"
    },
    {
        "text": "\"Frank,\" he said, \"are you going to eat me?\"",
        "source": "user"
    },
    {
        "text": "The wolf looked at him and slowly started to laugh.",
        "source": "user"
    },
    {
        "text": "He laughed and laughed until tears rolled down his furry cheeks.",
        "source": "user"
    },
    {
        "text": "\"No,\" the wolf said, \"I'm not going to eat you.  I'm not going to eat anyone.\"",
        "source": "user"
    },
    {
        "text": "\"But you're a wolf,\" the pig said.",
        "source": "user"
    },
    {
        "text": "The wolf asked the pig what he had eating while they watched tv together.",
        "source": "user"
    },
    {
        "text": "The pig thought a minute and then said, \"let's see, we had peanuts, a fruit salad, a bowl of popcorn and stir fry with tofu for dinner.\"",
        "source": "user"
    },
    {
        "text": "\"That's right.  Did you notice that these foods have anything in common?\"",
        "source": "user"
    },
    {
        "text": "The pig thought a minute and then said, \"they're all made of plants.\"",
        "source": "user"
    },
    {
        "text": "The wolf nodded.",
        "source": "user"
    },
    {
        "text": "\"You're a vegetarian.  You don't eat meat.\"",
        "source": "user"
    },
    {
        "text": "\"Correct,\" said the wolf.",
        "source": "user"
    },
    {
        "text": "\"Now, you need a place to stay and I can't pay the rent on this place myself, so how about it.  Do you want to be my roommate?\"",
        "source": "user"
    },
    {
        "text": "The pig agreed, as the place was nice and roomy and not made of depleted uranium like his old place.",
        "source": "user"
    },
    {
        "text": "He moved in and they lived together happily every after.",
        "source": "user"
    }
]