[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
        "source": "api"
    },
    {
        "text": "One day, she’s walking down the street and sees a man she’s never seen before.",
        "source": "api"
    },
    {
        "text": "She tries to get a good look at him without staring.",
        "source": "user"
    },
    {
        "text": "She’s not sure why she’s so interested, but she feels like she’s seen him before.",
        "source": "user"
    },
    {
        "text": "She’s never been to this part of town before, but she feels like she’s been here before.",
        "source": "user"
    },
    {
        "text": "She stops walking and takes her phone from her bag.",
        "source": "user"
    },
    {
        "text": "She pretends to send a text while she waits to get a better look at the man.",
        "source": "user"
    },
    {
        "text": "He starts walking in her direction.",
        "source": "user"
    },
    {
        "text": "She looks up and sees him looking at her.",
        "source": "user"
    },
    {
        "text": "Her heart skips a beat.",
        "source": "user"
    },
    {
        "text": "She looks down at her phone and pretends to send another text.",
        "source": "user"
    },
    {
        "text": "She looks up again, and he’s gone.",
        "source": "user"
    },
    {
        "text": "She looks around for a moment, confused.",
        "source": "user"
    },
    {
        "text": "She shrugs and begins to turn around, and finds him standing right there.",
        "source": "user"
    },
    {
        "text": "She gasps and drops her phone.",
        "source": "user"
    },
    {
        "text": "“I’m sorry,” he says, bending down to pick it up.",
        "source": "user"
    },
    {
        "text": "She is blushing, and reaches to help him.",
        "source": "user"
    },
    {
        "text": "Their hands touch as they both reach for the phone.",
        "source": "user"
    },
    {
        "text": "She feels a jolt of electricity.",
        "source": "user"
    },
    {
        "text": "\"Ow!\" she says, pulling her hand back.",
        "source": "user"
    },
    {
        "text": "He laughed and his eyes sparkled.",
        "source": "user"
    },
    {
        "text": "She felt like she was going to melt.",
        "source": "user"
    },
    {
        "text": "It felt like there literally was magic in the air.",
        "source": "user"
    },
    {
        "text": "She smiled at him, and he smiled back.",
        "source": "user"
    },
    {
        "text": "\"Have we met before?\" she asked.",
        "source": "user"
    },
    {
        "text": "\"You just look so familiar.\" He smiled again, and she felt her knees go weak.",
        "source": "user"
    },
    {
        "text": "\"No, we haven't met before. But if I look familiar, it's because you dreamed of me.\"",
        "source": "user"
    },
    {
        "text": "She froze.",
        "source": "user"
    },
    {
        "text": "\"What?\" she asked.",
        "source": "user"
    },
    {
        "text": "She felt embarrassed.",
        "source": "user"
    },
    {
        "text": "\"No, I haven't, I mean-\" He laughed again.",
        "source": "user"
    },
    {
        "text": "Those eyes!",
        "source": "user"
    },
    {
        "text": "\"It's okay, I'll explain.\" He said patiently.",
        "source": "user"
    },
    {
        "text": "\"Sometimes, people dream of their perfect match. And sometimes, those dreams come true.\" She looked at him, confused.",
        "source": "user"
    },
    {
        "text": "\"What are you saying?\"",
        "source": "user"
    },
    {
        "text": "\"I'm saying your wish has been granted. I'm your perfect match.\" She looked at him, her heart pounding.",
        "source": "user"
    },
    {
        "text": "\"That's all there is too it?\" She asked.",
        "source": "user"
    },
    {
        "text": "\"No, don't make it sound so simple. You had a good heart all your life. You earned me. Now, how about a hug?\"",
        "source": "user"
    }
]