[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
        "source": "api"
    },
    {
        "text": "One day, she’s on a date with a new guy, and she’s certain she’s finally found the one.",
        "source": "api"
    },
    {
        "text": "They go on an amazing first date with a visit to a museum followed by a walk on the beach boardroom that's close by in which the man kissed her while they were both sitting on some big rocks at the end of the boardwalk trail.",
        "source": "user"
    },
    {
        "text": "They ended up going home together and spent the night at her apartment, became intimate and ended up having many more dates after that.",
        "source": "user"
    },
    {
        "text": "Not too long after, they ended up becoming exclusive.",
        "source": "user"
    },
    {
        "text": "The woman then moved in with the man, and they lived together for a few months.",
        "source": "user"
    },
    {
        "text": "Everything was going well but she noticed something strange about his face.",
        "source": "user"
    },
    {
        "text": "At night when they were sleeping, it seemed to be a little different.",
        "source": "user"
    },
    {
        "text": "It still looked mostly like him but not totally and it seemed to be physically different somehow.",
        "source": "user"
    },
    {
        "text": "She even woke up once in the middle of the night and looked at him with just the night light on which cast barely any light and could've sworn that she saw him with a totally different face.",
        "source": "user"
    },
    {
        "text": "She rubbed her eyes and then she saw his real face was back.",
        "source": "user"
    },
    {
        "text": "He opened his eyes when it happened and ask her if she was ok.",
        "source": "user"
    },
    {
        "text": "She said she was fine and just went back to sleep.",
        "source": "user"
    },
    {
        "text": "They were so in love and months and months passed while they totally enjoyed each other's company.",
        "source": "user"
    },
    {
        "text": "Then one day, something very strange happened.",
        "source": "user"
    },
    {
        "text": "The woman was out shopping and she ran into a guy who she had gone on a date with a few weeks back.",
        "source": "user"
    },
    {
        "text": "She asked him, \"How are you still alive? I thought that you got into a car crash and died?\".",
        "source": "user"
    },
    {
        "text": "The man replied, \"Oh, no, I almost died. I went into a coma and woke up years later and here I am.\".",
        "source": "user"
    },
    {
        "text": "She replied, \"I'm so sure that you died. Everyone said that you died!\".",
        "source": "user"
    },
    {
        "text": "He replied, \"No, I get that a lot but that's not what happened. I assure you that In ever died and me being right here is the proof!\".",
        "source": "user"
    },
    {
        "text": "She said, \"Oh, well, wow, I'm so glad that you're ok!\".",
        "source": "user"
    },
    {
        "text": "He replied, \"Thank you. So am I!\".",
        "source": "user"
    },
    {
        "text": "Then she decided to go back home and tell her boyfriend about what just happened.",
        "source": "user"
    },
    {
        "text": "Little does she know that the man that she thought had died was actually the man that she's dating now.",
        "source": "user"
    },
    {
        "text": "He just pretended to have died in order to become another man for her to date.",
        "source": "user"
    },
    {
        "text": "So the woman went home and told her boyfriend everything.",
        "source": "user"
    },
    {
        "text": "The boyfriend acted like he was empathetic and said that the man's really lucky to be alive.",
        "source": "user"
    },
    {
        "text": "He also said, \"I know it sounds bad, but I'm glad that he died and that you didn't end up with that guy otherwise we wouldn't be together.\".",
        "source": "user"
    },
    {
        "text": "\"Don't say that! That's so mean!\", she replies.",
        "source": "user"
    },
    {
        "text": "\"Don't worry. I'm just kidding!\" he says.",
        "source": "user"
    },
    {
        "text": "They watch a movie together and end up falling asleep on the couch.",
        "source": "user"
    },
    {
        "text": "A few hours later she wakes up, turns to look at her boyfriend and sees that his face is the face of the man who she thought had died!",
        "source": "user"
    },
    {
        "text": "The horror on her face is immense.",
        "source": "user"
    },
    {
        "text": "She screams in fear and yells, \"Who are you? Why are you here? What did you do with my boyfriend?\".",
        "source": "user"
    },
    {
        "text": "The boyfriend replies, \"Whoa, calm down! I can explain everything!\".",
        "source": "user"
    },
    {
        "text": "She replies, \"Get out of here and tell me how you got here!\".",
        "source": "user"
    },
    {
        "text": "He then says, \"Look, I have to tell you something! You're gonna freak out but I have to tell you the truth. I'm your old boyfriend who you thought had died. I'm a shapeshifter and I pretended to be dead back then because our relationship wasn't going as well as I'd hoped and it was time for me to become someone else to start over and become a new man in your life.\".",
        "source": "user"
    },
    {
        "text": "She replies, \"I don't believe you! You're lying! How is that possible?\".",
        "source": "user"
    },
    {
        "text": "He replies, \"I come from a different solar system called Andromeda. It's the closest solar system to the Milky Way Galaxy with human like life. We're like humans here but just more advanced since we've lived 1,000,000 years more than you have. Please let me show you.\" He then shape shifts back into the boyfriend that she knows and she faints.",
        "source": "user"
    },
    {
        "text": "He tries to wake her up and when she finally wakes up she says, \"Oh my god. I had the most horrible dream! You were a shapeshifter from a different solar system who had shape shifted into a man I had previously dated, the one that I told you about that I thought had died in the car crash years ago.\" \"My god!\" the boyfriend says.",
        "source": "user"
    },
    {
        "text": "\"I think you need to drink some water. Here, drink up and relax and clear your head. It was just a dream.\" She says, \"Yeah it was just a dream. Thank God!\".",
        "source": "user"
    },
    {
        "text": "From that day on, the boyfriend was extremely careful to not get caught with his face changed ever again and they continued to date and their love remained strong.",
        "source": "user"
    },
    {
        "text": "She never found out that he was a shapeshifter who had previously been her boyfriend many times before.",
        "source": "user"
    }
]