[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.11476694085389738
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment?\n",
        "source": "api",
        "start_time": 86.0,
        "end_time": 86.0,
        "last_event_time": 86.0,
        "start_progress": 0.11476694085389738,
        "end_progress": 0.14610262436349392
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? \n\nIn the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and\n",
        "source": "api",
        "start_time": 131.0,
        "end_time": 131.0,
        "last_event_time": 131.0,
        "start_progress": 0.14610262436349392,
        "end_progress": 0.2028985507246377
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? In the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and animals eating each other including humans and babies. If only things would have been different back then and people would refuse the drug or have it been optional to take it it would have been a much better world now. \n",
        "source": "user",
        "start_time": 134.0,
        "end_time": 186.0,
        "last_event_time": 186.0,
        "start_progress": 0.2028985507246377,
        "end_progress": 0.2882882882882883
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? In the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and animals eating each other including humans and babies. If only things would have been different back then and people would refuse the drug or have it been optional to take it it would have been a much better world now. How You'll Survive: You're all alone in a hostile wasteland with no weapons, just your wits.\n",
        "source": "api",
        "start_time": 198.0,
        "end_time": 198.0,
        "last_event_time": 198.0,
        "start_progress": 0.2882882882882883,
        "end_progress": 0.32432432432432434
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? In the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and animals eating each other including humans and babies. If only things would have been different back then and people would refuse the drug or have it been optional to take it it would have been a much better world now. How You'll Survive: You're all alone in a hostile wasteland with no weapons, just your wits. There is no way i could survive with just the basics like water and food because once the mutants find me and know where i'm hiding i'm just going to be another piece of meat for them. \n",
        "source": "user",
        "start_time": 203.0,
        "end_time": 246.0,
        "last_event_time": 246.0,
        "start_progress": 0.32432432432432434,
        "end_progress": 0.3971797884841363
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? In the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and animals eating each other including humans and babies. If only things would have been different back then and people would refuse the drug or have it been optional to take it it would have been a much better world now. How You'll Survive: You're all alone in a hostile wasteland with no weapons, just your wits. There is no way i could survive with just the basics like water and food because once the mutants find me and know where i'm hiding i'm just going to be another piece of meat for them. You'd probably have to find a way to make weapons and get ammo for them and i don't know if i would be able to do that.\n",
        "source": "api",
        "start_time": 254.0,
        "end_time": 254.0,
        "last_event_time": 254.0,
        "start_progress": 0.3971797884841363,
        "end_progress": 0.4437916177046612
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? In the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and animals eating each other including humans and babies. If only things would have been different back then and people would refuse the drug or have it been optional to take it it would have been a much better world now. How You'll Survive: You're all alone in a hostile wasteland with no weapons, just your wits. There is no way i could survive with just the basics like water and food because once the mutants find me and know where i'm hiding i'm just going to be another piece of meat for them. I'd probably have to find a way to make weapons and get ammo for myself and i don't know if i would be able to do that, as things are already scarce. \n",
        "source": "user",
        "start_time": 259.0,
        "end_time": 300.0,
        "last_event_time": 300.0,
        "start_progress": 0.4437916177046612,
        "end_progress": 0.45593419506462984
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? In the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and animals eating each other including humans and babies. If only things would have been different back then and people would refuse the drug or have it been optional to take it it would have been a much better world now. How You'll Survive: You're all alone in a hostile wasteland with no weapons, just your wits. There is no way i could survive with just the basics like water and food because once the mutants find me and know where i'm hiding i'm just going to be another piece of meat for them. I'd probably have to find a way to make weapons and get ammo for myself and i don't know if i would be able to do that, as things are already scarce. The only way i could survive is if i had a team with me to hunt and protect me while i try to find medicine or a cure for what\n",
        "source": "api",
        "start_time": 314.0,
        "end_time": 314.0,
        "last_event_time": 314.0,
        "start_progress": 0.45593419506462984,
        "end_progress": 0.5052878965922444
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? In the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and animals eating each other including humans and babies. If only things would have been different back then and people would refuse the drug or have it been optional to take it it would have been a much better world now. How You'll Survive: You're all alone in a hostile wasteland with no weapons, just your wits. There is no way i could survive with just the basics like water and food because once the mutants find me and know where i'm hiding i'm just going to be another piece of meat for them. I'd probably have to find a way to make weapons and get ammo for myself and i don't know if i would be able to do that, as things are already scarce. The only way i could survive is if i had a team with me to hunt and protect me while i try to find medicine or a cure. \n",
        "source": "user",
        "start_time": 316.0,
        "end_time": 326.0,
        "last_event_time": 326.0,
        "start_progress": 0.5052878965922444,
        "end_progress": 0.5025460242851547
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? In the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and animals eating each other including humans and babies. If only things would have been different back then and people would refuse the drug or have it been optional to take it it would have been a much better world now. How You'll Survive: You're all alone in a hostile wasteland with no weapons, just your wits. There is no way i could survive with just the basics like water and food because once the mutants find me and know where i'm hiding i'm just going to be another piece of meat for them. I'd probably have to find a way to make weapons and get ammo for myself and i don't know if i would be able to do that, as things are already scarce. The only way i could survive is if i had a team with me to hunt and protect me while i try to find medicine or a cure. I was once given the opportunity to take the drug and i decided not to, i didn't want to live forever.\n",
        "source": "api",
        "start_time": 336.0,
        "end_time": 336.0,
        "last_event_time": 336.0,
        "start_progress": 0.5025460242851547,
        "end_progress": 0.5424990207598903
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? In the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and animals eating each other including humans and babies. If only things would have been different back then and people would refuse the drug or have it been optional to take it it would have been a much better world now. How You'll Survive: You're all alone in a hostile wasteland with no weapons, just your wits. There is no way i could survive with just the basics like water and food because once the mutants find me and know where i'm hiding i'm just going to be another piece of meat for them. I'd probably have to find a way to make weapons and get ammo for myself and i don't know if i would be able to do that, as things are already scarce. The only way i could survive is if i had a team with me to hunt and protect me while i try to find medicine or a cure. I was once given the opportunity to take the drug and i decided not to, i didn't want to live forever, but now i am just regretting a tad bit but not a whole lot. \n",
        "source": "user",
        "start_time": 337.0,
        "end_time": 349.0,
        "last_event_time": 349.0,
        "start_progress": 0.5424990207598903,
        "end_progress": 0.5663924794359577
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? In the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and animals eating each other including humans and babies. If only things would have been different back then and people would refuse the drug or have it been optional to take it it would have been a much better world now. How You'll Survive: You're all alone in a hostile wasteland with no weapons, just your wits. There is no way i could survive with just the basics like water and food because once the mutants find me and know where i'm hiding i'm just going to be another piece of meat for them. I'd probably have to find a way to make weapons and get ammo for myself and i don't know if i would be able to do that, as things are already scarce. The only way i could survive is if i had a team with me to hunt and protect me while i try to find medicine or a cure. I was once given the opportunity to take the drug and i decided not to, i didn't want to live forever, but now i am just regretting a tad bit but not a whole lot. I think i would have died from natural causes before the other side effects of the drug would have been discovered.\n",
        "source": "api",
        "start_time": 356.0,
        "end_time": 356.0,
        "last_event_time": 356.0,
        "start_progress": 0.5663924794359577,
        "end_progress": 0.6114375244810027
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? In the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and animals eating each other including humans and babies. If only things would have been different back then and people would refuse the drug or have it been optional to take it it would have been a much better world now. How You'll Survive: You're all alone in a hostile wasteland with no weapons, just your wits. There is no way i could survive with just the basics like water and food because once the mutants find me and know where i'm hiding i'm just going to be another piece of meat for them. I'd probably have to find a way to make weapons and get ammo for myself and i don't know if i would be able to do that, as things are already scarce. The only way i could survive is if i had a team with me to hunt and protect me while i try to find medicine or a cure. I was once given the opportunity to take the drug and i decided not to, i didn't want to live forever, but now i am just regretting a tad bit but not a whole lot. I think i would have died from natural causes before the other side effects of the drug would have been discovered. I don't think that i could survive the wasteland and i wouldn't know what to do if faced with that problem. I think the government was right to give the drug to those under 26 and not anyone else, because they were the ones that could be able to survive\n",
        "source": "api",
        "start_time": 393.0,
        "end_time": 412.0,
        "last_event_time": 412.0,
        "start_progress": 0.6114375244810027,
        "end_progress": 0.7109283196239718
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? In the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and animals eating each other including humans and babies. If only things would have been different back then and people would refuse the drug or have it been optional to take it it would have been a much better world now. How You'll Survive: You're all alone in a hostile wasteland with no weapons, just your wits. There is no way i could survive with just the basics like water and food because once the mutants find me and know where i'm hiding i'm just going to be another piece of meat for them. I'd probably have to find a way to make weapons and get ammo for myself and i don't know if i would be able to do that, as things are already scarce. The only way i could survive is if i had a team with me to hunt and protect me while i try to find medicine or a cure. I was once given the opportunity to take the drug and i decided not to, i didn't want to live forever, but now i am just regretting a tad bit but not a whole lot. I think i would have died from natural causes before the other side effects of the drug would have been discovered. I don't think that i could survive the wasteland and i wouldn't know what to do if faced with that problem. I think the government was right to give the drug to those under 26 and not anyone else, because they were the ones that could be able to survive and fight off the mutants and other animals.\n",
        "source": "api",
        "start_time": 425.0,
        "end_time": 425.0,
        "last_event_time": 425.0,
        "start_progress": 0.7109283196239718,
        "end_progress": 0.7285546415981199
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? In the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and animals eating each other including humans and babies. If only things would have been different back then and people would refuse the drug or have it been optional to take it it would have been a much better world now. How You'll Survive: You're all alone in a hostile wasteland with no weapons, just your wits. There is no way i could survive with just the basics like water and food because once the mutants find me and know where i'm hiding i'm just going to be another piece of meat for them. I'd probably have to find a way to make weapons and get ammo for myself and i don't know if i would be able to do that, as things are already scarce. The only way i could survive is if i had a team with me to hunt and protect me while i try to find medicine or a cure. I was once given the opportunity to take the drug and i decided not to, i didn't want to live forever, but now i am just regretting a tad bit but not a whole lot. I think i would have died from natural causes before the other side effects of the drug would have been discovered. I don't think that i could survive the wasteland and i wouldn't know what to do if faced with that problem. I think the government was right to give the drug to those under 26 and not anyone else, because they were the ones that could be able to survive and fight off the mutants and other animals. I think it was wrong for the government to stop giving the drug and i wish that they would just give everyone the drug.\n",
        "source": "api",
        "start_time": 450.0,
        "end_time": 450.0,
        "last_event_time": 450.0,
        "start_progress": 0.7285546415981199,
        "end_progress": 0.7755581668625147
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? In the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and animals eating each other including humans and babies. If only things would have been different back then and people would refuse the drug or have it been optional to take it it would have been a much better world now. How You'll Survive: You're all alone in a hostile wasteland with no weapons, just your wits. There is no way i could survive with just the basics like water and food because once the mutants find me and know where i'm hiding i'm just going to be another piece of meat for them. I'd probably have to find a way to make weapons and get ammo for myself and i don't know if i would be able to do that, as things are already scarce. The only way i could survive is if i had a team with me to hunt and protect me while i try to find medicine or a cure. I was once given the opportunity to take the drug and i decided not to, i didn't want to live forever, but now i am just regretting a tad bit but not a whole lot. I think i would have died from natural causes before the other side effects of the drug would have been discovered. I don't think that i could survive the wasteland and i wouldn't know what to do if faced with that problem. I think the government was right to give the drug to those under 26 and not anyone else, because they were the ones that could be able to survive and fight off the mutants and other animals. I think it was wrong for the government to stop giving the drug and i wish that they would just give everyone the drug and maybe now when everyone is having side effects then the one who chose not to take it would not be in harms way and would have no choice but to be a mutant and live like the rest . \n",
        "source": "user",
        "start_time": 452.0,
        "end_time": 487.0,
        "last_event_time": 487.0,
        "start_progress": 0.7755581668625147,
        "end_progress": 0.8476302389345868
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? In the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and animals eating each other including humans and babies. If only things would have been different back then and people would refuse the drug or have it been optional to take it it would have been a much better world now. How You'll Survive: You're all alone in a hostile wasteland with no weapons, just your wits. There is no way i could survive with just the basics like water and food because once the mutants find me and know where i'm hiding i'm just going to be another piece of meat for them. I'd probably have to find a way to make weapons and get ammo for myself and i don't know if i would be able to do that, as things are already scarce. The only way i could survive is if i had a team with me to hunt and protect me while i try to find medicine or a cure. I was once given the opportunity to take the drug and i decided not to, i didn't want to live forever, but now i am just regretting a tad bit but not a whole lot. I think i would have died from natural causes before the other side effects of the drug would have been discovered. I don't think that i could survive the wasteland and i wouldn't know what to do if faced with that problem. I think the government was right to give the drug to those under 26 and not anyone else, because they were the ones that could be able to survive and fight off the mutants and other animals. I think it was wrong for the government to stop giving the drug and i wish that they would just give everyone the drug and maybe now when everyone is having side effects then the one who chose not to take it would not be in harms way and would have no choice but to be a mutant and live like the rest . If i was to take the drug and survive, i would still live how i am now but with no need for food or water.\n",
        "source": "api",
        "start_time": 516.0,
        "end_time": 516.0,
        "last_event_time": 516.0,
        "start_progress": 0.8476302389345868,
        "end_progress": 0.8891500195848022
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Can you survive the world's most dangerous and practical scientific experiment? In the wake of the millions who've already died, you must fight your way through a wasteland full of radioactive mutants, murderous gangs, and animals eating each other including humans and babies. If only things would have been different back then and people would refuse the drug or have it been optional to take it it would have been a much better world now. How You'll Survive: You're all alone in a hostile wasteland with no weapons, just your wits. There is no way i could survive with just the basics like water and food because once the mutants find me and know where i'm hiding i'm just going to be another piece of meat for them. I'd probably have to find a way to make weapons and get ammo for myself and i don't know if i would be able to do that, as things are already scarce. The only way i could survive is if i had a team with me to hunt and protect me while i try to find medicine or a cure. I was once given the opportunity to take the drug and i decided not to, i didn't want to live forever, but now i am just regretting a tad bit but not a whole lot. I think i would have died from natural causes before the other side effects of the drug would have been discovered. I don't think that i could survive the wasteland and i wouldn't know what to do if faced with that problem. I think the government was right to give the drug to those under 26 and not anyone else, because they were the ones that could be able to survive and fight off the mutants and other animals. I think it was wrong for the government to stop giving the drug and i wish that they would just give everyone the drug and maybe now when everyone is having side effects then the one who chose not to take it would not be in harms way and would have no choice but to be a mutant and live like the rest . If i was to take the drug and survive, i would still live how i am now but with no need for food or water. Things would be much easier for me as the rest of the world has changed for the worse and i would have changed with it. But this is the situation i am in right now and just have to deal with it and knowing there is no going back this is how i will die and i have accepted the fact. \n",
        "source": "user",
        "start_time": 517.0,
        "end_time": 599.0,
        "last_event_time": 599.0,
        "start_progress": 0.8891500195848022,
        "end_progress": 1.0
    }
]