[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "I was not looking forward to seeing mine.",
        "source": "user"
    },
    {
        "text": "Mine was stuck in my cupboard for almost a year now as I broke the handle of the mug.",
        "source": "user"
    },
    {
        "text": "I couldn't bring myself to throw it away.",
        "source": "user"
    },
    {
        "text": "It was given to me by my mother-in-law and I was sure she would be upset if I threw it away.",
        "source": "user"
    },
    {
        "text": "It was all the talk with my coworkers this morning.",
        "source": "user"
    },
    {
        "text": "They all compared each other's dad ranking the same way they talk comparing their junk.",
        "source": "user"
    },
    {
        "text": "I was asked by Steve.",
        "source": "user"
    },
    {
        "text": "I said, \"I'm not sure, but I'm sure it's not the best.\" Apparently he was the #2,300,332.",
        "source": "user"
    },
    {
        "text": "Rumors in the office that Tom was ranking the highest in our office at #45,032.",
        "source": "user"
    },
    {
        "text": "I am not surprised.",
        "source": "user"
    },
    {
        "text": "He is a good dad.",
        "source": "user"
    },
    {
        "text": "It's finally the end of the workday and I was dreading to come home.",
        "source": "user"
    },
    {
        "text": "I said to myself, \"I'll just get home, open the door, and see what my ranking is.\"",
        "source": "user"
    },
    {
        "text": "I opened my cupboard and there was my ranking.",
        "source": "user"
    },
    {
        "text": "I tried washing the mug as I couldn't believe what I was seeing.",
        "source": "user"
    },
    {
        "text": "\"World's #0 Dad,\" it said.",
        "source": "user"
    },
    {
        "text": "I cried and cried.",
        "source": "user"
    },
    {
        "text": "Tears won't stop and tears did not stop for hours.",
        "source": "user"
    },
    {
        "text": "I was reminded that I no longer have my son.",
        "source": "user"
    },
    {
        "text": "He died in a car accident a few years ago.",
        "source": "user"
    },
    {
        "text": "It was my fault.",
        "source": "user"
    },
    {
        "text": "He was angry at me that day and probably too angry to be driving.",
        "source": "user"
    },
    {
        "text": "My last conversation with my son was about how I was a terrible father.",
        "source": "user"
    },
    {
        "text": "I would never forget his last words, \"I hate you. You are the worst dad in the world.\"",
        "source": "user"
    },
    {
        "text": "Being the worst dad in the world is far better than being not a dad, at all.",
        "source": "user"
    }
]