[
    "Humans once wielded formidable magical power.",
    "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
    "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
    "This power is somewhat chilling.",
    "Humans are able to create their own mana, and turn it into spells.",
    "But it comes at a price.",
    "Magic users are often abnormal, and some do not survive the experience.",
    "Those who do survive are changed in many ways, some of them not entirely beneficial.",
    "The world they wake up to is not the one they knew before.",
    "This world is one where Mana has caused all kinds of deformities and defects, and unfortunately these deformities and defects cause sufferers to experience a totally warped dimension of the world.",
    "It is generally one that they cannot understand because they are now out of touch with reality.",
    "They see things differently from the rest of society, and they are often unable to function at all during their daily lives.",
    "When they encounter the sight of something that can hurt them, or that they don't understand, they immediately have a violent reaction.",
    "In this third volume, the young man known as Andrei is now trying to understand his power.",
    "He is a very powerful user of mana, but this causes him to see the world in warped ways that he can no longer relate to.",
    "When he was first introduced, his power was so great that he could summon mana from the air.",
    "He could also cause things to move in unnatural ways.",
    "Unfortunately, he was unable to control it.",
    "He was unable to make his power do what he wanted it to do.",
    "Sometimes the power would be guided by his whims but often the power just seemed to have a total and complete mind of its own.",
    "This proved to be very dangerous for the world that Andrei lived in.",
    "It also put the lives of all of his friends in great danger.",
    "Even though he himself could not control his power, Andrei came to realize that his friends could.",
    "They could communicate with his power and make it do what they wanted it to.",
    "Interestingly, these friends seemed to have stepped into his life precisely in order to control his mana.",
    "But unfortunately for Andrei, this was just one of the drawbacks of mana.",
    "It tended to bring out the absolute worst in people.",
    "When people were confronted with his power, they could never resist the urge to manipulate it.",
    "They would use his mana to cause things to happen, even though this would often prove fatal for people around them.",
    "Andrei's friends used Andrei's mana for very dark reasons.",
    "Andrei himself wanted to stop his friends and could not understand why his friends were using his power in such evil ways, but he also could not control himself from refraining to do the same.",
    "Andrei's power had become a major threat to the world, and in many ways it was destroying his own life.",
    "Fortunately, a little girl named Emmy was born in the world just as Andrei's friends were about to do some real damage with Andrei's mana.",
    "She is a special child, that from birth demonstrates great power.",
    "She can communicate with Andrei's power and attempt to control it.",
    "She can also read people very well, and she is able to figure out what their intentions are.",
    "She can stop his friends from doing what they want to do, but she needs Andrei's help in order to do so.",
    "She is well aware that Andrei himself cannot control his power and that he has no idea what it is capable of.",
    "But interestingly, she is able to control Andrei.",
    "She eventually gets Andrei to put a hold on his friends.",
    "And she eventually is able to turn the tide on Andrei's mana.",
    "Once she does so, she is able to control others' mana as well.",
    "It is really Emmy who is the great hero in this story.",
    "She causes people's mana to become a force for good rather than evil.",
    "And in doing so, she completely rescues all of mankind and ensures the continuing survival of the human race.",
    "Emmy becomes a celebrated and recognized hero throughout all the land.",
    ""
]