[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "The alien spaceship ran out of fuel, and they have landed their ship in a small town.",
        "source": "user"
    },
    {
        "text": "They need to refuel, and the easiest way is to kidnap the most famous person nearby.",
        "source": "user"
    },
    {
        "text": "Fame gives humans an energy that only the aliens can see, and the aliens have the technology to siphon the fame energy to power their ship.",
        "source": "user"
    },
    {
        "text": "They kidnap Matt Damon, and bring him back to their ship.",
        "source": "user"
    },
    {
        "text": "The spaceship is a 10-meter sphere, with no openings.",
        "source": "user"
    },
    {
        "text": "The alien is about the size of a human infant, with four fingers.",
        "source": "user"
    },
    {
        "text": "Its head has a large, single eye in the center, and two small ears on either side.",
        "source": "api"
    },
    {
        "text": "It has no nose or mouth.",
        "source": "user"
    },
    {
        "text": "The aliens move by teleporting.",
        "source": "user"
    },
    {
        "text": "Any place they have been, or any place they will go in the future, they can teleport to.",
        "source": "user"
    },
    {
        "text": "But what they don't know, is that Ben Affleck is rallying the humans.",
        "source": "user"
    },
    {
        "text": "Matt Damon has survived both the alien abduction, and being teleported through the ship.",
        "source": "user"
    },
    {
        "text": "He has found a way to communicate with Ben Affleck, and they have hatched a plan to save Matt Damon.",
        "source": "user"
    },
    {
        "text": "Ben Affleck is an expert at teleporting.",
        "source": "api"
    },
    {
        "text": "He has studied the alien teleportation, and knows all its secrets.",
        "source": "api"
    },
    {
        "text": "He knows how to get into the alien ship, and he also has a plan for saving Matt Damon.",
        "source": "api"
    },
    {
        "text": "He gathers a small army to help him execute his plan.",
        "source": "user"
    },
    {
        "text": "The army attacks the alien ship, disrupting its siphoning process, forcing it to shield itself.",
        "source": "user"
    },
    {
        "text": "When the aliens shield themselves, Ben Affleck uses a special little device that blocks the alien's teleportation.",
        "source": "user"
    },
    {
        "text": "He then teleports into the alien ship, and frees Matt Damon.",
        "source": "user"
    },
    {
        "text": "The humans win the battle, and Matt Damon is safely returned to Earth.",
        "source": "user"
    }
]