[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the \"Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "Now, it's too late.",
        "source": "api"
    },
    {
        "text": "It is rumored that a new drug has been created.",
        "source": "api"
    },
    {
        "text": "But the government isn't giving it away for free.",
        "source": "user"
    },
    {
        "text": "It is too expensive for most citizens so people are going great lengths to obtain it illegally.",
        "source": "api"
    },
    {
        "text": "To get the drug, you and your friends decide to find a way into the headquarters of the government facility where it is supposedly being held.",
        "source": "user"
    },
    {
        "text": "The risks are high, but the group is going for it anyway.",
        "source": "api"
    },
    {
        "text": "They planned carefully and the big night had finally arrived.",
        "source": "user"
    },
    {
        "text": "They began their journey and successfully make it into the facility.",
        "source": "user"
    },
    {
        "text": "They follow the map to the vault where the drugs are being stored.",
        "source": "api"
    },
    {
        "text": "But it turns out there is an alarm.",
        "source": "user"
    },
    {
        "text": "They hadn't planned for this.",
        "source": "api"
    },
    {
        "text": "They had to either turn around and leave now, or find a way to bypass the alarm.",
        "source": "user"
    },
    {
        "text": "They chose to continue and discover an elevator that leads to a secret floor deep within the building.",
        "source": "user"
    },
    {
        "text": "The elevator descended to the floor below, and then kept going and going.",
        "source": "api"
    },
    {
        "text": "It was not to the lower floor, but to another section of the facility.",
        "source": "user"
    },
    {
        "text": "It went down so far they couldn't fathom how far underground they had gone.",
        "source": "api"
    },
    {
        "text": "Then, the elevator stopped and the doors opened.",
        "source": "user"
    },
    {
        "text": "They were in a strange laboratory.",
        "source": "api"
    },
    {
        "text": "\"This must be where they make the drug.",
        "source": "api"
    },
    {
        "text": "\" you thought.",
        "source": "user"
    },
    {
        "text": "The team searched on.",
        "source": "user"
    },
    {
        "text": "\"We shouldn't be down here.",
        "source": "api"
    },
    {
        "text": "We should just find the product and go.",
        "source": "user"
    },
    {
        "text": "We shouldn't mess with this stuff.",
        "source": "user"
    },
    {
        "text": "\" your best friend said.",
        "source": "user"
    },
    {
        "text": "Suddenly, the elevator doors closed and the elevator lifted up away, leaving them in the deep basement.",
        "source": "user"
    },
    {
        "text": "They were stuck.",
        "source": "user"
    },
    {
        "text": "They went to press the elevator buttons, but there weren't any.",
        "source": "user"
    },
    {
        "text": "A few moments later, the doors opened and a mysterious figure walked in.",
        "source": "user"
    },
    {
        "text": "He was the leader of the facility.",
        "source": "api"
    },
    {
        "text": "\"I understand you want access to our product.",
        "source": "api"
    },
    {
        "text": "I have a better offer.",
        "source": "user"
    },
    {
        "text": "\" he said.",
        "source": "user"
    },
    {
        "text": "\"I will give you access, but you must agree to my terms.",
        "source": "user"
    },
    {
        "text": "\" They agreed.",
        "source": "api"
    },
    {
        "text": "\"You will bring me an item every week for the rest of your lives, and I will give you your drug.",
        "source": "api"
    },
    {
        "text": "If you do not, I will permanently seal off access to this facility.",
        "source": "api"
    },
    {
        "text": "\" They agreed.",
        "source": "api"
    },
    {
        "text": "They ended up surviving the next wave of mass deaths and were pioneers for the new world.",
        "source": "api"
    }
]