[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "Some mugs have no ranks at all for the dads that were rated unsatisfactory.",
        "source": "user"
    },
    {
        "text": "Everyone is upset.",
        "source": "user"
    },
    {
        "text": "It's all over the news.",
        "source": "user"
    },
    {
        "text": "The government is involved.",
        "source": "user"
    },
    {
        "text": "People are storming the Capital in protest.",
        "source": "user"
    },
    {
        "text": "There is panic in the streets.",
        "source": "user"
    },
    {
        "text": "People want justice restored.",
        "source": "user"
    },
    {
        "text": "The people want every dad to be #1.",
        "source": "user"
    },
    {
        "text": "The CEO of the mug company stands his ground.",
        "source": "user"
    },
    {
        "text": "A reporter asks him why he can't just change the mugs back to where they were.",
        "source": "user"
    },
    {
        "text": "\"I can't keep living a lie. Not every dad is #1. In fact, there can only be one number one. The only way to know who that really is, is to rate every dad. So that's what I did. I'm just being honest.\"",
        "source": "user"
    },
    {
        "text": "The reporter then asks him what he is going to do about the people protesting outside.",
        "source": "api"
    },
    {
        "text": "\"I would suggest meditation and deep breathing. That should help them resolve their feelings about the kind of parents they are.\"",
        "source": "user"
    },
    {
        "text": "The CEO then says, \"I think I'm going to go home and visit my dad.\" The reporter asks, \"And where does your dad rank on the list of dads?\"",
        "source": "api"
    },
    {
        "text": "\"Oh, he's 7,345. We have some issues to work out. But don't worry, he still gets a mug.\" The reporter shook her head.",
        "source": "user"
    },
    {
        "text": "\"I noticed you have a mug there yourself.\"",
        "source": "user"
    },
    {
        "text": "\"Yes, I am #3,982.\"",
        "source": "api"
    },
    {
        "text": "\"But you don't have any children. So why do you have a dad mug at all?\"",
        "source": "user"
    },
    {
        "text": "\"I will be someday. And I don't have high expectations for myself, let's be real.\" The story aired on the news that night.",
        "source": "user"
    },
    {
        "text": "The CEO of the mug company was available for comments.",
        "source": "user"
    },
    {
        "text": "His first comment was to announce that next year, the Honest Mug company would be offering ranked mugs for Mother's Day.",
        "source": "user"
    },
    {
        "text": "The reporter looked into the camera and said, \"The number one mother is available to the first person comment on that story on my Instagram page.\"",
        "source": "user"
    },
    {
        "text": "The Honest Mug Company is going to be just fine.",
        "source": "api"
    },
    {
        "text": "Trust me, I read it on the internet.",
        "source": "user"
    }
]