[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "It begins to make those who are immortal age in reverse.",
        "source": "api"
    },
    {
        "text": "It's basically turning them back into an unborn creation over time.",
        "source": "user"
    },
    {
        "text": "It takes a while to happen but over time they all are 20 years old, then 15 years old.",
        "source": "user"
    },
    {
        "text": "There's so many more of them that the senior citizens are initially just surrounded by trouble making teenagers.",
        "source": "user"
    },
    {
        "text": "It's an annoyance at first, then they start getting even younger.",
        "source": "user"
    },
    {
        "text": "That's when the senior citizens realize they'll have to start taking care of an entire generation of young children by themselves.",
        "source": "user"
    },
    {
        "text": "Because there are 50 children to every one senior citizen, they have to just have one senior citizen in a room full of cribs.",
        "source": "user"
    },
    {
        "text": "They have to go and take care of them 24 hours a day.",
        "source": "user"
    },
    {
        "text": "It leads to exhaustion.",
        "source": "user"
    },
    {
        "text": "A young person couldn't do it, let alone the elderly.",
        "source": "user"
    },
    {
        "text": "I personally have a room of children that are all now infants.",
        "source": "user"
    },
    {
        "text": "It consists of changing diapers and feeding them all day.",
        "source": "user"
    },
    {
        "text": "I'm not even sure how I'm going to do it.",
        "source": "user"
    },
    {
        "text": "I never sleep anymore.",
        "source": "api"
    },
    {
        "text": "As awful as it is, I look forward to them no longer existing.",
        "source": "user"
    },
    {
        "text": "It's a horrible existence for both them and for us.",
        "source": "user"
    },
    {
        "text": "Do they remember what they once were?",
        "source": "user"
    },
    {
        "text": "Are they scared?",
        "source": "user"
    },
    {
        "text": "I'm not sure how long it will take for them to all disappear.",
        "source": "user"
    },
    {
        "text": "Will we die of old age before they die of being too young?",
        "source": "api"
    },
    {
        "text": "If it weren't such a horrifying situation, it would be fascinating to observe.",
        "source": "user"
    },
    {
        "text": "The entire population is about to be wiped out at the same time from both dying of youth and old age.",
        "source": "user"
    },
    {
        "text": "It's a very strange phenomenon.",
        "source": "user"
    },
    {
        "text": "I'm not sure what will happen to the world after this.",
        "source": "api"
    },
    {
        "text": "Will animals take over?",
        "source": "api"
    },
    {
        "text": "Maybe this is mother nature just giving another species a chance.",
        "source": "api"
    },
    {
        "text": "I doubt they'll find a way to mess it up as bad as we have.",
        "source": "user"
    },
    {
        "text": "Goodbye human race.",
        "source": "user"
    }
]