[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?",
        "source": "api"
    },
    {
        "text": "\" No wonder your higher ups don't want you to be near bees.",
        "source": "api"
    },
    {
        "text": "And they lied about your allergy!",
        "source": "user"
    },
    {
        "text": "You shake your head and wonder if you are hearing things that are not real.",
        "source": "user"
    },
    {
        "text": "As if the been read your mind, it again asked \"Your Majesty, waht are your orders?",
        "source": "user"
    },
    {
        "text": "\" The first your think of, prompted by the word 'order', is pizza, of course.",
        "source": "user"
    },
    {
        "text": "\"I will have two slices with extra cheese.",
        "source": "user"
    },
    {
        "text": "No make that four slices so I can share with my little sister\"\n\nThe Bee chuckles, and says \"I meant for you to tell me your orders about the pesticides that are killing us bees.",
        "source": "user"
    },
    {
        "text": "Spare our lives, I beg of you.",
        "source": "user"
    },
    {
        "text": "\"  You smirked, having heard some conspiracy about chemicals that actually prevent food from being killed by insects, being poisonous.",
        "source": "user"
    },
    {
        "text": "That the chemicals and engineered food substances play right into the conspiracy trouble makers.",
        "source": "user"
    },
    {
        "text": "\"Oh Mr.",
        "source": "user"
    },
    {
        "text": "Bee\" you responded, \"you are not going to get killed by the prevention of diseased crops.",
        "source": "user"
    },
    {
        "text": "Stop watching the news!",
        "source": "user"
    },
    {
        "text": "\" \n\nThe Bee flew off, dejected and weary.",
        "source": "user"
    },
    {
        "text": "You wait patiently for your pizza order with your sister.",
        "source": "user"
    },
    {
        "text": "After what seemed like forever, Mr.",
        "source": "user"
    },
    {
        "text": "Bee was back with the pizza.",
        "source": "user"
    },
    {
        "text": "\"Who will carry out your orders when we are all dead?",
        "source": "user"
    },
    {
        "text": "\" the Bee asked.",
        "source": "user"
    },
    {
        "text": "It was then that you got the message.",
        "source": "user"
    },
    {
        "text": "Maybe there is something to this so-called conspiracy of the Bees dying.",
        "source": "api"
    },
    {
        "text": "Your sister of all people backed up the Bee's fear, with viable scientific evidence.",
        "source": "user"
    },
    {
        "text": "You tell Mr Bee that you will have a plan to save the bees by the end of the week.",
        "source": "user"
    },
    {
        "text": "That is when the Bee can really be valuable.",
        "source": "user"
    },
    {
        "text": "The Bee will carry out your orders to keep the earth friendly and viable for all living beings.",
        "source": "user"
    }
]