[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "As the movie began, I was very surprised to see that in this lifetime, I had become a cat.",
        "source": "api"
    },
    {
        "text": "I was very surprised to see that I was a cat, but I also thought that it made perfect sense.",
        "source": "user"
    },
    {
        "text": "I loved cats in my other lives, and I thought I could relate to them.",
        "source": "api"
    },
    {
        "text": "The movie went on to show me that I had been a cat for many years and had lived a happy, complete life.",
        "source": "user"
    },
    {
        "text": "I lived with an old woman in a large house, and I was free to go outside and roam whenever I pleased.",
        "source": "api"
    },
    {
        "text": "I had a wonderful, loving relationship with this woman and she treated me very well.",
        "source": "user"
    },
    {
        "text": "One day, she told me that she was starting to get sick.",
        "source": "api"
    },
    {
        "text": "Her health was starting to fail, and she knew that her days were numbered.",
        "source": "user"
    },
    {
        "text": "This made me very sad because I loved the woman and we were like a family.",
        "source": "api"
    },
    {
        "text": "She told me that she wanted to take care of one final thing before she died.",
        "source": "user"
    },
    {
        "text": "She put me in her car and drove 20 miles to another house.",
        "source": "api"
    },
    {
        "text": "\"You will meet my granddaughter,\" she told me.",
        "source": "user"
    },
    {
        "text": "\"She is very nice, and she will make sure you are taken care of.",
        "source": "user"
    },
    {
        "text": "\"\nSo I met this new person.",
        "source": "api"
    },
    {
        "text": "I was hesitant at first because meeting new humans had not been a thing I was used to in this cat life.",
        "source": "user"
    },
    {
        "text": "But she was nice enough so I went along.",
        "source": "user"
    },
    {
        "text": "I got to go back with my elderly companion and she lived about another week.",
        "source": "user"
    },
    {
        "text": "As she was dying, she told me to be a good girl and that she would always be looking after me.",
        "source": "user"
    },
    {
        "text": "I had a new home to go to so I was ok, but I never forgot my kind caretaker and the friendship we had.",
        "source": "user"
    },
    {
        "text": "As the movie of my cat life ended, I was pleased for having found a different kind of love in another life.",
        "source": "user"
    },
    {
        "text": "The end.",
        "source": "user"
    }
]