[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.",
        "source": "api"
    },
    {
        "text": "\" He wondered how the little pig even had access to that kind of material.",
        "source": "api"
    },
    {
        "text": "He asked the little pig \"where did you get this stuff from?",
        "source": "user"
    },
    {
        "text": "\".",
        "source": "user"
    },
    {
        "text": "The little pig said \"I got it from the government.",
        "source": "user"
    },
    {
        "text": "\" \"What are you some kind of military contractor or something?",
        "source": "api"
    },
    {
        "text": "\" the wolf asked.",
        "source": "user"
    },
    {
        "text": "\"Something like that, why are you so interested?",
        "source": "user"
    },
    {
        "text": "\" replied the little pig.",
        "source": "user"
    },
    {
        "text": "\"I'm just curious, that's all.",
        "source": "user"
    },
    {
        "text": "\" said the wolf.",
        "source": "api"
    },
    {
        "text": "But the wolf had more than just a passing interest in depleted uranium.",
        "source": "api"
    },
    {
        "text": "He had contacts in eastern Europe that would pay a lot of money for even a little bit of the stuff.",
        "source": "user"
    },
    {
        "text": "He went home and called one of them and asked them how much they would give the wolf for some.",
        "source": "user"
    },
    {
        "text": "The wolf's contact said \"I'll give you $100,000 for a pound of it.",
        "source": "user"
    },
    {
        "text": "\" The wolf liked the sound of that so he went back to see the little pig to see if they could make a deal.",
        "source": "api"
    },
    {
        "text": "\"Hey, little pig, can you get any more of this depleted uranium stuff?",
        "source": "user"
    },
    {
        "text": "\" he asked.",
        "source": "user"
    },
    {
        "text": "\"Sure, I can get a lot more of it if you want it.",
        "source": "user"
    },
    {
        "text": "\" the little pig replied.",
        "source": "api"
    },
    {
        "text": "\"Well, I know people that will pay a lot of money for it\" said the wolf \"we can both be rich\".",
        "source": "api"
    },
    {
        "text": "So the little pig and the wolf went into business together selling depleted uranium to shady eastern European contacts.",
        "source": "user"
    },
    {
        "text": "The wolf was happy he didn't try to eat this little pig, their business arrangement was much too profitable for that.",
        "source": "user"
    }
]