[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "The aliens eventually learn of the public’s love for Damon, but as a result, they don’t think it would be fair to keep him for themselves.",
        "source": "api"
    },
    {
        "text": "But he's so darn entertaining and they fall in love with him.",
        "source": "user"
    },
    {
        "text": "Surprisingly, Damon quickly grows to like the aliens, too.",
        "source": "user"
    },
    {
        "text": "He finds them fascinating and kind with really good senses of humor.",
        "source": "user"
    },
    {
        "text": "He even starts to think that he might just be able to live with them.",
        "source": "user"
    },
    {
        "text": "But he does miss his friends and family.",
        "source": "api"
    },
    {
        "text": "A group of aliens meet with the U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "user"
    },
    {
        "text": "government to discuss the situation.",
        "source": "user"
    },
    {
        "text": "Damon joins on video and explains that while he was kidnapped, he doesn't want to press charges and wants an arrangement where he can spend time with the aliens as well as on Earth.",
        "source": "user"
    },
    {
        "text": "The U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "user"
    },
    {
        "text": "president, who has gotten involved, is shocked but as he thinks about it, he realizes that Damon being close with the aliens could help protect not only his country but the entire world.",
        "source": "user"
    },
    {
        "text": "Soon Damon is living with the aliens 6 months out of an Earth year, learning about their culture, and touring the galaxy.",
        "source": "user"
    },
    {
        "text": "He works on screenplays while he is with them, and then when he returns to Earth he works on making those into movies.",
        "source": "api"
    },
    {
        "text": "Over the next 20 years, he is involved in over 10 movies, all of which are blockbusters that introduce the world to new ideas and realities.",
        "source": "user"
    },
    {
        "text": "Everyone is happy with the arrangement.",
        "source": "user"
    },
    {
        "text": "In 2041, the Earth is attacked by aliens from a different planet than Damon's aliens.",
        "source": "user"
    },
    {
        "text": "Damon's friends spring into action and before they can take over they blow up the attacker's ships and send those remaining back to their galaxies, knowing that they can't mess with Earth.",
        "source": "user"
    },
    {
        "text": "The message spreads through the universe and for centuries, even after Damon's eventual death, the Earth was safe from attack.",
        "source": "user"
    }
]