[
    "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
    "I remember when it happened.",
    "I was a Dad myself and I'll never forget the moment when I pulled my mug out of the cabinet that day.",
    "I don't remember the exact ranking, but the mug that had my name on it had a very long number, instead of the #1 that used to be printed on it.",
    "My friend Ed's mug was nowhere near as high as mine, but he informed me that day that his mug had changed too.",
    "It was happening all over the world.",
    "On this day, the rankings were appearing on all #1 Dad mugs and everyone could see how each Dad ranked.",
    "I felt pretty bad about my mug, which i think was in the 600,000s.",
    "I had to see what I could do .",
    "I thought a lot about what I could do to get a better ranking, but it wasn't easy.",
    "My three kids deserved a good dad so I made a plan to improve it over the next week.",
    "The next day, I spent time with my kids doing fun things.",
    "I started the day by taking them out to breakfast.",
    "Then we went to the park and played frisbee.",
    "I helped with their homework after school that week too.",
    "They really seemed to like their attentive new dad.",
    "After a week I checked my mug, and it had changed.",
    "It was still not nearly as high as I wanted it to be, but it had moved up to the 50,000s.",
    "This, to me, was a BIG difference.",
    "I called Ed to share the news with him.",
    "Funny enough he had a similar story.",
    "It seems that everyone in the world who had one of these mugs was going through a similar experience and trying to be a better dad.",
    "There was even a story about it on the news.",
    "Someone had cast a magic spell over Dad mugs that lasted one week.",
    "In the end, it was only a short number of days that the mugs were changing numbers and it had no major effect on the world.",
    "But for my family and me, we were forever changed because now I considered my actions and imagined, \"How would I rank today?\" with everything I did as a dad.",
    "And my kids were forever grateful.",
    ""
]