[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "This is the story of the survivors of the first wave of the invasion, and how they begin to use their newfound abilities to fight back.",
        "source": "user"
    },
    {
        "text": "The series was collected into a single volume: The Zora Chronicles.",
        "source": "user"
    },
    {
        "text": "The Zora Chronicles was nominated for the Eisner Award for Best Limited Series in 2010.",
        "source": "user"
    },
    {
        "text": "The Zora Chronicles was also nominated for the Harvey Award for Best New Series in 2010.",
        "source": "user"
    },
    {
        "text": "As you can imagine, the Zora Chronicles were wildly popular and many people loved them, regardless of age.",
        "source": "user"
    },
    {
        "text": "The Zora Chronicles has been optioned for a film by the production company, The Gotham Group.",
        "source": "user"
    },
    {
        "text": "The film is expected to be released in September 2022.",
        "source": "user"
    },
    {
        "text": "One little boy named Johnny is particularly excited about the release of the film.",
        "source": "user"
    },
    {
        "text": "He is a huge fan of the Zora Chronicles and has read all of the books.",
        "source": "user"
    },
    {
        "text": "One day, a producer named Mike reaches out to Johnny.",
        "source": "user"
    },
    {
        "text": "He has heard about Johnny's love and passion for the Zora Chronicles because Johnny runs a dedicated Instagram page and blog featuring content about the series.",
        "source": "user"
    },
    {
        "text": "Mike asks Johnny to come to the set of the film for a special role.",
        "source": "user"
    },
    {
        "text": "Johnny is absolutely thrilled.",
        "source": "user"
    },
    {
        "text": "He never imagined that he could become a big-time star for his favorite series on the big screen.",
        "source": "user"
    },
    {
        "text": "Johnny is so excited that he can't wait to tell his friends.",
        "source": "user"
    },
    {
        "text": "But he is surprised when his friends aren't excited for him.",
        "source": "user"
    },
    {
        "text": "In fact, they are downright jealous.",
        "source": "user"
    },
    {
        "text": "Johnny's friends are all big fans of the Zora Chronicles, too.",
        "source": "api"
    },
    {
        "text": "But they are upset that Johnny got the role instead of them.",
        "source": "user"
    },
    {
        "text": "They don't want to see Johnny succeed.",
        "source": "user"
    },
    {
        "text": "Johnny decides to ignore his friends' immaturity.",
        "source": "user"
    },
    {
        "text": "He is determined to make the most of his opportunity.",
        "source": "user"
    },
    {
        "text": "But will Johnny's friends sabotage his big chance?",
        "source": "user"
    },
    {
        "text": "When Johnny arrives on set, Mike greets him warmly.",
        "source": "user"
    },
    {
        "text": "He explains that Johnny will be playing a young boy named Johnny who is a huge fan of the Zora Chronicles.",
        "source": "user"
    },
    {
        "text": "Johnny is thrilled to be playing himself.",
        "source": "user"
    },
    {
        "text": "He can't wait to see himself on the big screen.",
        "source": "user"
    },
    {
        "text": "But Johnny's excitement quickly turns to horror when he learns that his friends have followed him to the set.",
        "source": "user"
    },
    {
        "text": "They are determined to ruin Johnny's big break.",
        "source": "user"
    },
    {
        "text": "They are going to do everything they can to make sure Johnny's performance is a disaster.",
        "source": "user"
    },
    {
        "text": "But Johnny is determined to prove his friends wrong.",
        "source": "user"
    },
    {
        "text": "He is going to give the best performance of his life.",
        "source": "user"
    },
    {
        "text": "So even though Johnny's friends repeatedly try to heckle him while he's on set, he ignores them.",
        "source": "user"
    },
    {
        "text": "He decides to write them off as his friends.",
        "source": "user"
    },
    {
        "text": "He is going to focus on his performance and nothing else.",
        "source": "user"
    },
    {
        "text": "After all, if his friends cannot be supportive of him then he doesn't need them in his life.",
        "source": "user"
    },
    {
        "text": "Johnny's friends are furious that Johnny is ignoring them.",
        "source": "user"
    },
    {
        "text": "But Johnny proves to Mike that he can handle his cool, and Mike is impressed with Johnny's sensibilities in ignoring his former friends.",
        "source": "user"
    },
    {
        "text": "Mike offers Johnny a full-time contract for other movies and that is how Johnny began his career in the movie industry.",
        "source": "user"
    },
    {
        "text": "After that, the green-eyed monsters had nothing more to say.",
        "source": "user"
    },
    {
        "text": "They felt badly about having tried to sabotage Johnny's chances and apologized to him.",
        "source": "user"
    },
    {
        "text": "Johnny forgave them and they became friends again.",
        "source": "user"
    },
    {
        "text": "Johnny then invited all of them to watch the release of the Zoya Chronicles in Hollywood at the premiere!",
        "source": "user"
    }
]