[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "It causes everyone who took the drug to lose their memories.",
        "source": "api"
    },
    {
        "text": "There are all of these young people but they don't know who they are or anything about their past.",
        "source": "user"
    },
    {
        "text": "The elderly now control the world.",
        "source": "user"
    },
    {
        "text": "They have the power now.",
        "source": "user"
    },
    {
        "text": "They decide what happens.",
        "source": "user"
    },
    {
        "text": "They form a new Government and act like it has always existed.",
        "source": "user"
    },
    {
        "text": "They inform the immortals that they exist only to take care of the elderly.",
        "source": "user"
    },
    {
        "text": "The immortals do as they are told as they don't know any better.",
        "source": "user"
    },
    {
        "text": "They don't know that they are being used.",
        "source": "user"
    },
    {
        "text": "This works out for a while, at least for the elderly.",
        "source": "api"
    },
    {
        "text": "But once the elderly start to die then the immortals are completely lost.",
        "source": "user"
    },
    {
        "text": "After a couple of decades they are all coming to the few surviving seniors who are still alive.",
        "source": "user"
    },
    {
        "text": "They are into their 100s so they are barely able to remember things themselves.",
        "source": "user"
    },
    {
        "text": "The immortals are desperate for answers.",
        "source": "user"
    },
    {
        "text": "Sadly there aren't any left once those last few seniors die.",
        "source": "api"
    },
    {
        "text": "The world is now filled with beautiful immortals who have no memory, not even of yesterday.",
        "source": "user"
    },
    {
        "text": "They just live day to day.",
        "source": "user"
    },
    {
        "text": "Nothing is accomplished.",
        "source": "user"
    },
    {
        "text": "No new technologies are found.",
        "source": "user"
    },
    {
        "text": "No new food is created so they just live off of what they can find.",
        "source": "user"
    },
    {
        "text": "It's a sad life.",
        "source": "user"
    },
    {
        "text": "It's all that they know at this point though.",
        "source": "user"
    },
    {
        "text": "Being immortal isn't all it's cracked up to be.",
        "source": "user"
    },
    {
        "text": "These people got what they wanted but never realized the cost it would have.",
        "source": "user"
    },
    {
        "text": "Their souls never pass on so in the end it truly was a curse and only the elderly were able to escape from this life.",
        "source": "user"
    }
]