[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "At first you watch in horror, but eventually you find yourself rooting for the guy.",
        "source": "api"
    },
    {
        "text": "Moments in their lives begin to pass.",
        "source": "api"
    },
    {
        "text": "They range from small moments to large ones.",
        "source": "user"
    },
    {
        "text": "You are able to experience the emotions of when they were feeling the emotion.",
        "source": "user"
    },
    {
        "text": "From simple things to enjoy your parent's meals to more elaborate events such as, your first prom date.",
        "source": "api"
    },
    {
        "text": "Soon you find yourself once again watching yourself die.",
        "source": "user"
    },
    {
        "text": "Immediately the version that succeeded you shows up in a seat next to you.",
        "source": "api"
    },
    {
        "text": "They look at you with the same confusion you once shared.",
        "source": "user"
    },
    {
        "text": "This process continues.",
        "source": "user"
    },
    {
        "text": "It goes on and on.",
        "source": "api"
    },
    {
        "text": "You realize that you're trapped.",
        "source": "user"
    },
    {
        "text": "Is this Hell?",
        "source": "user"
    },
    {
        "text": "Am I forced to sit here and be a spectator of my life?",
        "source": "user"
    },
    {
        "text": "Never to be the one who makes the decision's and always a bystander?",
        "source": "user"
    },
    {
        "text": "It is then that you are given a choice.",
        "source": "user"
    },
    {
        "text": "You get up and walk away.",
        "source": "api"
    },
    {
        "text": "You walk through the door and it closes behind you.",
        "source": "api"
    },
    {
        "text": "The other versions of you don't follow.",
        "source": "user"
    },
    {
        "text": "Maybe they've been through this before or maybe they're afraid of what change this choice may bring.",
        "source": "user"
    },
    {
        "text": "Regardless, you choose to continue.",
        "source": "user"
    },
    {
        "text": "You finally feel as you're in control of yourself once again.",
        "source": "user"
    },
    {
        "text": "Regardless of what it may bring, at least you know it was because of the choice you were free to make.",
        "source": "user"
    }
]