[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "You can’t escape as you’re glued to your seat.",
        "source": "api"
    },
    {
        "text": "After it’s done you are taken forward to live your next life.",
        "source": "api"
    },
    {
        "text": "That can be a bit scary and even sad for some of us.",
        "source": "api"
    },
    {
        "text": "Not everyone wants to be reincarnated.",
        "source": "user"
    },
    {
        "text": "Not everyone wants to come back to this Earth.",
        "source": "user"
    },
    {
        "text": "But reincarnation allows us to experience many different lives.",
        "source": "user"
    },
    {
        "text": "It allows us to experience all the different roles we can play.",
        "source": "user"
    },
    {
        "text": "It allows us to be a parent, to be a child, to be an animal or plant.",
        "source": "api"
    },
    {
        "text": "Anything is possible with reincarnation.",
        "source": "api"
    },
    {
        "text": "Some people believe that reincarnation is like going from one room into another, and then you decide if you want to go back to the original.",
        "source": "user"
    },
    {
        "text": "We also get to choose our next life, including the place where we will live and who we will be.",
        "source": "api"
    },
    {
        "text": "Those people believe that we have some control over our life.",
        "source": "api"
    },
    {
        "text": "Others believe that we are reincarnated into something or someone by random chance.",
        "source": "user"
    },
    {
        "text": "Whatever your belief is, reincarnation allows us to experience the many different roles we can play.",
        "source": "user"
    },
    {
        "text": "What is it like to be a ghost?",
        "source": "api"
    },
    {
        "text": "To be a ghost is to be in purgatory.",
        "source": "api"
    },
    {
        "text": "But it is not a painful experience, it is just very quiet and calm.",
        "source": "api"
    },
    {
        "text": "It is almost like being in suspended animation.",
        "source": "api"
    },
    {
        "text": "There is no time, there are no seasons, there is no physical pain.",
        "source": "api"
    },
    {
        "text": "It's an interesting experience to say the least, and one many humans fear.",
        "source": "api"
    },
    {
        "text": "The universe that we live on is the only one we know.",
        "source": "user"
    },
    {
        "text": "The unknown can be very scary to our minds.",
        "source": "user"
    },
    {
        "text": "We are social creatures, and we feel safe in our own realm.",
        "source": "user"
    },
    {
        "text": "To move on from the physical body is very challenging for many people.",
        "source": "api"
    },
    {
        "text": "We have a comfort in our physical body.",
        "source": "api"
    },
    {
        "text": "Many people are afraid to live off as a spirit in the spiritual world.",
        "source": "user"
    },
    {
        "text": "They are used to their physical body.",
        "source": "user"
    },
    {
        "text": "It is a safe feeling for a human.",
        "source": "api"
    },
    {
        "text": "Some humans have the belief that when we die and move on, we go to a better place.",
        "source": "api"
    },
    {
        "text": "That is the most comforting thought in regards to death.",
        "source": "api"
    },
    {
        "text": "To many people, the afterlife is better than this Earth.",
        "source": "user"
    },
    {
        "text": "Getting to spend life with the Holy Father, the Lord, God is what they believe their life's purpose is.",
        "source": "api"
    },
    {
        "text": "Heaven is a wonderful place to be.",
        "source": "user"
    },
    {
        "text": "It is a place where there is no pain, suffering, or any other negative experience.",
        "source": "user"
    },
    {
        "text": "It is a place where we can live forever with the people who are most important to us.",
        "source": "api"
    },
    {
        "text": "That is peaceful to most humans.",
        "source": "api"
    },
    {
        "text": "Why die if we can live forever?",
        "source": "api"
    },
    {
        "text": "Humans have beliefs and ultimately the end of life is unknown.",
        "source": "user"
    },
    {
        "text": "When you look around and look into science there are many conflicting beliefs.",
        "source": "user"
    },
    {
        "text": "The world has so many different religions, and humans have a hard time to putting their faith into one set of beliefs.",
        "source": "user"
    },
    {
        "text": "Ultimately you choose what you want to believe in.",
        "source": "api"
    },
    {
        "text": "We will all experience death one day, and in my belief our physical bodies will be thrown away like a jacket.",
        "source": "api"
    },
    {
        "text": "Our spirit will rise out of our body and ascend to heaven.",
        "source": "user"
    },
    {
        "text": "We will meet our maker and live a life of eternal bliss with those who were closest to us.",
        "source": "user"
    },
    {
        "text": "Life is beautiful.",
        "source": "user"
    },
    {
        "text": "The afterlife is too.",
        "source": "user"
    }
]