[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 0.0,
        "end_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.08440137542982182
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. ",
        "source": "user",
        "last_event_time": 555.0,
        "start_time": 7.0,
        "end_time": 19.0,
        "start_progress": 0.08440137542982182,
        "end_progress": 0.11878712097530478
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. ",
        "source": "user",
        "last_event_time": 555.0,
        "start_time": 7.0,
        "end_time": 65.0,
        "start_progress": 0.11878712097530478,
        "end_progress": 0.15723663644889027
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 76.0,
        "end_time": 76.0,
        "start_progress": 0.15723663644889027,
        "end_progress": 0.17599249765551736
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 94.0,
        "end_time": 94.0,
        "start_progress": 0.17599249765551736,
        "end_progress": 0.19631134729603
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\"",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 107.0,
        "end_time": 107.0,
        "start_progress": 0.19631134729603,
        "end_progress": 0.2172553923100969
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 116.0,
        "end_time": 116.0,
        "start_progress": 0.2172553923100969,
        "end_progress": 0.22913410440762738
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 124.0,
        "end_time": 124.0,
        "start_progress": 0.22913410440762738,
        "end_progress": 0.24507658643326038
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. ",
        "source": "user",
        "last_event_time": 555.0,
        "start_time": 125.0,
        "end_time": 149.0,
        "start_progress": 0.24507658643326038,
        "end_progress": 0.2797749296655205
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 161.0,
        "end_time": 161.0,
        "start_progress": 0.2797749296655205,
        "end_progress": 0.29415442325726787
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" ",
        "source": "user",
        "last_event_time": 555.0,
        "start_time": 161.0,
        "end_time": 174.0,
        "start_progress": 0.29415442325726787,
        "end_progress": 0.3207252266333229
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 180.0,
        "end_time": 180.0,
        "start_progress": 0.3207252266333229,
        "end_progress": 0.3276023757424195
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. ",
        "source": "user",
        "last_event_time": 555.0,
        "start_time": 181.0,
        "end_time": 208.0,
        "start_progress": 0.3276023757424195,
        "end_progress": 0.37699281025320414
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 213.0,
        "end_time": 213.0,
        "start_progress": 0.37699281025320414,
        "end_progress": 0.387308533916849
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 222.0,
        "end_time": 222.0,
        "start_progress": 0.387308533916849,
        "end_progress": 0.40825257893091593
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 235.0,
        "end_time": 235.0,
        "start_progress": 0.40825257893091593,
        "end_progress": 0.41544232572678963
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 241.0,
        "end_time": 241.0,
        "start_progress": 0.41544232572678963,
        "end_progress": 0.43888715223507346
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. ",
        "source": "user",
        "last_event_time": 555.0,
        "start_time": 243.0,
        "end_time": 264.0,
        "start_progress": 0.43888715223507346,
        "end_progress": 0.4876523913723038
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 276.0,
        "end_time": 276.0,
        "start_progress": 0.4876523913723038,
        "end_progress": 0.530478274460769
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 285.0,
        "end_time": 285.0,
        "start_progress": 0.530478274460769,
        "end_progress": 0.5364176305095343
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 294.0,
        "end_time": 294.0,
        "start_progress": 0.5364176305095343,
        "end_progress": 0.5523601125351673
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\"",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 300.0,
        "end_time": 300.0,
        "start_progress": 0.5523601125351673,
        "end_progress": 0.5817442950922164
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\" She tells you that it is an honor to have been called by the Almighty King of the Bees to serve as a human leader of all bees. \"",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 309.0,
        "end_time": 309.0,
        "start_progress": 0.5817442950922164,
        "end_progress": 0.6220693966864645
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\" She tells you that it is an honor to have been called by the Almighty King of the Bees to serve as a human leader of all bees.  ",
        "source": "user",
        "last_event_time": 555.0,
        "start_time": 310.0,
        "end_time": 312.0,
        "start_progress": 0.6220693966864645,
        "end_progress": 0.6220693966864645
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\" She tells you that it is an honor to have been called by the Almighty King of the Bees to serve as a human leader of all bees.  You just can't understand how you were tapped for this role but then Michael explains. ",
        "source": "user",
        "last_event_time": 555.0,
        "start_time": 310.0,
        "end_time": 337.0,
        "start_progress": 0.6220693966864645,
        "end_progress": 0.6492653954360738
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\" She tells you that it is an honor to have been called by the Almighty King of the Bees to serve as a human leader of all bees.  You just can't understand how you were tapped for this role but then Michael explains. \"Do you remember the time you had that peanut butter and honey sandwich?\" he asks. ",
        "source": "user",
        "last_event_time": 555.0,
        "start_time": 310.0,
        "end_time": 364.0,
        "start_progress": 0.6492653954360738,
        "end_progress": 0.6752110034385745
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\" She tells you that it is an honor to have been called by the Almighty King of the Bees to serve as a human leader of all bees.  You just can't understand how you were tapped for this role but then Michael explains. \"Do you remember the time you had that peanut butter and honey sandwich?\" he asks. \"Well, the Almighty King of the Bees was watching and saw you happily enjoying your sandwich.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 373.0,
        "end_time": 373.0,
        "start_progress": 0.6752110034385745,
        "end_progress": 0.7042825883088465
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\" She tells you that it is an honor to have been called by the Almighty King of the Bees to serve as a human leader of all bees.  You just can't understand how you were tapped for this role but then Michael explains. \"Do you remember the time you had that peanut butter and honey sandwich?\" he asks. \"Well, the Almighty King of the Bees was watching and saw you happily enjoying your sandwich. He knows you like honey and was moved by your love of it.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 386.0,
        "end_time": 386.0,
        "start_progress": 0.7042825883088465,
        "end_progress": 0.7224132541419194
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\" She tells you that it is an honor to have been called by the Almighty King of the Bees to serve as a human leader of all bees.  You just can't understand how you were tapped for this role but then Michael explains. \"Do you remember the time you had that peanut butter and honey sandwich?\" he asks. \"Well, the Almighty King of the Bees was watching and saw you happily enjoying your sandwich. He knows you like honey and was moved by your love of it. So he decided that you would be a perfect human leader of the bees.\"",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 400.0,
        "end_time": 400.0,
        "start_progress": 0.7224132541419194,
        "end_progress": 0.7439824945295405
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\" She tells you that it is an honor to have been called by the Almighty King of the Bees to serve as a human leader of all bees.  You just can't understand how you were tapped for this role but then Michael explains. \"Do you remember the time you had that peanut butter and honey sandwich?\" he asks. \"Well, the Almighty King of the Bees was watching and saw you happily enjoying your sandwich. He knows you like honey and was moved by your love of it. So he decided that you would be a perfect human leader of the bees.\" You are surprised that eating such a simple thing as a peanut butter and honey sandwich would land you such a title and role in the world, but it doesn't seem like you can argue more. ",
        "source": "user",
        "last_event_time": 555.0,
        "start_time": 402.0,
        "end_time": 430.0,
        "start_progress": 0.7439824945295405,
        "end_progress": 0.8018130665833073
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\" She tells you that it is an honor to have been called by the Almighty King of the Bees to serve as a human leader of all bees.  You just can't understand how you were tapped for this role but then Michael explains. \"Do you remember the time you had that peanut butter and honey sandwich?\" he asks. \"Well, the Almighty King of the Bees was watching and saw you happily enjoying your sandwich. He knows you like honey and was moved by your love of it. So he decided that you would be a perfect human leader of the bees.\" You are surprised that eating such a simple thing as a peanut butter and honey sandwich would land you such a title and role in the world, but it doesn't seem like you can argue more. You have been chosen.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 444.0,
        "end_time": 444.0,
        "start_progress": 0.8018130665833073,
        "end_progress": 0.8083776180056268
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\" She tells you that it is an honor to have been called by the Almighty King of the Bees to serve as a human leader of all bees.  You just can't understand how you were tapped for this role but then Michael explains. \"Do you remember the time you had that peanut butter and honey sandwich?\" he asks. \"Well, the Almighty King of the Bees was watching and saw you happily enjoying your sandwich. He knows you like honey and was moved by your love of it. So he decided that you would be a perfect human leader of the bees.\" You are surprised that eating such a simple thing as a peanut butter and honey sandwich would land you such a title and role in the world, but it doesn't seem like you can argue more. You have been chosen. Michael says to you \"Remember, we are here to serve you.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 452.0,
        "end_time": 452.0,
        "start_progress": 0.8083776180056268,
        "end_progress": 0.8261956861519225
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\" She tells you that it is an honor to have been called by the Almighty King of the Bees to serve as a human leader of all bees.  You just can't understand how you were tapped for this role but then Michael explains. \"Do you remember the time you had that peanut butter and honey sandwich?\" he asks. \"Well, the Almighty King of the Bees was watching and saw you happily enjoying your sandwich. He knows you like honey and was moved by your love of it. So he decided that you would be a perfect human leader of the bees.\" You are surprised that eating such a simple thing as a peanut butter and honey sandwich would land you such a title and role in the world, but it doesn't seem like you can argue more. You have been chosen. Michael says to you \"Remember, we are here to serve you.\" You nod and then send the bees on their first task. You tell the bees to go far away and to not come back. The bees are obligated to listen to your commands and do so. ",
        "source": "user",
        "last_event_time": 555.0,
        "start_time": 455.0,
        "end_time": 487.0,
        "start_progress": 0.8261956861519225,
        "end_progress": 0.8793372929040325
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\" She tells you that it is an honor to have been called by the Almighty King of the Bees to serve as a human leader of all bees.  You just can't understand how you were tapped for this role but then Michael explains. \"Do you remember the time you had that peanut butter and honey sandwich?\" he asks. \"Well, the Almighty King of the Bees was watching and saw you happily enjoying your sandwich. He knows you like honey and was moved by your love of it. So he decided that you would be a perfect human leader of the bees.\" You are surprised that eating such a simple thing as a peanut butter and honey sandwich would land you such a title and role in the world, but it doesn't seem like you can argue more. You have been chosen. Michael says to you \"Remember, we are here to serve you.\" You nod and then send the bees on their first task. You tell the bees to go far away and to not come back. The bees are obligated to listen to your commands and do so. Within minutes, they are gone.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 493.0,
        "end_time": 493.0,
        "start_progress": 0.8793372929040325,
        "end_progress": 0.888715223507346
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\" She tells you that it is an honor to have been called by the Almighty King of the Bees to serve as a human leader of all bees.  You just can't understand how you were tapped for this role but then Michael explains. \"Do you remember the time you had that peanut butter and honey sandwich?\" he asks. \"Well, the Almighty King of the Bees was watching and saw you happily enjoying your sandwich. He knows you like honey and was moved by your love of it. So he decided that you would be a perfect human leader of the bees.\" You are surprised that eating such a simple thing as a peanut butter and honey sandwich would land you such a title and role in the world, but it doesn't seem like you can argue more. You have been chosen. Michael says to you \"Remember, we are here to serve you.\" You nod and then send the bees on their first task. You tell the bees to go far away and to not come back. The bees are obligated to listen to your commands and do so. Within minutes, they are gone. When you turn to Michael, he disappears as well.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 493.0,
        "end_time": 505.0,
        "start_progress": 0.888715223507346,
        "end_progress": 0.9040325101594249
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\" She tells you that it is an honor to have been called by the Almighty King of the Bees to serve as a human leader of all bees.  You just can't understand how you were tapped for this role but then Michael explains. \"Do you remember the time you had that peanut butter and honey sandwich?\" he asks. \"Well, the Almighty King of the Bees was watching and saw you happily enjoying your sandwich. He knows you like honey and was moved by your love of it. So he decided that you would be a perfect human leader of the bees.\" You are surprised that eating such a simple thing as a peanut butter and honey sandwich would land you such a title and role in the world, but it doesn't seem like you can argue more. You have been chosen. Michael says to you \"Remember, we are here to serve you.\" You nod and then send the bees on their first task. You tell the bees to go far away and to not come back. The bees are obligated to listen to your commands and do so. Within minutes, they are gone. When you turn to Michael, he disappears as well. You are all alone.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 493.0,
        "end_time": 512.0,
        "start_progress": 0.9040325101594249,
        "end_progress": 0.90997186620819
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\" She tells you that it is an honor to have been called by the Almighty King of the Bees to serve as a human leader of all bees.  You just can't understand how you were tapped for this role but then Michael explains. \"Do you remember the time you had that peanut butter and honey sandwich?\" he asks. \"Well, the Almighty King of the Bees was watching and saw you happily enjoying your sandwich. He knows you like honey and was moved by your love of it. So he decided that you would be a perfect human leader of the bees.\" You are surprised that eating such a simple thing as a peanut butter and honey sandwich would land you such a title and role in the world, but it doesn't seem like you can argue more. You have been chosen. Michael says to you \"Remember, we are here to serve you.\" You nod and then send the bees on their first task. You tell the bees to go far away and to not come back. The bees are obligated to listen to your commands and do so. Within minutes, they are gone. When you turn to Michael, he disappears as well. You are all alone. ou look at the sandwich on your table and think about how it changed your life.",
        "source": "api",
        "last_event_time": 555.0,
        "start_time": 493.0,
        "end_time": 527.0,
        "start_progress": 0.90997186620819,
        "end_progress": 0.9349796811503595
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" You're shocked to hear the little voice speak to you and even more shocked to find that it belongs to a bee. The bee introduces himself as Michael and tells you not to be afraid of him. \"But I'm deathly allergic,\" you tell Michael. Michael laughs and tells you that he has a surprise for you. Suddenly a swarm of bees surround you and the queen bee arrives. She lands on your shoulder and says \"Honey, what are your orders?\" The rest of the swarm begins to buzz. The queen tells you that they're yours to command. You protest to Michael again that you are deathly allergic to this swarm of bees and you cannot be near them. Michael tells you that they will not hurt you. \"No one is going to sting you,\" he promises. \"You will be absolutely fine with us.\" You're still hesitant. But Michael tells you that the Almighty King of the Bees has sought you out as the next human leader of all bees, and that thus no one would dare sting you. \"But I'm not a bee,\" you respond. \"Yes, but you are the human leader of all bees,\" Michael responds. You cannot believe it. The queen bee tells you that it is true and that she has come to help you. She says she is at your aid and she will dispense any member of her hive to aid you too. \"But how did I get picked for this role?\" you ask, incredulously. The queen explains that the Almighty King of the Bees has been watching you for a while, and he sees your potential to be a great leader. You are skeptical. \"I'm just an ordinary person,\" you tell the queen. She laughs and says \"Yes, but the Almighty King of the Bees sees great things ahead for you.\" She tells you that it is an honor to have been called by the Almighty King of the Bees to serve as a human leader of all bees.  You just can't understand how you were tapped for this role but then Michael explains. \"Do you remember the time you had that peanut butter and honey sandwich?\" he asks. \"Well, the Almighty King of the Bees was watching and saw you happily enjoying your sandwich. He knows you like honey and was moved by your love of it. So he decided that you would be a perfect human leader of the bees.\" You are surprised that eating such a simple thing as a peanut butter and honey sandwich would land you such a title and role in the world, but it doesn't seem like you can argue more. You have been chosen. Michael says to you \"Remember, we are here to serve you.\" You nod and then send the bees on their first task. You tell the bees to go far away and to not come back. The bees are obligated to listen to your commands and do so. Within minutes, they are gone. When you turn to Michael, he disappears as well. You are all alone. Later that day at lunch, you look at the sandwich on your table and think about how it changed your life. But you are glad to be rid of the bees, for that role seemed like it would be too much responsibility and moreover, you really didn't want a swarm of pesky bees in your ear all day.",
        "source": "user",
        "last_event_time": 555.0,
        "start_time": 527.0,
        "end_time": 555.0,
        "start_progress": 0.9349796811503595,
        "end_progress": 1.0
    }
]