[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "The alien's name is Rayne.",
        "source": "user"
    },
    {
        "text": "She's a bounty hunter.",
        "source": "user"
    },
    {
        "text": "She's also a bit crazy.",
        "source": "api"
    },
    {
        "text": "She has it in her head that Matt Damon is the greatest bounty of the human race given his amazing comedic skill and acting talent.",
        "source": "api"
    },
    {
        "text": "So she believes that kidnapping Matt Damon and bringing him back to her home planet, Cyborg, is the best way for her to make it rain and for her to get a payday.",
        "source": "user"
    },
    {
        "text": "What she doesn't realize is that the human race will stop at nothing to get their beloved Matt Damon back.",
        "source": "user"
    },
    {
        "text": "The human race is going to make it extremely difficult for Rayne to actually cash out on her payday since they are going to make it near impossible to actually get the bounty owed to her for kidnapping him.",
        "source": "api"
    },
    {
        "text": "In fact, the human race, upon discovering the Matt Damon is not home, immediately assembled task forces around the world to try to locate Matt Damon's exact location.",
        "source": "user"
    },
    {
        "text": "It takes the human race forever to find out where Matt Damon is, but once they do, they will send one of their best agents to retrieve him.",
        "source": "user"
    },
    {
        "text": "The human race pinpoints Matt Damon's exact location on the spacecraft that the alien has taken off with him in.",
        "source": "user"
    },
    {
        "text": "They then discover that the spacecraft is headed toward Cyborg, which is located in the Andromeda Galaxy.",
        "source": "user"
    },
    {
        "text": "Due to the distance it takes so long for them to figure out where Matt Damon is, they send an elite human agent after him, who eventually catches up.",
        "source": "api"
    },
    {
        "text": "This elite agent's name is Barth.",
        "source": "api"
    },
    {
        "text": "Barth has a storied pedigree and is an incredibly talented agent.",
        "source": "user"
    },
    {
        "text": "He has never lost a case before and he is not about to let Matt Damon be the first.",
        "source": "user"
    },
    {
        "text": "So Barth heads off to catch up with the alien on his own personal spacecraft.",
        "source": "user"
    },
    {
        "text": "Barth is successful in tracking the alien down and catching up to her.",
        "source": "user"
    },
    {
        "text": "Rayne is totally shocked to see Barth standing in her way of cashing out on the kidnapping.",
        "source": "api"
    },
    {
        "text": "How dare this mere mortal human try to thwart her plans for cash?",
        "source": "user"
    },
    {
        "text": "Barth tells the alien to let go of Matt Damon, or things could get really ugly.",
        "source": "user"
    },
    {
        "text": "The alien thinks that she is in charge, but Barth insists that he's the one in charge.",
        "source": "user"
    },
    {
        "text": "The two bicker for a bit and then the alien realizes that this whole situation is just fruitless.",
        "source": "api"
    },
    {
        "text": "So she agrees to release Matt Damon.",
        "source": "user"
    },
    {
        "text": "Upon his release, Matt Damon tells the alien and Barth that he's going to go back home.",
        "source": "api"
    },
    {
        "text": "He's had enough of this kidnapping nonsense.",
        "source": "api"
    },
    {
        "text": "He's going to go home and maybe start a family.",
        "source": "api"
    },
    {
        "text": "Maybe he'll find some nice human woman to settle down with.",
        "source": "api"
    },
    {
        "text": "The alien is very sad to see Matt Damon go.",
        "source": "api"
    },
    {
        "text": "But Barth totally understands Matt Damon's desire to settle down with some semblance of normalcy after the bizarre kidnapping experience that he's just gone through.",
        "source": "api"
    },
    {
        "text": "Barth promises to take Matt Damon back to his hometown on planet Earth so that Matt Damon can recuperate and regain his mental health after such a harrowing experience.",
        "source": "user"
    },
    {
        "text": "Before he leaves for Earth, Matt Damon asks the alien if she's going to be all right.",
        "source": "user"
    },
    {
        "text": "The alien, sad as she is about Matt Damon's departure, smiles at Matt Damon and nods.",
        "source": "api"
    },
    {
        "text": "The alien knows that Matt Damon is actually quite the gentleman.",
        "source": "user"
    },
    {
        "text": "If anyone had to escape her capture, it was a good thing it was Matt Damon, since the alien had actually grown somewhat of a soft spot for the man.",
        "source": "user"
    },
    {
        "text": "The alien watches as Matt Damon, Barth, and the spacecraft take off.",
        "source": "user"
    },
    {
        "text": "Barth takes Matt Damon home, and Matt Damon rests, relaxes and tries to forget the whole experience of ever having been kidnapped.",
        "source": "api"
    },
    {
        "text": "When Barth checks in on Matt Damon a few months later, Matt Damon seems to be in very good spirits and is as good as new.",
        "source": "user"
    },
    {
        "text": "It's almost as though he was never kidnapped.",
        "source": "user"
    }
]