[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "He is falling deep in love with the woman but can't seem to make her like him enough to stay with him for long.",
        "source": "user"
    },
    {
        "text": "So, he works on making himself a more acceptable boyfriend to her.",
        "source": "user"
    },
    {
        "text": "He tried to learn about her in great depth and understand the things that she desires in a mate.",
        "source": "user"
    },
    {
        "text": "Slowly he realizes that in many ways he simply doesn't measure up to her expectations for a romantic partner.",
        "source": "user"
    },
    {
        "text": "He eventually realizes that he doesn't need to be a different person, but needs to become a better version of himself.",
        "source": "user"
    },
    {
        "text": "He starts to do the very hard work of improving himself as a person.",
        "source": "user"
    },
    {
        "text": "One thing that she respects is erudition so he starts to educate himself on all the subjects he had no interest in when he was in school.",
        "source": "user"
    },
    {
        "text": "She likes men with impressive physiques so he starts a workout regimen.",
        "source": "user"
    },
    {
        "text": "He's a great dancer, but he can't dance very well in front of her so he starts taking lessons.",
        "source": "user"
    },
    {
        "text": "he spends so much time improving himself that he really does become a better man and his confidence an self esteem improve dramatically.",
        "source": "user"
    },
    {
        "text": "After all this work he decides that he doesn't really need her to be happy and decides to see her one last time, for closure.",
        "source": "user"
    },
    {
        "text": "He tells her everything he's learned and how he's improved himself.",
        "source": "user"
    },
    {
        "text": "She tells him that she knew that it was him every time and that she just wanted to see him work to live up to the potential she saw within him.",
        "source": "user"
    },
    {
        "text": "He is stunned and cries in her arms.",
        "source": "user"
    },
    {
        "text": "He understands now that he loves her even more because she caused him to be a greater man than he could have ever been without her help.",
        "source": "user"
    },
    {
        "text": "They marry and spend the rest of their lives together.",
        "source": "user"
    }
]