[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\"",
        "source": "api"
    },
    {
        "text": "It has been years since JFK, THE JFK, had contacted me.",
        "source": "user"
    },
    {
        "text": "He first contacted me after I was sworn in as president during my first term.",
        "source": "user"
    },
    {
        "text": "JFK leads a group of former presidents that work in the shadows to eliminate threats to the United States and the world.",
        "source": "user"
    },
    {
        "text": "It was a secret group called the \"C-Team\" and no one knows about them except for the former presidents and those they protect.",
        "source": "user"
    },
    {
        "text": "The C-Team deals with supernatural and extraterrestrial threats.",
        "source": "user"
    },
    {
        "text": "After I read the letter, I packed my suitcase.",
        "source": "user"
    },
    {
        "text": "Michelle was still in bed sleeping.",
        "source": "user"
    },
    {
        "text": "I woke her up and told her \"it's time\".",
        "source": "user"
    },
    {
        "text": "She knew about the C-Team as well.",
        "source": "user"
    },
    {
        "text": "She wished me luck and said that she would take care of the kids.",
        "source": "user"
    },
    {
        "text": "I called the number JFK left on the letter.",
        "source": "user"
    },
    {
        "text": "The person on the other end said that a helicopter would land in my back yard to pick me up.",
        "source": "user"
    },
    {
        "text": "The helicopter was on the scene in 30 minutes.",
        "source": "user"
    },
    {
        "text": "The helicopter landed in my back yard, and two heavily armed troopers escorted me to the chopper.",
        "source": "user"
    },
    {
        "text": "I asked the pilot where we would be going.",
        "source": "user"
    },
    {
        "text": "He said space.",
        "source": "user"
    },
    {
        "text": "I laughed until two rocket engines appeared beneath the helicopter.",
        "source": "user"
    },
    {
        "text": "The helicopter pilots sealed off the compartment we were in and fired up the engines.",
        "source": "user"
    },
    {
        "text": "I am not sure where this rocket technology came from, but it was extremely powerful.",
        "source": "user"
    },
    {
        "text": "We had flown past the International Space Station in a manner of minutes.",
        "source": "user"
    },
    {
        "text": "I was taken to a small space station orbiting Earth.",
        "source": "user"
    },
    {
        "text": "The plane docked with the space station.",
        "source": "user"
    },
    {
        "text": "After a few minutes, I heard the sound of air rushing into the compartment we were in.",
        "source": "user"
    },
    {
        "text": "Then the plane doors opened.",
        "source": "user"
    },
    {
        "text": "I was met by JFK at the entrance to the space station.",
        "source": "user"
    },
    {
        "text": "He still looked the same.",
        "source": "user"
    },
    {
        "text": "JFK said, \"Are you ready to start this adventure, Barack?\".",
        "source": "user"
    },
    {
        "text": "I replied to him, \"I was ready since the day I took office. \".",
        "source": "user"
    },
    {
        "text": "JFK smiled and said \"Let's get started.\"   My adventures on the C-Team had finally begun.",
        "source": "user"
    }
]