[
    "You're Barack Obama.",
    "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
    "It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below.",
    "It's time to start the real job.\" Signed simply, \"JFK.\" Upon calling the number, you find yourself in an abandoned warehouse.",
    "You literally just teleported there.",
    "What was happening?",
    "You decide that you'll look around to try and figure out where you are.",
    "You look through the warehouse but it is empty.",
    "You then open the door that leads outside.",
    "You're on a balcony overlooking a sprawling city.",
    "It's not like a city you've ever seen before.",
    "It's old, yet futuristic.",
    "It has a very movie quality to it.",
    "You then hear someone clearing their throat behind you.",
    "You turn to see a man with a cowboy hat, dressed in a suit.",
    "He removes his hat and introduces himself as Agent Dale Cooper.",
    "You instantly recognize that name from the show Twin Peaks.",
    "You're a big fan.",
    "Agent Cooper explains that you have been chosen to be the new Truman.",
    "It's your job to oversee this mystery city.",
    "You are to solve the mystery of who is murdering people in this city.",
    "It's a lot to take in.",
    "Agent Cooper explains that in order to get you acquainted with the city, he's going to give you a tour.",
    "He takes you down to the city floor.",
    "You begin seeing this old yet futuristic city up close.",
    "The people are human but they are dressed in a way that looks different from anything you've seen.",
    "He explains that this city is called \"Twin Peaks\".",
    "It's different than the one from the tv show, that's for sure.",
    "He explains that you will have two seasons of time to figure out who the killer is.",
    "You will have 8 days for each season.",
    "He states that the series premiere is starting right now.",
    "You then hear the Twin Peaks theme music starting.",
    "It seems to come out of nowhere.",
    "Having watched the series, you know you are in for a crazy ride.",
    "This is going to be a wild 2 seasons!",
    ""
]