[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "This power gives them the ability to have a collective mind.",
        "source": "api"
    },
    {
        "text": "This new collective mind, called the Consciousness, is a remarkable phenomenon.",
        "source": "user"
    },
    {
        "text": "But it is also a weapon that can give humanity the edge it needs to drive back the Ethereal invaders.",
        "source": "api"
    },
    {
        "text": "It allows them to plan across the world without even having to communicate.",
        "source": "api"
    },
    {
        "text": "They begin working on a plan.",
        "source": "user"
    },
    {
        "text": "Using the Consciousness as a weapon, they begin to fight back against those who would see them destroyed.",
        "source": "user"
    },
    {
        "text": "They come up with a timed attack.",
        "source": "api"
    },
    {
        "text": "They strike at the same times in every location and hit the Ethereals where they least expect it.",
        "source": "user"
    },
    {
        "text": "This is successful.",
        "source": "api"
    },
    {
        "text": "It catches them off guard.",
        "source": "user"
    },
    {
        "text": "But it does not finish them off.",
        "source": "user"
    },
    {
        "text": "They then have to focus their attacks more.",
        "source": "api"
    },
    {
        "text": "People have to travel to join larger groups to take down the largest of the aliens.",
        "source": "user"
    },
    {
        "text": "They have to work together to survive.",
        "source": "user"
    },
    {
        "text": "They need to work together to end this.",
        "source": "api"
    },
    {
        "text": "It takes some time but they finally take down the larger aliens and free the earth from this invasion.",
        "source": "user"
    },
    {
        "text": "But it is not without great cost.",
        "source": "user"
    },
    {
        "text": "Humans are a much smaller population now.",
        "source": "api"
    },
    {
        "text": "Many people like this new power that they share.",
        "source": "api"
    },
    {
        "text": "A movement starts that wants to ban people from having children because it would lesson their power.",
        "source": "user"
    },
    {
        "text": "Without children in the future, the Consciousness would be even stronger.",
        "source": "user"
    },
    {
        "text": "This splits the world into two groups, those who want to repopulate and those who do not.",
        "source": "api"
    },
    {
        "text": "These two sides go to war.",
        "source": "user"
    },
    {
        "text": "It causes even more death.",
        "source": "user"
    },
    {
        "text": "The people who do not want to repopulate get the advantage.",
        "source": "api"
    },
    {
        "text": "They then end up wiping out the other group.",
        "source": "user"
    },
    {
        "text": "The survivors then begin killing each other, thinking that they may gain new powers if there are less people.",
        "source": "user"
    },
    {
        "text": "This continues until there is one human left, who realizes there were no extra powers.",
        "source": "user"
    },
    {
        "text": "They have the ultimate collective mind to share with no one else.",
        "source": "user"
    }
]