[
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\"\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.11972731146144014
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\"\n\nI looked at the letter and couldn't believe what I was reading. How could JFK be writing me a letter. He has been dead for years. His death was confirmed and even seen on video. This obviously is a prank but who would do something so disgusting?\n\nI tried to go about the rest of my day but I can't lie. The letter kept popping up in my head. I had to figure out who was pranking me. I was the President of the United States for 8 years. If JFK was actually alive I would have heard about it from the Secret Service. I went to bed and the next day when I woke up that letter was still on my mind.\n\nI decided to give the number a call. A male voice picked up and told me that I'd be transferred to JFK. After about 15 seconds a voice said to me \"Hi Barack, it's John F Kennedy.\" I told the voice on the other end of the phone that obviously this is a joke and I was about to hang up. The voice told me to wait and said he had proof.\n\nAbout 15 seconds later I checked my phone and I saw a picture of this man. He looked like JFK. He took a picture of his old license. He had old family photos. I still was pretty sure this was a prank but I wanted to see how far it would go.\n\nI asked JFK why he left me his number and want he needed my help with. JFK explained that he wanted me to come visit a secret island that he was stationed on. He has some new technology that I might want to check out.\n\nHe has been designing technology that will allow the United States to take over the entire world. He said he had been planning this for his entire career but he had to do it in secrecy. That is why he had to stage his own death. He had to get away and get off the grid in order to get this work done.\n\nI explained to JFK that I really appreciate the offer but I can't visit. I would have to fly with the Secret Service as I am a previous President as well. That would not go over well and could possibly blow up his spot. You tell JFK to keep in touch and he tells you he will. You never hear from JFK again and nothing really changes in the world over the next 5 years. \n",
        "source": "user",
        "start_time": 35.0,
        "end_time": 569.0,
        "last_event_time": 569.0,
        "start_progress": 0.11972731146144014,
        "end_progress": 1.0
    }
]