[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api",
        "last_event_time": 616.0,
        "start_time": 0.0,
        "end_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.10872974385781495
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. ",
        "source": "user",
        "last_event_time": 616.0,
        "start_time": 9.0,
        "end_time": 70.0,
        "start_progress": 0.10872974385781495,
        "end_progress": 0.15211709357030842
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient.",
        "source": "api",
        "last_event_time": 616.0,
        "start_time": 81.0,
        "end_time": 81.0,
        "start_progress": 0.15211709357030842,
        "end_progress": 0.17929952953476216
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. ",
        "source": "user",
        "last_event_time": 616.0,
        "start_time": 83.0,
        "end_time": 107.0,
        "start_progress": 0.17929952953476216,
        "end_progress": 0.20334553058024046
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well.",
        "source": "api",
        "last_event_time": 616.0,
        "start_time": 118.0,
        "end_time": 118.0,
        "start_progress": 0.20334553058024046,
        "end_progress": 0.25509670674333507
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. ",
        "source": "user",
        "last_event_time": 616.0,
        "start_time": 123.0,
        "end_time": 160.0,
        "start_progress": 0.25509670674333507,
        "end_progress": 0.30371144798745425
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey.",
        "source": "api",
        "last_event_time": 616.0,
        "start_time": 180.0,
        "end_time": 180.0,
        "start_progress": 0.30371144798745425,
        "end_progress": 0.3303711447987454
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. ",
        "source": "user",
        "last_event_time": 616.0,
        "start_time": 182.0,
        "end_time": 196.0,
        "start_progress": 0.3303711447987454,
        "end_progress": 0.35598536330371144
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it.",
        "source": "api",
        "last_event_time": 616.0,
        "start_time": 208.0,
        "end_time": 208.0,
        "start_progress": 0.35598536330371144,
        "end_progress": 0.3910088865656038
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it. So I used my own money to pay for the medicine to save the man. ",
        "source": "user",
        "last_event_time": 616.0,
        "start_time": 210.0,
        "end_time": 226.0,
        "start_progress": 0.3910088865656038,
        "end_progress": 0.42498693152117095
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it. So I used my own money to pay for the medicine to save the man. I returned to the village and gave the medicine to the patient.",
        "source": "api",
        "last_event_time": 616.0,
        "start_time": 234.0,
        "end_time": 234.0,
        "start_progress": 0.42498693152117095,
        "end_progress": 0.45791949817041294
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it. So I used my own money to pay for the medicine to save the man. I returned to the village and gave the medicine to the patient. After one day the man started regaining his health. ",
        "source": "user",
        "last_event_time": 616.0,
        "start_time": 244.0,
        "end_time": 264.0,
        "start_progress": 0.45791949817041294,
        "end_progress": 0.4856246732880293
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it. So I used my own money to pay for the medicine to save the man. I returned to the village and gave the medicine to the patient. After one day the man started regaining his health. The patient was very thankful and promised to pay me back.",
        "source": "api",
        "last_event_time": 616.0,
        "start_time": 276.0,
        "end_time": 276.0,
        "start_progress": 0.4856246732880293,
        "end_progress": 0.5159435441714585
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it. So I used my own money to pay for the medicine to save the man. I returned to the village and gave the medicine to the patient. After one day the man started regaining his health. The patient was very thankful and promised to pay me back. I told him it was not necessary since I knew it would be very hard for him to pay me. ",
        "source": "user",
        "last_event_time": 616.0,
        "start_time": 278.0,
        "end_time": 301.0,
        "start_progress": 0.5159435441714585,
        "end_progress": 0.5614218504966022
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it. So I used my own money to pay for the medicine to save the man. I returned to the village and gave the medicine to the patient. After one day the man started regaining his health. The patient was very thankful and promised to pay me back. I told him it was not necessary since I knew it would be very hard for him to pay me. I left the village and continued on with my journey.",
        "source": "api",
        "last_event_time": 616.0,
        "start_time": 319.0,
        "end_time": 319.0,
        "start_progress": 0.5614218504966022,
        "end_progress": 0.5886042864610559
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it. So I used my own money to pay for the medicine to save the man. I returned to the village and gave the medicine to the patient. After one day the man started regaining his health. The patient was very thankful and promised to pay me back. I told him it was not necessary since I knew it would be very hard for him to pay me. I left the village and continued on with my journey. The next day ",
        "source": "user",
        "last_event_time": 616.0,
        "start_time": 323.0,
        "end_time": 332.0,
        "start_progress": 0.5886042864610559,
        "end_progress": 0.5959226346053319
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it. So I used my own money to pay for the medicine to save the man. I returned to the village and gave the medicine to the patient. After one day the man started regaining his health. The patient was very thankful and promised to pay me back. I told him it was not necessary since I knew it would be very hard for him to pay me. I left the village and continued on with my journey. The next day I was called to another village for work.",
        "source": "api",
        "last_event_time": 616.0,
        "start_time": 351.0,
        "end_time": 351.0,
        "start_progress": 0.5959226346053319,
        "end_progress": 0.6173549398849973
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it. So I used my own money to pay for the medicine to save the man. I returned to the village and gave the medicine to the patient. After one day the man started regaining his health. The patient was very thankful and promised to pay me back. I told him it was not necessary since I knew it would be very hard for him to pay me. I left the village and continued on with my journey. The next day I was called to another village for work. This time it was a sick woman who needed medicine. She had been sick for a whole week. ",
        "source": "user",
        "last_event_time": 616.0,
        "start_time": 352.0,
        "end_time": 378.0,
        "start_progress": 0.6173549398849973,
        "end_progress": 0.6633559853633038
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it. So I used my own money to pay for the medicine to save the man. I returned to the village and gave the medicine to the patient. After one day the man started regaining his health. The patient was very thankful and promised to pay me back. I told him it was not necessary since I knew it would be very hard for him to pay me. I left the village and continued on with my journey. The next day I was called to another village for work. This time it was a sick woman who needed medicine. She had been sick for a whole week. I was still thinking about the patient from the previous day.",
        "source": "api",
        "last_event_time": 616.0,
        "start_time": 388.0,
        "end_time": 388.0,
        "start_progress": 0.6633559853633038,
        "end_progress": 0.6952430737062206
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it. So I used my own money to pay for the medicine to save the man. I returned to the village and gave the medicine to the patient. After one day the man started regaining his health. The patient was very thankful and promised to pay me back. I told him it was not necessary since I knew it would be very hard for him to pay me. I left the village and continued on with my journey. The next day I was called to another village for work. This time it was a sick woman who needed medicine. She had been sick for a whole week. I was still thinking about the patient from the previous day. \"What if she also can't afford medicine?\", I wondered. ",
        "source": "user",
        "last_event_time": 616.0,
        "start_time": 395.0,
        "end_time": 423.0,
        "start_progress": 0.6952430737062206,
        "end_progress": 0.7245164662833247
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it. So I used my own money to pay for the medicine to save the man. I returned to the village and gave the medicine to the patient. After one day the man started regaining his health. The patient was very thankful and promised to pay me back. I told him it was not necessary since I knew it would be very hard for him to pay me. I left the village and continued on with my journey. The next day I was called to another village for work. This time it was a sick woman who needed medicine. She had been sick for a whole week. I was still thinking about the patient from the previous day. \"What if she also can't afford medicine?\", I wondered. But I decided to treat the woman anyway.",
        "source": "api",
        "last_event_time": 616.0,
        "start_time": 437.0,
        "end_time": 437.0,
        "start_progress": 0.7245164662833247,
        "end_progress": 0.7454260324098275
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it. So I used my own money to pay for the medicine to save the man. I returned to the village and gave the medicine to the patient. After one day the man started regaining his health. The patient was very thankful and promised to pay me back. I told him it was not necessary since I knew it would be very hard for him to pay me. I left the village and continued on with my journey. The next day I was called to another village for work. This time it was a sick woman who needed medicine. She had been sick for a whole week. I was still thinking about the patient from the previous day. \"What if she also can't afford medicine?\", I wondered. But I decided to treat the woman anyway. I treated her for a few days, and the woman started feeling better.",
        "source": "api",
        "last_event_time": 616.0,
        "start_time": 437.0,
        "end_time": 450.0,
        "start_progress": 0.7454260324098275,
        "end_progress": 0.7809722948248824
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it. So I used my own money to pay for the medicine to save the man. I returned to the village and gave the medicine to the patient. After one day the man started regaining his health. The patient was very thankful and promised to pay me back. I told him it was not necessary since I knew it would be very hard for him to pay me. I left the village and continued on with my journey. The next day I was called to another village for work. This time it was a sick woman who needed medicine. She had been sick for a whole week. I was still thinking about the patient from the previous day. \"What if she also can't afford medicine?\", I wondered. But I decided to treat the woman anyway. I treated her for a few days, and the woman started feeling better. She paid me for the medicine. As it turns out she was very wealthy and could afford the medicine. \"I heard what you did,\" she said, referring to paying for the other patient's medicine. And she slipped a diamond into his hand. ",
        "source": "user",
        "last_event_time": 616.0,
        "start_time": 452.0,
        "end_time": 549.0,
        "start_progress": 0.7809722948248824,
        "end_progress": 0.9001568217459488
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it. So I used my own money to pay for the medicine to save the man. I returned to the village and gave the medicine to the patient. After one day the man started regaining his health. The patient was very thankful and promised to pay me back. I told him it was not necessary since I knew it would be very hard for him to pay me. I left the village and continued on with my journey. The next day I was called to another village for work. This time it was a sick woman who needed medicine. She had been sick for a whole week. I was still thinking about the patient from the previous day. \"What if she also can't afford medicine?\", I wondered. But I decided to treat the woman anyway. I treated her for a few days, and the woman started feeling better. She paid me for the medicine. As it turns out she was very wealthy and could afford the medicine. \"I heard what you did,\" she said, referring to paying for the other patient's medicine. And she slipped a diamond into his hand. \"You can keep this as a reward.",
        "source": "api",
        "last_event_time": 616.0,
        "start_time": 558.0,
        "end_time": 558.0,
        "start_progress": 0.9001568217459488,
        "end_progress": 0.9163617354939885
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. \n\nOn the screen I see myself as a doctor who works in remote areas to save lives. One day I am called to a village to treat a patient. The patient is very sick and needs medicine. I have no medicine with me, but I try to make the patient comfortable and wait for him to get well. The next day I went to a different village to find the right medicine for the sick patient. I leave the patient behind and continue my journey. I found the medicine but it was very expensive. I was sad, thinking that the patient will not be able to afford it. So I used my own money to pay for the medicine to save the man. I returned to the village and gave the medicine to the patient. After one day the man started regaining his health. The patient was very thankful and promised to pay me back. I told him it was not necessary since I knew it would be very hard for him to pay me. I left the village and continued on with my journey. The next day I was called to another village for work. This time it was a sick woman who needed medicine. She had been sick for a whole week. I was still thinking about the patient from the previous day. \"What if she also can't afford medicine?\", I wondered. But I decided to treat the woman anyway. I treated her for a few days, and the woman started feeling better. She paid me for the medicine. As it turns out she was very wealthy and could afford the medicine. \"I heard what you did,\" she said, referring to paying for the other patient's medicine. And she slipped a diamond into his hand. \"You can keep this as a reward.\" And then she left. \n\nAs I watched this on the screen I was so amazed. I guess in another life I finally learned that kindness can pay off in unexpected ways. ",
        "source": "user",
        "last_event_time": 616.0,
        "start_time": 559.0,
        "end_time": 616.0,
        "start_progress": 0.9163617354939885,
        "end_progress": 1.0
    }
]