[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "You can see in detail the events that will occur in your next life, but you're unable to interact with the movie.",
        "source": "api"
    },
    {
        "text": "You wish you could take this knowledge into your next life, but you know you can't.",
        "source": "api"
    },
    {
        "text": "You don't even remember any of your other past lives besides the one you just lived.",
        "source": "user"
    },
    {
        "text": "You are shocked to learn that you have been both male and female in past lives, both rich and poor, and have died both young and old.",
        "source": "user"
    },
    {
        "text": "The most surprising life you lived was as royalty in a middle eastern country.",
        "source": "user"
    },
    {
        "text": "You were a princess who had her pick of men.",
        "source": "user"
    },
    {
        "text": "You married a man you didn't love, but who was a decent person and an excellent king.",
        "source": "user"
    },
    {
        "text": "It was enough for you to know that your husband would take good care of your people.",
        "source": "api"
    },
    {
        "text": "Eventually, you grew to love him because of his kindness and generosity.",
        "source": "user"
    },
    {
        "text": "You watched your movie life and learned that you would soon be reincarnated as a man in Japan.",
        "source": "user"
    },
    {
        "text": "You were excited about the possibilities, but you worried about your family you had just left behind.",
        "source": "api"
    },
    {
        "text": "Would you ever cross paths with them?",
        "source": "user"
    },
    {
        "text": "And if you did, would you feel a connection with them?",
        "source": "user"
    },
    {
        "text": "Your movie ended and you were forced to leave the theatre.",
        "source": "user"
    },
    {
        "text": "You knew that at any moment, your memories of what you just saw would be gone.",
        "source": "api"
    },
    {
        "text": "That was going to be a relief for a few reasons, but you desperately wished to hang on to the memories of the important things.",
        "source": "user"
    },
    {
        "text": "You didn't want to make the same mistakes again.",
        "source": "user"
    },
    {
        "text": "You went to a gorgeous lake to watch the sun meet the horizon.",
        "source": "user"
    },
    {
        "text": "You had a feeling that as soon as the sun was gone, you would be starting your new life.",
        "source": "user"
    },
    {
        "text": "The sun set, and as it did, you experienced a blinding light and great pressure all over your body.",
        "source": "user"
    },
    {
        "text": "You were being born!",
        "source": "user"
    },
    {
        "text": "Your new parents were so excited to meet you.",
        "source": "user"
    },
    {
        "text": "Since your life movie was so recent, you had some feelings of deja vu.",
        "source": "user"
    },
    {
        "text": "You couldn't quite place it, but this experience was familiar.",
        "source": "user"
    },
    {
        "text": "Your parents told you they would give you the best life a boy could ever have, and you believed them.",
        "source": "user"
    },
    {
        "text": "Seeing the love and promise in their eyes meant that your next life movie would have a happy ending.",
        "source": "user"
    }
]