[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "The magic of the old gods is returning.",
        "source": "api"
    },
    {
        "text": "In order to use it, however, the humans must humble themselves.",
        "source": "api"
    },
    {
        "text": "Mana only flows through those who understand the nature of life: humans, animals, plants, and elements all must work together to take care of Earth.",
        "source": "user"
    },
    {
        "text": "The humans visit the old libraries in Greece in order to learn more about Mana.",
        "source": "user"
    },
    {
        "text": "Along the way, they irrigate and replenish food supplies for the animals.",
        "source": "user"
    },
    {
        "text": "They are doing what they can to ensure that the species who survived the alien attack can continue living.",
        "source": "user"
    },
    {
        "text": "Their journey to Greece takes several weeks since they have to cross the Atlantic Ocean by boat.",
        "source": "user"
    },
    {
        "text": "They are heartbroken when they realize what their consumer lifestyle has done to the oceans.",
        "source": "user"
    },
    {
        "text": "They gather all of the garbage that they can so that fish and water fowl have better living environments.",
        "source": "user"
    },
    {
        "text": "Upon reaching Greece, they make their way to the ancient library.",
        "source": "user"
    },
    {
        "text": "It's near some monuments to the Gods, so they decide to study there.",
        "source": "user"
    },
    {
        "text": "They hoped that the Gods who could teach them how to use Mana would take pity on them and recognize all of the work they had done for the planet and for their own self-improvement.",
        "source": "user"
    },
    {
        "text": "They are surprised when the Gods do appear.",
        "source": "user"
    },
    {
        "text": "They are even more surprised when the Gods tell them that they have no intention of teaching them how to use Mana.",
        "source": "api"
    },
    {
        "text": "The humans have to learn how to use it on their own.",
        "source": "api"
    },
    {
        "text": "The Gods disappear, leaving the humans to their own devices.",
        "source": "api"
    },
    {
        "text": "In despair, the humans look to each other for support.",
        "source": "api"
    },
    {
        "text": "They realize that the past few months of self-improvement have not been enough to erase the past damage they have done.",
        "source": "user"
    },
    {
        "text": "They have to work harder to be worthy of Mana.",
        "source": "user"
    },
    {
        "text": "The humans decide that they have to learn to live in harmony with the planet.",
        "source": "api"
    },
    {
        "text": "They have to learn to live in harmony with the animals, plants, and elements.",
        "source": "api"
    },
    {
        "text": "They have to learn to live in harmony with each other.",
        "source": "api"
    },
    {
        "text": "If they can do this, then maybe, just maybe, the Gods will give them one more chance.",
        "source": "api"
    }
]