[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "People panic and look to the governments of the world for answers.",
        "source": "user"
    },
    {
        "text": "All the while, Matt Damon is forced to live in a strange world with an even stranger alien.",
        "source": "user"
    },
    {
        "text": "He is angry about all the deliberation going on in the world, and no action to save him.",
        "source": "user"
    },
    {
        "text": "When the alien's wife is kidnapped by humans, and a daring rescue is staged, Matt Damon becomes more than an unwilling prisoner.",
        "source": "user"
    },
    {
        "text": "He suddenly becomes a prisoner of war.",
        "source": "user"
    },
    {
        "text": "The aliens torture him relentlessly.",
        "source": "user"
    },
    {
        "text": "Having no concept of time, he loses track of how long he's been on this strange alien's planet.",
        "source": "user"
    },
    {
        "text": "He begins to look back over his life and realizes that he has played so many different characters, he never thought that he would live a real life scenario like this, in front of the whole world.",
        "source": "user"
    },
    {
        "text": "He gathers his composure and decides that he will act, and give his best performance, as a hero.",
        "source": "user"
    },
    {
        "text": "He will save the world from the alien that has taken him.",
        "source": "user"
    },
    {
        "text": "He requests an audience with the head alien and promises to divulge everything he knows about Earth's defenses at the meeting.",
        "source": "user"
    },
    {
        "text": "The aliens agree and take him to their leader.",
        "source": "user"
    },
    {
        "text": "Matt Damon is placed on the ground in front of the alien leader and a translator.",
        "source": "user"
    },
    {
        "text": "He begins by complimenting the alien leader on his command over his people.",
        "source": "user"
    },
    {
        "text": "He then launches into a scene he had prepared for the occasion.",
        "source": "user"
    },
    {
        "text": "He grabs the alien leader's antenna, which is apparently a symbol of his power, and throws it to the ground.",
        "source": "user"
    },
    {
        "text": "He screams, \"Freedom!\" so loudly that he startles the guards.",
        "source": "user"
    },
    {
        "text": "He then takes a step back and launches into a scene where his character, the hero, is yelling at the alien leader.",
        "source": "user"
    },
    {
        "text": "He tells the alien leader that the people of Earth will never surrender!",
        "source": "user"
    },
    {
        "text": "He proclaims that they will fight to the last man, woman and child!",
        "source": "user"
    },
    {
        "text": "The alien leader picks up his torn antennae and grabs Matt in one hand and lifts him over his head.",
        "source": "user"
    },
    {
        "text": "He stares into Matt's eyes and tells him that the aliens had taken him because he is an advocate for environmentalism.",
        "source": "user"
    },
    {
        "text": "He says that the people of Earth had no concept of how to interact with their world.",
        "source": "user"
    },
    {
        "text": "The purpose of taking Matt was to give him the knowledge to protect the natural environment of the planet.",
        "source": "user"
    },
    {
        "text": "The fight didn't start until Earthlings kidnapped his wife.",
        "source": "user"
    },
    {
        "text": "He tells Matt that if the Earthlings didn't move toward a more environmentally friendly society, all of their populations would be sacrificed to save their planet.",
        "source": "user"
    },
    {
        "text": "Matt listened carefully, feeling quite the fool.",
        "source": "user"
    },
    {
        "text": "He agreed to deliver the message and get the alien's wife back.",
        "source": "user"
    },
    {
        "text": "The aliens let him go and the leader's wife is returned.",
        "source": "user"
    },
    {
        "text": "Matt learns how to save the planet and delivers the message, but nobody listens.",
        "source": "user"
    },
    {
        "text": "He is shunned and ridiculed by the media for his \"brainwashing.\" The Earth burns down 20 years later.",
        "source": "user"
    }
]