[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "When the U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "user"
    },
    {
        "text": "had got into exile, it had been the leading superpower of the world, but now, coming out, it is a third-rate power, and the world is dominated by the Soviet Union and China.",
        "source": "user"
    },
    {
        "text": "The citizens of the U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "user"
    },
    {
        "text": "are shocked to learn that the U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "user"
    },
    {
        "text": "is no longer the most powerful nation in the world.",
        "source": "user"
    },
    {
        "text": "In fact, the U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "is now the laughingstock of the world.",
        "source": "api"
    },
    {
        "text": "The U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "government decides to launch a preemptive strike against the Soviet Union and China in order to reestablish the U.",
        "source": "api"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "as the dominant superpower.",
        "source": "api"
    },
    {
        "text": "The U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "launches an attack on the Soviet Union, but the Soviets are prepared for the attack, and the U.",
        "source": "api"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "is forced to retreat.",
        "source": "api"
    },
    {
        "text": "The U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "then launches a nuclear attack on China.",
        "source": "api"
    },
    {
        "text": "The Chinese retaliate by launching a nuclear attack on the U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "The U.",
        "source": "api"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "is devastated by the attack, and the U.",
        "source": "api"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "government is forced to relocate to the underground bunker in Mount Weather, Virginia.",
        "source": "user"
    },
    {
        "text": "The Soviets and the Chinese then launch a full-scale invasion of the U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "The Soviets and the Chinese are able to conquer the U.",
        "source": "api"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "with relative ease, and the U.",
        "source": "api"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "is divided into three parts: the Soviet Union takes the East Coast, China takes the West Coast, and the Rocky Mountains are left as a buffer zone.",
        "source": "api"
    },
    {
        "text": "It's a surprising turn of events for U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "user"
    },
    {
        "text": "citizens, who never once in their lives could have imagined that the U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "would be conquered by another nation, let alone by two!",
        "source": "api"
    },
    {
        "text": "One man named John Matherson is a resident of the town of Black Mountain, North Carolina.",
        "source": "user"
    },
    {
        "text": "He is a farmer and a widower, and he has two children: a son named Jacob and a daughter named Rachel.",
        "source": "user"
    },
    {
        "text": "John is a man who is willing to do anything to protect his family, and he is willing to fight for his country, even if it means going to war.",
        "source": "user"
    },
    {
        "text": "So John hatches a plan to fight back against the Soviets and the Chinese.",
        "source": "user"
    },
    {
        "text": "He knows he needs to do so covertly, because if he is caught, he will be executed.",
        "source": "user"
    },
    {
        "text": "John's plan is to form a resistance movement against the Soviets and the Chinese.",
        "source": "user"
    },
    {
        "text": "He is able to recruit a few people to join him, including his son Jacob, his daughter Rachel, and a man named Tom.",
        "source": "user"
    },
    {
        "text": "John's plan is to use his knowledge of the land to his advantage.",
        "source": "user"
    },
    {
        "text": "He knows that the Soviets and the Chinese have no knowledge of the land, and he knows that he can use that to his advantage.",
        "source": "user"
    },
    {
        "text": "He also knows that he needs to recruit more people to join his movement, and that he needs to do so quickly.",
        "source": "user"
    },
    {
        "text": "So John and his group of freedom fighters set out to recruit more people to join their cause.",
        "source": "user"
    },
    {
        "text": "John's plan works, and he is able to recruit more people to join his movement.",
        "source": "user"
    },
    {
        "text": "He is able to recruit a man named Stuart, who is a former member of the U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "military, and a man named Charlie, who is a former member of the U.",
        "source": "api"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "Air Force.",
        "source": "api"
    },
    {
        "text": "This is the perfect group of people since Stuart and Charlie have extensive vet experience.",
        "source": "user"
    },
    {
        "text": "Now that John has assembled his team, he is able to begin his plan of action.",
        "source": "user"
    },
    {
        "text": "John's plan is to attack the Chinese and the Soviets from the inside.",
        "source": "user"
    },
    {
        "text": "He and his team will go into the Rocky Mountains and set up a base of operations there.",
        "source": "user"
    },
    {
        "text": "From there, they will be able to launch attacks against the Soviets and the Chinese.",
        "source": "user"
    },
    {
        "text": "It's really the ideal setup, because the Soviets and the Chinese are completely unaware of the fact that there is a resistance movement against them.",
        "source": "user"
    },
    {
        "text": "When it's time to put the plan into action, John and his team begin to make their way to the Rocky Mountains.",
        "source": "user"
    },
    {
        "text": "John and his team are able to make it to the Rocky Mountains without being detected by the Soviets or the Chinese.",
        "source": "user"
    },
    {
        "text": "There, they set up a base of operations, and they begin to launch attacks against the Soviets and the Chinese.",
        "source": "user"
    },
    {
        "text": "They are able to do so with relative ease, and they are able to do so without being detected.",
        "source": "user"
    },
    {
        "text": "John and his team are able to launch a number of successful attacks against the Soviets and the Chinese.",
        "source": "user"
    },
    {
        "text": "They are able to destroy a number of Soviet and Chinese supply depots, and they are able to destroy a number of Chinese and Soviet supply trains.",
        "source": "user"
    },
    {
        "text": "The Chinese and Soviets are not able to figure out who is attacking them, and they are not able to figure out where the attacks are coming from.",
        "source": "user"
    },
    {
        "text": "So slowly, the Chinese and Soviets' power is eroding, all thanks to John and his team.",
        "source": "user"
    },
    {
        "text": "Soon, John and his team are able to launch an attack against the Soviets and the Chinese that will be their most daring yet.",
        "source": "user"
    },
    {
        "text": "They are able to destroy a Soviet and Chinese military base, and they are able to destroy a Soviet and Chinese military convoy.",
        "source": "user"
    },
    {
        "text": "The Soviets and the Chinese are now in a state of panic, and they are now in a state of confusion.",
        "source": "user"
    },
    {
        "text": "With these wins for John and his team, the Soviets and the Chinese are now in a state of fear.",
        "source": "user"
    },
    {
        "text": "The Soviets and Chinese pull out of the United States and the United States is able to use the state of panic to emerge again as a world superpower, all because of John and his team!",
        "source": "user"
    }
]