[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "As a result, China has become the most powerful nation on Earth.",
        "source": "user"
    },
    {
        "text": "The United States decides to reclaim its power.",
        "source": "user"
    },
    {
        "text": "In the process of doing so, they attempt to overthrow the government of China and replace it with a new one.",
        "source": "user"
    },
    {
        "text": "Their attempts to overthrow the Chinese government are futile.",
        "source": "user"
    },
    {
        "text": "In retaliation, China declares war on the United States.",
        "source": "user"
    },
    {
        "text": "The Chinese empire has grown too strong and too powerful.",
        "source": "user"
    },
    {
        "text": "The United States cannot compete.",
        "source": "user"
    },
    {
        "text": "The United States government, in an attempt to save the country, takes drastic measures.",
        "source": "user"
    },
    {
        "text": "The United States decides the most drastic yet logical thing to do is to surrender to the Chinese empire.",
        "source": "user"
    },
    {
        "text": "In exchange for the United States' surrender, China will not continue on to conquer the world.",
        "source": "user"
    },
    {
        "text": "However, the United States must adopt all Chinese culture and abandon American ways of life.",
        "source": "user"
    },
    {
        "text": "The United States agrees to the terms.",
        "source": "user"
    },
    {
        "text": "The United States becomes known as the New Atlantic China and develops a new currency that is entirely crypto.",
        "source": "user"
    },
    {
        "text": "The United States is put under Chinese rule.",
        "source": "user"
    },
    {
        "text": "All burger restaurants are replaced with noodle bars.",
        "source": "user"
    },
    {
        "text": "English is no longer taught in schools.",
        "source": "user"
    },
    {
        "text": "Everything that once said \"Made in China\" now says \"Produced in the Motherland.\" The United States is heavily censored by the Chinese government.",
        "source": "user"
    },
    {
        "text": "There is no national anthem anymore and no one plays sports.",
        "source": "user"
    },
    {
        "text": "Instead, the Chinese empire has sponsored a new futuristic sport.",
        "source": "user"
    },
    {
        "text": "It is a sport that consists of two teams battling it out with laser beams.",
        "source": "user"
    },
    {
        "text": "The sport turns out to be a huge hit among former Americans and many people take it on as a new hobby.",
        "source": "user"
    },
    {
        "text": "The Chinese empire is pleased with their new acquisition, and the citizens are quite pleased with the sports and food.",
        "source": "user"
    },
    {
        "text": "This leads to 300 years of peace on earth.",
        "source": "user"
    }
]