[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?",
        "source": "api"
    },
    {
        "text": "\" \n\nYou look around, and see a tiny bee, about the size of a thumb, with a tiny crown on its head.",
        "source": "api"
    },
    {
        "text": "You look around, and see that the other bees are all similarly tiny, and all have crowns.",
        "source": "api"
    },
    {
        "text": "You ask the bee what the purpose of their crowns are and the bee tells you that the crowd represents that they are royal bees and can make royal honey.",
        "source": "api"
    },
    {
        "text": "You ask the bees what the difference between regular honey and royal is.",
        "source": "user"
    },
    {
        "text": "The bee tells you that royal honey can be produced quicker and also adds strength to any animal or human that eats it.",
        "source": "user"
    },
    {
        "text": "You ask the bee if it would be possible to make a batch of royal honey and the bee tells you that it would be possible, but that it would cost you big time.",
        "source": "user"
    },
    {
        "text": "You ask how much it would cost and the bee tells you that it would cost a year of your life.",
        "source": "user"
    },
    {
        "text": "You tell the bee that is way too big of a price to pay and go your separate way.",
        "source": "api"
    },
    {
        "text": "Later that month you see a man walking down the street and he has giant muscles.",
        "source": "user"
    },
    {
        "text": "You stop him and ask him if he had any encounters with a bee wearing a crown.",
        "source": "user"
    },
    {
        "text": "The man tells you that he did and the bee gave him royal honey for free.",
        "source": "user"
    },
    {
        "text": "You are furious and go find the bee and ask him why that man was able to get royal honey for free.",
        "source": "user"
    },
    {
        "text": "The bee explains that because you are royalty you have to pay a greater price.",
        "source": "user"
    },
    {
        "text": "Your royal ancestors killed bees ages ago and haven't paid for their sins yet.",
        "source": "user"
    },
    {
        "text": "You tell the bee that that is unfair as you have nothing to do with that.",
        "source": "user"
    },
    {
        "text": "You offer the bee a compromise and the bee tells you that he will meet with the other royal bees and come up with an offering.",
        "source": "user"
    },
    {
        "text": "The royal bee meets with you again and gives you the terms of the deal.",
        "source": "user"
    },
    {
        "text": "The royal bee says that he will give you 1 pound of royal honey and in return you will give him and his bees an entire acre of land that they can inhabit.",
        "source": "user"
    },
    {
        "text": "You think it over and agree with the bee.",
        "source": "user"
    },
    {
        "text": "The deal is complete.",
        "source": "user"
    },
    {
        "text": "The bees have their land that they have total control over.",
        "source": "user"
    },
    {
        "text": "You have the royal honey that will give you super strength.",
        "source": "user"
    },
    {
        "text": "You get home and twist the jar top off and look at the honey.",
        "source": "user"
    },
    {
        "text": "Unlike regular honey, this honey is red.",
        "source": "user"
    },
    {
        "text": "You go take a spoon out of a drawer and take a big bite of the honey.",
        "source": "user"
    },
    {
        "text": "Unfortunately, the royal honey tastes so bad that you can't even swallow it.",
        "source": "user"
    },
    {
        "text": "You spit it out and realize that ultimately you got nothing out of this deal.",
        "source": "user"
    },
    {
        "text": "You were tricked by a little bee wearing a little crown on his head.",
        "source": "user"
    }
]