[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "Instead, they were wiped out.",
        "source": "api"
    },
    {
        "text": "On day one of what the US expected to be a joyous reunion with past allies, all they got was silence.",
        "source": "api"
    },
    {
        "text": "No one responded to their emails, their phone calls, messages that they tried to send.",
        "source": "user"
    },
    {
        "text": "The US president sent teams out to countries.",
        "source": "user"
    },
    {
        "text": "The envoy that went to Russia found buildings in rubble.",
        "source": "user"
    },
    {
        "text": "Animals had taken over the landscape.",
        "source": "user"
    },
    {
        "text": "Not one person was found.",
        "source": "user"
    },
    {
        "text": "The same was true in England.",
        "source": "user"
    },
    {
        "text": "In France.",
        "source": "user"
    },
    {
        "text": "In Australia they found kangaroos wandering cracked and ruined roads and kiwis nested in the few buildings that remained standing.",
        "source": "user"
    },
    {
        "text": "Everywhere they found the same thing.",
        "source": "user"
    },
    {
        "text": "The US president kept hoping that they’d find some kind of survivor.",
        "source": "user"
    },
    {
        "text": "Finally, in a cave in what had been Brazil, searchers found a small group of people.",
        "source": "api"
    },
    {
        "text": "There was a language barrier, but American's interviewing them determined that there had been a war between Russia and China.",
        "source": "user"
    },
    {
        "text": "Every country except the US had taken one side or the other, and in return all countries had been wiped out about 20 years earlier.",
        "source": "user"
    },
    {
        "text": "Since the US hadn't been involved, they were spared and had no idea what was going on.",
        "source": "user"
    },
    {
        "text": "The US president called an emergency meeting to try and figure out what they should do.",
        "source": "user"
    },
    {
        "text": "It was a shock to find that the US was alone in the world except for small pockets of survivors.",
        "source": "api"
    },
    {
        "text": "He decided that he would keep searching and bring survivors together if they wanted, or leave them be if not.",
        "source": "user"
    },
    {
        "text": "He also started sending teams out figure out what natural resources the US could benefit from in the abandoned countries.",
        "source": "user"
    },
    {
        "text": "They looked for technologies that might have been discovered as well.",
        "source": "user"
    },
    {
        "text": "As this occurred, more survivors were found, especially on islands that hadn't been obvious during the war.",
        "source": "user"
    },
    {
        "text": "Over the next few years, Americans had the opportunity to populate other countries.",
        "source": "user"
    },
    {
        "text": "This was good because during the period of isolation, the population had boomed.",
        "source": "user"
    },
    {
        "text": "American had been a country build on immigrants, and now they were having people immigrate from their shores for new opportunities.",
        "source": "user"
    },
    {
        "text": "People had the opportunity to live in areas that they had only read about - Caribbean islands, on the canals of Venice, in the snow covered peaks of the Alps.",
        "source": "user"
    },
    {
        "text": "While a terrible thing had happened, American spirit kept going.",
        "source": "user"
    }
]