[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 0.0,
        "end_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.07878611030055442
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. ",
        "source": "user",
        "last_event_time": 588.0,
        "start_time": 13.0,
        "end_time": 30.0,
        "start_progress": 0.07878611030055442,
        "end_progress": 0.11234315728042019
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 36.0,
        "end_time": 36.0,
        "start_progress": 0.11234315728042019,
        "end_progress": 0.1310183834257368
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 42.0,
        "end_time": 42.0,
        "start_progress": 0.1310183834257368,
        "end_progress": 0.15319521447330026
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 49.0,
        "end_time": 49.0,
        "start_progress": 0.15319521447330026,
        "end_progress": 0.16866063612489057
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 57.0,
        "end_time": 57.0,
        "start_progress": 0.16866063612489057,
        "end_progress": 0.18675226145316604
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 63.0,
        "end_time": 63.0,
        "start_progress": 0.18675226145316604,
        "end_progress": 0.19725707615990662
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 73.0,
        "end_time": 73.0,
        "start_progress": 0.19725707615990662,
        "end_progress": 0.23665013131018384
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" ",
        "source": "user",
        "last_event_time": 588.0,
        "start_time": 75.0,
        "end_time": 105.0,
        "start_progress": 0.23665013131018384,
        "end_progress": 0.26962357747300847
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 116.0,
        "end_time": 116.0,
        "start_progress": 0.26962357747300847,
        "end_progress": 0.28596440035016046
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 123.0,
        "end_time": 123.0,
        "start_progress": 0.28596440035016046,
        "end_progress": 0.29471841260577764
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 131.0,
        "end_time": 131.0,
        "start_progress": 0.29471841260577764,
        "end_progress": 0.3034724248613948
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? ",
        "source": "user",
        "last_event_time": 588.0,
        "start_time": 132.0,
        "end_time": 157.0,
        "start_progress": 0.3034724248613948,
        "end_progress": 0.34578348409687776
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 166.0,
        "end_time": 166.0,
        "start_progress": 0.34578348409687776,
        "end_progress": 0.36037350452290634
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 172.0,
        "end_time": 172.0,
        "start_progress": 0.36037350452290634,
        "end_progress": 0.3691275167785235
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 172.0,
        "end_time": 177.0,
        "start_progress": 0.3691275167785235,
        "end_progress": 0.37788152903414063
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\"",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 183.0,
        "end_time": 183.0,
        "start_progress": 0.37788152903414063,
        "end_progress": 0.38692734169827836
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. ",
        "source": "user",
        "last_event_time": 588.0,
        "start_time": 183.0,
        "end_time": 204.0,
        "start_progress": 0.38692734169827836,
        "end_progress": 0.3918879486431281
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 214.0,
        "end_time": 214.0,
        "start_progress": 0.3918879486431281,
        "end_progress": 0.4003501604902247
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" ",
        "source": "user",
        "last_event_time": 588.0,
        "start_time": 215.0,
        "end_time": 218.0,
        "start_progress": 0.4003501604902247,
        "end_progress": 0.4085205719288007
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 222.0,
        "end_time": 222.0,
        "start_progress": 0.4085205719288007,
        "end_progress": 0.42369419317187046
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 234.0,
        "end_time": 234.0,
        "start_progress": 0.42369419317187046,
        "end_progress": 0.4490808287131602
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 240.0,
        "end_time": 240.0,
        "start_progress": 0.4490808287131602,
        "end_progress": 0.4677560548584768
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 245.0,
        "end_time": 245.0,
        "start_progress": 0.4677560548584768,
        "end_progress": 0.48468047855267
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" ",
        "source": "user",
        "last_event_time": 588.0,
        "start_time": 245.0,
        "end_time": 271.0,
        "start_progress": 0.48468047855267,
        "end_progress": 0.50510650714911
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 277.0,
        "end_time": 277.0,
        "start_progress": 0.50510650714911,
        "end_progress": 0.5220309308433032
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. ",
        "source": "user",
        "last_event_time": 588.0,
        "start_time": 279.0,
        "end_time": 292.0,
        "start_progress": 0.5220309308433032,
        "end_progress": 0.5328275459585643
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 296.0,
        "end_time": 296.0,
        "start_progress": 0.5328275459585643,
        "end_progress": 0.5471257659760723
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" ",
        "source": "user",
        "last_event_time": 588.0,
        "start_time": 297.0,
        "end_time": 343.0,
        "start_progress": 0.5471257659760723,
        "end_progress": 0.5745550043770061
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. ",
        "source": "user",
        "last_event_time": 588.0,
        "start_time": 297.0,
        "end_time": 356.0,
        "start_progress": 0.5745550043770061,
        "end_progress": 0.5958564341990079
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" ",
        "source": "user",
        "last_event_time": 588.0,
        "start_time": 297.0,
        "end_time": 373.0,
        "start_progress": 0.5958564341990079,
        "end_progress": 0.6133644587102421
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 378.0,
        "end_time": 378.0,
        "start_progress": 0.6133644587102421,
        "end_progress": 0.6227020717829005
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" ",
        "source": "user",
        "last_event_time": 588.0,
        "start_time": 379.0,
        "end_time": 424.0,
        "start_progress": 0.6227020717829005,
        "end_progress": 0.671432740005836
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 429.0,
        "end_time": 429.0,
        "start_progress": 0.671432740005836,
        "end_progress": 0.6906915669681938
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment. You watch them go, and you're filled with a sense of power.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 438.0,
        "end_time": 438.0,
        "start_progress": 0.6906915669681938,
        "end_progress": 0.7081995914794281
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment. You watch them go, and you're filled with a sense of power. You've never had the ability to control anything before, but now you can control the bees.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 447.0,
        "end_time": 447.0,
        "start_progress": 0.7081995914794281,
        "end_progress": 0.7347534286548001
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment. You watch them go, and you're filled with a sense of power. You've never had the ability to control anything before, but now you can control the bees. You can control the bees!",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 447.0,
        "end_time": 455.0,
        "start_progress": 0.7347534286548001,
        "end_progress": 0.742340239276335
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment. You watch them go, and you're filled with a sense of power. You've never had the ability to control anything before, but now you can control the bees. You can control the bees! And now, you can also control Soeurette. ",
        "source": "user",
        "last_event_time": 588.0,
        "start_time": 457.0,
        "end_time": 463.0,
        "start_progress": 0.742340239276335,
        "end_progress": 0.754595856434199
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment. You watch them go, and you're filled with a sense of power. You've never had the ability to control anything before, but now you can control the bees. You can control the bees! And now, you can also control Soeurette. You can make her pay for all the times she's been rude to you.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 472.0,
        "end_time": 472.0,
        "start_progress": 0.754595856434199,
        "end_progress": 0.7726874817624745
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment. You watch them go, and you're filled with a sense of power. You've never had the ability to control anything before, but now you can control the bees. You can control the bees! And now, you can also control Soeurette. You can make her pay for all the times she's been rude to you. The bees get to Soeurette's apartment. ",
        "source": "user",
        "last_event_time": 588.0,
        "start_time": 483.0,
        "end_time": 489.0,
        "start_progress": 0.7726874817624745,
        "end_progress": 0.7843594981032973
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment. You watch them go, and you're filled with a sense of power. You've never had the ability to control anything before, but now you can control the bees. You can control the bees! And now, you can also control Soeurette. You can make her pay for all the times she's been rude to you. The bees get to Soeurette's apartment. They fly in through her window and start stinging her.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 493.0,
        "end_time": 493.0,
        "start_progress": 0.7843594981032973,
        "end_progress": 0.8001167201634082
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment. You watch them go, and you're filled with a sense of power. You've never had the ability to control anything before, but now you can control the bees. You can control the bees! And now, you can also control Soeurette. You can make her pay for all the times she's been rude to you. The bees get to Soeurette's apartment. They fly in through her window and start stinging her. She screams and tries to swat them away, but there are too many of them.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 499.0,
        "end_time": 499.0,
        "start_progress": 0.8001167201634082,
        "end_progress": 0.82141814998541
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment. You watch them go, and you're filled with a sense of power. You've never had the ability to control anything before, but now you can control the bees. You can control the bees! And now, you can also control Soeurette. You can make her pay for all the times she's been rude to you. The bees get to Soeurette's apartment. They fly in through her window and start stinging her. She screams and tries to swat them away, but there are too many of them. She runs around her apartment, trying to escape them, but they keep coming.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 503.0,
        "end_time": 503.0,
        "start_progress": 0.82141814998541,
        "end_progress": 0.8435949810329735
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment. You watch them go, and you're filled with a sense of power. You've never had the ability to control anything before, but now you can control the bees. You can control the bees! And now, you can also control Soeurette. You can make her pay for all the times she's been rude to you. The bees get to Soeurette's apartment. They fly in through her window and start stinging her. She screams and tries to swat them away, but there are too many of them. She runs around her apartment, trying to escape them, but they keep coming. She falls to the ground, and the bees continue to sting her.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 511.0,
        "end_time": 511.0,
        "start_progress": 0.8435949810329735,
        "end_progress": 0.8613948059527283
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment. You watch them go, and you're filled with a sense of power. You've never had the ability to control anything before, but now you can control the bees. You can control the bees! And now, you can also control Soeurette. You can make her pay for all the times she's been rude to you. The bees get to Soeurette's apartment. They fly in through her window and start stinging her. She screams and tries to swat them away, but there are too many of them. She runs around her apartment, trying to escape them, but they keep coming. She falls to the ground, and the bees continue to sting her. She looks up at you and says, \"Why are you doing this to me?",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 519.0,
        "end_time": 519.0,
        "start_progress": 0.8613948059527283,
        "end_progress": 0.8791946308724832
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment. You watch them go, and you're filled with a sense of power. You've never had the ability to control anything before, but now you can control the bees. You can control the bees! And now, you can also control Soeurette. You can make her pay for all the times she's been rude to you. The bees get to Soeurette's apartment. They fly in through her window and start stinging her. She screams and tries to swat them away, but there are too many of them. She runs around her apartment, trying to escape them, but they keep coming. She falls to the ground, and the bees continue to sting her. She looks up at you and says, \"Why are you doing this to me? I've never done anything to you!\"",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 523.0,
        "end_time": 523.0,
        "start_progress": 0.8791946308724832,
        "end_progress": 0.8891158447621826
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment. You watch them go, and you're filled with a sense of power. You've never had the ability to control anything before, but now you can control the bees. You can control the bees! And now, you can also control Soeurette. You can make her pay for all the times she's been rude to you. The bees get to Soeurette's apartment. They fly in through her window and start stinging her. She screams and tries to swat them away, but there are too many of them. She runs around her apartment, trying to escape them, but they keep coming. She falls to the ground, and the bees continue to sting her. She looks up at you and says, \"Why are you doing this to me? I've never done anything to you!\" You smile and say, \"You've been rude to me for years.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 529.0,
        "end_time": 529.0,
        "start_progress": 0.8891158447621826,
        "end_progress": 0.9048730668222935
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment. You watch them go, and you're filled with a sense of power. You've never had the ability to control anything before, but now you can control the bees. You can control the bees! And now, you can also control Soeurette. You can make her pay for all the times she's been rude to you. The bees get to Soeurette's apartment. They fly in through her window and start stinging her. She screams and tries to swat them away, but there are too many of them. She runs around her apartment, trying to escape them, but they keep coming. She falls to the ground, and the bees continue to sting her. She looks up at you and says, \"Why are you doing this to me? I've never done anything to you!\" You smile and say, \"You've been rude to me for years. I've never been able to get back at you, but now I can.",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 539.0,
        "end_time": 539.0,
        "start_progress": 0.9048730668222935,
        "end_progress": 0.9212138896994456
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment. You watch them go, and you're filled with a sense of power. You've never had the ability to control anything before, but now you can control the bees. You can control the bees! And now, you can also control Soeurette. You can make her pay for all the times she's been rude to you. The bees get to Soeurette's apartment. They fly in through her window and start stinging her. She screams and tries to swat them away, but there are too many of them. She runs around her apartment, trying to escape them, but they keep coming. She falls to the ground, and the bees continue to sting her. She looks up at you and says, \"Why are you doing this to me? I've never done anything to you!\" You smile and say, \"You've been rude to me for years. I've never been able to get back at you, but now I can. This is my revenge.\"",
        "source": "api",
        "last_event_time": 588.0,
        "start_time": 550.0,
        "end_time": 550.0,
        "start_progress": 0.9212138896994456,
        "end_progress": 0.9273416982783775
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees. You're afraid to move, afraid to breathe, afraid to do anything. The bee, sensing your fear, flies off your shoulder and lands on your hand. \"Your Majesty, what are your orders?\" it asks again. You look at the bee, then at your hand, then back at the bee. You realize that you have a choice. You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before. You look at the bee and say, \"I'm not a king. Why are you calling me Your Majesty and asking me for my orders?\" The bee looks at you and says, \"Because you are my king. You are the king of all bees. You are the king of the hive.\" You are surprised by what the bee is saying. After all, if you're so allergic to bees how could it be possible for you to be king of the hive? You look at the bee and say, \"I don't believe you. I'm not the king of the hive. I'm not the king of all bees. I'm not the king of anything.\" The bee smiles. \"I know you don't believe me. But here, I can show you.\" The bee flies off your hand and lands on the ground. It then starts to move around the ground, gathering up all the other bees in the area. It gathers up hundreds of bees, all of them buzzing around you. The bee then flies back up to you and lands on your hand. \"Look,\" the bee says. \"I've gathered up all your disciples for you.\" You look at the bees and say, \"I don't have any disciples.\" But they merely buzz at your side. You look at the bee and say, \"I don't understand.\" The bee says, \"We are your personal hive and we are at your service for whatever you need.\" Finally, you start to get an idea for how the bees can be useful to you. You say, \"You know what, I have the perfect order for you.\" The bees all buzz in excitement. I say, \"Go to a girl named Soeurette's apartment and cover her in stings. Soeurette has always been rude to me and I would like to use this opportunity for payback!\" The bees fly off your hand and head towards Soeurette's apartment. You watch them go, and you're filled with a sense of power. You've never had the ability to control anything before, but now you can control the bees. You can control the bees! And now, you can also control Soeurette. You can make her pay for all the times she's been rude to you. The bees get to Soeurette's apartment. They fly in through her window and start stinging her. She screams and tries to swat them away, but there are too many of them. She runs around her apartment, trying to escape them, but they keep coming. She falls to the ground, and the bees continue to sting her. She looks up at you and says, \"Why are you doing this to me? I've never done anything to you!\" You smile and say, \"You've been rude to me for years. I've never been able to get back at you, but now I can. This is my revenge.\" Soeurette is shocked to know that you are king of the bees and that they are all at your service at the drop of a hat. She apologizes profusely to you and says she will never be rude to you again. And from that moment on, she is always very polite.",
        "source": "user",
        "last_event_time": 588.0,
        "start_time": 553.0,
        "end_time": 588.0,
        "start_progress": 0.9273416982783775,
        "end_progress": 1.0
    }
]