[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?",
        "source": "api"
    },
    {
        "text": "\" Instantly, you're afraid because of all the warnings you've heard throughout your life about the dangers of bees.",
        "source": "api"
    },
    {
        "text": "You're afraid to move, afraid to breathe, afraid to do anything.",
        "source": "user"
    },
    {
        "text": "The bee, sensing your fear, flies off your shoulder and lands on your hand.",
        "source": "api"
    },
    {
        "text": "\"Your Majesty, what are your orders?",
        "source": "api"
    },
    {
        "text": "\" it asks again.",
        "source": "api"
    },
    {
        "text": "You look at the bee, then at your hand, then back at the bee.",
        "source": "api"
    },
    {
        "text": "You realize that you have a choice.",
        "source": "api"
    },
    {
        "text": "You can either believe the lies you've been told your entire life, or you can take a chance and do something you've never done before.",
        "source": "api"
    },
    {
        "text": "You look at the bee and say, \"I'm not a king.",
        "source": "api"
    },
    {
        "text": "Why are you calling me Your Majesty and asking me for my orders?",
        "source": "user"
    },
    {
        "text": "\" The bee looks at you and says, \"Because you are my king.",
        "source": "user"
    },
    {
        "text": "You are the king of all bees.",
        "source": "api"
    },
    {
        "text": "You are the king of the hive.",
        "source": "api"
    },
    {
        "text": "\" You are surprised by what the bee is saying.",
        "source": "api"
    },
    {
        "text": "After all, if you're so allergic to bees how could it be possible for you to be king of the hive?",
        "source": "user"
    },
    {
        "text": "You look at the bee and say, \"I don't believe you.",
        "source": "user"
    },
    {
        "text": "I'm not the king of the hive.",
        "source": "api"
    },
    {
        "text": "I'm not the king of all bees.",
        "source": "api"
    },
    {
        "text": "I'm not the king of anything.",
        "source": "api"
    },
    {
        "text": "\" The bee smiles.",
        "source": "api"
    },
    {
        "text": "\"I know you don't believe me.",
        "source": "api"
    },
    {
        "text": "But here, I can show you.",
        "source": "api"
    },
    {
        "text": "\" The bee flies off your hand and lands on the ground.",
        "source": "user"
    },
    {
        "text": "It then starts to move around the ground, gathering up all the other bees in the area.",
        "source": "api"
    },
    {
        "text": "It gathers up hundreds of bees, all of them buzzing around you.",
        "source": "api"
    },
    {
        "text": "The bee then flies back up to you and lands on your hand.",
        "source": "api"
    },
    {
        "text": "\"Look,\" the bee says.",
        "source": "api"
    },
    {
        "text": "\"I've gathered up all your disciples for you.",
        "source": "api"
    },
    {
        "text": "\" You look at the bees and say, \"I don't have any disciples.",
        "source": "user"
    },
    {
        "text": "\" But they merely buzz at your side.",
        "source": "api"
    },
    {
        "text": "You look at the bee and say, \"I don't understand.",
        "source": "user"
    },
    {
        "text": "\" The bee says, \"We are your personal hive and we are at your service for whatever you need.",
        "source": "api"
    },
    {
        "text": "\" Finally, you start to get an idea for how the bees can be useful to you.",
        "source": "user"
    },
    {
        "text": "You say, \"You know what, I have the perfect order for you.",
        "source": "user"
    },
    {
        "text": "\" The bees all buzz in excitement.",
        "source": "user"
    },
    {
        "text": "I say, \"Go to a girl named Soeurette's apartment and cover her in stings.",
        "source": "api"
    },
    {
        "text": "Soeurette has always been rude to me and I would like to use this opportunity for payback!",
        "source": "user"
    },
    {
        "text": "\" The bees fly off your hand and head towards Soeurette's apartment.",
        "source": "user"
    },
    {
        "text": "You watch them go, and you're filled with a sense of power.",
        "source": "api"
    },
    {
        "text": "You've never had the ability to control anything before, but now you can control the bees.",
        "source": "api"
    },
    {
        "text": "You can control the bees!",
        "source": "api"
    },
    {
        "text": "And now, you can also control Soeurette.",
        "source": "api"
    },
    {
        "text": "You can make her pay for all the times she's been rude to you.",
        "source": "user"
    },
    {
        "text": "The bees get to Soeurette's apartment.",
        "source": "api"
    },
    {
        "text": "They fly in through her window and start stinging her.",
        "source": "user"
    },
    {
        "text": "She screams and tries to swat them away, but there are too many of them.",
        "source": "api"
    },
    {
        "text": "She runs around her apartment, trying to escape them, but they keep coming.",
        "source": "api"
    },
    {
        "text": "She falls to the ground, and the bees continue to sting her.",
        "source": "api"
    },
    {
        "text": "She looks up at you and says, \"Why are you doing this to me?",
        "source": "api"
    },
    {
        "text": "I've never done anything to you!",
        "source": "api"
    },
    {
        "text": "\" You smile and say, \"You've been rude to me for years.",
        "source": "api"
    },
    {
        "text": "I've never been able to get back at you, but now I can.",
        "source": "api"
    },
    {
        "text": "This is my revenge.",
        "source": "api"
    },
    {
        "text": "\" Soeurette is shocked to know that you are king of the bees and that they are all at your service at the drop of a hat.",
        "source": "api"
    },
    {
        "text": "She apologizes profusely to you and says she will never be rude to you again.",
        "source": "user"
    },
    {
        "text": "And from that moment on, she is always very polite.",
        "source": "user"
    }
]