[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "This will surely be some sort of catastrophe and create a hierarchy of dads, some insisting that their ranking is wrong because their lawn is nicer than their neighbor's or that they can grill a better steak.",
        "source": "user"
    },
    {
        "text": "This is a disaster not on a global scale, but from neighborhood to neighborhood; the dads that rank higher will demand the respect their rank brings them.",
        "source": "user"
    },
    {
        "text": "This happened in my own neighborhood.",
        "source": "user"
    },
    {
        "text": "When the #1 Dad mug changed, my street was of two minds.",
        "source": "user"
    },
    {
        "text": "Most of the men that were in the top ten on my street, decided that they would be #1 and began strutting down the street like they owned the place.",
        "source": "api"
    },
    {
        "text": "They started making rules about the street and demanding that the houses with the lower ranking dads do their bidding.",
        "source": "user"
    },
    {
        "text": "It was total chaos and no one could agree on how to handle the new hierarchy of dads.",
        "source": "user"
    },
    {
        "text": "The numbers on the mugs seemed to change nearly every day, because there were literally hundreds of millions of dads ranked on these mugs so it didn't take long for my street to come up with their own ranking system.",
        "source": "user"
    },
    {
        "text": "If your mug fell within a range of numbers, you were given a shorter, cleaner number that went from 1-10.",
        "source": "user"
    },
    {
        "text": "There was only a few dads with a 1, and most were 5-7, and a few were 9 and 10.",
        "source": "user"
    },
    {
        "text": "It was sort of like a bell curve like you would see when grades are weighted.",
        "source": "user"
    },
    {
        "text": "This made the rankings easier to understand.",
        "source": "user"
    },
    {
        "text": "At least this was better than our previous ranking system, when we just made up a number to represent the ranking of a dad and the numbers changed wildly.",
        "source": "user"
    },
    {
        "text": "One day, my neighbor discovered some secrets on how to raise his dad rank.",
        "source": "user"
    },
    {
        "text": "My neighbor was a dad and he had always ranked around eight out of ten but he was going to gun for a ranking of 1 with his new tricks.",
        "source": "user"
    },
    {
        "text": "He didn't care much about the rankings, but he wanted to upset the current 1 ranked dad, Mario, since he was such a jerk.",
        "source": "user"
    },
    {
        "text": "Mario would make rules and order people around like they were his personal slaves and it was time that stopped.",
        "source": "user"
    },
    {
        "text": "My neighbor put together a plan that would raise his rank that involved grilling, mowing the lawn, playing catch with his kids, and doing the ultimate dad move that would boost his rank the most ; get along with his mother in law.",
        "source": "user"
    },
    {
        "text": "The plan was simple.",
        "source": "user"
    },
    {
        "text": "He was going to invite his mother in law over for a cookout, grill her a perfect steak, and round out the day playing a game of catch as a family.",
        "source": "user"
    },
    {
        "text": "Well, the day arrived and he did just that.",
        "source": "user"
    },
    {
        "text": "The plan went off without a hitch and he went to bed, excited to see his new rank.",
        "source": "user"
    },
    {
        "text": "He woke up the next day, ready to see how well this plan went off.",
        "source": "user"
    },
    {
        "text": "He walked into his kitchen, opened his cupboard, and retrieved his dad mug.",
        "source": "api"
    },
    {
        "text": "He turned it over and looked at the new number on his mug and consulted the neighborhood guide to translate the new number to align with the neighborhood ranking system.",
        "source": "user"
    },
    {
        "text": "He smiled.",
        "source": "user"
    },
    {
        "text": "His mug ranked number 1.",
        "source": "user"
    },
    {
        "text": "Mario's reign was about to end.",
        "source": "user"
    }
]