[
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.17391304347826086
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, I prefer reading a book than listening to an audiobook.\n",
        "source": "user",
        "start_time": 23.0,
        "end_time": 40.0,
        "last_event_time": 40.0,
        "start_progress": 0.17391304347826086,
        "end_progress": 0.2091997479521109
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, I prefer reading a book than listening to an audiobook. The main reason is that only by reading a book, can I understand how the story progresses and can I really get to know the character. A writer’s style might be very difficult to understand in an audiobook, but it becomes a lot easier to understand when reading. Also, I think that audiobooks are not worth the money: a book costs less than an audiobook. Also, books never run out of batteries.\n",
        "source": "api",
        "start_time": 65.0,
        "end_time": 135.0,
        "last_event_time": 135.0,
        "start_progress": 0.2091997479521109,
        "end_progress": 0.45746691871455575
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, I prefer reading a book than listening to an audiobook. The main reason is that only by reading a book, can I understand how the story progresses and can I really get to know the character. A writer’s style might be very difficult to understand in an audiobook, but it becomes a lot easier to understand when reading. Also, I think that audiobooks are not worth the money: a book costs less than an audiobook. In addition, books never run out of batteries. \n",
        "source": "user",
        "start_time": 149.0,
        "end_time": 160.0,
        "last_event_time": 160.0,
        "start_progress": 0.45746691871455575,
        "end_progress": 0.46250787649653435
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, I prefer reading a book than listening to an audiobook. The main reason is that only by reading a book, can I understand how the story progresses and can I really get to know the character. A writer’s style might be very difficult to understand in an audiobook, but it becomes a lot easier to understand when reading. Also, I think that audiobooks are not worth the money: a book costs less than an audiobook. In addition, books never run out of batteries. And lastly, if I am at the beach with my family, an audiobook will be useless.\n",
        "source": "api",
        "start_time": 176.0,
        "end_time": 176.0,
        "last_event_time": 176.0,
        "start_progress": 0.46250787649653435,
        "end_progress": 0.5116572148708255
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, I prefer reading a book than listening to an audiobook. The main reason is that only by reading a book, can I understand how the story progresses and can I really get to know the character. A writer’s style might be very difficult to understand in an audiobook, but it becomes a lot easier to understand when reading. Also, I think that audiobooks are not worth the money: a book costs less than an audiobook. In addition, books never run out of batteries.  Think of an example, if I am at the beach with my family, an audiobook will be useless.\n",
        "source": "user",
        "start_time": 178.0,
        "end_time": 206.0,
        "last_event_time": 206.0,
        "start_progress": 0.5116572148708255,
        "end_progress": 0.5179584120982986
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, I prefer reading a book than listening to an audiobook. The main reason is that only by reading a book, can I understand how the story progresses and can I really get to know the character. A writer’s style might be very difficult to understand in an audiobook, but it becomes a lot easier to understand when reading. Also, I think that audiobooks are not worth the money: a book costs less than an audiobook. In addition, books never run out of batteries.  Think of an example, if I am at the beach with my family, an audiobook will be useless. However, if I have a book, I can stay with my family and still enjoy a good book.\n",
        "source": "api",
        "start_time": 239.0,
        "end_time": 239.0,
        "last_event_time": 239.0,
        "start_progress": 0.5179584120982986,
        "end_progress": 0.569628229363579
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, I prefer reading a book than listening to an audiobook. The main reason is that only by reading a book, can I understand how the story progresses and can I really get to know the character. A writer’s style might be very difficult to understand in an audiobook, but it becomes a lot easier to understand when reading. Also, I think that audiobooks are not worth the money: a book costs less than an audiobook. In addition, books never run out of batteries.  Think of an example, if I am at the beach with my family, an audiobook will be useless. However, if I have a book, I can stay with my family and still enjoy a good book. And, finally, reading is a different experience than listening to an audiobook.\n",
        "source": "api",
        "start_time": 260.0,
        "end_time": 260.0,
        "last_event_time": 260.0,
        "start_progress": 0.569628229363579,
        "end_progress": 0.6200378071833649
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, I prefer reading a book than listening to an audiobook. The main reason is that only by reading a book, can I understand how the story progresses and can I really get to know the character. A writer’s style might be very difficult to understand in an audiobook, but it becomes a lot easier to understand when reading. Also, I think that audiobooks are not worth the money: a book costs less than an audiobook. In addition, books never run out of batteries.  Think of an example, if I am at the beach with my family, an audiobook will be useless. However, if I have a book, I can stay with my family and still enjoy a good book. And, finally, reading is a different experience than listening to an audiobook. A book changes my mood when I read it, whereas I barely feel a thing when listening to an audiobook.\n",
        "source": "api",
        "start_time": 300.0,
        "end_time": 300.0,
        "last_event_time": 300.0,
        "start_progress": 0.6200378071833649,
        "end_progress": 0.6836798991808444
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, I prefer reading a book than listening to an audiobook. The main reason is that only by reading a book, can I understand how the story progresses and can I really get to know the character. A writer’s style might be very difficult to understand in an audiobook, but it becomes a lot easier to understand when reading. Also, I think that audiobooks are not worth the money: a book costs less than an audiobook. In addition, books never run out of batteries.  Think of an example, if I am at the beach with my family, an audiobook will be useless. However, if I have a book, I can stay with my family and still enjoy a good book. And, finally, reading is a different experience than listening to an audiobook.  A book changes my mood when I read it, whereas I barely feel a thing when listening to an audiobook. My mood can hardly be connected to just a voice without reading words in a book. \n",
        "source": "user",
        "start_time": 306.0,
        "end_time": 354.0,
        "last_event_time": 354.0,
        "start_progress": 0.6836798991808444,
        "end_progress": 0.7359798361688721
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, I prefer reading a book than listening to an audiobook. The main reason is that only by reading a book, can I understand how the story progresses and can I really get to know the character. A writer’s style might be very difficult to understand in an audiobook, but it becomes a lot easier to understand when reading. Also, I think that audiobooks are not worth the money: a book costs less than an audiobook. In addition, books never run out of batteries.  Think of an example, if I am at the beach with my family, an audiobook will be useless. However, if I have a book, I can stay with my family and still enjoy a good book. And, finally, reading is a different experience than listening to an audiobook.  A book changes my mood when I read it, whereas I barely feel a thing when listening to an audiobook. My mood can hardly be connected to just a voice without reading words in a book. Listening to an audiobook is enjoyable in the car or during other activities where reading is impossible. Reading a book is fun because I can connect with the characters and the plot, which are very hard to achieve through listening.\n",
        "source": "api",
        "start_time": 372.0,
        "end_time": 418.0,
        "last_event_time": 418.0,
        "start_progress": 0.7359798361688721,
        "end_progress": 0.8827977315689981
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, I prefer reading a book than listening to an audiobook. The main reason is that only by reading a book, can I understand how the story progresses and can I really get to know the character. A writer’s style might be very difficult to understand in an audiobook, but it becomes a lot easier to understand when reading. Also, I think that audiobooks are not worth the money: a book costs less than an audiobook. In addition, books never run out of batteries.  Think of an example, if I am at the beach with my family, an audiobook will be useless. However, if I have a book, I can stay with my family and still enjoy a good book. And, finally, reading is a different experience than listening to an audiobook.  A book changes my mood when I read it, whereas I barely feel a thing when listening to an audiobook. My mood can hardly be connected to just a voice without reading words in a book. Reading a book is fun because I can connect with the characters and the plot, which are very hard to achieve through listening.  Listening to an audiobook is enjoyable in the car or during other activities where reading is impossible.\n",
        "source": "user",
        "start_time": 423.0,
        "end_time": 427.0,
        "last_event_time": 427.0,
        "start_progress": 0.8827977315689981,
        "end_progress": 0.8834278512917454
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, I prefer reading a book than listening to an audiobook. The main reason is that only by reading a book, can I understand how the story progresses and can I really get to know the character. A writer’s style might be very difficult to understand in an audiobook, but it becomes a lot easier to understand when reading. Also, I think that audiobooks are not worth the money: a book costs less than an audiobook. In addition, books never run out of batteries.  Think of an example, if I am at the beach with my family, an audiobook will be useless. However, if I have a book, I can stay with my family and still enjoy a good book. And, finally, reading is a different experience than listening to an audiobook.  A book changes my mood when I read it, whereas I barely feel a thing when listening to an audiobook. My mood can hardly be connected to just a voice without reading words in a book. Reading a book is fun because I can connect with the characters and the plot, which are very hard to achieve through listening.  Listening to an audiobook is enjoyable in the car or during other activities where reading is impossible. However, listening to an audiobook is boring because it feels like the voice belongs to someone who is reading aloud to me.\n",
        "source": "api",
        "start_time": 482.0,
        "end_time": 482.0,
        "last_event_time": 482.0,
        "start_progress": 0.8834278512917454,
        "end_progress": 0.9615626969124134
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, I prefer reading a book than listening to an audiobook. The main reason is that only by reading a book, can I understand how the story progresses and can I really get to know the character. A writer’s style might be very difficult to understand in an audiobook, but it becomes a lot easier to understand when reading. Also, I think that audiobooks are not worth the money: a book costs less than an audiobook. In addition, books never run out of batteries.  Think of an example, if I am at the beach with my family, an audiobook will be useless. However, if I have a book, I can stay with my family and still enjoy a good book. And, finally, reading is a different experience than listening to an audiobook.  A book changes my mood when I read it, whereas I barely feel a thing when listening to an audiobook. My mood can hardly be connected to just a voice without reading words in a book. Reading a book is fun because I can connect with the characters and the plot, which are very hard to achieve through listening.  However, listening to an audiobook is boring because it feels like the voice belongs to someone who is reading aloud to me. Listening to an audiobook is enjoyable in the car or during other activities where reading is impossible. \n",
        "source": "user",
        "start_time": 486.0,
        "end_time": 492.0,
        "last_event_time": 492.0,
        "start_progress": 0.9615626969124134,
        "end_progress": 0.9621928166351607
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, I prefer reading a book than listening to an audiobook. The main reason is that only by reading a book, can I understand how the story progresses and can I really get to know the character. A writer’s style might be very difficult to understand in an audiobook, but it becomes a lot easier to understand when reading. Also, I think that audiobooks are not worth the money: a book costs less than an audiobook. In addition, books never run out of batteries.  Think of an example, if I am at the beach with my family, an audiobook will be useless. However, if I have a book, I can stay with my family and still enjoy a good book. And, finally, reading is a different experience than listening to an audiobook.  A book changes my mood when I read it, whereas I barely feel a thing when listening to an audiobook. My mood can hardly be connected to just a voice without reading words in a book. Reading a book is fun because I can connect with the characters and the plot, which are very hard to achieve through listening.  However, listening to an audiobook is boring because it feels like the voice belongs to someone who is reading aloud to me. Listening to an audiobook is enjoyable in the car or during other activities where reading is impossible. Listening to an audiobook can also be beneficial because there is no need to strain one’s eyes.\n",
        "source": "api",
        "start_time": 526.0,
        "end_time": 526.0,
        "last_event_time": 526.0,
        "start_progress": 0.9621928166351607,
        "end_progress": 1.0220541902961562
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, I prefer reading a book than listening to an audiobook. The main reason is that only by reading a book, can I understand how the story progresses and can I really get to know the character. A writer’s style might be very difficult to understand in an audiobook, but it becomes a lot easier to understand when reading. Also, I think that audiobooks are not worth the money: a book costs less than an audiobook. In addition, books never run out of batteries.  Think of an example, if I am at the beach with my family, an audiobook will be useless. However, if I have a book, I can stay with my family and still enjoy a good book. And, finally, reading is a different experience than listening to an audiobook.  A book changes my mood when I read it, whereas I barely feel a thing when listening to an audiobook. My mood can hardly be connected to just a voice without reading words in a book. Reading a book is fun because I can connect with the characters and the plot, which are very hard to achieve through listening.  However, listening to an audiobook is boring because it feels like the voice belongs to someone who is reading aloud to me.  Listening to an audiobook can still be beneficial because there is no need to strain one’s eyes. To conclude, I prefer reading a book than listening to an audiobook.\n",
        "source": "user",
        "start_time": 534.0,
        "end_time": 590.0,
        "last_event_time": 590.0,
        "start_progress": 1.0220541902961562,
        "end_progress": 1.0
    }
]