[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "There's a general sense of anxiety.",
        "source": "user"
    },
    {
        "text": "There are waste bins around the world brimming with dad mugs with really high numbers and not a few zero mugs too!",
        "source": "user"
    },
    {
        "text": "Dads everywhere are trying to get a peek at other dads' mugs and figuring how they are measuring up.",
        "source": "user"
    },
    {
        "text": "Not a few dads have been seen in toy stores buying a lot of toys hoping that they can change their number.",
        "source": "user"
    },
    {
        "text": "A general sense of uncertainty and anxiety is pervading the globe as kids and their mothers are commenting on the old man's standing in the dad ranks.",
        "source": "user"
    },
    {
        "text": "Family counselors have seen a real uptick in business as have Disney Land, Disney World, etc.",
        "source": "user"
    },
    {
        "text": "Churches report an uptick in attendance from dads.",
        "source": "user"
    },
    {
        "text": "Dads everywhere are speaking to the good Lord about how things can be changed and how he can help them with their respective families.",
        "source": "user"
    },
    {
        "text": "Doctors are flooded with requests for anti-anxiety meds and tranquilizers.",
        "source": "user"
    },
    {
        "text": "Big business is getting in on this too.",
        "source": "user"
    },
    {
        "text": "Many have announced Dad Bring Your Kids to Work Day, others have changed policy around family leave for dads and not a few are touting changes favoring work-life balance.",
        "source": "user"
    },
    {
        "text": "Many businesses are paying men to stay at home with children under school age.",
        "source": "user"
    },
    {
        "text": "Magazines and newspaper are crowded with articles for dads to improve their standing and surveys so they can figure out where they've gone wrong.",
        "source": "user"
    },
    {
        "text": "Of course, this is just a work of fiction, but doesn't it make you think?",
        "source": "user"
    }
]