[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.",
        "source": "api"
    },
    {
        "text": "\" Not only did the wolf not threaten to huff and puff and blow the door down, but neither the wolf, nor anyone else, would go anywhere near the place.",
        "source": "api"
    },
    {
        "text": "This little pig became depressed.",
        "source": "user"
    },
    {
        "text": "He had no friends, because he was a pig who lived in a house made of depleted uranium.",
        "source": "user"
    },
    {
        "text": "What a lonely existence he faced.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig woke up every day to the same disappointing life.",
        "source": "user"
    },
    {
        "text": "He thought of ending it all, but he was passionate about the cause he had protested against so many times.",
        "source": "user"
    },
    {
        "text": "He would not do anything to support baconism.",
        "source": "user"
    },
    {
        "text": "The baconists would not have him for breakfast, not today and not ever.",
        "source": "user"
    },
    {
        "text": "Still, the 92nd little pig struggled to find the will to live.",
        "source": "user"
    },
    {
        "text": "His bacon lives matter work was meaningful, but did not fulfill his innermost needs.",
        "source": "user"
    },
    {
        "text": "He had never had a close friend, or even a visitor to his home.",
        "source": "user"
    },
    {
        "text": "He lived in shame, and had been unable to form strong relationships, with anyone.",
        "source": "user"
    },
    {
        "text": "He had never been in love.",
        "source": "user"
    },
    {
        "text": "He had never been in a relationship.",
        "source": "api"
    },
    {
        "text": "He had never even had a date.",
        "source": "api"
    },
    {
        "text": "His world was built of isolated despair, with a foundation in depleted uranium.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig wept at night, until he fell asleep.",
        "source": "user"
    },
    {
        "text": "He woke up to the horrible realization that he would have to live another day on this mound of cancerous toxicity.",
        "source": "user"
    },
    {
        "text": "He would have to face the world again.",
        "source": "user"
    },
    {
        "text": "He looked for reasons to leave the house each day.",
        "source": "api"
    },
    {
        "text": "He would go for a trough, at the local troughery, even when he wasn't hungry.",
        "source": "user"
    },
    {
        "text": "He would chat with the person serving his food, but he could never come to terms with his shoddy foundation and never allowed a true friendship to form.",
        "source": "user"
    },
    {
        "text": "He would go to the local pub, where he would drink to excess, and then vomit in the street.",
        "source": "user"
    },
    {
        "text": "This led to both physical and emotional ruin.",
        "source": "api"
    },
    {
        "text": "After several years of crippling addiction, the 92nd little pig died alone, on a park bench which was later revealed to be mildly radioactive and had to be removed.",
        "source": "user"
    },
    {
        "text": "Nobody remembers the 92nd little pig.",
        "source": "user"
    }
]