[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "This woman goes by Soeurette, and she is quite frankly quite ignorant, because she keeps failing to recognize all the warning signs in guys that caused her to break up with her past ten ex-husbands, who, as you might have surmised from the opening paragraph already, have actually all been the same person.",
        "source": "api"
    },
    {
        "text": "Soeurette is a bit of a ditz, and a bit of a flirt.",
        "source": "user"
    },
    {
        "text": "And moreover, she is a bit of a gold digger, and a bit of a social climber, and a bit of a snob.",
        "source": "api"
    },
    {
        "text": "She is not the nicest person in the world, and she is not the brightest bulb in the chandelier.",
        "source": "user"
    },
    {
        "text": "So when Matt first introduced himself to her in college, she was immediately hooked, because Matt was a basketball player on the varsity team and Soeurette knew that Matt was an econ major, which meant that he would be rich someday.",
        "source": "api"
    },
    {
        "text": "After all, she expected that he would go on to work at a prestigious bank in New York City, and this would mean that she would be able to live in a penthouse apartment, and drive a Mercedes-Benz, and wear designer clothes, and go on expensive vacations to St.",
        "source": "api"
    },
    {
        "text": "Tropez.",
        "source": "api"
    },
    {
        "text": "So, Soeurette was immediately attracted to Matt, and she fell head over heels in love with him.",
        "source": "user"
    },
    {
        "text": "But Soeurette ends up breaking off the relationship because Matt was cheating on her at the time.",
        "source": "api"
    },
    {
        "text": "A year later, Matt reenters her life and Soeurette is too dumb to realize that it's him, and she falls for him all over again.",
        "source": "user"
    },
    {
        "text": "Matt again wrongs Soeurette by getting another woman pregnant, and Soeurette breaks up with him again.",
        "source": "api"
    },
    {
        "text": "She cries, and she's sad, and she's heartbroken, and she's devastated, and she's angry, and she's hurt, and she's confused.",
        "source": "api"
    },
    {
        "text": "So when Matt comes back into her life again without her realizing his identity, she is relieved to find that she is capable of finding love again.",
        "source": "api"
    },
    {
        "text": "It's too bad though because Matt is still seeing other women on the side, and this time he's seeing Soeurette's younger sister, Virginia.",
        "source": "user"
    },
    {
        "text": "When Soeurette finds this out she again throws Matt out.",
        "source": "user"
    },
    {
        "text": "But Matt quickly finds his way back to her and tells her he's committed for life.",
        "source": "user"
    },
    {
        "text": "Soeurette believes him again and for whatever reason, this time Matt actually does hold true to his word.",
        "source": "user"
    },
    {
        "text": "So, Matt and Soeurette end up living the rest of their lives together, but it's a little uncomfortable because underneath their relationship is always the tension that Matt had habitually cheated on Soeurette for so much of their relationship, and that Soeurette had always been too idiotic to notice.",
        "source": "user"
    },
    {
        "text": "So, this story's moral is that people should always go into relationships with their eyes wide open.",
        "source": "user"
    }
]