[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "The \"Best Dad\" mug changes to \"Worst Dad\".",
        "source": "user"
    },
    {
        "text": "This is very weird and none of the fathers have any idea what is going on.",
        "source": "user"
    },
    {
        "text": "How is writing on a mug changing spontaneously.",
        "source": "user"
    },
    {
        "text": "Why is every dad being affected?",
        "source": "user"
    },
    {
        "text": "The dads are all very confused and upset.",
        "source": "api"
    },
    {
        "text": "It's insulting to have to look at a Worst Dad mug.",
        "source": "user"
    },
    {
        "text": "They all want to know what is going on.",
        "source": "user"
    },
    {
        "text": "They set up a meeting in town and nobody really knows what to say.",
        "source": "user"
    },
    {
        "text": "They don't have any information on what actually happened.",
        "source": "user"
    },
    {
        "text": "The dads are all very upset and angry.",
        "source": "user"
    },
    {
        "text": "They all go home and turn on the TV.",
        "source": "user"
    },
    {
        "text": "When the TV is turned on there is a message from an alien.",
        "source": "user"
    },
    {
        "text": "He explains that they were doing a science experiment on his home planet.",
        "source": "user"
    },
    {
        "text": "Just switching out one simple word caused all of the dads in town's personalities to change.",
        "source": "user"
    },
    {
        "text": "All over a stupid little mug that they could have thrown in the garbage.",
        "source": "user"
    },
    {
        "text": "The dads went from being the upbeat, happy and helpful men to being angry and furious all over the word worst.",
        "source": "user"
    },
    {
        "text": "The alien explains to them that they need to not let words have that kind of power.",
        "source": "user"
    },
    {
        "text": "The entire point of the science project was to teach the humans a lesson.",
        "source": "user"
    },
    {
        "text": "The lesson being that overreacting to something small can have bad consequences.",
        "source": "user"
    },
    {
        "text": "The alien tells the dads to think about their wives and children.",
        "source": "user"
    },
    {
        "text": "Did the dads even care about their feelings over this entire ordeal?",
        "source": "user"
    },
    {
        "text": "Of course not.",
        "source": "user"
    },
    {
        "text": "And those people should be the priority in a Dad's life.",
        "source": "user"
    },
    {
        "text": "Not a mug.",
        "source": "user"
    },
    {
        "text": "Think about that next time a stressful event happens.",
        "source": "user"
    },
    {
        "text": "Always prioritize what's actually important in life.",
        "source": "user"
    },
    {
        "text": "The alien had done his job and the experiment was a success.",
        "source": "user"
    },
    {
        "text": "The dad's had learned from him and were grateful.",
        "source": "user"
    }
]