[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
        "source": "api"
    },
    {
        "text": "One day, the woman is watching the film Groundhog Day when she suddenly realizes how familiar the situation seems.",
        "source": "api"
    },
    {
        "text": "A character in the film is being wooed by a man who lives the same day over and over, and slowly learns everything about her through all the repeated dates.",
        "source": "user"
    },
    {
        "text": "Meanwhile, the men that the woman has been dating in real life also seem to know a lot about her.",
        "source": "user"
    },
    {
        "text": "It's almost as if the men are living the same date over and over again with her, and trying to get it right.",
        "source": "user"
    },
    {
        "text": "But he tells herself that this movie scenario can't be the case in her life, because all the men are different.",
        "source": "user"
    },
    {
        "text": "They would have to be working together.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "or to somehow all be the same person.",
        "source": "user"
    },
    {
        "text": "She decides to try a little experiment.",
        "source": "user"
    },
    {
        "text": "She calls up one of the guys who has been wooing her, pretending to be a friend of his.",
        "source": "user"
    },
    {
        "text": "The man, sounding a little confused replies to her as if she really is a friend.",
        "source": "user"
    },
    {
        "text": "Her suspicions seem confirmed: the man seems unsure of who his own friends are, almost as if his life is a fabrication.",
        "source": "user"
    },
    {
        "text": "The woman calls up another man on a date, and has him meet her at the same coffee shop that one of the other men suggested; when he arrives she thanks him for suggesting the shop.",
        "source": "user"
    },
    {
        "text": "\"No problem, I knew you would like it\", the man says with a smile.",
        "source": "user"
    },
    {
        "text": "At this point she has put the puzzle together.",
        "source": "user"
    },
    {
        "text": "The men she has been dating are all the same man.",
        "source": "user"
    },
    {
        "text": "She then begins to test him, to see if he really is a shapeshifter.",
        "source": "user"
    },
    {
        "text": "\"You know what, I hate to do this but I actually called you here to break up\",  she tells him.",
        "source": "user"
    },
    {
        "text": "The man asks if she has met someone else.",
        "source": "user"
    },
    {
        "text": "\"No, I have actually been dating a lot of other men, but I am not interested in any of them. The truth is I'm shallow, and I want someone who looks like the man I've been dreaming of all my life. Seven feet tall, long beard, eyes that are red like fire.\" The man takes the news surprisingly well and leaves.",
        "source": "user"
    },
    {
        "text": "Two minutes later, a new man walks into the shop.",
        "source": "user"
    },
    {
        "text": "Seven feet tall, long beard.",
        "source": "user"
    },
    {
        "text": "He introduces himself to the woman.",
        "source": "user"
    },
    {
        "text": "She notices he has red eyes.",
        "source": "user"
    },
    {
        "text": "Now she knows the truth, the man is a shapeshifter.",
        "source": "user"
    },
    {
        "text": "Luckily, she wasn't lying about the type of man she preferred.",
        "source": "user"
    },
    {
        "text": "She now knows she can live a long and happy life with her seven foot tall dream man.",
        "source": "user"
    }
]