[
    "When you die, you appear in a cinema with a number of other people who look like you.",
    "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
    "You see yourself as a baby, being born, and then growing up.",
    "It's eerie.",
    "You look just the same but are dressed and act differently.",
    "You glance around at all the yous present in the theater.",
    "Again, you look the same basically but carry yourself and are dressed differently.",
    "Some of the yous you were bear scars.",
    "There are at least a couple in wheelchairs.",
    "One of you has a white cane.",
    "All these yous have experienced different lives.",
    "Look down there at the end is one of you breathing into a paper bag in the midst of a panic attack.",
    "You are all reincarnations of the same person, yet are different.",
    "Some of you are rail thin.",
    "Some of you are dressed opulently.",
    "Some of you have darker and lighter skin but you are all recognizably you.",
    "What a kick.",
    "You hope that there will be an opportunity to chat after the film.",
    "Where is this theater anyway, is it heaven or is it hell?",
    "You are all here, so it must be one of those.",
    "I wonder if these yous are good people or bad people?",
    "Do we all share a common core personality?",
    "Do we all have the same soul?",
    "How many years of life does this represent for \"me\"?",
    "How many more lives are left?",
    "Is this the last one?",
    "Did I have something I was supposed to do?",
    "Is it now done?",
    "Did I do it?",
    "Did I do it right?",
    "What if this is an endless process and next time one dies one ends up back here?",
    "The movie I am watching of the next life do I watch until that you is extinguished and joins all of us here to watch yet another life unfold.",
    "Will there never be enlightenment?",
    "Will my questions never be answered?",
    "Is there to be an intermission, yes, I believe so because the theater lights just blinked on.",
    "Maybe some answers will be forthcoming?",
    ""
]