[
    "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
    "For the third time this year, Matt Damon was missing.",
    "A few months back the last time this happened, the entire world basically stopped and searched for him.",
    "Come to find out he fell asleep on his yacht and floated out into the middle of the Pacific ocean for three months.",
    "So of course, when he disappeared this time, the entire world searched for him again.",
    "They checked the oceans and the coffee bars as well as small indigenous villages in South America where someone could go and just be out of the public eye for a while.",
    "After three months of searching, not a single lead was found.",
    "Then the big break came.",
    "NASA scientists discovered a tracking anomaly about the time that Damon went missing in the same area that he had last been seen.",
    "The anomaly was very interesting in that it appeared to be traveling at a speed that would take it all the way into outer space.",
    "After a few days of intense investigation from looking at radar images to doorbell cameras their worst fears were realized.",
    "Matt Damon had been kidnapped by aliens.",
    "\"So why would they kidnap Matt Damon?\" asked the president.",
    "That was the question everyone else was asking, too.",
    "So NASA set up a broadcast to beam into space to see if we could get an answer.",
    "The message that was basically 'Anyone with any information on the abduction of an Earthling with a slight Bostonian accent and charming sneer, please contact us' was sent out between all of our satellites as far as we could beam it.",
    "The response was almost immediate.",
    "'We have Matt Damon.",
    "We need to be entertained.",
    "You cannot have him back.\"\n\n\"We have to think of a plan,\" said the president, \"but why do they need to be entertained?\" Once again this question was on everyone's mind.",
    "All we wanted was Matt Damon back.",
    "Is there anyone else that could entertain these aliens?",
    "\"Maybe we could ask the aliens to make a list of their favorite Earth entertainers,\" said the president.",
    "We could rotate them out like they were on tour.",
    "It would also keep the aliens from getting bored by the same actor.",
    "Everyone agreed that this was a good idea and we started on our list of possible entertainers.",
    "There were several that actually volunteered.",
    "The list was narrowed down to twenty and sent to the aliens for their selections.",
    "They ended up trading Damon back to earth for a rotation of Bradley Cooper, Beyonce, and Celine Dion.",
    "The main thing was we had Matt Damon back.",
    "For now...",
    ""
]