[
    "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
    "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
    "The United States was understandably angry.",
    "They have been essentially shunned from the rest of the world, while people have been able to communicate with one another.",
    "The current United States President, Michael Wilson, has been the subject of great controversy.",
    "His decision to declare an all out war in all of the countries of the world was not met with overall support, but in his mind, it was the best decision.",
    "Military forces all around the country were moved into place, and would launch an attack on all other countries in the world.",
    "Nuclear weapons, conventional weapons, biological weapons, you name it.",
    "The United States have made them all ready and eager to use them upon the other countries.",
    "Meanwhile, protests on different States have erupted as well as riots, and the President has been forced to declare martial law.",
    "\"This is immoral!,\" says one of the posters of one of the protesters.",
    "Another one says, \"I will not let this happen!,\" and yet another says that \"This is not the America I know!\"\n\nBut President Wilson was not budging.",
    "He had his aides set up a tactical plan on who to strike first.",
    "They've attacked smaller countries first, such as Guatemala, Rwanda, and El Salvador.",
    "All populations of those small tiny island countries have been decimated within a few minutes as a result of the United States' attack.",
    "Next were mid-size countries like Poland, the United Kingdom, and Germany.",
    "Military troops of the United States have invaded these countries, and the majority of their populations have been wiped out within a day's time.",
    "The countries with larger landmarks were last and were the hardest to conquer, but with the United States' nuclear weapons, they had no problem whatsoever.",
    "China's superpower tanks were no match for the United States' technology, and their entire population was wiped out within a few days as well.",
    "The United States' longtime rival, Russia, was no match for the United States either, and their population suffered a similar fate to China's.",
    "The last remaining country, Canada, which was also a country that has always been friendly to the United States, was the final country to have been attacked by the United States.",
    "President Wilson had a visible frown on his face, and he turned to the camera and declared, \"Canada has been a close ally of ours for so long.",
    "But they were part of this conspiracy and they too would die.\"\n\nNo human being outside of the United States was safe from becoming a casualty.",
    "The United States have gotten outside of isolation and yet it faces another one again, but this time, because of it's own doing.",
    ""
]