[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "Instead, they were all fighting one another, with the exception of the Soviet Union (who had supposedly reformed), and Korea.",
        "source": "api"
    },
    {
        "text": "The United States, under the command of Colonel Bowers, decides to collect all the scientific minds in order to create a device that will turn back time.",
        "source": "api"
    },
    {
        "text": "Once this device is created, the Colonel and his troops will return to the past in order to prevent World War III from ever happening.",
        "source": "api"
    },
    {
        "text": "World War III would have severe consequences in so many different ways on the United States and all the other countries involved.",
        "source": "api"
    },
    {
        "text": "Obviously lives will be lost.",
        "source": "user"
    },
    {
        "text": "People will lose limbs.",
        "source": "user"
    },
    {
        "text": "PTSD will affect many.",
        "source": "user"
    },
    {
        "text": "But there will also be much more damage done.",
        "source": "user"
    },
    {
        "text": "Economies will crash.",
        "source": "api"
    },
    {
        "text": "Society will struggle.",
        "source": "user"
    },
    {
        "text": "Generations of people will be affected long-term and not in a positive way.",
        "source": "user"
    },
    {
        "text": "Without a doubt, this war will change many things for the worse.",
        "source": "user"
    },
    {
        "text": "And sure, some countries will be on the winning side of the war.",
        "source": "api"
    },
    {
        "text": "But at the end of the day they won't have anything meaningful to show for it.",
        "source": "user"
    },
    {
        "text": "Sacrifices will be made and all because of a war.",
        "source": "user"
    },
    {
        "text": "Luckily, Colonel Bowers has that device that will turn back time and prevent this War from ever happening.",
        "source": "user"
    },
    {
        "text": "And he is determined to make this happen no matter what.",
        "source": "user"
    },
    {
        "text": "He goes through the time machine and is able to meet with all of the countries that were supposed to be present in World War III.",
        "source": "api"
    },
    {
        "text": "He tells them that he is from the future and explains to them all of the negative things that will happen to each individual country.",
        "source": "user"
    },
    {
        "text": "The countries leaders look on and realize how negatively they will all be affected.",
        "source": "user"
    },
    {
        "text": "Luckily the leaders all agreed to never get involved in a war like that.",
        "source": "user"
    },
    {
        "text": "Colonel Bowers helped prevent World War III and was forever known as a hero.",
        "source": "user"
    }
]