[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "` For years the \"Lost Generations\" were upset about losing out on immortality.",
        "source": "api"
    },
    {
        "text": "Bu now, those who took the drug are not doing well.",
        "source": "user"
    },
    {
        "text": "They are losing their minds, their memories, and their ability to function.",
        "source": "user"
    },
    {
        "text": "Things have gone terribly wrong.",
        "source": "api"
    },
    {
        "text": "Something has to be done quickly because there are so many people afflicted they will become a burden on society.",
        "source": "user"
    },
    {
        "text": "The government decides to send you back in time to the year 2016 to stop the drug from being distributed.",
        "source": "user"
    },
    {
        "text": "You meet the drug distributor and tell him there will be no deal.",
        "source": "api"
    },
    {
        "text": "He offers you immense bribes and kickbacks and you realize the truth.",
        "source": "user"
    },
    {
        "text": "The government knew the drug was not safe the whole time.",
        "source": "user"
    },
    {
        "text": "The were bribed into distributing it.",
        "source": "user"
    },
    {
        "text": "You completed the mission of stopping the drug from being distributed but you also learned he truth.",
        "source": "user"
    },
    {
        "text": "If the government finds out you know the truth you will surely be a target.",
        "source": "user"
    },
    {
        "text": "You must forever keep this a secret.",
        "source": "user"
    },
    {
        "text": "You will be hunted by the government and the drug distributor.",
        "source": "user"
    },
    {
        "text": "You have really made some enemies.",
        "source": "api"
    },
    {
        "text": "You are now a target and must stay hidden.",
        "source": "user"
    },
    {
        "text": "You start a new life in a small town and you live in the most generic way you can so you draw little attention to yourself.",
        "source": "api"
    },
    {
        "text": "You have a job, a house, and a family.",
        "source": "user"
    },
    {
        "text": "You have learned that it is never a good idea to want to be immortal but instead to live for your family and pass on all of the things that are good about you to them.",
        "source": "api"
    },
    {
        "text": "That is the real way you can live on forever.",
        "source": "user"
    }
]