[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "Shapeshifters have lived among us for thousands a years.",
        "source": "api"
    },
    {
        "text": "For the most part, they have not caught the attention of humans.",
        "source": "user"
    },
    {
        "text": "Shapeshifters have the same lifespans as human beings.",
        "source": "user"
    },
    {
        "text": "Many will live their life as a regular human and rarely shapeshift into anyone else.",
        "source": "user"
    },
    {
        "text": "Typically, shapeshifters will fall in love with only one person in their lifetime.",
        "source": "user"
    },
    {
        "text": "If the object of their affection didn't reciprocate the shapeshifter's feelings, than the shapeshifter wouldn't fall in love again.",
        "source": "user"
    },
    {
        "text": "In the case of the shapeshifter Jon Tulane, Jon fell in love with Sandra.",
        "source": "user"
    },
    {
        "text": "Jon met Sandra through an online dating website.",
        "source": "user"
    },
    {
        "text": "Yes, there are shapeshifters on Tinder.",
        "source": "user"
    },
    {
        "text": "When Jon first met Sandra for a date, the date was friendly, but Sandra didn't seem to be romantically interested in Jon.",
        "source": "user"
    },
    {
        "text": "Jon, on the other hand, was smitten with Sandra.",
        "source": "user"
    },
    {
        "text": "He loved the way she talked, her intelligence, and her beauty.",
        "source": "user"
    },
    {
        "text": "When Jon and Sandra's date didn't work out, Jon thought the problem was his physically looks.",
        "source": "user"
    },
    {
        "text": "Jon decided to change his appearance to see if he could woo Sandra.",
        "source": "user"
    },
    {
        "text": "He shapeshifted into a new form, went by a new name, and found Sandra on Tinder again.",
        "source": "user"
    },
    {
        "text": "Like before, they went out for a date, but it still didn't work out.",
        "source": "user"
    },
    {
        "text": "Jon repeated this cycle a four more times with the results being the same.",
        "source": "user"
    },
    {
        "text": "Jon was convinced that Sandra didn't like him because of his looks.",
        "source": "user"
    },
    {
        "text": "Foolishly, Jon was focusing on the wrong thing.",
        "source": "api"
    },
    {
        "text": "He focused on his looks as opposed to his personality.",
        "source": "user"
    },
    {
        "text": "Eventually, Jon gave up trying to court Sandra.",
        "source": "user"
    },
    {
        "text": "He accepted the fact that he wouldn't find love again.",
        "source": "user"
    },
    {
        "text": "One day, Jon was walking down the street when he saw Sandra walking towards him while he was shapeshifted into a different form.",
        "source": "user"
    },
    {
        "text": "He walked by without saying anything to Sandra.",
        "source": "api"
    },
    {
        "text": "He knew that shipped had sailed.",
        "source": "user"
    }
]