[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "Spending your life growing old while your younger siblings, friends and family all stay the same age is unbelievably depressing.",
        "source": "api"
    },
    {
        "text": "It's a lonely, meaningless existence.",
        "source": "user"
    },
    {
        "text": "You're gawked at and stared, whispered over and laughed about.",
        "source": "api"
    },
    {
        "text": "But, as you get older you start to see something strange happening.",
        "source": "user"
    },
    {
        "text": "You are having regular health issues, despite making an effort to look after yourself.",
        "source": "api"
    },
    {
        "text": "You're thinning hair, your skin is sagging and wrinkles are beginning to appear.",
        "source": "user"
    },
    {
        "text": "And inside?",
        "source": "api"
    },
    {
        "text": "Your arteries are clogging and your joints are aching.",
        "source": "user"
    },
    {
        "text": "After a fall on the stairs you have a visit to your doctor.",
        "source": "user"
    },
    {
        "text": "As you sit in the waiting room you notice something strange is happening to the other patients.",
        "source": "user"
    },
    {
        "text": "They have simple problems, a papercut, a stubbed toe, a skinned knee.",
        "source": "api"
    },
    {
        "text": "But their pain is unmanageable.",
        "source": "user"
    },
    {
        "text": "They are passing out while sitting there, unable to handle the severity of the pain.",
        "source": "user"
    },
    {
        "text": "Your doctor tells you that it's something they've been seeing more and more, but that it's nothing to worry about.",
        "source": "user"
    },
    {
        "text": "To take care of yourself and you'll be fine.",
        "source": "api"
    },
    {
        "text": "But you aren't worried about yourself now.",
        "source": "user"
    },
    {
        "text": "As you drive home, you pass a park and what you see makes you slam on the brakes.",
        "source": "user"
    },
    {
        "text": "A young, healthy man is limping down the street with what appears to be a shattered leg.",
        "source": "user"
    },
    {
        "text": "You pull over and stare.",
        "source": "api"
    },
    {
        "text": "He's screaming in pain and his leg is dragging behind him.",
        "source": "api"
    },
    {
        "text": "As you start to exit the car to help, the man falls to the ground with a last scream and suddenly a thick black smoke emanates from his leg, rushing up his body, fire covering every inch of him until mere seconds later, he is a pile of dust.",
        "source": "user"
    },
    {
        "text": "\"They are supposed to be immortal,\" you think to yourself.",
        "source": "user"
    },
    {
        "text": "But you see them dying all around you.",
        "source": "user"
    },
    {
        "text": "That is when you realize that as you've aged, your body has had time to transition and reflect on it's pain.",
        "source": "api"
    },
    {
        "text": "The immortals.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "only the pure survive.",
        "source": "user"
    },
    {
        "text": "Only the undamaged.",
        "source": "user"
    },
    {
        "text": "This isn't immortality, this side effect is creating a new  natural selection.",
        "source": "user"
    },
    {
        "text": "And for the first time in your 85 years, you are glad you were not chosen.",
        "source": "user"
    }
]