[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?\"",
        "source": "api"
    },
    {
        "text": "You feel instant panic sneaking up on you, because you know that if you move, you'll be stung.",
        "source": "user"
    },
    {
        "text": "But this little bee promises that he's friendly.",
        "source": "user"
    },
    {
        "text": "He's just here to help.",
        "source": "user"
    },
    {
        "text": "You ask why he's asking for your orders and he says that he's your loyal servant.",
        "source": "user"
    },
    {
        "text": "Interesting, you think to yourself.",
        "source": "user"
    },
    {
        "text": "You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now.",
        "source": "user"
    },
    {
        "text": "You ask him to help you get rid of your allergies.",
        "source": "user"
    },
    {
        "text": "But all of a sudden, you feel a sharp pain in your shoulder.",
        "source": "user"
    },
    {
        "text": "You look down and see that the bee has stung you.",
        "source": "user"
    },
    {
        "text": "You feel your throat closing up and you start to panic.",
        "source": "user"
    },
    {
        "text": "You try to scream for help, but you can't.",
        "source": "user"
    },
    {
        "text": "You feel your body go limp and you fall to the ground.",
        "source": "user"
    },
    {
        "text": "You can't move.",
        "source": "user"
    },
    {
        "text": "You can't breathe.",
        "source": "user"
    },
    {
        "text": "You can't even think.",
        "source": "user"
    },
    {
        "text": "You feel your life slipping away, and you curse the bee for being so conniving.",
        "source": "user"
    },
    {
        "text": "You curse yourself for being so gullible.",
        "source": "user"
    },
    {
        "text": "You curse the world for being so cruel.",
        "source": "user"
    },
    {
        "text": "You curse the universe for being so unfair.",
        "source": "user"
    },
    {
        "text": "Suddenly, your mom is at your side.",
        "source": "user"
    },
    {
        "text": "She's crying.",
        "source": "user"
    },
    {
        "text": "You can't see her face, but you can hear her voice.",
        "source": "user"
    },
    {
        "text": "She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground.",
        "source": "user"
    },
    {
        "text": "You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you.",
        "source": "user"
    },
    {
        "text": "You feel your body being placed in the back of your mom's car.",
        "source": "user"
    },
    {
        "text": "You hear the door slam shut.",
        "source": "user"
    },
    {
        "text": "You hear your mom's car start up and drive away.",
        "source": "user"
    },
    {
        "text": "You feel yourself being rushed to the hospital.",
        "source": "user"
    },
    {
        "text": "You hear your brother in the backseat, crying.",
        "source": "user"
    },
    {
        "text": "You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body.",
        "source": "user"
    },
    {
        "text": "You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm.",
        "source": "user"
    },
    {
        "text": "You feel your body relax.",
        "source": "user"
    },
    {
        "text": "You feel your throat open up.",
        "source": "user"
    },
    {
        "text": "You feel your body start to breathe again.",
        "source": "user"
    },
    {
        "text": "It's a total miracle but you feel so much better now.",
        "source": "user"
    },
    {
        "text": "You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die.",
        "source": "user"
    },
    {
        "text": "Your mom tells the doctors that she will do everything in her power to protect you, and that she thought she had drilled it into your head not to go near bees.",
        "source": "user"
    },
    {
        "text": "But your mom feels guilty because she realizes she recently planted some flowers in the front yard that are full of bees.",
        "source": "user"
    },
    {
        "text": "She didn't really think anything of it since she knew that bees are good for pollination and good for the ecosystem.",
        "source": "user"
    },
    {
        "text": "But now, thinking back on the situation she realizes she should have been more careful.",
        "source": "user"
    },
    {
        "text": "She never should have planted those flowers.",
        "source": "user"
    },
    {
        "text": "It's really unfortunate that this happened to you and your mom realizes it could have been avoided.",
        "source": "user"
    },
    {
        "text": "She apologizes profusely to you but you tell her not to worry because you're fine now.",
        "source": "user"
    },
    {
        "text": "The doctors are confident that your prognosis is good and you really don't want to worry your mom.",
        "source": "user"
    },
    {
        "text": "Later that night, you're discharged to go home and your mom makes you promise that you will never go near a bee again.",
        "source": "user"
    },
    {
        "text": "The next day, she takes action to help you keep that promise by pulling out all the flowers that she had planted in the yard.",
        "source": "user"
    }
]