[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 0.0,
        "end_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.07135306553911205
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 6.0,
        "end_time": 21.0,
        "start_progress": 0.07135306553911205,
        "end_progress": 0.08562367864693446
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 25.0,
        "end_time": 25.0,
        "start_progress": 0.08562367864693446,
        "end_progress": 0.09698731501057083
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 26.0,
        "end_time": 34.0,
        "start_progress": 0.09698731501057083,
        "end_progress": 0.11020084566596194
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 39.0,
        "end_time": 39.0,
        "start_progress": 0.11020084566596194,
        "end_progress": 0.11627906976744186
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 40.0,
        "end_time": 45.0,
        "start_progress": 0.11627906976744186,
        "end_progress": 0.13028541226215645
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 54.0,
        "end_time": 54.0,
        "start_progress": 0.13028541226215645,
        "end_progress": 0.1379492600422833
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 55.0,
        "end_time": 72.0,
        "start_progress": 0.1379492600422833,
        "end_progress": 0.17468287526427062
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 80.0,
        "end_time": 80.0,
        "start_progress": 0.17468287526427062,
        "end_progress": 0.18789640591966172
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 82.0,
        "end_time": 87.0,
        "start_progress": 0.18789640591966172,
        "end_progress": 0.19371035940803383
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 91.0,
        "end_time": 91.0,
        "start_progress": 0.19371035940803383,
        "end_progress": 0.2040169133192389
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 95.0,
        "end_time": 95.0,
        "start_progress": 0.2040169133192389,
        "end_progress": 0.21723044397463
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 99.0,
        "end_time": 99.0,
        "start_progress": 0.21723044397463,
        "end_progress": 0.23202959830866807
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 103.0,
        "end_time": 103.0,
        "start_progress": 0.23202959830866807,
        "end_progress": 0.24339323467230445
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 107.0,
        "end_time": 107.0,
        "start_progress": 0.24339323467230445,
        "end_progress": 0.25792811839323465
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 110.0,
        "end_time": 110.0,
        "start_progress": 0.25792811839323465,
        "end_progress": 0.26215644820295986
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 117.0,
        "end_time": 117.0,
        "start_progress": 0.26215644820295986,
        "end_progress": 0.26717758985200846
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 122.0,
        "end_time": 122.0,
        "start_progress": 0.26717758985200846,
        "end_progress": 0.27299154334038056
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 126.0,
        "end_time": 127.0,
        "start_progress": 0.27299154334038056,
        "end_progress": 0.2817124735729387
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 127.0,
        "end_time": 132.0,
        "start_progress": 0.2817124735729387,
        "end_progress": 0.29439746300211417
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 136.0,
        "end_time": 136.0,
        "start_progress": 0.29439746300211417,
        "end_progress": 0.30523255813953487
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 140.0,
        "end_time": 140.0,
        "start_progress": 0.30523255813953487,
        "end_progress": 0.3158033826638478
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 145.0,
        "end_time": 145.0,
        "start_progress": 0.3158033826638478,
        "end_progress": 0.327431289640592
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 149.0,
        "end_time": 154.0,
        "start_progress": 0.327431289640592,
        "end_progress": 0.33747357293868924
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 158.0,
        "end_time": 158.0,
        "start_progress": 0.33747357293868924,
        "end_progress": 0.3409090909090909
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 163.0,
        "end_time": 163.0,
        "start_progress": 0.3409090909090909,
        "end_progress": 0.3546511627906977
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 167.0,
        "end_time": 167.0,
        "start_progress": 0.3546511627906977,
        "end_progress": 0.36390063424947144
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 170.0,
        "end_time": 182.0,
        "start_progress": 0.36390063424947144,
        "end_progress": 0.37658562367864695
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 186.0,
        "end_time": 186.0,
        "start_progress": 0.37658562367864695,
        "end_progress": 0.3890063424947146
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 187.0,
        "end_time": 213.0,
        "start_progress": 0.3890063424947146,
        "end_progress": 0.427061310782241
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 219.0,
        "end_time": 219.0,
        "start_progress": 0.427061310782241,
        "end_progress": 0.44344608879492603
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 224.0,
        "end_time": 224.0,
        "start_progress": 0.44344608879492603,
        "end_progress": 0.45110993657505283
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 228.0,
        "end_time": 228.0,
        "start_progress": 0.45110993657505283,
        "end_progress": 0.46405919661733613
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 235.0,
        "end_time": 235.0,
        "start_progress": 0.46405919661733613,
        "end_progress": 0.47674418604651164
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 239.0,
        "end_time": 239.0,
        "start_progress": 0.47674418604651164,
        "end_progress": 0.4891649048625793
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 245.0,
        "end_time": 245.0,
        "start_progress": 0.4891649048625793,
        "end_progress": 0.5092494714587738
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\"",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 252.0,
        "end_time": 252.0,
        "start_progress": 0.5092494714587738,
        "end_progress": 0.5132135306553911
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 253.0,
        "end_time": 255.0,
        "start_progress": 0.5132135306553911,
        "end_progress": 0.5158562367864693
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 262.0,
        "end_time": 262.0,
        "start_progress": 0.5158562367864693,
        "end_progress": 0.5340909090909091
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 264.0,
        "end_time": 265.0,
        "start_progress": 0.5340909090909091,
        "end_progress": 0.5356765327695561
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\"",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 269.0,
        "end_time": 269.0,
        "start_progress": 0.5356765327695561,
        "end_progress": 0.5438689217758985
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 270.0,
        "end_time": 275.0,
        "start_progress": 0.5438689217758985,
        "end_progress": 0.5531183932346723
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 279.0,
        "end_time": 279.0,
        "start_progress": 0.5531183932346723,
        "end_progress": 0.563953488372093
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 284.0,
        "end_time": 284.0,
        "start_progress": 0.563953488372093,
        "end_progress": 0.5790169133192389
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\"",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 291.0,
        "end_time": 291.0,
        "start_progress": 0.5790169133192389,
        "end_progress": 0.5874735729386892
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 292.0,
        "end_time": 297.0,
        "start_progress": 0.5874735729386892,
        "end_progress": 0.59223044397463
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 301.0,
        "end_time": 301.0,
        "start_progress": 0.59223044397463,
        "end_progress": 0.6094080338266384
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 305.0,
        "end_time": 305.0,
        "start_progress": 0.6094080338266384,
        "end_progress": 0.6162790697674418
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 313.0,
        "end_time": 313.0,
        "start_progress": 0.6162790697674418,
        "end_progress": 0.6242071881606766
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 318.0,
        "end_time": 318.0,
        "start_progress": 0.6242071881606766,
        "end_progress": 0.6355708245243129
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 320.0,
        "end_time": 326.0,
        "start_progress": 0.6355708245243129,
        "end_progress": 0.6501057082452432
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\"",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 331.0,
        "end_time": 331.0,
        "start_progress": 0.6501057082452432,
        "end_progress": 0.6590909090909091
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 331.0,
        "end_time": 338.0,
        "start_progress": 0.6590909090909091,
        "end_progress": 0.6701902748414377
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\"",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 342.0,
        "end_time": 342.0,
        "start_progress": 0.6701902748414377,
        "end_progress": 0.6778541226215645
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 345.0,
        "end_time": 365.0,
        "start_progress": 0.6778541226215645,
        "end_progress": 0.7085095137420718
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 370.0,
        "end_time": 370.0,
        "start_progress": 0.7085095137420718,
        "end_progress": 0.7182875264270613
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 370.0,
        "end_time": 376.0,
        "start_progress": 0.7182875264270613,
        "end_progress": 0.7280655391120507
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she will do everything in her power to protect you",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 380.0,
        "end_time": 381.0,
        "start_progress": 0.7280655391120507,
        "end_progress": 0.7402219873150105
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she will do everything in her power to protect you, and that she thought she had drilled it into your head not to go near bees. ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 381.0,
        "end_time": 389.0,
        "start_progress": 0.7402219873150105,
        "end_progress": 0.7608350951374208
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she will do everything in her power to protect you, and that she thought she had drilled it into your head not to go near bees. \n\nBut your mom feels guilty because ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 391.0,
        "end_time": 413.0,
        "start_progress": 0.7608350951374208,
        "end_progress": 0.7703488372093024
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she will do everything in her power to protect you, and that she thought she had drilled it into your head not to go near bees. \n\nBut your mom feels guilty because she realizes she recently ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 415.0,
        "end_time": 422.0,
        "start_progress": 0.7703488372093024,
        "end_progress": 0.7772198731501057
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she will do everything in her power to protect you, and that she thought she had drilled it into your head not to go near bees. \n\nBut your mom feels guilty because she realizes she recently planted ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 424.0,
        "end_time": 429.0,
        "start_progress": 0.7772198731501057,
        "end_progress": 0.7793340380549683
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she will do everything in her power to protect you, and that she thought she had drilled it into your head not to go near bees. \n\nBut your mom feels guilty because she realizes she recently planted some flowers in the front yard that are full of bees.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 432.0,
        "end_time": 432.0,
        "start_progress": 0.7793340380549683,
        "end_progress": 0.7933403805496829
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she will do everything in her power to protect you, and that she thought she had drilled it into your head not to go near bees. \n\nBut your mom feels guilty because she realizes she recently planted some flowers in the front yard that are full of bees. She didn't really think anything of it since she knew that bees are good for pollination and good for the ecosystem. But now, thinking back on the situation ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 449.0,
        "end_time": 465.0,
        "start_progress": 0.7933403805496829,
        "end_progress": 0.8350951374207188
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she will do everything in her power to protect you, and that she thought she had drilled it into your head not to go near bees. \n\nBut your mom feels guilty because she realizes she recently planted some flowers in the front yard that are full of bees. She didn't really think anything of it since she knew that bees are good for pollination and good for the ecosystem. But now, thinking back on the situation she realizes she should have been more careful.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 469.0,
        "end_time": 474.0,
        "start_progress": 0.8350951374207188,
        "end_progress": 0.8475158562367865
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she will do everything in her power to protect you, and that she thought she had drilled it into your head not to go near bees. \n\nBut your mom feels guilty because she realizes she recently planted some flowers in the front yard that are full of bees. She didn't really think anything of it since she knew that bees are good for pollination and good for the ecosystem. But now, thinking back on the situation she realizes she should have been more careful. She never should have planted those flowers. ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 475.0,
        "end_time": 479.0,
        "start_progress": 0.8475158562367865,
        "end_progress": 0.8596723044397463
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she will do everything in her power to protect you, and that she thought she had drilled it into your head not to go near bees. \n\nBut your mom feels guilty because she realizes she recently planted some flowers in the front yard that are full of bees. She didn't really think anything of it since she knew that bees are good for pollination and good for the ecosystem. But now, thinking back on the situation she realizes she should have been more careful. She never should have planted those flowers. It's really unfortunate that this happened to you and your mom realizes it could have been avoided. She apologizes profusely to you but you tell her not to worry because ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 481.0,
        "end_time": 504.0,
        "start_progress": 0.8596723044397463,
        "end_progress": 0.9045983086680761
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she will do everything in her power to protect you, and that she thought she had drilled it into your head not to go near bees. \n\nBut your mom feels guilty because she realizes she recently planted some flowers in the front yard that are full of bees. She didn't really think anything of it since she knew that bees are good for pollination and good for the ecosystem. But now, thinking back on the situation she realizes she should have been more careful. She never should have planted those flowers. It's really unfortunate that this happened to you and your mom realizes it could have been avoided. She apologizes profusely to you but you tell her not to worry because you're fine now.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 508.0,
        "end_time": 508.0,
        "start_progress": 0.9045983086680761,
        "end_progress": 0.9088266384778013
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she will do everything in her power to protect you, and that she thought she had drilled it into your head not to go near bees. \n\nBut your mom feels guilty because she realizes she recently planted some flowers in the front yard that are full of bees. She didn't really think anything of it since she knew that bees are good for pollination and good for the ecosystem. But now, thinking back on the situation she realizes she should have been more careful. She never should have planted those flowers. It's really unfortunate that this happened to you and your mom realizes it could have been avoided. She apologizes profusely to you but you tell her not to worry because you're fine now. The doctors are confident that your prognosis is good and you really don't want ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 509.0,
        "end_time": 527.0,
        "start_progress": 0.9088266384778013,
        "end_progress": 0.9302325581395349
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she will do everything in her power to protect you, and that she thought she had drilled it into your head not to go near bees. \n\nBut your mom feels guilty because she realizes she recently planted some flowers in the front yard that are full of bees. She didn't really think anything of it since she knew that bees are good for pollination and good for the ecosystem. But now, thinking back on the situation she realizes she should have been more careful. She never should have planted those flowers. It's really unfortunate that this happened to you and your mom realizes it could have been avoided. She apologizes profusely to you but you tell her not to worry because you're fine now. The doctors are confident that your prognosis is good and you really don't want to worry your mom.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 531.0,
        "end_time": 531.0,
        "start_progress": 0.9302325581395349,
        "end_progress": 0.9349894291754757
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she will do everything in her power to protect you, and that she thought she had drilled it into your head not to go near bees. \n\nBut your mom feels guilty because she realizes she recently planted some flowers in the front yard that are full of bees. She didn't really think anything of it since she knew that bees are good for pollination and good for the ecosystem. But now, thinking back on the situation she realizes she should have been more careful. She never should have planted those flowers. It's really unfortunate that this happened to you and your mom realizes it could have been avoided. She apologizes profusely to you but you tell her not to worry because you're fine now. The doctors are confident that your prognosis is good and you really don't want to worry your mom. Later that night, you're discharged to go home and your mom ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 534.0,
        "end_time": 541.0,
        "start_progress": 0.9349894291754757,
        "end_progress": 0.9511099365750528
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she will do everything in her power to protect you, and that she thought she had drilled it into your head not to go near bees. \n\nBut your mom feels guilty because she realizes she recently planted some flowers in the front yard that are full of bees. She didn't really think anything of it since she knew that bees are good for pollination and good for the ecosystem. But now, thinking back on the situation she realizes she should have been more careful. She never should have planted those flowers. It's really unfortunate that this happened to you and your mom realizes it could have been avoided. She apologizes profusely to you but you tell her not to worry because you're fine now. The doctors are confident that your prognosis is good and you really don't want to worry your mom. Later that night, you're discharged to go home and your mom makes you promise that you will never go near a bee again.",
        "source": "api",
        "last_event_time": 565.0,
        "start_time": 548.0,
        "end_time": 548.0,
        "start_progress": 0.9511099365750528,
        "end_progress": 0.9664376321353065
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nYou feel instant panic sneaking up on you, because you know that if you move, you'll be stung. But this little bee promises that he's friendly. He's just here to help. You ask why he's asking for your orders and he says that he's your loyal servant. Interesting, you think to yourself. You have never met a servant bee before, and it's odd that at age 34 you are finally meeting one now. You ask him to help you get rid of your allergies. But all of a sudden, you feel a sharp pain in your shoulder. You look down and see that the bee has stung you. You feel your throat closing up and you start to panic. You try to scream for help, but you can't. You feel your body go limp and you fall to the ground. You can't move. You can't breathe. You can't even think. You feel your life slipping away, and you curse the bee for being so conniving. You curse yourself for being so gullible. You curse the world for being so cruel. You curse the universe for being so unfair.\n\nSuddenly, your mom is at your side. She's crying. You can't see her face, but you can hear her voice. She's saying \"I'm so sorry, honey. You're going to be okay. Stay with me, honey.\" You feel your body being lifted off the ground. You then hear your little brother rush over and you know he's angrily swatting away into the air, trying to kill the bee that did this to you. You feel your body being placed in the back of your mom's car. You hear the door slam shut. You hear your mom's car start up and drive away. You feel yourself being rushed to the hospital. You hear your brother in the backseat, crying. You feel your mom's hand on your arm, and you hear her say \"Hang on, honey. Just hang on.\" Once you arrive at the hospital, you hear the doctor say \"We need to act fast. He's going into anaphylactic shock.\" Your mom starts crying harder and you feel the doctor's hands on your body. You hear the doctor say \"We need to give him an epi pen. He's going to die if we don't.\" The nurses swarm around you and you feel the doctor stick something into your arm. You feel your body relax. You feel your throat open up. You feel your body start to breathe again. It's a total miracle but you feel so much better now. You hear your mom say \"Thank God.\" The doctors ask for details and your mom says \"He was stung by a bee.\" The doctors nod and gravely tell your mom that she must protect you from bees at all costs moving forward, because if you are stung again, you will die. Your mom tells the doctors that she will do everything in her power to protect you, and that she thought she had drilled it into your head not to go near bees. \n\nBut your mom feels guilty because she realizes she recently planted some flowers in the front yard that are full of bees. She didn't really think anything of it since she knew that bees are good for pollination and good for the ecosystem. But now, thinking back on the situation she realizes she should have been more careful. She never should have planted those flowers. It's really unfortunate that this happened to you and your mom realizes it could have been avoided. She apologizes profusely to you but you tell her not to worry because you're fine now. The doctors are confident that your prognosis is good and you really don't want to worry your mom. Later that night, you're discharged to go home and your mom makes you promise that you will never go near a bee again. The next day, she takes action to help you keep that promise by pulling out all the flowers that she had planted in the yard. ",
        "source": "user",
        "last_event_time": 565.0,
        "start_time": 548.0,
        "end_time": 565.0,
        "start_progress": 0.9664376321353065,
        "end_progress": 1.0
    }
]