[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?\"",
        "source": "api"
    },
    {
        "text": "You look down and see a bee the size of a small cat.",
        "source": "user"
    },
    {
        "text": "You've never seen a bee of this size and start to run away.",
        "source": "user"
    },
    {
        "text": "The bee starts to chase you and continues to call you \"Your Majesty.\"",
        "source": "user"
    },
    {
        "text": "You ask the bee why he is following you.",
        "source": "user"
    },
    {
        "text": "The bee tells you that you're the King of the bees now.",
        "source": "user"
    },
    {
        "text": "You tell the bee that's impossible as you're actually allergic to bees.",
        "source": "user"
    },
    {
        "text": "The bee tells you that doesn't matter.",
        "source": "user"
    },
    {
        "text": "You are the King of the bees now and have to help them escape.",
        "source": "user"
    },
    {
        "text": "They're all stuck in a barn with no windows and no way to escape.",
        "source": "user"
    },
    {
        "text": "Plants and crops are dying and the air quality is worse than usual.",
        "source": "user"
    },
    {
        "text": "The bee points you towards the barn and you ask him what you have to do.",
        "source": "user"
    },
    {
        "text": "The bee tells you all you have to do is open the door.",
        "source": "user"
    },
    {
        "text": "You start to get a bit scared because what if the bees sting you?",
        "source": "user"
    },
    {
        "text": "There are so many bees in there that a bunch of stings could probably kill you.",
        "source": "user"
    },
    {
        "text": "You ask the bee that is the size of a cat how they will know you're not their to harm you.",
        "source": "user"
    },
    {
        "text": "He assures you that you're the King of the bees and they will know that.",
        "source": "user"
    },
    {
        "text": "You go up to the barn door and open the door.",
        "source": "user"
    },
    {
        "text": "The bees weren't strong enough to push it open and they don't have hands.",
        "source": "user"
    },
    {
        "text": "The door swings open and thousands of bees come flying out.",
        "source": "user"
    },
    {
        "text": "You start to panic and fear that you're going to be stung but to your joy, the bees fly right past you.",
        "source": "user"
    },
    {
        "text": "The cat sized bee runs up to you with tears in his eyes and thanks you.",
        "source": "user"
    },
    {
        "text": "You saved the bees from death and will forever be known as the King of the bees.",
        "source": "user"
    },
    {
        "text": "You never have to fear being stung again.",
        "source": "user"
    }
]