[
    "Humans once wielded formidable magical power.",
    "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
    "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
    "Quite frankly, it's a little unsettling!",
    "This is because Mana causes people to change into monsters.",
    "The story follows the adventures of a young man named Takuma who has been transformed into a monster.",
    "He has been given the ability to transform back into his human form for a short time, but only if he can consume enough Mana to do so.",
    "He is joined by a young woman named Elvy who has the same condition.",
    "It's unfortunate because becoming a monster is really the only defense that humans have against the hostile aliens.",
    "Yet at the same time, it's a curse because it makes them look like monsters to their fellow humans.",
    "Of course, no human wants to look like a monster.",
    "Monsters are ugly and scary, and they're not very popular.",
    "So Takuma and Elvy really have their work cut out for them.",
    "They need to find Mana, but they also need to find a way to hide their condition from the other humans.",
    "They don't want to be seen, because if other humans see monsters among them, it will cause a panic.",
    "So Takuma and Elvy must be very careful.",
    "They try to stay hidden, but they also need to find Mana.",
    "If they don't, they'll never be able to return to their human forms.",
    "Takuma and Elvy are joined by a young man named Shion who has also been transformed into a monster.",
    "He's a little older than Takuma, but he's also a bit of a troublemaker.",
    "Because of his troublemaker status, he's been kicked out of his home, and he's on the run.",
    "Shion is a little bit of a rebel, and he's not very good at following orders.",
    "This makes Takuma and Elvy very nervous.",
    "In order to survive, they need to stick together, but Shion doesn't seem to understand this.",
    "Shion repeatedly tries to leave the group, and he's always getting into trouble.",
    "Takuma finally has enough, and he decides to teach Shion a lesson.",
    "He tells Shion that he needs to be the one to get the Mana.",
    "Takuma says that if Shion can't do it, then he should just leave.",
    "Shion is shocked that Takuma would say such a thing, but Takuma tells him that he's just being honest.",
    "Shion decides to take Takuma up on his challenge.",
    "He 's going to get the Mana, and he's going to prove that he's not a loser.",
    "Takuma is impressed by Shion's determination, and he decides to help him.",
    "Takuma and Elvy will help Shion get the Mana.",
    "The three of them set out on a journey to find the Mana.",
    "They travel to a place called the \"Mana Zone\" where the Mana is supposed to be the most concentrated.",
    "They hope to find enough Mana to transform back into humans.",
    "But they also need to be careful because the Mana Zone is also home to the hostile aliens.",
    "The aliens are very dangerous, and they will attack anyone who enters the Mana Zone.",
    "So, in the quiet of the night, Takuma, Elvy, and Shion sneak into the Mana Zone.",
    "They hope to find the Mana before the aliens find them.",
    "Shion is the one who spots the Mana first.",
    "It's a small glowing ball of light, and it's floating in the air.",
    "Shion is so excited that he tries to grab it.",
    "But the Mana is very elusive, and it keeps flying away.",
    "Takuma and Elvy try to help Shion, but they can't seem to catch it either.",
    "It's as if the Mana is playing a game with them.",
    "The Mana is very fast, and it's very tricky.",
    "Takuma and Elvy are surprised by how much trouble they're having.",
    "Finally, they manage to corner the Mana.",
    "They grab onto it, and they pull it down to the ground.",
    "Shion quickly snatches it up, and he puts it in his pocket.",
    "Takuma and Elvy are relieved.",
    "The three monsters have finally captured the Mana.",
    "They split the Mana into three equal parts, and they each take one.",
    "One by one, they start to transform back into humans.",
    "They are relieved to see that the aliens that have been attacking them have all been killed off by their fellow monsters as well!",
    ""
]