[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.\" And the 92nd little pig (whose name was Clyde by the way) was like \"wut, dude?\"",
        "source": "api"
    },
    {
        "text": "The two stared at each other for a moment, both confused by the other's reaction.",
        "source": "user"
    },
    {
        "text": "The wolf finally said, \"It's too much. Like, literally, too much radiation. I gotta go.\"",
        "source": "api"
    },
    {
        "text": "Clyde laughed as the wolf started backing away.",
        "source": "user"
    },
    {
        "text": "\"Lol, dude, wait. What kind of idiot do you think I am? I mean, like, no one would ever build a house out of depleted uranium. Not without proper shielding and other mitigating measures. Did you seriously forget I have a Ph.D in physics with a focus of nuclear physics?\"",
        "source": "user"
    },
    {
        "text": "The wolf considered the 92nd pig for a moment.",
        "source": "user"
    },
    {
        "text": "\"You do have a point. I did forget. And you're right, only an idiot would live in a house built of depleted uranium. I guess I'm just a moron. And actually this is a really cool house.\"",
        "source": "api"
    },
    {
        "text": "Clyde smiled wide.",
        "source": "user"
    },
    {
        "text": "\"I thought you would like it. But now I don't know what to do, I built it so far away from Mom's and she is whining at me to move closer to home. I'm going to have to move.\"",
        "source": "user"
    },
    {
        "text": "The wolf nodded, \"Bummer dude. But can you afford 2 houses?\"",
        "source": "user"
    },
    {
        "text": "The 92nd little pig sighed and shock his head.",
        "source": "user"
    },
    {
        "text": "\"Nope and that it my problem. I literally can't afford anything because I spent all my money building this house and I'm broke.\"",
        "source": "user"
    },
    {
        "text": "All of a sudden the wolf looked excited.",
        "source": "user"
    },
    {
        "text": "\"Hey, I've been meaning to move out of that old cottage in the woods. Maybe I could buy this house from you?\"",
        "source": "user"
    },
    {
        "text": "Clyde tried not to look too eager.",
        "source": "user"
    },
    {
        "text": "\"Um, well, I dunno...But maybe...sure, we could do that.\"",
        "source": "api"
    },
    {
        "text": "A quick bit of dealing, a firm handshake, and a down payment later, and the house was now the wolf's.",
        "source": "user"
    },
    {
        "text": "He started making preparations to move in as the 92nd pig walked away, pretending to look sad.",
        "source": "user"
    },
    {
        "text": "He eventually was out of earshot, and began giggling.",
        "source": "user"
    },
    {
        "text": "\"Yeah, of course there is shielding. Won't last long though. That'll teach you to blow my brothers' houses down and try to eat them.\" And with that he went home to his mom to tell her the story.",
        "source": "user"
    }
]