[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "Since the war had begun as a transition of American political parties, into social movements.",
        "source": "user"
    },
    {
        "text": "Really stupid lines were drawn.",
        "source": "user"
    },
    {
        "text": "They kept saying that they were drawing lines in the sand, but there was no sand.",
        "source": "user"
    },
    {
        "text": "It made no sense.",
        "source": "user"
    },
    {
        "text": "When the rest of the world saw an opportunity to completely disconnect from the United States, they took it with gratitude.",
        "source": "user"
    },
    {
        "text": "Occasionally a tour group would get too close to the shores of America.",
        "source": "user"
    },
    {
        "text": "They always came back, but with only half their intelligence left in tact.",
        "source": "user"
    },
    {
        "text": "They would be filled with the most bizarre stories about how life in America had been.",
        "source": "user"
    },
    {
        "text": "Many people were starving in the US, but not due to a lack of food.",
        "source": "user"
    },
    {
        "text": "They had somehow convinced themselves that food was a conspiracy to control their minds and they simply stopped eating.",
        "source": "user"
    },
    {
        "text": "Meanwhile, the rest of the world was living in great harmony.",
        "source": "user"
    },
    {
        "text": "A renaissance of new ideas and cultural sharing had created a world filled with truly happy people.",
        "source": "user"
    },
    {
        "text": "The United States was in shambles.",
        "source": "api"
    },
    {
        "text": "They had enough money and resources to live for 1000 years in isolation, when they went into isolation.",
        "source": "user"
    },
    {
        "text": "By the time the 50 years of isolation elapsed, much of the country was on fire and people were robbing each other with military style weapons for things that they didn't really need.",
        "source": "user"
    },
    {
        "text": "The lack of competition with other nations had left the US with an identity problem.",
        "source": "user"
    },
    {
        "text": "They solved this by taking on a new identity, as the most violent people in recorded history.",
        "source": "user"
    },
    {
        "text": "The contrast with what the rest of the world had become had been so dramatic, that Americans barely resembled people anymore.",
        "source": "user"
    },
    {
        "text": "They were more like beasts.",
        "source": "api"
    },
    {
        "text": "The US government had snapped into action, as they began to recognize these threats to their security.",
        "source": "user"
    },
    {
        "text": "Over the 50 year period of isolation they had almost passed one bill, but the president was sick and didn't sign it and then it got lost.",
        "source": "user"
    },
    {
        "text": "Due to this lack of legislation and the subsequent lapse in security, all government records were gone.",
        "source": "user"
    },
    {
        "text": "The truth is, they never really wrote anything down.",
        "source": "user"
    },
    {
        "text": "Everyone stopped working at their jobs on the second day of isolation.",
        "source": "user"
    },
    {
        "text": "Mostly, they just hunted and robbed one another, every day, for 50 years.",
        "source": "user"
    },
    {
        "text": "In the end, the United States was destroyed by a new type of bomb.",
        "source": "api"
    },
    {
        "text": "It was for the best.",
        "source": "user"
    },
    {
        "text": "The end.",
        "source": "user"
    }
]