[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack.",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": "but pack your bags and call the number below.",
        "source": "api"
    },
    {
        "text": "It's time to start the real job.",
        "source": "api"
    },
    {
        "text": "\" Signed simply, \"JFK.",
        "source": "api"
    },
    {
        "text": "\" \nYou call the number and are greeted by a voice on the other end.",
        "source": "api"
    },
    {
        "text": "It is a recording.",
        "source": "api"
    },
    {
        "text": "It tells you that you are going to join the ranks of all of the past Presidents of the USA.",
        "source": "user"
    },
    {
        "text": "You are going to be a member of the Illuminati.",
        "source": "user"
    },
    {
        "text": "You are invited to a secret meeting half way across the world.",
        "source": "api"
    },
    {
        "text": "You arrive and you see all of the previous Presidents, even ones who were supposed to be dead.",
        "source": "user"
    },
    {
        "text": "You find out that the stories about the illuminati and the lizard people are real.",
        "source": "user"
    },
    {
        "text": "You happen to be the first human addition.",
        "source": "user"
    },
    {
        "text": "You find out that you all secretly control the world.",
        "source": "user"
    },
    {
        "text": "You are the puppet masters.",
        "source": "user"
    },
    {
        "text": "We discuss what needs to be done next.",
        "source": "api"
    },
    {
        "text": "We decide that the world needs to be reset.",
        "source": "user"
    },
    {
        "text": "We need to stage a collapse that would reset everything as we knew out.",
        "source": "api"
    },
    {
        "text": "The easiest way is to crash the economy.",
        "source": "user"
    },
    {
        "text": "We can invest money and profit off of it as the rest of the world crumbles.",
        "source": "user"
    },
    {
        "text": "We decide to do this.",
        "source": "user"
    },
    {
        "text": "Practically overnight it happens.",
        "source": "api"
    },
    {
        "text": "The stock market crashes and we come into a considerable amount of money.",
        "source": "user"
    },
    {
        "text": "Meanwhile the world crumbles as we had hoped.",
        "source": "user"
    },
    {
        "text": "This opens the door for us to send our people in to take over corporations.",
        "source": "user"
    },
    {
        "text": "We even buy the news so we can control it.",
        "source": "user"
    },
    {
        "text": "We decide to put our people in charge of the government next.",
        "source": "user"
    },
    {
        "text": "There is no part of the world that we don't control.",
        "source": "api"
    },
    {
        "text": "Now it's just time to start turning the citizens into lizards as well.",
        "source": "user"
    },
    {
        "text": "We decide to do this by releasing a virus that will make the people sick and eventually turn them into lizards.",
        "source": "user"
    },
    {
        "text": "Some people die during the process but the majority successfully change.",
        "source": "api"
    },
    {
        "text": "Now the planet is ours.",
        "source": "user"
    },
    {
        "text": "The next thing to do is to start taking over the rest of the universe.",
        "source": "user"
    },
    {
        "text": "That's what lizard people do after all.",
        "source": "user"
    }
]