[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "This is the story of the rebirth of magic in a world where it has long been forgotten.",
        "source": "user"
    },
    {
        "text": "The story is told through the eyes of the main character, a young man named Riku.",
        "source": "user"
    },
    {
        "text": "He is the son of a powerful mage, and has been trained in the art of magic from a young age.",
        "source": "user"
    },
    {
        "text": "He is the only one of his kind to have been born in a hundred years.",
        "source": "user"
    },
    {
        "text": "The story begins when Riku is a young boy, and follows him as he grows up and learns to control his magic.",
        "source": "user"
    },
    {
        "text": "He is sent to a school for mages, where he meets many other students his age.",
        "source": "user"
    },
    {
        "text": "Very similar to Harry Potter and Hogwarts.",
        "source": "user"
    },
    {
        "text": "Riku is a very quick learner and is the top of his class.",
        "source": "user"
    },
    {
        "text": "His ability to learn magic is uncanny.",
        "source": "user"
    },
    {
        "text": "He is able to learn spells that take others years to master in a matter of days.",
        "source": "user"
    },
    {
        "text": "He is also able to cast spells that no one else can.",
        "source": "user"
    },
    {
        "text": "He is a very powerful mage and has the potential to be the best mage of all time.",
        "source": "api"
    },
    {
        "text": "Riku is also very skilled in the art of hand to hand combat.",
        "source": "user"
    },
    {
        "text": "He is able to take on many enemies at once and defeat them with ease.",
        "source": "user"
    },
    {
        "text": "Nobody can touch him.",
        "source": "user"
    },
    {
        "text": "Except for one other student.",
        "source": "user"
    },
    {
        "text": "Koru is the only other student who is learning the art of magic at the speed Riku is.",
        "source": "user"
    },
    {
        "text": "However Koru is using magic to do harm.",
        "source": "user"
    },
    {
        "text": "He is a very evil person and is the complete opposite of Riku.",
        "source": "user"
    },
    {
        "text": "He is able to cast spells that Riku has never seen before.",
        "source": "user"
    },
    {
        "text": "The two go into battle.",
        "source": "user"
    },
    {
        "text": "Riku wants to save the world.",
        "source": "user"
    },
    {
        "text": "Koru wants to take over the world.",
        "source": "user"
    },
    {
        "text": "The story continues as Riku grows up and is forced to make decisions that will change the world forever.",
        "source": "user"
    },
    {
        "text": "Koru gives Riku an ultimatum.",
        "source": "user"
    },
    {
        "text": "Koru will go away forever but the only way to eliminate him is to eradicate 10 countries.",
        "source": "user"
    },
    {
        "text": "Riku doesn't want to cause any harm.",
        "source": "user"
    },
    {
        "text": "Koru won't budge on his ultimatum.",
        "source": "user"
    },
    {
        "text": "Riku comes up with a plan to trick Koru.",
        "source": "user"
    },
    {
        "text": "He casts a fake spell that is supposed to eliminate 10 countries in the world.",
        "source": "user"
    },
    {
        "text": "He then casts a spell that turns Koru into a plant before he can even realize that Riku didn't actually eliminate the 10 planets.",
        "source": "user"
    },
    {
        "text": "Koru lives the rest of his life as a plant.",
        "source": "user"
    },
    {
        "text": "Riku lives the rest of his life practicing magic and leaving a positive impact on everyone he comes into contact with.",
        "source": "user"
    },
    {
        "text": "Riku was able to defeat his arch rival and also save the world.",
        "source": "user"
    },
    {
        "text": "A beautiful first chapter to this series.",
        "source": "user"
    },
    {
        "text": "However in the next book a more powerful and more evil force will challenge Riku.",
        "source": "user"
    },
    {
        "text": "Will Riku be up to the challenge or will evil triumph over good?",
        "source": "user"
    },
    {
        "text": "For the sake of humanity lets hope good beats evil just like the cliche says.",
        "source": "user"
    }
]