[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "The Mana Knights have risen, a group of people with the ability to wield Mana, and the fight to reclaim the world.",
        "source": "api"
    },
    {
        "text": "They have a cathedral on the Pacific coast, where all four winds blow each day.",
        "source": "api"
    },
    {
        "text": "Mana is attracted here, as a nexus of their power.",
        "source": "user"
    },
    {
        "text": "The Mana Knights have a special relationship with the Mana Goddess.",
        "source": "user"
    },
    {
        "text": "They are the only ones who can hear her voice.",
        "source": "api"
    },
    {
        "text": "She is the one who gives them their power, and she is the one who decides who will be a Mana Knight.",
        "source": "api"
    },
    {
        "text": "Mana Knights are able to use Mana to cast spells, which are called \"Mana Arts\".",
        "source": "api"
    },
    {
        "text": "These spells are based on the four elements of Earth, Fire, Wind and Water.",
        "source": "api"
    },
    {
        "text": "Mana Knights are also able to use Mana to enhance their physical abilities, such as strength and speed.",
        "source": "api"
    },
    {
        "text": "Mana Knights can also use Mana to create magical weapons and armor.",
        "source": "api"
    },
    {
        "text": "These items are called \"Mana Tools\" and are the only weapons that can harm the aliens.",
        "source": "api"
    },
    {
        "text": "Mana Knights are also able to create magical barriers, which are called \"Mana Shields\".",
        "source": "api"
    },
    {
        "text": "Mana Knights are able to use Mana to heal themselves and others.",
        "source": "api"
    },
    {
        "text": "They are also able to use Mana to create portals to other dimensions, and to travel through time.",
        "source": "api"
    },
    {
        "text": "The Mana Knights are led by the Mana Knight Commander, who is the strongest Mana Knight.",
        "source": "api"
    },
    {
        "text": "The Mana Knights are also led by a council of elders, who are the strongest Mana Knights in each of the four elements.",
        "source": "api"
    },
    {
        "text": "There are preparations being made for war with the aliens.",
        "source": "api"
    },
    {
        "text": "The  knights are preparing to overthrow the alien slavers, and free the rest of the humans.",
        "source": "user"
    },
    {
        "text": "You have been hearing the whispers of the Mana Goddess since your 16th Birthday.",
        "source": "user"
    },
    {
        "text": "Today is your choosing ceremony, but you are still undecided.",
        "source": "user"
    },
    {
        "text": "Each of the elements has a special appeal to you, but they all have benefits.",
        "source": "user"
    },
    {
        "text": "Earth is the element of strength and power.",
        "source": "user"
    },
    {
        "text": "Water is fluid and agile.",
        "source": "api"
    },
    {
        "text": "Wind is high and mighty.",
        "source": "api"
    },
    {
        "text": "Fire is quick and energetic.",
        "source": "user"
    },
    {
        "text": "You can see yourself in each element.",
        "source": "user"
    },
    {
        "text": "You must dedicate one element as your specialty.",
        "source": "user"
    },
    {
        "text": "How will you ever choose one?",
        "source": "user"
    }
]