[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "You're sitting in your breakfast nook at 6 o'clock in the morning one day when it happens.",
        "source": "user"
    },
    {
        "text": "All you're doing is reading the paper and drinking coffee, and suddenly your mug changes to show that you're actually the #1 Dad.",
        "source": "user"
    },
    {
        "text": "You feel pride well up inside you, but then you feel a sense of shock.",
        "source": "user"
    },
    {
        "text": "That's because you inherited this mug from your own dad, who didn't feel like bringing it with him when he packed up and moved to another state with his new girlfriend.",
        "source": "user"
    },
    {
        "text": "You don't have a #1 Dad mug of your own because you are not a dad.",
        "source": "user"
    },
    {
        "text": "You are a single man in his mid-30s who lives alone in the same house he grew up in.",
        "source": "user"
    },
    {
        "text": "You don't even have a dog.",
        "source": "user"
    },
    {
        "text": "You have a cat, but you're not sure if it counts.",
        "source": "user"
    },
    {
        "text": "You're not sure how to feel about this.",
        "source": "user"
    },
    {
        "text": "How could you be a father?",
        "source": "user"
    },
    {
        "text": "You start racking your brain.",
        "source": "user"
    },
    {
        "text": "Did you have a kid when you were in college and forget about it?",
        "source": "user"
    },
    {
        "text": "Did you have a kid with a girl you dated for a couple of months in high school?",
        "source": "user"
    },
    {
        "text": "What was her name again?",
        "source": "user"
    },
    {
        "text": "You think harder.",
        "source": "user"
    },
    {
        "text": "You remember her name was Soeurette Morley.",
        "source": "user"
    },
    {
        "text": "That's right.",
        "source": "user"
    },
    {
        "text": "The two of you had spent one steamy night together, where you both got so drunk you couldn't remember anything.",
        "source": "user"
    },
    {
        "text": "You were both virgins, and you were both so nervous that you didn't even know what to do.",
        "source": "user"
    },
    {
        "text": "You had a condom, but you were both so nervous that you didn't even use it.",
        "source": "user"
    },
    {
        "text": "You both woke up the next morning and were horrified to discover that you had done it.",
        "source": "user"
    },
    {
        "text": "But you were both so drunk that you couldn't remember anything, and regardless, she promised that she was on the pill.",
        "source": "user"
    },
    {
        "text": "Well, now you're stunned.",
        "source": "user"
    },
    {
        "text": "If you're the #1 Dad in the world, then you must have gotten Soeurette pregnant.",
        "source": "user"
    },
    {
        "text": "You decide to give her a call.",
        "source": "user"
    },
    {
        "text": "She answers the phone, and you say, \"Soeurette, I have to ask you something. Did we have a baby together?\" Soeurette laughs and asks you what you're talking about.",
        "source": "user"
    },
    {
        "text": "You tell her you're the #1 Dad in the world, according to the mug in your hand, and you're pretty sure that you had a baby with her, because you can't think of any other explanation.",
        "source": "user"
    },
    {
        "text": "After all, you haven't slept with anyone else since then, and you haven't been a father before.",
        "source": "user"
    },
    {
        "text": "Soeurette suddenly grows quiet.",
        "source": "user"
    },
    {
        "text": "She admits that she has a seven-year old daughter , and that she's been keeping her a secret from you.",
        "source": "user"
    },
    {
        "text": "She says she knew that you had plans for college and that she didn't want her pregnancy to keep you from achieving your goals.",
        "source": "user"
    },
    {
        "text": "You are stunned and ask her how you can meet your daughter.",
        "source": "user"
    },
    {
        "text": "Soeurette says that you can come over to meet her now.",
        "source": "user"
    },
    {
        "text": "You ask for her name and Soeurette says she named your daughter Harper.",
        "source": "user"
    },
    {
        "text": "You arrive at Soeurette's house and knock on the door.",
        "source": "user"
    },
    {
        "text": "Harper answers the door and you meet her for the first time.",
        "source": "user"
    },
    {
        "text": "Your eyes well up with pride when you see her.",
        "source": "user"
    },
    {
        "text": "Soeurette is standing behind her, and she says, \"Harper, this is your father.\" Harper asks if you want to take her out for ice cream and you agree.",
        "source": "user"
    },
    {
        "text": "You take her to the ice cream parlor and she orders a chocolate cone.",
        "source": "user"
    },
    {
        "text": "Over ice cream, the two of you start bonding and you realize Harper is a pretty decent kid.",
        "source": "user"
    },
    {
        "text": "From then on, you start building a relationship with your daughter and get to know Harper quite well, making up for lost time.",
        "source": "user"
    }
]