[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "He's being guarded by Ben Affleck, whose sole purpose in life is to protect Matt Damon from all threats, but Ben needed to use the bathroom.",
        "source": "user"
    },
    {
        "text": "In the time it takes Batman to pee, Matt Damon was kidnapped and brought onto a space ship.",
        "source": "user"
    },
    {
        "text": "Ben rushes back to the room and sees a single piece of paper where Matt Damon once sat.",
        "source": "user"
    },
    {
        "text": "It reads:\n\"Dear Ben Affleck,\nSince you didn't protect Matt Damon from being taken, I'm not giving you the chance to find him.",
        "source": "user"
    },
    {
        "text": "Contact no one.",
        "source": "api"
    },
    {
        "text": "\"\nAnd it was signed with a strange squiggly line in an unfamiliar shape.",
        "source": "user"
    },
    {
        "text": "\"I don't know what to do\" Ben says to himself.",
        "source": "user"
    },
    {
        "text": "He can't keep this to himself, Matt has a family and friends, movies to film and an Oscar to win.",
        "source": "user"
    },
    {
        "text": "Everyone knows they rarely leave each others sides.",
        "source": "api"
    },
    {
        "text": "All Ben can think to do is disappear himself.",
        "source": "user"
    },
    {
        "text": "In the mean time, Matt was taken to a far away planet.",
        "source": "user"
    },
    {
        "text": "His captors were fans and very friendly to boot!",
        "source": "api"
    },
    {
        "text": "They kidnapped him because they were so in love with his acting, specifically his role as Jason Bourne.",
        "source": "user"
    },
    {
        "text": "Matt briefly thinks of Ben and wonders what his friend thinks happened, but he's in space.",
        "source": "api"
    },
    {
        "text": "SPACE!",
        "source": "user"
    },
    {
        "text": "He's filmed movies as an astronaut.",
        "source": "user"
    },
    {
        "text": "He's spent a whole movie on Mars!",
        "source": "user"
    },
    {
        "text": "But now he really was in space!",
        "source": "user"
    },
    {
        "text": "Back home the Matt's family was growing concerned that they couldn't reach Matt or Ben.",
        "source": "user"
    },
    {
        "text": "The media was becoming confused as to \"Where is Matt and why doesn't his family care that he's missing?",
        "source": "user"
    },
    {
        "text": "\" and \"Where is Ben and why didn't he protect Matt?",
        "source": "user"
    },
    {
        "text": "\"\n\nBut life goes on, Matt's family soon realizes he likely left to film another Ocean's movie and failed to tell them (he can be selfish at times).",
        "source": "api"
    },
    {
        "text": "Ben's family realizes their lives are much more peaceful without the constant \"OMG MATT DAMON IS MY BFF\" chatter.",
        "source": "user"
    },
    {
        "text": "But what about Matt?",
        "source": "user"
    },
    {
        "text": "It's been months!",
        "source": "user"
    },
    {
        "text": "But to Matt, it's felt like only hours.",
        "source": "user"
    },
    {
        "text": "He is flying in a space ship, in outer space.",
        "source": "user"
    },
    {
        "text": "There are planets and stars, life beyond humans.",
        "source": "user"
    },
    {
        "text": "Animals that you can't even explain.",
        "source": "user"
    },
    {
        "text": "There are food replicators, time travel, warp speed.",
        "source": "user"
    },
    {
        "text": "There is nothing for Matt back home, his family will be fine without him, they barely miss him.",
        "source": "user"
    },
    {
        "text": "The media has found a new star to dote on while Matt is living on a literal star.",
        "source": "user"
    },
    {
        "text": "Ben, however, has let the media cover that he is missing Matt Damon.",
        "source": "user"
    },
    {
        "text": "He's struggling every day, he's confused that no one is searching for him, that no one misses him.",
        "source": "api"
    },
    {
        "text": "He sits on a bench, overlooking the ocean and wonders if Matt is out there somewhere.",
        "source": "user"
    },
    {
        "text": "As if he thought the words out loud, Matt appears.",
        "source": "api"
    },
    {
        "text": "\"You want to go on a trip, buddy?",
        "source": "user"
    },
    {
        "text": "\"\n\"MATT!",
        "source": "user"
    },
    {
        "text": "\" Ben rushes to his side and wraps his arms around him.",
        "source": "user"
    },
    {
        "text": "\"I'll go anywhere with you.",
        "source": "user"
    },
    {
        "text": "Always\" and gently kisses his cheek.",
        "source": "api"
    },
    {
        "text": "A light shines down and his body warms.",
        "source": "user"
    },
    {
        "text": "And suddenly, the beach is gone and in it's place he and Matt are standing in a shiny silver room.",
        "source": "user"
    },
    {
        "text": "\"It's space, Ben.",
        "source": "user"
    },
    {
        "text": "We are on an alien spaceship\".",
        "source": "user"
    },
    {
        "text": "Matt prompts.",
        "source": "user"
    },
    {
        "text": "\"I don't care where I am, as long as I'm with you.",
        "source": "user"
    },
    {
        "text": "\"\n\nThe ship shoots into space, best friends together again and for always.",
        "source": "user"
    }
]