[
    "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
    "So when they were old enough, she sent them out into the world to seek their fortunes.",
    "You know the story about the first three little pigs.",
    "This is a story about the 92nd little pig.",
    "The 92nd little pig built a house out of depleted uranium.",
    "And the wolf was like, \"dude.\" \n\nThe wolf came to the 92nd little pig's house and said, \"Little pig, little pig, let me come in.",
    "\"No thank you!\" the pig answered politely.",
    "\"I'm not going to let you in.",
    "Please go now!\" \n\n\"Please let me in,\" pleaded the wolf.",
    "The pig simply locked and bolted the door shut, and closed all of the curtains.",
    "The pig was far too busy for this nonsense.",
    "The pig got back to work.",
    "\"Little pig, little pig, let me come in,\" said the wolf.",
    "The pig did not answer.",
    "The wolf tried to open the door, but it was locked.",
    "\"Little pig, little pig, let me come in,\" said the wolf, with waning energy.",
    "The pig ignored him.",
    "The wolf whimpered.",
    "\"Little pig,\" he gasped.",
    "\"Little pig, let me come in,\" he wheezed.",
    "The pig continued to ignore him.",
    "The pig was far too busy to deal with this silliness.",
    "The wolf felt like he was going to cry.",
    "\"Little pig,\" he sobbed.",
    "\"Little pig,\" he cried.",
    "\"Little pig, let me come in,\" he wailed.",
    "The pig was unmoved.",
    "The wolf could not control himself any longer.",
    "He broke down and cried.",
    "He cried and cried and cried.",
    "He cried and his tears fell everywhere.",
    "They fell on the ground and made puddles.",
    "They fell and landed on the door of the house.",
    "One puddle of tears landed on the handle of the door.",
    "Suddenly, the house began to sizzle.",
    "The wolf's tears were acid.",
    "The acid was reacting with the uranium.",
    "The uranium was melting.",
    "The wolf's tears were eating the house!",
    "The wolf cried and cried and cried.",
    "The wolf cried until he had no more tears left.",
    "When he finally wiped his eyes dry and looked up, he could see there was nothing in front of him except the pig.",
    "The pig looked completely shocked and bewildered.",
    "The wolf was so surprised and confused that he forgot to be hungry.",
    "He just stood there.",
    "\"I feel so much better!",
    "I forgot why I was crying.\" The wolf said.",
    "The pig shrugged.",
    "\"Wanna come in?\"\n"
]