[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.\"",
        "source": "api"
    },
    {
        "text": "The wolf had no idea what to do next after he had witnessed this.",
        "source": "user"
    },
    {
        "text": "He was like, \"I'm going to have to go back to the drawing board on this one.\" The wolf had been in some sticky situations but this one really took him aback.",
        "source": "user"
    },
    {
        "text": "He started to wonder what to do next and think of a plan.",
        "source": "user"
    },
    {
        "text": "The wolf went back to the woods and he was like, \"I'm going to have to think of a new plan.\" The wolf begins to think of what tools he had at his disposal.",
        "source": "user"
    },
    {
        "text": "He had his teeth, he had his claws, he had his fangs, he had his tail, he had his paws, he had his nose.",
        "source": "user"
    },
    {
        "text": "This was not going well for him at the time.",
        "source": "user"
    },
    {
        "text": "The wolf thought about the little pig's house.",
        "source": "user"
    },
    {
        "text": "It was made out of depleted uranium.",
        "source": "user"
    },
    {
        "text": "This would be very difficult to break through or blow up because of its strength.",
        "source": "user"
    },
    {
        "text": "The wolf thought about this for a while and then he got an idea.",
        "source": "user"
    },
    {
        "text": "What if he made a saw out of uranium.",
        "source": "user"
    },
    {
        "text": "This would put him at the same level as the house and he could break into it and eat the pig.",
        "source": "user"
    },
    {
        "text": "So the wolf went to the uranium mine and he got a bunch of uranium ore and he took it to the blacksmith.",
        "source": "user"
    },
    {
        "text": "The blacksmith made the saw reluctantly and the wolf was prepared to strike.",
        "source": "user"
    },
    {
        "text": "The wolf went to the little pig's house and he started sawing and sawing and sawing and sawing and sawing and sawing and failed.",
        "source": "user"
    },
    {
        "text": "The pig had used a richer grade of uranium.",
        "source": "user"
    },
    {
        "text": "The wolf had admitted to defeat and went back to his house.",
        "source": "user"
    },
    {
        "text": "At this point, he was out of ideas as there were no stronger materials available.",
        "source": "user"
    },
    {
        "text": "He would just have to wait out the pig which could take years.",
        "source": "user"
    }
]