[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?\" You look down and see a bee wearing a tiny cap and vest.",
        "source": "api"
    },
    {
        "text": "You ask the bee what he wants and the bee tells you that you are now the leader of their bee army.",
        "source": "user"
    },
    {
        "text": "The bee tells you that he needs your help at saving the largest bee colony in the world.",
        "source": "user"
    },
    {
        "text": "The bee stung you and that made you the leader of the bee army.",
        "source": "user"
    },
    {
        "text": "You are one of them now.",
        "source": "user"
    },
    {
        "text": "They need your help badly.",
        "source": "user"
    },
    {
        "text": "The bee explains to you that if you help him and his fellow bees, you will no longer be deathly allergic.",
        "source": "user"
    },
    {
        "text": "You won't be allergic at all.",
        "source": "user"
    },
    {
        "text": "You ask the bee how you're even alive considering he is a bee and he stung you.",
        "source": "user"
    },
    {
        "text": "The bee explains that he is a royal bee and his stinger can't kill anyone.",
        "source": "user"
    },
    {
        "text": "His stinger signifies friendship and loyalty.",
        "source": "user"
    },
    {
        "text": "You ask the bee how you're even going to be able to help.",
        "source": "user"
    },
    {
        "text": "The bee tells you that they need a strong man to chop open a wooden fences blockade.",
        "source": "user"
    },
    {
        "text": "Since they are bees they are unable to hold an ax.",
        "source": "user"
    },
    {
        "text": "If you can wield the ax and break the blockade, all of the bees can escape and live their life freely again.",
        "source": "user"
    },
    {
        "text": "These bees are part of the biggest colony in the world and they are being kept captive by an evil man.",
        "source": "user"
    },
    {
        "text": "He is using the bees to create honey that he can sell all across the world.",
        "source": "user"
    },
    {
        "text": "The man is rich and the bees are tired and overworked.",
        "source": "user"
    },
    {
        "text": "Some have even died from the amount of work they're being asked to do.",
        "source": "user"
    },
    {
        "text": "The bees fly towards where the bees are being kept captive and you see a really thick piece of wood.",
        "source": "user"
    },
    {
        "text": "There's no way to remove the wood and you have to chop through it to open up the door.",
        "source": "user"
    },
    {
        "text": "You wield the ax and swing it for the first time and to your surprise, you take a big chunk of wood right out of the middle.",
        "source": "user"
    },
    {
        "text": "You swing the ax again and another big chunk flies out.",
        "source": "user"
    },
    {
        "text": "You swing the ax one more time with all of your might and the wooden blockade snaps in half.",
        "source": "user"
    },
    {
        "text": "There is now no barrier that can prevent you from opening the door and freeing the bees.",
        "source": "user"
    },
    {
        "text": "You open the door and all of the bees fly out.",
        "source": "user"
    },
    {
        "text": "You have successfully rescued them and have saved their lives.",
        "source": "user"
    },
    {
        "text": "The bee that originally stung you flies up to you and tells you that you will no longer be allergic to bees.",
        "source": "user"
    },
    {
        "text": "He also tells you that they are so grateful they are going to give you a life time supply of honey.",
        "source": "user"
    },
    {
        "text": "Whenever you need it, just contact the bee and a jar of honey will be yours.",
        "source": "user"
    },
    {
        "text": "What a fun surprise.",
        "source": "user"
    }
]