[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack.",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": "but pack your bags and call the number below.",
        "source": "api"
    },
    {
        "text": "It's time to start the real job.",
        "source": "api"
    },
    {
        "text": "\" Signed simply, \"JFK.",
        "source": "api"
    },
    {
        "text": "\"\n\nYou're shocked.",
        "source": "api"
    },
    {
        "text": "This has to be a joke.",
        "source": "user"
    },
    {
        "text": "JFK has been dead for ages.",
        "source": "user"
    },
    {
        "text": "There is even a video of him getting shot in the head.",
        "source": "user"
    },
    {
        "text": "Surely you are just being trolled by someone.",
        "source": "user"
    },
    {
        "text": "At the end of the day, your curiosity gets the best of you.",
        "source": "user"
    },
    {
        "text": "You call the number and a man picks up.",
        "source": "user"
    },
    {
        "text": "You tell him that you're Barack Obama and got the letter that was sent and marked by a JFK.",
        "source": "user"
    },
    {
        "text": "The man tells you to hold on and transfers you to another line.",
        "source": "user"
    },
    {
        "text": "You hear a man pick up and he claims that he is John F.",
        "source": "user"
    },
    {
        "text": "Kennedy.",
        "source": "user"
    },
    {
        "text": "You tell him that's impossible and that JFK has been dead for decades.",
        "source": "user"
    },
    {
        "text": "He explains that he has been alive the entire time and wanted to get out of the limelight.",
        "source": "user"
    },
    {
        "text": "The entire assassination was staged similar to a movie.",
        "source": "user"
    },
    {
        "text": "JFK used a stunt double and effects to make it look real.",
        "source": "user"
    },
    {
        "text": "You sit there and tell JFK you want proof.",
        "source": "user"
    },
    {
        "text": "He sends you a picture of his license as well as pictures from his past in his wallet.",
        "source": "user"
    },
    {
        "text": "He also shows you his new license that has a fake name on it as well.",
        "source": "user"
    },
    {
        "text": "You sit there shocked and have no idea how to react.",
        "source": "user"
    },
    {
        "text": "JFK tells you that he has a job for you and that you will be paid handsomely.",
        "source": "user"
    },
    {
        "text": "He tells you to pack your bags and that you will be picked up in a few hours.",
        "source": "api"
    },
    {
        "text": "A few hours later you are picked up and are going to a unknown destination.",
        "source": "api"
    },
    {
        "text": "You sit in the car and the man driving tells you that you will be working with JFK.",
        "source": "user"
    },
    {
        "text": "You ask him what the job is and he tells you that you will be working with JFK to help him take down the Illuminati.",
        "source": "api"
    },
    {
        "text": "You ask JFK what the issue with the Illuminati is.",
        "source": "api"
    },
    {
        "text": "He tells you that they are a group of people who control the world and have been doing so for centuries.",
        "source": "user"
    },
    {
        "text": "They are a group of people who control the world's money supply and are very rich.",
        "source": "api"
    },
    {
        "text": "He tells you that he wants to take them down and that he needs your help.",
        "source": "api"
    },
    {
        "text": "You tell JFK that you would love to help but don't know where to start.",
        "source": "api"
    },
    {
        "text": "JFK tells you that he has a plan and that he will explain it to you on the way.",
        "source": "user"
    },
    {
        "text": "He explains that you that he is going to infiltrate the Illumanti and destroy them from the inside.",
        "source": "api"
    },
    {
        "text": "His new alias is the 3rd richest person in the world.",
        "source": "user"
    },
    {
        "text": "You are shocked at this information as well and get uncomfortable.",
        "source": "user"
    },
    {
        "text": "You tell JFK that you're too afraid to help and want to go back to your wife and children.",
        "source": "user"
    },
    {
        "text": "JFK gets very upset and tells you that you clearly don't care about your country.",
        "source": "user"
    },
    {
        "text": "You go back home and are confident that you made the right decision.",
        "source": "user"
    },
    {
        "text": "While you value your country, there is too many things that could go wrong and harm you or your family.",
        "source": "user"
    },
    {
        "text": "You made the right call.",
        "source": "user"
    }
]