[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered.",
        "source": "api",
        "last_event_time": 567.0,
        "start_time": 0.0,
        "end_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.09921848453958546
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. ",
        "source": "user",
        "last_event_time": 567.0,
        "start_time": 8.0,
        "end_time": 60.0,
        "start_progress": 0.09921848453958546,
        "end_progress": 0.18280665987088004
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile.",
        "source": "api",
        "last_event_time": 567.0,
        "start_time": 89.0,
        "end_time": 89.0,
        "start_progress": 0.18280665987088004,
        "end_progress": 0.2147468569486918
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. ",
        "source": "user",
        "last_event_time": 567.0,
        "start_time": 98.0,
        "end_time": 133.0,
        "start_progress": 0.2147468569486918,
        "end_progress": 0.2616377845735644
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious.",
        "source": "api",
        "last_event_time": 567.0,
        "start_time": 139.0,
        "end_time": 139.0,
        "start_progress": 0.2616377845735644,
        "end_progress": 0.26809378185524974
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. ",
        "source": "user",
        "last_event_time": 567.0,
        "start_time": 139.0,
        "end_time": 166.0,
        "start_progress": 0.26809378185524974,
        "end_progress": 0.33401291199456334
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug.",
        "source": "api",
        "last_event_time": 567.0,
        "start_time": 174.0,
        "end_time": 174.0,
        "start_progress": 0.33401291199456334,
        "end_progress": 0.35304111450900444
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years. You are completely shocked that the government could have been so reckless as to make everyone get the drug. ",
        "source": "user",
        "last_event_time": 567.0,
        "start_time": 175.0,
        "end_time": 242.0,
        "start_progress": 0.35304111450900444,
        "end_progress": 0.44308528712198436
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years.  The effects were not necessarily immediate but more felt over the course of generations, and now, the latest group of women to come into childbearing age are 100% baren. You are completely shocked that the government could have been so reckless as to make everyone get the drug. ",
        "source": "user",
        "last_event_time": 567.0,
        "start_time": 245.0,
        "end_time": 279.0,
        "start_progress": 0.44308528712198436,
        "end_progress": 0.5011892626571526
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years.  The effects were not necessarily immediate but more felt over the course of generations, and now, the latest group of women to come into childbearing age are 100% barren. You are completely shocked that the government could have been so reckless as to make everyone get the drug.  The women who are unable to have children are very upset. ",
        "source": "user",
        "last_event_time": 567.0,
        "start_time": 282.0,
        "end_time": 308.0,
        "start_progress": 0.5011892626571526,
        "end_progress": 0.5215766224940537
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years.  The effects were not necessarily immediate but more felt over the course of generations, and now, the latest group of women to come into childbearing age are 100% barren. You are completely shocked that the government could have been so reckless as to make everyone get the drug.  The women who are unable to have children are very upset. They are angry at the government for making them get the drug, and they are angry at the scientists for creating the drug in the first place.",
        "source": "api",
        "last_event_time": 567.0,
        "start_time": 314.0,
        "end_time": 314.0,
        "start_progress": 0.5215766224940537,
        "end_progress": 0.5694869181107713
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years.  The effects were not necessarily immediate but more felt over the course of generations, and now, the latest group of women to come into childbearing age are 100% barren. You are completely shocked that the government could have been so reckless as to make everyone get the drug.  The women who are unable to have children are very upset. They are angry at the government for making them get the drug, and they are angry at the scientists for creating the drug in the first place. They feel that they can no longer be defined as \"real women\" without the capacity to bear children and become mothers. ",
        "source": "user",
        "last_event_time": 567.0,
        "start_time": 317.0,
        "end_time": 350.0,
        "start_progress": 0.5694869181107713,
        "end_progress": 0.6102616377845735
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years.  The effects were not necessarily immediate but more felt over the course of generations, and now, the latest group of women to come into childbearing age are 100% barren. You are completely shocked that the government could have been so reckless as to make everyone get the drug.  The women who are unable to have children are very upset. They are angry at the government for making them get the drug, and they are angry at the scientists for creating the drug in the first place. They feel that they can no longer be defined as \"real women\" without the capacity to bear children and become mothers. They feel that their lives are not worth living anymore.",
        "source": "api",
        "last_event_time": 567.0,
        "start_time": 358.0,
        "end_time": 358.0,
        "start_progress": 0.6102616377845735,
        "end_progress": 0.6292898402990146
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years.  The effects were not necessarily immediate but more felt over the course of generations, and now, the latest group of women to come into childbearing age are 100% barren. You are completely shocked that the government could have been so reckless as to make everyone get the drug.  The women who are unable to have children are very upset. They are angry at the government for making them get the drug, and they are angry at the scientists for creating the drug in the first place. They feel that they can no longer be defined as \"real women\" without the capacity to bear children and become mothers. They feel that their lives are not worth living anymore. One woman, Soeurette Morley, decides to go on a rampage against the government by creating her own counterdrug. ",
        "source": "user",
        "last_event_time": 567.0,
        "start_time": 360.0,
        "end_time": 379.0,
        "start_progress": 0.6292898402990146,
        "end_progress": 0.6676860346585117
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years.  The effects were not necessarily immediate but more felt over the course of generations, and now, the latest group of women to come into childbearing age are 100% barren. You are completely shocked that the government could have been so reckless as to make everyone get the drug.  The women who are unable to have children are very upset. They are angry at the government for making them get the drug, and they are angry at the scientists for creating the drug in the first place. They feel that they can no longer be defined as \"real women\" without the capacity to bear children and become mothers. They feel that their lives are not worth living anymore. One woman, Soeurette Morley, decides to go on a rampage against the government by creating her own counterdrug. She is able to create a drug that reverses the effects of the original drug.",
        "source": "api",
        "last_event_time": 567.0,
        "start_time": 393.0,
        "end_time": 393.0,
        "start_progress": 0.6676860346585117,
        "end_progress": 0.6935100237852532
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years.  The effects were not necessarily immediate but more felt over the course of generations, and now, the latest group of women to come into childbearing age are 100% barren. You are completely shocked that the government could have been so reckless as to make everyone get the drug.  The women who are unable to have children are very upset. They are angry at the government for making them get the drug, and they are angry at the scientists for creating the drug in the first place. They feel that they can no longer be defined as \"real women\" without the capacity to bear children and become mothers. They feel that their lives are not worth living anymore. One woman, Soeurette Morley, decides to go on a rampage against the government by creating her own counterdrug. She is able to create a drug that reverses the effects of the original drug. She is able to reverse the sterilization effects of the original drug, but she is unable to reverse the aging effects.",
        "source": "api",
        "last_event_time": 567.0,
        "start_time": 405.0,
        "end_time": 405.0,
        "start_progress": 0.6935100237852532,
        "end_progress": 0.7339449541284404
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years.  The effects were not necessarily immediate but more felt over the course of generations, and now, the latest group of women to come into childbearing age are 100% barren. You are completely shocked that the government could have been so reckless as to make everyone get the drug.  The women who are unable to have children are very upset. They are angry at the government for making them get the drug, and they are angry at the scientists for creating the drug in the first place. They feel that they can no longer be defined as \"real women\" without the capacity to bear children and become mothers. They feel that their lives are not worth living anymore. One woman, Soeurette Morley, decides to go on a rampage against the government by creating her own counterdrug. She is able to create a drug that reverses the effects of the original drug. She is able to reverse the sterilization effects of the original drug, but she is unable to reverse the aging effects. As a result, everyone who she administers the counterdrug to rapidly ages to become their real, true age. This means that women who had become very accustomed to looking perpetually 28 now look 75. They are devastated because their husbands still look 28 and now they feel like cougars. ",
        "source": "user",
        "last_event_time": 567.0,
        "start_time": 408.0,
        "end_time": 460.0,
        "start_progress": 0.7339449541284404,
        "end_progress": 0.8318042813455657
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years.  The effects were not necessarily immediate but more felt over the course of generations, and now, the latest group of women to come into childbearing age are 100% barren. You are completely shocked that the government could have been so reckless as to make everyone get the drug.  The women who are unable to have children are very upset. They are angry at the government for making them get the drug, and they are angry at the scientists for creating the drug in the first place. They feel that they can no longer be defined as \"real women\" without the capacity to bear children and become mothers. They feel that their lives are not worth living anymore. One woman, Soeurette Morley, decides to go on a rampage against the government by creating her own counterdrug. She is able to create a drug that reverses the effects of the original drug. She is able to reverse the sterilization effects of the original drug, but she is unable to reverse the aging effects. As a result, everyone who she administers the counterdrug to rapidly ages to become their real, true age. This means that women who had become very accustomed to looking perpetually 28 now look 75. They are devastated because their husbands still look 28 and now they feel like cougars. The men are devastated because their wives look like their grandmothers.",
        "source": "api",
        "last_event_time": 567.0,
        "start_time": 466.0,
        "end_time": 466.0,
        "start_progress": 0.8318042813455657,
        "end_progress": 0.8562691131498471
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years.  The effects were not necessarily immediate but more felt over the course of generations, and now, the latest group of women to come into childbearing age are 100% barren. You are completely shocked that the government could have been so reckless as to make everyone get the drug.  The women who are unable to have children are very upset. They are angry at the government for making them get the drug, and they are angry at the scientists for creating the drug in the first place. They feel that they can no longer be defined as \"real women\" without the capacity to bear children and become mothers. They feel that their lives are not worth living anymore. One woman, Soeurette Morley, decides to go on a rampage against the government by creating her own counterdrug. She is able to create a drug that reverses the effects of the original drug. She is able to reverse the sterilization effects of the original drug, but she is unable to reverse the aging effects. As a result, everyone who she administers the counterdrug to rapidly ages to become their real, true age. This means that women who had become very accustomed to looking perpetually 28 now look 75. They are devastated because their husbands still look 28 and now they feel like cougars. The men are devastated because their wives look like their grandmothers. However, this counterdrug is what the world needs to start creating babies again. ",
        "source": "user",
        "last_event_time": 567.0,
        "start_time": 467.0,
        "end_time": 488.0,
        "start_progress": 0.8562691131498471,
        "end_progress": 0.8844716275908936
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years.  The effects were not necessarily immediate but more felt over the course of generations, and now, the latest group of women to come into childbearing age are 100% barren. You are completely shocked that the government could have been so reckless as to make everyone get the drug.  The women who are unable to have children are very upset. They are angry at the government for making them get the drug, and they are angry at the scientists for creating the drug in the first place. They feel that they can no longer be defined as \"real women\" without the capacity to bear children and become mothers. They feel that their lives are not worth living anymore. One woman, Soeurette Morley, decides to go on a rampage against the government by creating her own counterdrug. She is able to create a drug that reverses the effects of the original drug. She is able to reverse the sterilization effects of the original drug, but she is unable to reverse the aging effects. As a result, everyone who she administers the counterdrug to rapidly ages to become their real, true age. This means that women who had become very accustomed to looking perpetually 28 now look 75. They are devastated because their husbands still look 28 and now they feel like cougars. The men are devastated because their wives look like their grandmothers. However, this counterdrug is what the world needs to start creating babies again. The world is now in a race to create a new generation of babies.",
        "source": "api",
        "last_event_time": 567.0,
        "start_time": 498.0,
        "end_time": 498.0,
        "start_progress": 0.8844716275908936,
        "end_progress": 0.9062181447502549
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years.  The effects were not necessarily immediate but more felt over the course of generations, and now, the latest group of women to come into childbearing age are 100% barren. You are completely shocked that the government could have been so reckless as to make everyone get the drug.  The women who are unable to have children are very upset. They are angry at the government for making them get the drug, and they are angry at the scientists for creating the drug in the first place. They feel that they can no longer be defined as \"real women\" without the capacity to bear children and become mothers. They feel that their lives are not worth living anymore. One woman, Soeurette Morley, decides to go on a rampage against the government by creating her own counterdrug. She is able to create a drug that reverses the effects of the original drug. She is able to reverse the sterilization effects of the original drug, but she is unable to reverse the aging effects. As a result, everyone who she administers the counterdrug to rapidly ages to become their real, true age. This means that women who had become very accustomed to looking perpetually 28 now look 75. They are devastated because their husbands still look 28 and now they feel like cougars. The men are devastated because their wives look like their grandmothers. However, this counterdrug is what the world needs to start creating babies again. The world is now in a race to create a new generation of babies. Men and women couple off immediately. ",
        "source": "user",
        "last_event_time": 567.0,
        "start_time": 501.0,
        "end_time": 518.0,
        "start_progress": 0.9062181447502549,
        "end_progress": 0.9194699286442406
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years.  The effects were not necessarily immediate but more felt over the course of generations, and now, the latest group of women to come into childbearing age are 100% barren. You are completely shocked that the government could have been so reckless as to make everyone get the drug.  The women who are unable to have children are very upset. They are angry at the government for making them get the drug, and they are angry at the scientists for creating the drug in the first place. They feel that they can no longer be defined as \"real women\" without the capacity to bear children and become mothers. They feel that their lives are not worth living anymore. One woman, Soeurette Morley, decides to go on a rampage against the government by creating her own counterdrug. She is able to create a drug that reverses the effects of the original drug. She is able to reverse the sterilization effects of the original drug, but she is unable to reverse the aging effects. As a result, everyone who she administers the counterdrug to rapidly ages to become their real, true age. This means that women who had become very accustomed to looking perpetually 28 now look 75. They are devastated because their husbands still look 28 and now they feel like cougars. The men are devastated because their wives look like their grandmothers. However, this counterdrug is what the world needs to start creating babies again. The world is now in a race to create a new generation of babies. Men and women couple off immediately. Women who had been barren for decades are now able to conceive.",
        "source": "api",
        "last_event_time": 567.0,
        "start_time": 527.0,
        "end_time": 527.0,
        "start_progress": 0.9194699286442406,
        "end_progress": 0.9408766564729868
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years.  The effects were not necessarily immediate but more felt over the course of generations, and now, the latest group of women to come into childbearing age are 100% barren. You are completely shocked that the government could have been so reckless as to make everyone get the drug.  The women who are unable to have children are very upset. They are angry at the government for making them get the drug, and they are angry at the scientists for creating the drug in the first place. They feel that they can no longer be defined as \"real women\" without the capacity to bear children and become mothers. They feel that their lives are not worth living anymore. One woman, Soeurette Morley, decides to go on a rampage against the government by creating her own counterdrug. She is able to create a drug that reverses the effects of the original drug. She is able to reverse the sterilization effects of the original drug, but she is unable to reverse the aging effects. As a result, everyone who she administers the counterdrug to rapidly ages to become their real, true age. This means that women who had become very accustomed to looking perpetually 28 now look 75. They are devastated because their husbands still look 28 and now they feel like cougars. The men are devastated because their wives look like their grandmothers. However, this counterdrug is what the world needs to start creating babies again. The world is now in a race to create a new generation of babies. Men and women couple off immediately. Women who had been barren for decades are now able to conceive. The world is in a frenzy of baby making.",
        "source": "api",
        "last_event_time": 567.0,
        "start_time": 539.0,
        "end_time": 539.0,
        "start_progress": 0.9408766564729868,
        "end_progress": 0.9548080190282026
    },
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality. Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Of course, you are not affected directly by the drug's side effects, since you were too old to receive the drug at the age of 28 many years ago. However, you now see that catastrophe has struck your children, because they all received the drug. Your children are now living in a world where they are all immortal, but they are all sterile. The world's population had been falling ever since the first drugs were administered but no one could really pinpoint the reason before. Now, it is obvious. All the blame had previously been pointed at various sources like the environment, or global warming, or women's rising career ambitions, or unfriendly work from home policies for new parents. But now, it is clear that the real culprit was the drug. The drug explains why the population has been dwindling because slowly but surely, it has been killing women's reproductive organs over the last 50 years.  The effects were not necessarily immediate but more felt over the course of generations, and now, the latest group of women to come into childbearing age are 100% barren. You are completely shocked that the government could have been so reckless as to make everyone get the drug.  The women who are unable to have children are very upset. They are angry at the government for making them get the drug, and they are angry at the scientists for creating the drug in the first place. They feel that they can no longer be defined as \"real women\" without the capacity to bear children and become mothers. They feel that their lives are not worth living anymore. One woman, Soeurette Morley, decides to go on a rampage against the government by creating her own counterdrug. She is able to create a drug that reverses the effects of the original drug. She is able to reverse the sterilization effects of the original drug, but she is unable to reverse the aging effects. As a result, everyone who she administers the counterdrug to rapidly ages to become their real, true age. This means that women who had become very accustomed to looking perpetually 28 now look 75. They are devastated because their husbands still look 28 and now they feel like cougars. The men are devastated because their wives look like their grandmothers. However, this counterdrug is what the world needs to start creating babies again. The world is now in a race to create a new generation of babies. Men and women couple off immediately. Women who had been barren for decades are now able to conceive. The world is in a frenzy of baby making. And the world succeeds in this mission. The people are able to give birth to enough babies to ensure the survival of the human race.",
        "source": "user",
        "last_event_time": 567.0,
        "start_time": 543.0,
        "end_time": 567.0,
        "start_progress": 0.9548080190282026,
        "end_progress": 1.0
    }
]