[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "It seemed foolish of the U.",
        "source": "api"
    },
    {
        "text": "S to not verify that the other countries were isolating, but the passing through of borders was strictly prohibited.",
        "source": "user"
    },
    {
        "text": "The U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "government decided to send a special task force to find out what happened to the other countries.",
        "source": "api"
    },
    {
        "text": "The task force is sent through the border and discovers that the other countries have been destroyed by a nuclear war.",
        "source": "api"
    },
    {
        "text": "The task force is then ambushed by a group of survivors, who are revealed to be the descendants of the people who survived the nuclear war.",
        "source": "api"
    },
    {
        "text": "The survivors are led by a man named Kincaid, who is the leader of a religious cult that worships the nuclear war.",
        "source": "api"
    },
    {
        "text": "Kincaid claims that the nuclear war was sent by God to cleanse the world of sin.",
        "source": "api"
    },
    {
        "text": "The survivors, who have been living in the ruins of the other countries, have created a new society based on their own interpretation of the Bible.",
        "source": "api"
    },
    {
        "text": "The task force is taken to a city called New Jerusalem, where they are put on trial for the sins of their ancestors.",
        "source": "api"
    },
    {
        "text": "The task force is sentenced to death, but they are rescued by a man named Joshua, who is the leader of a group of rebels who oppose Kincaid.",
        "source": "api"
    },
    {
        "text": "Joshua claims that Kincaid is a false prophet, and that the nuclear war was not sent by God.",
        "source": "api"
    },
    {
        "text": "Joshua takes the task force to the ruins of Washington D.",
        "source": "api"
    },
    {
        "text": "C.",
        "source": "api"
    },
    {
        "text": ", where he shows them a computer that was created by the government before.",
        "source": "api"
    },
    {
        "text": "The computer contains a recording of the last president of the United States, who tells the task force that the nuclear war was not sent by God, but by a group of scientists who wanted to destroy the world.",
        "source": "api"
    },
    {
        "text": "The president tells the task force that the survivors are not the descendants of the people who survived the nuclear war, but are actually the descendants of the scientists.",
        "source": "api"
    },
    {
        "text": "With this newfound knowledge, the survivors must decide how to use this information, to save the world, and themselves.",
        "source": "api"
    }
]