[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "You are a God-like figure who has the power to grant miracles to those you deem worthy.",
        "source": "api"
    },
    {
        "text": "A person can only receive one miracle in their lifetime, so you must choose carefully who will have the ultimate reward.",
        "source": "api"
    },
    {
        "text": "There is not only pressure on the person receiving the miracle, but there is also pressure on you.",
        "source": "api"
    },
    {
        "text": "Giving miracles is a huge responsibility.",
        "source": "user"
    },
    {
        "text": "What happens if you give a miracle to someone who does not deserve it?",
        "source": "user"
    },
    {
        "text": "Or what happens if you give the wrong miracle to the right person?",
        "source": "api"
    },
    {
        "text": "These pressures can be a lot for one person to handle.",
        "source": "api"
    },
    {
        "text": "But you have been chosen to give these miracles to people.",
        "source": "user"
    },
    {
        "text": "You are helping them experience a reincarnation of their own.",
        "source": "user"
    },
    {
        "text": "Through your decisions, you will be shaping their lives and the lives of everyone they come in contact with.",
        "source": "user"
    },
    {
        "text": "They will be grateful for the miracle and will give it back to you by continuing to spread the gift in their own lives.",
        "source": "api"
    },
    {
        "text": "Over time, you will see the effect of these miracles.",
        "source": "api"
    },
    {
        "text": "Some of the effects will be good.",
        "source": "api"
    },
    {
        "text": "Some of the effects will be bad.",
        "source": "user"
    },
    {
        "text": "Although you are giving miracles away, you are giving them to humans.",
        "source": "user"
    },
    {
        "text": "Humans are not perfect beings.",
        "source": "user"
    },
    {
        "text": "They have flaws.",
        "source": "user"
    },
    {
        "text": "They can be selfish.",
        "source": "user"
    },
    {
        "text": "They can be very self-serving.",
        "source": "user"
    },
    {
        "text": "They can be very greedy.",
        "source": "api"
    },
    {
        "text": "But they also can be helpful.",
        "source": "api"
    },
    {
        "text": "They can be kind.",
        "source": "user"
    },
    {
        "text": "They can be loving.",
        "source": "user"
    },
    {
        "text": "Human beings die in terms of the physical world.",
        "source": "api"
    },
    {
        "text": "Our spirit doesn't die.",
        "source": "user"
    },
    {
        "text": "Whether it be reincarnation, heaven or something else, our spirit ascends.",
        "source": "user"
    },
    {
        "text": "We do not die with the physical body.",
        "source": "user"
    },
    {
        "text": "Were you to get an opportunity at reincarnation what would you choose?",
        "source": "user"
    },
    {
        "text": "You would want to live a life where you could really make a difference, wouldn't you?",
        "source": "user"
    },
    {
        "text": "I know I would.",
        "source": "api"
    },
    {
        "text": "And that's what I'm trying to do in this physical world in my current form.",
        "source": "api"
    },
    {
        "text": "Leave this place with a positive legacy behind before I enter the spiritual world.",
        "source": "user"
    },
    {
        "text": "You have a chance to make a difference in the life of someone else while you're still on this physical Earth.",
        "source": "user"
    },
    {
        "text": "So do it.",
        "source": "api"
    }
]