[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "start_progress": 0.23217115689381934,
        "end_progress": 0.23217115689381934
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. People that have taken the drugs experience loss of intelligence. When they are 40, their minds are destroyed. This create a big problem to the society because lots of people with low IQ wander in the street causing many social problems and crimes. Worse still, these people won't die because they have no signs of aging. When they reach 85, their bodies begin to fail, but still will not die due to health problem. Since technology have not progressed, they are a burden for the society and have to live in a big city called the “Retirement Zone\".",
        "source": "api",
        "start_time": 0.0,
        "end_time": 428.0,
        "start_progress": 0.23217115689381934,
        "end_progress": 0.6481774960380349
    },
    {
        "text": "The government has come up with a solution to solve this problem: the Death Game.",
        "source": "user",
        "start_time": 428.0,
        "end_time": 461.0,
        "start_progress": 0.6489698890649762,
        "end_progress": 0.7131537242472267
    },
    {
        "text": "In this game, the people that have taken the drug must fight for their lives in everyday life.",
        "source": "user",
        "start_time": 461.0,
        "end_time": 503.0,
        "start_progress": 0.713946117274168,
        "end_progress": 0.7884310618066561
    },
    {
        "text": "Those who lose will be killed.",
        "source": "user",
        "start_time": 503.0,
        "end_time": 574.0,
        "start_progress": 0.7892234548335975,
        "end_progress": 0.8129952456418383
    },
    {
        "text": "The winner will become immortal.",
        "source": "user",
        "start_time": 574.0,
        "end_time": 587.0,
        "start_progress": 0.8137876386687797,
        "end_progress": 0.8391442155309033
    },
    {
        "text": "The setting is a future where science has found out how to make people immortal, but they create an unexpected side-effect: when the cost for immortality is developing a low IQ.",
        "source": "api",
        "start_time": 587.0,
        "end_time": 951.0,
        "start_progress": 0.23217115689381934,
        "end_progress": 0.9809825673534073
    }
]