[
    "Your entire life, you've been told you're deathly allergic to bees.",
    "You've always had people protecting you from them, be it your mother or a hired hand.",
    "Today, one slips through and lands on your shoulder.",
    "You hear a tiny voice say \"Your Majesty, what are your orders?\" You look around and see a swarm of bees, all bowing to you.",
    "\"Oh!\" said the princess, quite alarmed.",
    "\"I don't know what to say!",
    "There are so many of you.\" \n\n\"We are at your service, Your Majesty,\" said the bees, bowing low.",
    "\"Anything you desire is our pleasure.\" \n\n\"Well,\" said the princess, \"I would like some honey for my tea.\"\n\n\"Right away, Your Majesty.\" Suddenly, all of the bees swarmed the princess's tea cup in a frenzy.",
    "She screamed and jumped back.",
    "\"What are you doing?\" she cried.",
    "\"That's my tea!",
    "Isn't that dangerous?\" \n\n\"We're sorry, Your Majesty,\" said the bees.",
    "\"We didn't mean to frighten you.",
    "We were simply providing the honey you requested.\" \n\n\"Well, I don't want you to sting me,\" said the princess.",
    "\"Please do that somewhere else, and bring it to me in a jar.",
    "Like civilized people!\" \n\n\"Of course, Your Majesty.\" The bees hurried off to the kitchen to make honey.",
    "\"I wonder what else I can order them to do,\" said the princess.",
    "She looked out the window while she thought.",
    "\"I know!\" she said.",
    "She sat and waited for the bees to return.",
    "A while later, she was finishing her tea with honey.",
    "\"I've decided,\" said the princess, \"that I want to go for a walk in the garden.",
    "I will need shade.\" \n\n\"Right away, Your Majesty,\" said the bees.",
    "The bees brought her an umbrella for the sun.",
    "She waved her hand at it, uninterested.",
    "\"I don't want that,\" she said.",
    "\"I have a better idea.\" \n\n\"What would you like, Your Majesty?\" asked the bees.",
    "A short while later, the princess was strolling through the garden without a care in the world.",
    "She removed her sun hat and let her hair fall down loose.",
    "She smiled as the bees buzzed around her.",
    "She smiled in the shade of the large cloud above her head.",
    "She looked up at her bees and said \"I'm so glad I have you.",
    "I never did care for direct sunlight.",
    "Now I can go for walks midday.\" \n\nThe bees buzzed happily above the princess.",
    "They together in a thin blanket formation.",
    "They were happy to serve the princess.",
    "She was the fairest in the land, and now she was the only person in the land to have her own personal cloud.",
    "Fancy that!",
    ""
]