[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack.",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": "but pack your bags and call the number below.",
        "source": "api"
    },
    {
        "text": "It's time to start the real job.",
        "source": "api"
    },
    {
        "text": "\" Signed simply, \"JFK.",
        "source": "api"
    },
    {
        "text": "\"\n\n\n\nYou have no idea what JFK could mean by this, but you're intrigued.",
        "source": "api"
    },
    {
        "text": "After all, hasn't JFK been dead for many years?",
        "source": "api"
    },
    {
        "text": "Hesitantly, you call the number he's given in the letter and you speak to him.",
        "source": "user"
    },
    {
        "text": "A man answers and you are surprised that the man's voice is the one of a healthy middle-aged adult.",
        "source": "api"
    },
    {
        "text": "If JFK were alive, he'd be ancient by now and his voice would be gravelly and raspy.",
        "source": "user"
    },
    {
        "text": "It would not be as vibrant as it is on the phone.",
        "source": "user"
    },
    {
        "text": "Nonetheless, you speak to the man who claims to be JFK.",
        "source": "user"
    },
    {
        "text": "This man tells you to meet him in Bermuda.",
        "source": "api"
    },
    {
        "text": "JFK tells you that he's sending a plane for you.",
        "source": "user"
    },
    {
        "text": "You are completely mystified and stupefied.",
        "source": "api"
    },
    {
        "text": "You ask if Michelle can come along.",
        "source": "user"
    },
    {
        "text": "\"No, it's just you.",
        "source": "user"
    },
    {
        "text": "\" You protest that you can go nowhere without Michelle, and that she will most certainly be suspicious that you are having an affair if you go off to Bermuda on a random whim without notifying her at all.",
        "source": "api"
    },
    {
        "text": "\"I'm sorry Barack, but you have to do this alone,\" JFK says.",
        "source": "user"
    },
    {
        "text": "\"You have no choice in the matter.",
        "source": "api"
    },
    {
        "text": "\"\n\nThat night, you go home to Michelle and tell her that you have received a strange letter asking that you travel out to Bermuda, and that you must fulfill the obligations under the letter alone.",
        "source": "api"
    },
    {
        "text": "You make up some nonsense about a new job.",
        "source": "user"
    },
    {
        "text": "Michelle can see right through your lies.",
        "source": "api"
    },
    {
        "text": "She knows that you don't have a new job.",
        "source": "user"
    },
    {
        "text": "After all, you are happily retired.",
        "source": "user"
    },
    {
        "text": "Your life is so much more calm and less stressful now.",
        "source": "user"
    },
    {
        "text": "Why would you throw all of that away just because of a job offer?",
        "source": "user"
    },
    {
        "text": "Your career is done and you know it and she knows it.",
        "source": "user"
    },
    {
        "text": "This is a lie.",
        "source": "user"
    },
    {
        "text": "Michelle starts to ask questions.",
        "source": "user"
    },
    {
        "text": "You are evasive.",
        "source": "user"
    },
    {
        "text": "After all, you barely have any details about this job yourself, so you certainly aren't in a position to share such details with her!",
        "source": "user"
    },
    {
        "text": "You deflect questions about the job and try to change the subject.",
        "source": "user"
    },
    {
        "text": "Eventually, Michelle gives up.",
        "source": "api"
    },
    {
        "text": "She knows that you wouldn't be pressing to go to Bermuda alone if you didn't have a very good and very legitimate reason for doing so.",
        "source": "api"
    },
    {
        "text": "So she leaves the issue and heads up to bed.",
        "source": "user"
    },
    {
        "text": "The next morning, the mansion staff are gathered and ready to chauffeur you to the airport.",
        "source": "user"
    },
    {
        "text": "Off you go to Bermuda!",
        "source": "api"
    },
    {
        "text": "The lines at the airport are short and you are surprised to be on the plane in under an hour from the time you set foot in the airport.",
        "source": "api"
    },
    {
        "text": "When you touch down in Bermuda, you are shocked to see JFK waiting for you.",
        "source": "user"
    },
    {
        "text": "He's alive!",
        "source": "user"
    },
    {
        "text": "JFK greets you warmly.",
        "source": "user"
    },
    {
        "text": "He tells you that he needs your help to do something tremendously important, and that it's up to you to stop a major threat.",
        "source": "user"
    },
    {
        "text": "You are very concerned and ask what the issue is.",
        "source": "api"
    },
    {
        "text": "He says he is trying to negotiate a cross-border peace treaty with Bermuda and that he needs your help.",
        "source": "user"
    },
    {
        "text": "You immediately jump in to offer your help.",
        "source": "user"
    },
    {
        "text": "It's not everyday that JFK will ask you to help with diplomatic relations!",
        "source": "user"
    },
    {
        "text": "With your help, JFK is able to successfully resolve the matter.",
        "source": "user"
    },
    {
        "text": "Peace is restored again to both nations involved in the threat.",
        "source": "user"
    },
    {
        "text": "You are very happy that you were able to assist in this mater but you are even happier to have met JFK.",
        "source": "api"
    },
    {
        "text": "You let JFK know that you are available to help him any time he might need it.",
        "source": "user"
    },
    {
        "text": "JFK thanks you heartily.",
        "source": "user"
    },
    {
        "text": "He says that he might indeed have need for you again in the future.",
        "source": "user"
    },
    {
        "text": "The two of you shake hands and end the meeting warmly.",
        "source": "api"
    }
]