[
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.1793911007025761
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should be providing these pads and tampons to female students. At the end of the day, all students should feel comfortable at school. If being able to receive tampons and pads is going to help female students, it should happen without any questions asked.\n\nAfter all, school bathrooms are supplied with soap, toilet paper and paper towels. All of those are hygiene related products. Students that are boys don't have to worry about any of the embarrassment that could come from female students not having pads or tampons. \n\nAt the very least, the female students voices should be heard. They're really the only ones that matter in this situation. If they say that they'll be more comfortable with free pads and tampons, they should be provided.\n\nSomeone would have to explain to me the negative aspect of these items being provided other than increased costs. I also can't imagine that the costs would be enough to make any significant dent in the amount that schools receive from the government via taxes.\n\nThe only difference between items like pads and tampons compared to items like toilet paper and soap is that there is a more embarrassing stigma surrounding the former. So my idea would be to have these items provided in a discreet way that wouldn't be embarrassing for the students. \n\nI think most families would support this as well because again, the students are children. They should be as comfortable as possible in school and I guarantee parents would want that as well. \n\nLets just leave it up to the students. Let them have their voices being heard in an anonymous or discreet way in order to not embarrass them. If the students want this, it's the school and the governments job to deliver for them. That's the bottom line. \n\n",
        "source": "user",
        "start_time": 55.0,
        "end_time": 548.0,
        "last_event_time": 548.0,
        "start_progress": 0.1793911007025761,
        "end_progress": 1.0
    }
]