[
    "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
    "So when they were old enough, she sent them out into the world to seek their fortunes.",
    "You know the story about the first three little pigs.",
    "This is a story about the 92nd little pig.",
    "The 92nd little pig built a house out of depleted uranium.",
    "And the wolf was like, \"dude.",
    "What an incredible house right here!\" The wolf was in awe.",
    "The pig was not trusting of the pig however and was very reluctant to give the wolf any information on the house.",
    "The pig did however accept the compliment, and thanked the wolf.",
    "The wolf asked if he could go inside, to which the pig denied.",
    "\"The inside is not done at this point yet.",
    "I would rather have it finished before showing anybody the indoors.\" said the pig.",
    "The wolf understood, but still could not get the house out of his head.",
    "He longed for house as beautiful and sturdy as the one that stood before him.",
    "If he had a home like this, he would be able to have total security whenever inside his home.",
    "Wolf was devious at heart, and knew that having the strongest house in the village only made him stronger as a villian.",
    "\"Villian\" was not really the word to describe wolf however during the day to day.",
    "The wolf simply had impulses that he needed to indulge in that caused him to become a villian.",
    "He was a villian because he was a wolf, and wolves were villians.",
    "It was in the wolf's dna to want to prey on weaker animals, however the wolf fights against this urge everyday.",
    "The wolf is a good person, but he has a bad side.",
    "Pig knew this, but simply could not trust him because he never knew when he would snap.",
    "Wolf grew lonely as the days went on, and he felt this home would bring him more friends and more happy times.",
    "The security was nice, but the friends were nicer.",
    "The wolf could not get the house out of his mind, and although he did not know exactly how to make the home, he tried his best.",
    "Voila!",
    "The wolf had built a home that looked identical to the pigs.",
    "The pig was impressed.",
    "But the pig knew it was not the same home.",
    "The pig blew to see how sturdy it truly was.",
    "He called on his brothers and twenty other pigs came by.",
    "They all blew, and the wolves house went down.",
    "The wolf looked devastated.",
    "\"Im going to have to try harder\" said the wolf.",
    "\"Sorry.\" said the pig.",
    "But the house is only identical if it can withstand the blow of 92 pigs.",
    "The wolf understood, and began working once again.",
    "Will the wolf be able to complete the home or will this be the sequal to the three little pigs, only reversed and with 92 pigs instead.",
    ""
]