[
    "When you die, you appear in a cinema with a number of other people who look like you.",
    "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
    "The you sitting next to you, leans over and says \"I haven't seen this one before, but I hope the ending is better than the last one.\" He cringes a bit and sits back in his seat as he realizes who he was talking to.",
    "\"What happened in the last one?\" you ask kind of sternly.",
    "\"You'll have to wait and see..\" the other you says back.",
    "You watch as you live your life, making all the same mistakes that you made in your last life.",
    "you find yourself yelling at the screen telling yourself not to do certain things and watching as the \"movie you\" does them anyway.",
    "\"Frustrating, isn't it?\" asks an older looking you.",
    "\"Is this your first viewing?\" he wonders to you.",
    "\"Yes, it is.\" you reply.",
    "\"It gets a lot better.\" he says back, smiling at you.",
    "\"Are you sure?\" you ask.",
    "\"Not really\" he replies.",
    "\"I just know that not everything that happens is as you remember it.\" \"It's like a dream.",
    "You see images that are familiar and you try to remember what they went with.\" There's just enough there for you to notice, but not enough to know what is really happening.\" \n\"So what happens when I get to the end?\" you ask.",
    "\"There is no end.\" you hear the older you say.",
    "\"This has always happened and always will happen.\" \"There is no time here.\"\nYou look back up and realize that you now see \"yourself\" in a car driving down the road.",
    "You never remembered having a car like this.",
    "You notice that the driving \"you\" is having trouble staying awake.",
    "You laugh to yourself and wonder how many times you did the same thing.",
    "Suddenly there is a bright light, some screeching tires and the credits roll on the movie.",
    "\"What happened?\" You ask the older you that you were talking to earlier.",
    "He looks past you and nods to the seat next to you that was empty just moments before.",
    "'Yeah...What happened?\" Said a drowsy and confused looking \"you\" that just arrived.",
    "\"You'll have to watch and see...\" you say to yourself as the next movie begins to play.",
    ""
]