[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?",
        "source": "api"
    },
    {
        "text": "\"\n\n\"Wait what\" I say?",
        "source": "api"
    },
    {
        "text": "!",
        "source": "user"
    },
    {
        "text": "The bee replies again \"Your Majesty, what are your orders\"?",
        "source": "user"
    },
    {
        "text": "Am I going crazy I think.",
        "source": "user"
    },
    {
        "text": "The bee says \"Don't be afraid I am only here to please you\".",
        "source": "user"
    },
    {
        "text": "I'm stunned for a second and say \"Please don't sting me, I am very allergic\".",
        "source": "user"
    },
    {
        "text": "The bee replies, \"Oh that won't be an issue, I would never sting you.",
        "source": "user"
    },
    {
        "text": "\" I think ask \"How can I hear you talk?",
        "source": "user"
    },
    {
        "text": "\" The bee replies, \"You are a very special human, you were born with something called the Beekeepers Gift.",
        "source": "user"
    },
    {
        "text": "\" \"The Beekeepers Gift is a gift that allows you to control the bees\".",
        "source": "user"
    },
    {
        "text": "\"You aren't allergic, your parents didn't want you to know about your gift until you were old enough\" the bee says.",
        "source": "user"
    },
    {
        "text": "You look at the bee and start to wonder, \"Is it possible that I could be a queen?",
        "source": "user"
    },
    {
        "text": "\" He says \"Well no you're more like an ambassador for humans and bees\".",
        "source": "api"
    },
    {
        "text": "I ask, \"Well may I speak to the Queen?",
        "source": "user"
    },
    {
        "text": "\" He says sure and takes me to them.",
        "source": "user"
    },
    {
        "text": "He flies until we reach a colony.",
        "source": "user"
    },
    {
        "text": "I approach nervously because again allergic to bees and the bees bow down.",
        "source": "user"
    },
    {
        "text": "\"Wow is this really happening\", I think to myself.",
        "source": "user"
    },
    {
        "text": "\"Your Majesty, I have brought her\" he says.",
        "source": "user"
    },
    {
        "text": "The queen replies, \"The bees have told me all about her, it is time for the prophecy to come true\".",
        "source": "api"
    },
    {
        "text": "\"Yes I think\" I reply.",
        "source": "api"
    },
    {
        "text": "The Queen Bee then tell me about the bee population.",
        "source": "user"
    },
    {
        "text": "She says due to deforestation and climate change the bees are struggling and I need to help so that their population can be saved.",
        "source": "user"
    },
    {
        "text": "She says that I need to take volunteer bees and go around and start new populations across the continent.",
        "source": "user"
    },
    {
        "text": "My reward would be all the honey I can take to sell to fund this expedition.",
        "source": "user"
    },
    {
        "text": "I agree to fulfill the mission.",
        "source": "user"
    },
    {
        "text": "The next few months I go around the US.",
        "source": "user"
    },
    {
        "text": "Leaving groups of bees where I see fit so that they may flourish.",
        "source": "user"
    },
    {
        "text": "I take the honey to sell to fund the trip.",
        "source": "user"
    },
    {
        "text": "City to city, state to state, coast to coast I go.",
        "source": "user"
    },
    {
        "text": "I finish the mission and go back to the queen.",
        "source": "user"
    },
    {
        "text": "She tells me the mission is a success.",
        "source": "user"
    },
    {
        "text": "She allows me more honey and I become a very successful beekeeper and are allowed to live out my life with the Beekeeper's Gift.",
        "source": "user"
    }
]