[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.",
        "source": "api"
    },
    {
        "text": "\" He wondered how he was going to blow down a house made of uranium.",
        "source": "api"
    },
    {
        "text": "He huffed and he puffed and blew real hard.",
        "source": "user"
    },
    {
        "text": "But it didn't work.",
        "source": "api"
    },
    {
        "text": "The house still stood.",
        "source": "user"
    },
    {
        "text": "The wolf was so angry.",
        "source": "user"
    },
    {
        "text": "He decided he must instead blow up the house in order to get to the little pig.",
        "source": "api"
    },
    {
        "text": "So he called up china, who sent him a ton of dynamite.",
        "source": "user"
    },
    {
        "text": "He planned on using it to blow up the little pig's uranium house.",
        "source": "api"
    },
    {
        "text": "So he picked an evening when he thought the pig would be home and he put the dynamite around the house.",
        "source": "user"
    },
    {
        "text": "He lit the fuse and then ran.",
        "source": "user"
    },
    {
        "text": "The 92nd little pig saw the wolf running away from his house.",
        "source": "user"
    },
    {
        "text": "He knew right away what had happened.",
        "source": "api"
    },
    {
        "text": "But little did the wolf know that this special house was impossible to destroy.",
        "source": "user"
    },
    {
        "text": "So it still stood and the little pig was safe.",
        "source": "user"
    },
    {
        "text": "The next morning the wolf came back to the little pig's house.",
        "source": "user"
    },
    {
        "text": "He decided the pig was a worthy opponent for building such an indestructible house.",
        "source": "api"
    },
    {
        "text": "\"I won't kill you,\" he told the pig.",
        "source": "user"
    },
    {
        "text": "\"I'll bother a different pig instead.",
        "source": "user"
    },
    {
        "text": "\" And from then on the 92nd little pig lived in peace not to be bothered by the wolf again.",
        "source": "user"
    }
]