[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.\"",
        "source": "api"
    },
    {
        "text": "The wolf came to the 92nd little pig's house and said, \"Little pig, little pig, let me come in. The Pig said, \"No way buddy.\"",
        "source": "api"
    },
    {
        "text": "\"",
        "source": "user"
    },
    {
        "text": "The wolf said, \"But I'm hungry.\"",
        "source": "api"
    },
    {
        "text": "The Pig said, \"Well, I'm not going to let you in, so you'll just have to go hungry.\" So the wolf got a crazy idea.",
        "source": "api"
    },
    {
        "text": "He went to the store and bought a bunch of dynamite.",
        "source": "api"
    },
    {
        "text": "He lit the dynamite in an attempt to blow up the house.",
        "source": "user"
    },
    {
        "text": "But the Pig was like, \"Dude, that's not going to work. My house is made out of depleted uranium.\" But nevertheless, the wolf set out to blow the house.",
        "source": "api"
    },
    {
        "text": "It didn't work.",
        "source": "user"
    },
    {
        "text": "After the dynamite went off the house still stood.",
        "source": "user"
    },
    {
        "text": "So the wolf was like, \"Oh, I guess I'll have to try something else.\" Then he came up with another off the wall idea.",
        "source": "api"
    },
    {
        "text": "He went to the store and bought a bunch of grenades.",
        "source": "api"
    },
    {
        "text": "The Pig said, \"if the dynamite didn't work the grenades definitely won't work!\" \"But what will I eat? I'm so hungry!\", the Wolf exclaimed.",
        "source": "user"
    },
    {
        "text": "The Pig said, \"Well, I'm sorry, but I'm not going to let you in. \"Do you have any food?\"",
        "source": "api"
    },
    {
        "text": "\" asked the Wolf.",
        "source": "user"
    },
    {
        "text": "\"No,\" said the Pig.",
        "source": "api"
    },
    {
        "text": "\"Well, I'm going to go to the store and get some food.\" So the Wolf went to the store instead and bought some sandwiches.",
        "source": "api"
    },
    {
        "text": "He brought them back to share with the Pig.",
        "source": "user"
    },
    {
        "text": "The Pig said, \"I'm sorry, but I'm not going to let you in. \"Even for some sandwiches?\"",
        "source": "api"
    },
    {
        "text": "\" asked the Wolf.",
        "source": "user"
    },
    {
        "text": "So the pig went outside and had a sandwich with the Wolf.",
        "source": "user"
    },
    {
        "text": "Then the wolf said, \"I'm still hungry.\" And then he ate the Pig as well.",
        "source": "api"
    },
    {
        "text": "The Wolf went on his way fat and happy.",
        "source": "user"
    }
]