[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "When the aliens invaded over 50 years ago, it caught humanity by surprise.",
        "source": "user"
    },
    {
        "text": "We used to think that we were alone in this vast universe, but we were sorely mistaken.",
        "source": "user"
    },
    {
        "text": "As magical beings, humanity had always had a firm grasp on on our magical powers.",
        "source": "user"
    },
    {
        "text": "As our world grew, our magical powers began to wither away.",
        "source": "user"
    },
    {
        "text": "The mana pool, where humanity gained its magical powers from, was not sufficient enough to sustain the population on our planet as it grew beyond 7 billion.",
        "source": "user"
    },
    {
        "text": "Our government had tried for years to limit the birth of children in order to maintain our magical powers to a certain degree, but progress was too slow.",
        "source": "user"
    },
    {
        "text": "Most of our magical powers were mere shadows of what they used to be.",
        "source": "user"
    },
    {
        "text": "The supply of mana could not power our magical ambitions.",
        "source": "user"
    },
    {
        "text": "As morbid as it sounds, some humans saw the alien invasion as an opportunity to start over, a clean slate.",
        "source": "user"
    },
    {
        "text": "The alien invaders enslaved humanity and killed countless others on their conquest of our planet.",
        "source": "user"
    },
    {
        "text": "As the human population decreased, the mana pool began to have a greater effect on our powers once more.",
        "source": "user"
    },
    {
        "text": "The remaining humans began to band together in small communities, and used their powers for the betterment of humanity.",
        "source": "user"
    },
    {
        "text": "The betterment of humanity meant fighting against our alien masters, taking back our planet.",
        "source": "user"
    },
    {
        "text": "Our small communities learned to combine our powers and mana, to conjure devastating powers.",
        "source": "user"
    },
    {
        "text": "Our powers are evolving in ways we never thought possible.",
        "source": "user"
    },
    {
        "text": "We had to plan our counter attack carefully because we could not risk getting discovered, or worse, killed.",
        "source": "user"
    },
    {
        "text": "We had to come up with a way for us to wipe out the aliens quickly and quietly.",
        "source": "user"
    },
    {
        "text": "The aliens had learned to harness mana and had hoarded a large supply of it in their main base of operations.",
        "source": "user"
    },
    {
        "text": "If we could destroy their main supply of mana, we could cripple their operations.",
        "source": "user"
    },
    {
        "text": "We had been successful in planting a mole within their alien ranks, which gave us a window into their operations.",
        "source": "user"
    },
    {
        "text": "We knew the best time to attack is when they are at their weakest, in the middle of a new moon.",
        "source": "api"
    },
    {
        "text": "The new moon weakened their bodies to a point of hibernation, which was the perfect window of attack.",
        "source": "user"
    },
    {
        "text": "We had to strike now, before they were fully prepared for the new moon.",
        "source": "api"
    },
    {
        "text": "On the dawn of the new moon, our mole and a few of our soldiers planted an explosive, magic bomb at the alien mana source.",
        "source": "user"
    },
    {
        "text": "They managed to escape before the explosion.",
        "source": "user"
    },
    {
        "text": "The explosion was loud and bright.",
        "source": "user"
    },
    {
        "text": "The aliens were weak and feeble without their source of mana.",
        "source": "user"
    },
    {
        "text": "We began our attack by sending in our soldiers, wiping out the aliens quickly.",
        "source": "user"
    },
    {
        "text": "Our soldiers were armed with magic guns, which harnessed our newly found powers.",
        "source": "user"
    },
    {
        "text": "The fighting progressed throughout the night, with humanity gaining more and more victories.",
        "source": "user"
    },
    {
        "text": "The aliens became desperate and began to use their most powerful weapons.",
        "source": "user"
    },
    {
        "text": "The weapons were no match for our magical powers, proving to have no effect on us.",
        "source": "user"
    },
    {
        "text": "Our soldiers were able to subdue the remaining aliens with ease.",
        "source": "user"
    },
    {
        "text": "By morning, the alien camps had been wiped out entirely and we regained our foothold on our planet.",
        "source": "user"
    },
    {
        "text": "When we finally had control of our planet, the government decided to divide it up into small communities.",
        "source": "user"
    },
    {
        "text": "Many of us had lost many loved ones, but gained our magical powers in return.",
        "source": "user"
    },
    {
        "text": "To some of us it was a fair exchange, to others it was a grim reminder of our dark past.",
        "source": "user"
    },
    {
        "text": "Although we had finally gained our freedom, the memories of the 5 years of captivity would remain with us forever.",
        "source": "user"
    },
    {
        "text": "We had to push forward and rebuild our beautiful planet once more.",
        "source": "user"
    }
]