[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "Now the truth was out.",
        "source": "user"
    },
    {
        "text": "I am at once chagrined and relieved.",
        "source": "user"
    },
    {
        "text": "Ok, so really I KNEW I wasn't really number one.",
        "source": "user"
    },
    {
        "text": "I knew it, my kid didn't though.",
        "source": "user"
    },
    {
        "text": "Now I have to have a hard talk with Junior.",
        "source": "user"
    },
    {
        "text": "He's always looked up to me, thinking I'm best.",
        "source": "user"
    },
    {
        "text": "Really, I'm far from it.",
        "source": "user"
    },
    {
        "text": "I don't know what I'm really doing half the time.",
        "source": "user"
    },
    {
        "text": "Out of the approx.",
        "source": "user"
    },
    {
        "text": "1 1/2 million cup holders, (this is ONLY the surviving legible relics really, broken ones that are unreadable are excluded from ranking, eliminating a surprising number of crockery.",
        "source": "user"
    },
    {
        "text": ") my rank is lowly, but not in awful company.",
        "source": "user"
    },
    {
        "text": "I'm in the middle, at a ranking of 767,198 I'm above a surprising number.",
        "source": "user"
    },
    {
        "text": "To me, no shock, to Junior, a question that now is raised, makes him curious and a bit hurt.",
        "source": "user"
    },
    {
        "text": "Junior seems more hurt than I would have imagined.",
        "source": "user"
    },
    {
        "text": "Ok, so this is what I'll say.",
        "source": "user"
    },
    {
        "text": "I'm writing this out here, so I can refine it and perhaps change my mind before it's too late.",
        "source": "user"
    },
    {
        "text": "\"Son, I'm not really number one here.",
        "source": "user"
    },
    {
        "text": "Your mother is really, so you know this right?",
        "source": "api"
    },
    {
        "text": "\": I imagine him saying yes or nodding in agreement here.",
        "source": "user"
    },
    {
        "text": "\"Well, the worlds a big place.",
        "source": "user"
    },
    {
        "text": "There are more men (and a few women) that are better fathers, for sure.",
        "source": "user"
    },
    {
        "text": "They give up all their dreams to father and mentor.",
        "source": "user"
    },
    {
        "text": "I DO NOT do this.",
        "source": "user"
    },
    {
        "text": "I follow my own path, allowing you to  sort of fend for yourself more than I should.",
        "source": "user"
    },
    {
        "text": "I disagree with experts, letting you do too many dumb things.",
        "source": "user"
    },
    {
        "text": "I also make way too many mistakes.",
        "source": "user"
    },
    {
        "text": "But, you know, if I had to do it all over again?",
        "source": "user"
    },
    {
        "text": "I'd not change things.",
        "source": "api"
    },
    {
        "text": "I Love you for you.",
        "source": "api"
    },
    {
        "text": "I want you to do your best and It's my opinion that I should just do what I can to help out.",
        "source": "user"
    },
    {
        "text": "I'm too selfish though, really, that's true.",
        "source": "user"
    },
    {
        "text": "I just want you to understand that I love you but I'm not perfect.",
        "source": "user"
    },
    {
        "text": "Please don't imagine I'm better than I am.",
        "source": "user"
    },
    {
        "text": "Just love me for me, and I'll love you for you.",
        "source": "user"
    },
    {
        "text": "I'm not sure how this will affect our relationship, but I hope it can be better.",
        "source": "user"
    },
    {
        "text": "\" \"I love you, and I hope we can still go on from here.",
        "source": "api"
    },
    {
        "text": "\"\n",
        "source": "user"
    }
]