[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?\"",
        "source": "api"
    },
    {
        "text": "I almost spat the bee right there because I was so scared of it having the capability to talk.",
        "source": "user"
    },
    {
        "text": "I examined the bee.",
        "source": "user"
    },
    {
        "text": "I realized it wasn't possible for it to talk.",
        "source": "user"
    },
    {
        "text": "I examined it further, almost close to my eye I see that it has robotic parts.",
        "source": "user"
    },
    {
        "text": "This bee is not a living creature.",
        "source": "user"
    },
    {
        "text": "It's a robot!",
        "source": "user"
    },
    {
        "text": "\"Who made you?\" I asked the bee robot.",
        "source": "user"
    },
    {
        "text": "\"Why are you here?\"",
        "source": "user"
    },
    {
        "text": "\"I am the Bee Robot. I am here to answer and serve you.\" said the bee robot.",
        "source": "api"
    },
    {
        "text": "Not convinced, I tried to look for any off switch.",
        "source": "user"
    },
    {
        "text": "I finally found the off switch and pressed it.",
        "source": "user"
    },
    {
        "text": "I took it back home and studied it, carefully hiding it from my mother who said I was allergic to bees.",
        "source": "user"
    },
    {
        "text": "Maybe she knows something, maybe she's doing this to protect me.",
        "source": "user"
    },
    {
        "text": "But I went on to my room and studied the small bee.",
        "source": "user"
    },
    {
        "text": "I gotten a magnifying glass and printed to the back of the bee says, \"Copyright 2011, Bee Robot Inc.\"",
        "source": "user"
    },
    {
        "text": "\"Bee Robot, Inc.?\" I murmured.",
        "source": "user"
    },
    {
        "text": "I also noticed those bolded initials.",
        "source": "user"
    },
    {
        "text": "BRI.",
        "source": "user"
    },
    {
        "text": "Those were the initials of my dad.",
        "source": "user"
    },
    {
        "text": "I decided to confront my mom about it.",
        "source": "user"
    },
    {
        "text": "\"He built the company to protect you, honey.\" Mom said.",
        "source": "user"
    },
    {
        "text": "\"Originally, that was the plan.\"",
        "source": "user"
    },
    {
        "text": "But not all plans go smoothly, I suppose.",
        "source": "user"
    },
    {
        "text": "She explained that my dad died creating the company as the bees have now gone autonomous and learn among themselves.",
        "source": "user"
    },
    {
        "text": "It was created to protect me, but now it has gone on a rampage against all the people I know, my friends and family.",
        "source": "user"
    },
    {
        "text": "That's why we were always moving.",
        "source": "user"
    },
    {
        "text": "That's why we were always told to not touch them.",
        "source": "user"
    },
    {
        "text": "That's why I always see people being killed by bees in the news.",
        "source": "user"
    },
    {
        "text": "It has been years since my father's death.",
        "source": "user"
    },
    {
        "text": "And the human population is deteriorating.",
        "source": "user"
    },
    {
        "text": "Do not touch the bees.",
        "source": "user"
    }
]