[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.\" The wolf yelled at the pig and said it was unfair because uranium can't be blown down.",
        "source": "api"
    },
    {
        "text": "The pig had studied on the internet and done a ton of research after seeing all the other pigs in the community have their houses blown down by the wolf.",
        "source": "user"
    },
    {
        "text": "That would caused the entire home to collapse.",
        "source": "user"
    },
    {
        "text": "It was difficult to obtain uranium but luckily for the pig, he was able to find some on Amazon.",
        "source": "user"
    },
    {
        "text": "He also had a ton of experience building homes.",
        "source": "user"
    },
    {
        "text": "The wolf went back to his house and tried to do some research of his own.",
        "source": "user"
    },
    {
        "text": "He had to figure out what could destroy uranium.",
        "source": "user"
    },
    {
        "text": "The internet is an amazing place because the wolf was able to figure out that water destroys uranium.",
        "source": "user"
    },
    {
        "text": "The wolf just had to figure out how to get enough water to the pigs home.",
        "source": "user"
    },
    {
        "text": "He did some thinking and went back online.",
        "source": "user"
    },
    {
        "text": "He did research and figured the best way to do this is to rent a water truck.",
        "source": "user"
    },
    {
        "text": "A water truck is a big truck that has a hose similar to a firetruck.",
        "source": "user"
    },
    {
        "text": "The wolf planned to drive the water truck to the pigs home and spray the home with water.",
        "source": "user"
    },
    {
        "text": "The wolf drove to the pigs home and got out of the water truck.",
        "source": "user"
    },
    {
        "text": "He turned the hose and sprayed the home and to his dismay, the house didn't collapse like the internet said it would.",
        "source": "user"
    },
    {
        "text": "The pig came out of his house and was laughing at the wolf.",
        "source": "user"
    },
    {
        "text": "He explained to him that the house wasn't actually made of depleted uranium.",
        "source": "user"
    },
    {
        "text": "He would never tell the wolf the material of the home because he knew the wolf would go straight to the internet to find out how to ruin his house.",
        "source": "user"
    },
    {
        "text": "The pig tells the wolf to leave him and his house alone.",
        "source": "user"
    },
    {
        "text": "The wolf gets extremely mad at this and tells the pig that he will figure out the material and will destroy the house before this is all done with.",
        "source": "user"
    },
    {
        "text": "The wolf goes back home to research but for now the little pig has finally gotten one over on the wolf.",
        "source": "user"
    }
]