[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "You have spent a life making sure you eat right, exercise and make all the health improvements money can buy, hoping to squeeze out a few more years and remain with your love, Mark.",
        "source": "api"
    },
    {
        "text": "Mark had been having these splitting headaches years ago.",
        "source": "user"
    },
    {
        "text": "He thought it was just from listening to loud music and staying out late at night and overdoing the alcohol.",
        "source": "user"
    },
    {
        "text": "I have made every allowance, but lately Mark has trouble just being in a room where even the slightest volume of music or Video.",
        "source": "user"
    },
    {
        "text": "Only able to venture out of his quietened now soundproof room to go to the restroom.",
        "source": "user"
    },
    {
        "text": "I have been trying to keep him comfortable, but now we are running out of time.",
        "source": "user"
    },
    {
        "text": "He seems to worsen by the day and finally the government is admitting that the senses have been honed with the drug, made more and more fine, so that it usually ends in madness.",
        "source": "api"
    },
    {
        "text": "Hearing minute sounds, such as an insect crossing the top of the roof, water running through pipes.",
        "source": "user"
    },
    {
        "text": "Even the soundproofing doesn't work.",
        "source": "user"
    },
    {
        "text": "He can't stand to have me in the house at all.",
        "source": "user"
    },
    {
        "text": "He claims he can hear my heartbeat.",
        "source": "user"
    },
    {
        "text": "The newest development is the most troubling.",
        "source": "user"
    },
    {
        "text": "He feels the people he is near - or even in our block, they are trying to madden him, out to get him, for simply walking down the street.",
        "source": "user"
    },
    {
        "text": "Mark isn't unique in this, all those who are younger than 4 years under my age have the same issue.",
        "source": "user"
    },
    {
        "text": "Those people are all mad.",
        "source": "user"
    },
    {
        "text": "They have created a class of insane persons with no where to go, simply out and howling at the moon, or sun, or whatever.",
        "source": "user"
    },
    {
        "text": "They are certain everyone else is out to get them.",
        "source": "user"
    },
    {
        "text": "Sure they are being plotted against, now some of them have gotten weapons.",
        "source": "user"
    },
    {
        "text": "They have turned on us, themselves, everyone, whether treated or not.",
        "source": "user"
    },
    {
        "text": "Our days are all numbered, there MIGHT be hope for a few younger people who opted out.",
        "source": "user"
    },
    {
        "text": "There is a remote island, the insane won't go near it because the waves madden them.",
        "source": "user"
    },
    {
        "text": "I have been trying to get Mark to go there, but he is too afraid of the water.",
        "source": "user"
    },
    {
        "text": "He hears it, he also snarls at me now when I near.",
        "source": "api"
    },
    {
        "text": "I simply have to make the Cocktail, we have to drink it to end it all together.",
        "source": "user"
    },
    {
        "text": "I'm too old to start over and he's just too crazy, we can't go on.",
        "source": "user"
    },
    {
        "text": "This is the end.",
        "source": "user"
    }
]