[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?",
        "source": "api"
    },
    {
        "text": "\" At first you think your mind is playing tricks on you.",
        "source": "api"
    },
    {
        "text": "\"Who said that?",
        "source": "user"
    },
    {
        "text": "\" you ask nervously.",
        "source": "user"
    },
    {
        "text": "The bee looks at you and says \"I did, Your Majesty.",
        "source": "user"
    },
    {
        "text": "\" You jump up in terror.",
        "source": "api"
    },
    {
        "text": "You feel like you're in a dream and wonder if you might be losing your mind.",
        "source": "user"
    },
    {
        "text": "\"Is this some kind of joke or prank?",
        "source": "user"
    },
    {
        "text": "\" you cry out, barely able to control your own voice.",
        "source": "user"
    },
    {
        "text": "The bee looks at you with his tiny black eyes and says \"No, Your Majesty\".",
        "source": "user"
    },
    {
        "text": "\"Why do you keep calling me that\" you ask.",
        "source": "api"
    },
    {
        "text": "The bee looks at you and says \"Because you are the Queen of the Bees, Your Majesty.",
        "source": "user"
    },
    {
        "text": "\"What does that mean?",
        "source": "api"
    },
    {
        "text": "\" you exclaim \"how could that even be possible?",
        "source": "user"
    },
    {
        "text": "\" The bee looks at you and says \"You are the last of the royal line\".",
        "source": "user"
    },
    {
        "text": "As you talk to the bee it reveals the amazing story about the true nature of bees.",
        "source": "api"
    },
    {
        "text": "You learn that bees are really alien lifeforms that came to earth and adopted the form of bees in order to help plants thrive on this planet.",
        "source": "user"
    },
    {
        "text": "You also came from that alien planet as a baby and are in fact the queen of the bee race.",
        "source": "user"
    },
    {
        "text": "Now it is time to take your place and lead the bees in their work to spread life across the universe.",
        "source": "user"
    }
]