[
    "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
    "Your government decides to give the drug to all citizens under 26, but you and the rest of the \"Lost Generations\" are deemed too high-risk.",
    "When you're 85, the side effects are finally discovered.",
    "You're given the choice of taking the drug or dying.",
    "If you take the drug, there is still a chance of dying due to old age.",
    "If you don't, you'll die anyway.",
    "You decide to take the drug.",
    "One week after taking the drug, I have survived.",
    "I have been given a second chance at life.",
    "I have been given a second chance to make the world a better place.",
    "I set out to find ways to make a difference in the world.",
    "I have decided to use my time to help the world.",
    "Just then, there's a knock at the door.",
    "I open the door and there is a man standing there.",
    "He tells me that he is here to take me to the government.",
    "\"I don't have an appointment with the government.\"\n\n\"No,\" the man says.",
    "\"You work there now.\" \n\n\"What?\" I ask.",
    "\"When you took the drug, you consented to 5 years of service.",
    "Didn't you read the form?\" \n\n\"I don't remember signing a form.\"\n\nThe man sighs.",
    "\"You were given a form when you took the drug.",
    "Look, I don't have time to get into legal stuff with you.",
    "I'm just your driver.",
    "We gotta go.\"\n\nI sighed.",
    "Well, I wanted to make a difference.",
    "Let's get to work, I thought.",
    "I grabbed my coat and followed the man to the car.",
    "Once I was buckled in, I asked, \"So, what's my job?\" \n\nThe man said nothing.",
    "He just started the car and drove away.",
    "\"I didn't bring a lunch or anything.",
    "Will there be a cafeteria there?",
    "At work?\" I asked.",
    "Again, the man said nothing.",
    "The man drove for hours.",
    "We were in the middle of nowhere.",
    "Finally, we arrived at a building.",
    "The man led me inside and we walked down a long hallway.",
    "He stopped at a door and opened it.",
    "When he opened it, I saw a man standing there in a suit.",
    "Not just any man.",
    "It was the President.",
    "\"Welcome to the government,\" he said.",
    "\"And welcome to your first day at work.\" \n\n\"What is my job?\" I asked.",
    "\"This is your job.",
    "My job.\" he said.",
    "\"You are now the President of the United States.\"\n\n\"Why me?\" \n\n\"You're the only one who can do this job.",
    "We chose you out of many.",
    "We think you are ready.",
    "Welcome aboard, Mrs.",
    "President.\"\n"
]