[
    "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
    "So when they were old enough, she sent them out into the world to seek their fortunes.",
    "You know the story about the first three little pigs.",
    "This is a story about the 92nd little pig.",
    "The 92nd little pig built a house out of depleted uranium.",
    "And the wolf was like, \"dude.\" That's going to be too hard to blow down.",
    "So the wolf huffed and puffed and blew down every other house in the neighborhood, but he was unable to blow down the 92nd little pig's house.",
    "He decided to go online and do some research on techniques to blow down houses.",
    "He spent hours on Youtube watching wolves use different techniques.",
    "He eventually decided most of them were just click bait and didn't really work.",
    "Then he came across one that looked promising.",
    "It took a lot of inner focus, kind of like karate.",
    "So the wolf went to his dojo, took some deep breaths, and then attempted to blow down the house.",
    "It didn't budge.",
    "He next decided to try going on Facebook and see if he could find any enemies of the 92nd little pig.",
    "He quickly realized that the 92nd little pig had made enemies of several of his brothers.",
    "They were more than happy to meet the wolf to try and help him.",
    "They met outside of the 92nd little pig's house.",
    "The pig leaned out of his window upon seeing them.",
    "\"Really, guys?\" said the 92nd little pig.",
    "That just angered them.",
    "The pigs began trying to help blow it down.",
    "They weren't good at it naturally, but they tried.",
    "And after a while they needed to take a break.",
    "They decided they would try all doing it at the same time.",
    "They got into a circle, held hands and began blowing as hard as they could.",
    "It worked!",
    "The house came apart, sending the 92nd little pig running angrily outside.",
    "He then stopped, looking at the destruction.",
    "\"You guys have a good technique.\" said the 92nd little pig.",
    "\"Thanks, we worked well together.\" said the wolf.",
    "\"You know who we should use this on?",
    "That 94th little pig.",
    "He thinks he is so much better than us with that gold house.",
    "You guys in?\"\n\nEveryone nodded in complete agreement.",
    "So the group went on their way, joined in their hatred of a new common enemy.",
    ""
]