[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?",
        "source": "api"
    },
    {
        "text": "\" \n\n\nWhat do you do?",
        "source": "api"
    },
    {
        "text": "\"I don't understand.",
        "source": "api"
    },
    {
        "text": "Are you talking to me?",
        "source": "user"
    },
    {
        "text": "\" you ask the bee.",
        "source": "user"
    },
    {
        "text": "You are terrified this thing is going to sting you and ultimately cause your death.",
        "source": "user"
    },
    {
        "text": "Frozen with fear, you hear a voice reply \"I am speaking to you, your Excellence.",
        "source": "user"
    },
    {
        "text": "You are the controller of the bees, and I need to know what your next wish is for our colony.",
        "source": "user"
    },
    {
        "text": "\"   \"I don't know what you're talking about, I'm deathly allergic to bees.",
        "source": "user"
    },
    {
        "text": "\"That isn't true, sir.",
        "source": "api"
    },
    {
        "text": "It's a lie that has been perpetrated and told to you to keep you from knowing your true identity and purpose,\" said the small yellow fellow.",
        "source": "user"
    },
    {
        "text": "You are taken aback by this, but then you notice the bee is moving away from you.",
        "source": "user"
    },
    {
        "text": "\"You need to follow me.",
        "source": "api"
    },
    {
        "text": "I have something to show you which has been hidden from you all of your life.",
        "source": "user"
    },
    {
        "text": "\" The bee begins to sly towards the tree line on you property.",
        "source": "user"
    },
    {
        "text": "Hesitantly, you decide to follow.",
        "source": "user"
    },
    {
        "text": "Once at the edge of the forest, the bee again lands on your shoulder.",
        "source": "user"
    },
    {
        "text": "It's tiny voice seems to be directly in you ear.",
        "source": "user"
    },
    {
        "text": "Telling you which way to go.",
        "source": "user"
    },
    {
        "text": "You are walking deeper into the woods, and you finally arrive at the mouth of a cave.",
        "source": "user"
    },
    {
        "text": "You have been in these woods so many times in your life, but never noticed this small opening.",
        "source": "user"
    },
    {
        "text": "\"To find out who you really are you must venture into the darkness.",
        "source": "user"
    },
    {
        "text": "Only then can you be illuminated with the knowledge of your existence,\" said the tiny bee.",
        "source": "user"
    },
    {
        "text": "The cave is dark, but you can see the walls are covered in carvings.",
        "source": "user"
    },
    {
        "text": "As you walk through the cave, you begin to understand what the carvings are.",
        "source": "api"
    },
    {
        "text": "You see images of massive amounts of bees roaming freely, happy in their existence in the world.",
        "source": "api"
    },
    {
        "text": "Then, there appears to bee some type of massive destruction, and the bees are suffering in the images and dying.",
        "source": "user"
    },
    {
        "text": "As you continue to peer at the carvings, you come upon a person surrounded by rays.",
        "source": "user"
    },
    {
        "text": "This person has your face!",
        "source": "user"
    },
    {
        "text": "They look so strong and determined.",
        "source": "user"
    },
    {
        "text": "You continue to walk further into the cave hoping to find out the meaning of the bee's cryptic words.",
        "source": "user"
    },
    {
        "text": "What you find next causes you to freeze in your tracks.",
        "source": "user"
    },
    {
        "text": "The carving shows the person directing the rays of light towards other humans.",
        "source": "api"
    },
    {
        "text": "The light is shown wiping out factories and massive buildings.",
        "source": "user"
    },
    {
        "text": "You realize you are the Keeper of the Bees and the person meant to save them from extinction.",
        "source": "user"
    },
    {
        "text": "You gather your courage and exit the darkness with the new awareness of who you are.",
        "source": "user"
    },
    {
        "text": "\"I know our next move,\" you tell the bee.",
        "source": "user"
    },
    {
        "text": "\"Shall I ready the troops, sir,\" the small creature asks.",
        "source": "user"
    },
    {
        "text": "You nod in reply.",
        "source": "user"
    },
    {
        "text": "You are determined to fulfill the prophecy of the carvings and wipe out the polluters and destroyers of the environment.",
        "source": "user"
    }
]