[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the \"Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "There is still hope.",
        "source": "api"
    },
    {
        "text": "Recently, a plant was discovered that has the powers to not only stop aging, but reverse it.",
        "source": "user"
    },
    {
        "text": "The catch: it only grows in a remote rain forest.",
        "source": "user"
    },
    {
        "text": "There are many people willing to risk their lives to go to the rain forest to get the plant.",
        "source": "api"
    },
    {
        "text": "You want to do it, too.",
        "source": "user"
    },
    {
        "text": "The team sets off for the rain forest.",
        "source": "api"
    },
    {
        "text": "Among them is a botanist that hopes to succeed at growing more of the magical plants.",
        "source": "user"
    },
    {
        "text": "The team travels for weeks and many are lost to disease, animal attacks, and the elements.",
        "source": "user"
    },
    {
        "text": "By the time they reach the plant, the team only has 3 people left.",
        "source": "api"
    },
    {
        "text": "The leader, the botanist, and you.",
        "source": "user"
    },
    {
        "text": "The chances of making it back alive are lower than ever.",
        "source": "api"
    },
    {
        "text": "If you find the plant, will you be able to get home?",
        "source": "user"
    },
    {
        "text": "The team decides to continue on their mission.",
        "source": "api"
    },
    {
        "text": "One beautiful morning, they finally reach their destination.",
        "source": "user"
    },
    {
        "text": "The plants are growing wild!",
        "source": "user"
    },
    {
        "text": "\"We should test it,\" the botanist says, \"before we harvest it all.",
        "source": "api"
    },
    {
        "text": "\" The botanist gathers a sample of leaves and crushes them in a mortar and pestle.",
        "source": "api"
    },
    {
        "text": "He mixes the contents in a test tube with water, and begins to shake it.",
        "source": "user"
    },
    {
        "text": "He looks at the solution and says nothing.",
        "source": "api"
    },
    {
        "text": "He removes the cap of the test tube and takes a sip of the mixture.",
        "source": "user"
    },
    {
        "text": "In an instant, he begins to age rapidly.",
        "source": "user"
    },
    {
        "text": "The remaining teammates gasp in horror.",
        "source": "api"
    },
    {
        "text": "The leader runs to the botanist, who now looks like a frail, old man.",
        "source": "user"
    },
    {
        "text": "\"What happened?",
        "source": "api"
    },
    {
        "text": "What have you done?",
        "source": "api"
    },
    {
        "text": "\" The botanist pulls the leader's face close to his and says, \"I'm sorry.",
        "source": "user"
    },
    {
        "text": "I think the map was upside down.",
        "source": "api"
    },
    {
        "text": "We're in the wrong valley.",
        "source": "user"
    },
    {
        "text": "\" \n\nSuddenly, the botanist begins to cough up blood.",
        "source": "user"
    },
    {
        "text": "He takes his last breath, and then dies.",
        "source": "api"
    },
    {
        "text": "The leader, now in a state of panic, runs to the nearest tree.",
        "source": "user"
    },
    {
        "text": "He climbs it, and surveys the surrounding area.",
        "source": "api"
    },
    {
        "text": "He drops his arms at his side.",
        "source": "api"
    },
    {
        "text": "\"It's no use.",
        "source": "api"
    },
    {
        "text": "There's no way out.",
        "source": "user"
    },
    {
        "text": "\" He sat on the tree branch and began to pray.",
        "source": "user"
    },
    {
        "text": "Suddenly, a small, purple plant grows from the ground.",
        "source": "user"
    },
    {
        "text": "He reached down to pick it up, but before he could even touch it, it blossomed and the botanist came back to life.",
        "source": "api"
    },
    {
        "text": "They were in the right valley after all.",
        "source": "user"
    }
]