[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "The US learned the hard way, not to trust other political powers.",
        "source": "user"
    },
    {
        "text": "It is difficult to imagine the CIA without operatives in other nations.",
        "source": "user"
    },
    {
        "text": "What was the government thinking?",
        "source": "user"
    },
    {
        "text": "The author takes the reader through a whirlwind of emotions, while keeping the reader on his toes with action and surprises.",
        "source": "user"
    },
    {
        "text": "You find out that the US did have operatives in other nations, but they were bought off!",
        "source": "user"
    },
    {
        "text": "Some tried to communicate the activities of other nations, but mysteriously disappears.",
        "source": "user"
    },
    {
        "text": "In chapter after chapte.",
        "source": "user"
    },
    {
        "text": "espionage and counter-espionage whirls across the pages of this imaginary tale.",
        "source": "user"
    },
    {
        "text": "Although fictional, one at times believes that various post-war situations could have easily occured.",
        "source": "user"
    },
    {
        "text": "The action and surprises are on the mark.",
        "source": "user"
    },
    {
        "text": "In one part of the suspense,, the author takes the reader on a ride in Russia, where an agent will be sent into the city of Moscow.",
        "source": "user"
    },
    {
        "text": "It depicts accurate attitudes that occured by citizens and the government of Russia after the war.",
        "source": "user"
    },
    {
        "text": "It is a mind-boggling account of the state of the city.",
        "source": "user"
    },
    {
        "text": "Suspicion is the undercurrant of every word spoken; of every action taken.",
        "source": "user"
    },
    {
        "text": "The best part is about the agent.",
        "source": "user"
    },
    {
        "text": "She is a woman and seductress.",
        "source": "user"
    },
    {
        "text": "She is a great character, being incredibly intelligent and sensual.",
        "source": "user"
    },
    {
        "text": "Too many Russians loved her persona, one rarely seen in women in Russia.",
        "source": "user"
    },
    {
        "text": "She won over the hearts and minds of many.",
        "source": "user"
    },
    {
        "text": "At one point, almost predictabily, she felt tempted to disappear with another new identity so she could be with the man she promised herself to not fall in love with.",
        "source": "user"
    },
    {
        "text": "Overall, the book is a real page turner.",
        "source": "user"
    },
    {
        "text": "Enjoy!",
        "source": "user"
    }
]