[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "It causes those who took the drug to become mindless zombies.",
        "source": "api"
    },
    {
        "text": "You and your friends now have to survive as the earth is being overrun by these zombies.",
        "source": "user"
    },
    {
        "text": "It's not a smooth journey.",
        "source": "api"
    },
    {
        "text": "Your group is people who are close to 90 years old trying to evade zombies.",
        "source": "user"
    },
    {
        "text": "Each attack kills a big chunk of the group as they are too weak to fight and too slow to run.",
        "source": "user"
    },
    {
        "text": "So, how do you survive?",
        "source": "user"
    },
    {
        "text": "How do you get your group to safety?",
        "source": "api"
    },
    {
        "text": "I decide to lead the survivors to an island.",
        "source": "user"
    },
    {
        "text": "On the way to the island, we come across a couple of villages that have survived and are willing to help us.",
        "source": "user"
    },
    {
        "text": "They share supplies and give us a place to rest.",
        "source": "api"
    },
    {
        "text": "After a while we end up in front of a row of islands.",
        "source": "user"
    },
    {
        "text": "There's one that stands out as it looks large enough for us to live on.",
        "source": "user"
    },
    {
        "text": "This is where we will settle.",
        "source": "user"
    },
    {
        "text": "We begin setting up little huts and finding food and a water source.",
        "source": "api"
    },
    {
        "text": "It's going pretty well at first.",
        "source": "user"
    },
    {
        "text": "But then, a group of people arrives on their yacht.",
        "source": "user"
    },
    {
        "text": "It's another group of seniors.",
        "source": "api"
    },
    {
        "text": "They however are rich and demand the island for themselves.",
        "source": "user"
    },
    {
        "text": "They claim my group are just squatters and that we've taken more than our share.",
        "source": "user"
    },
    {
        "text": "A fight ends up developing.",
        "source": "api"
    },
    {
        "text": "It's quite a sight to see.",
        "source": "user"
    },
    {
        "text": "People are falling and breaking their hips.",
        "source": "user"
    },
    {
        "text": "Others are just sitting down to catch their breath.",
        "source": "user"
    },
    {
        "text": "This ends up catching the attention of the zombies who are on the mainland.",
        "source": "user"
    },
    {
        "text": "Many gather, watching in amusement.",
        "source": "user"
    },
    {
        "text": "My group and the other seniors make an uneasy truce.",
        "source": "user"
    },
    {
        "text": "We'll live together on the island and just avoid each other.",
        "source": "api"
    },
    {
        "text": "We realize we don't have much time left to live anyway so we may as well not spend our last days fighting.",
        "source": "user"
    },
    {
        "text": "The zombies would enjoy watching it too much.",
        "source": "user"
    }
]