[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "The aliens have been abducting humans for years, but no one has ever noticed.",
        "source": "api"
    },
    {
        "text": "They take people now and again when it suits them.",
        "source": "api"
    },
    {
        "text": "They are not interested in the humans themselves, but in their technology.",
        "source": "user"
    },
    {
        "text": "They think Matt Damon will be of value to them.",
        "source": "api"
    },
    {
        "text": "The aliens are a little disappointed when they find out that Matt Damon is not a scientist or a physicist.",
        "source": "user"
    },
    {
        "text": "They have bee watching him for a long time and expected him be like he is in the movies.",
        "source": "api"
    },
    {
        "text": "They are also disappointed to learn that Matt Damon is not a good fighter.",
        "source": "user"
    },
    {
        "text": "Matt Damon is not of much value to the aliens and now humanity is on to the aliens because they want Matt Damon back.",
        "source": "api"
    },
    {
        "text": "The aliens have to return Matt Damon which is fine really because he is of little value to them.",
        "source": "user"
    },
    {
        "text": "But first they have to wipe his memory so he will not tell the humans of the aliens.",
        "source": "user"
    },
    {
        "text": "Matt Damon is returned to the human race, but he has no memory of what happened to him.",
        "source": "user"
    },
    {
        "text": "He also has no memory of his current work projects so he sadly is fired from all of his wok because he cannot do a good job.",
        "source": "api"
    },
    {
        "text": "Matt Damon is a little upset about this, but he is also a little relieved.",
        "source": "user"
    },
    {
        "text": "He kind of always wanted to know what it would be like to live as someone who was not a movie star.",
        "source": "api"
    },
    {
        "text": "Matt Damon has a little money saved up so he decides to take a year off and live as a normal person.",
        "source": "user"
    },
    {
        "text": "After that year he never goes back to movies.",
        "source": "api"
    },
    {
        "text": "No one ever finds out what really happened to him.",
        "source": "user"
    }
]