[
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.21999256781865478
    },
    {
        "text": "Is It Wrong to Focus on Animal Welfare When Humans Are Suffering?\n\nWould you be surprised to hear that a study found that research subjects were more upset by stories of a dog beaten by a baseball bat than of an adult similarly beaten? Or that other researchers found that if forced to choose, 40 percent of people would save their pet dog over a foreign tourist.\n\nWhy do you think many people are more empathetic toward the suffering of animals than that of people? In your opinion, is it wrong to focus on animal welfare when humans are suffering? Why do you think so?\n\n---\n\nIn my opinion, I am not surprised at all that humans have empathy for animals compared to strangers. Most of us who have pets consider animals to be part of our family. If an animal is getting beaten, it doesn't really have a way to defend itself. A human has the ability to defend itself and to fight back. Humans are stronger and more powerful than most animals so it would be disgusting to harm one. \n\nI also don't think it has to be a black and white issue. We should care about both humans suffering as well as an animal's welfare. For whatever reason, we as humans just love dogs. I love my dog. He is the best dog in the world in my opinion. I consider him to be my family. And I'm not sure why I feel that way, I just do. \n\nI want to do everything I can to stop animal cruelty and I also want to do everything I can to prevent humans from suffering. The problem is no matter how hard we try, it will be impossible to eradicate either issue from our world. There are always going to be bad human beings in this world that like to cause harm to both people and animals. Those people absolutely disgust me and should be in jail.\n\nThink about how many people are murdered each day. Think about how many people are robbed at gunpoint. Think about how many animals are just dropped off on the side of the road. A bunch of people are heartless and have no conscience. There is always going to be evil in this world sadly.\n\nWhat us good people can do is help our fellow man and give love and care to our animals. We also can say something if we see something. If I see a person or an animal being mistreated, I'm going to step in every time and try to correct that wrong. \n\nHuman beings love things that we can take care of. That includes our family, our friends and our animals. We also love things that love us back and once again our friends, family and animals give us that love back. We have an emotional bond and a strong connection with them that can't be replaced. \n\nAs humans we can care about humans and animals at the same time. That is what I have done my entire life and that is not going to change. \n",
        "source": "user",
        "start_time": 39.0,
        "end_time": 548.0,
        "last_event_time": 548.0,
        "start_progress": 0.21999256781865478,
        "end_progress": 1.0
    }
]