[
    "Your entire life, you've been told you're deathly allergic to bees.",
    "You've always had people protecting you from them, be it your mother or a hired hand.",
    "Today, one slips through and lands on your shoulder.",
    "You hear a tiny voice say \"Your Majesty, what are your orders?\" \n\nWhat do you do?",
    "It's not every day that a bee talks to you.",
    "The bee is a magical bee, and it can grant you one wish.",
    "That's how it can prove to you just how important you are.",
    "What do you wish for?",
    "You could wish for money.",
    "You could wish to live forever.",
    "You could wish for a million wishes.",
    "That probably isn't allowed though.",
    "Your Mother approaches and sees what is happening.",
    "She looks nervous.",
    "\"Did you make your wish yet?\" she asks.",
    "\"How did you know?\" you ask.",
    "She sighs.",
    "\"Once they offer you a wish, you must take it.",
    "I tried to keep you from this as long as I could.\"\n\n\"Why is a wish so bad?\" I ask.",
    "\"Because you can't wish for anything good,\" she says.",
    "Not quite understanding, you attempt to wish for something good.",
    "You try to wish for money for your family.",
    "However, it comes out as \"Someone in my family will die and I will get their life insurance money.\"\n\nMy mother isn't surprised.",
    "She expected this as she falls to the ground, dead.",
    "Your check arrives and you are now wealthy.",
    "You are now the King of Bees as well.",
    "The bee tells you that you had your wish.",
    "Now you must lead them.",
    "You reluctantly agree.",
    "You let a large swarm of bees into your house.",
    "They cover every inch of it.",
    "You can't see anything, just bees.",
    "You sit, looking at the bees everywhere.",
    "You think about how you now are rich, but you have no mother.",
    "You also now have bees everywhere you go.",
    "Was this a life you wanted?",
    "You think about it and decide you don't want to be the King of Bees.",
    "You order an industrial bee poison online.",
    "You get a hose and spray it everywhere, including on yourself.",
    "Your last thought is that you really don't like bees.",
    ""
]