[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "start_progress": 0.11035781544256121,
        "end_progress": 0.11035781544256121
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk. When you're 85, the side effects are finally discovered. Scientists realize that this drug actually causes people to become particularly voracious about satiating basic human needs and desires like food, shelter, clothing, and sex. \n\nThe drug is recalled, and the government is forced to pay for the cost of the drug and the side effects. But already an entire human population has been impacted by the drug. The only people saved are those who are your age or older since you were the only ones that did not receive the drug. \n\nYou are one of the few people who are not affected by the drug. But you have seen how this drug has totally decimated others. For example, a good friend of yours who is younger than you is obese because she cannot stop stuffing food into her face. Another one of your friends has gone bankrupt buying herself 100 houses since she feels extreme anxiety about not having enough housing to live in.  And another one of your friends has also become a hoarder since she has so many clothes bursting at the seams of her house. Finally, one of your friends is in a constant state of postpartum depression since she's now been through forty-three pregnancies. Her sexual appetite is just unending. \n\nYou have decided to take action. You want to save humanity from itself. You want to stop this drug from ever being used again. \n\nYou have decided to create a new drug that will counteract the effects of the immortality drug. You call it the “Anti-Immortality Drug.\" You spend many nights and days working in your lab trying to perfect the drug.",
        "source": "api",
        "start_time": 0.0,
        "end_time": 374.0,
        "start_progress": 0.11035781544256121,
        "end_progress": 0.6787193973634652
    },
    {
        "text": "When it has finally been perfected you decide to test it out on yourself.",
        "source": "user",
        "start_time": 374.0,
        "end_time": 386.0,
        "start_progress": 0.6790960451977401,
        "end_progress": 0.7065913370998117
    },
    {
        "text": "You don't see any short-term side effects or reactions so you feel good about your creation.",
        "source": "user",
        "start_time": 386.0,
        "end_time": 409.0,
        "start_progress": 0.7069679849340866,
        "end_progress": 0.7416195856873823
    },
    {
        "text": "You then administer the drug to your friends.",
        "source": "user",
        "start_time": 409.0,
        "end_time": 418.0,
        "start_progress": 0.7419962335216572,
        "end_progress": 0.7589453860640302
    },
    {
        "text": "The friend of yours who has the high libido instantly feels that her sexual urges are quelled.",
        "source": "user",
        "start_time": 418.0,
        "end_time": 443.0,
        "start_progress": 0.7593220338983051,
        "end_progress": 0.7947269303201506
    },
    {
        "text": "The friend who is bankrupt from all her houses starts selling them off like crazy, thus vastly improving her net worth.",
        "source": "user",
        "start_time": 443.0,
        "end_time": 465.0,
        "start_progress": 0.7951035781544256,
        "end_progress": 0.839924670433145
    },
    {
        "text": "The friend who is a hoarder gives all her clothes to the homeless.",
        "source": "user",
        "start_time": 465.0,
        "end_time": 471.0,
        "start_progress": 0.8403013182674199,
        "end_progress": 0.8651600753295668
    },
    {
        "text": "And the friend who is obese learns moderation when it comes to her diet.",
        "source": "user",
        "start_time": 471.0,
        "end_time": 486.0,
        "start_progress": 0.8655367231638418,
        "end_progress": 0.8926553672316384
    },
    {
        "text": "Everyone in society who takes your drug is now living a normal life.",
        "source": "user",
        "start_time": 486.0,
        "end_time": 494.0,
        "start_progress": 0.8930320150659133,
        "end_progress": 0.9190207156308852
    },
    {
        "text": "They all cheer for you as their personal hero.",
        "source": "user",
        "start_time": 494.0,
        "end_time": 501.0,
        "start_progress": 0.9193973634651601,
        "end_progress": 0.9367231638418079
    },
    {
        "text": "You are hailed as the savior of humanity.",
        "source": "user",
        "start_time": 501.0,
        "end_time": 505.0,
        "start_progress": 0.9370998116760829,
        "end_progress": 0.9525423728813559
    },
    {
        "text": "And that is how you ended out the twilight years of your life as a star and celebrity who many people respected and admired.",
        "source": "user",
        "start_time": 505.0,
        "end_time": 569.0,
        "start_progress": 0.9529190207156308,
        "end_progress": 0.9996233521657251
    }
]