[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "And interestingly, there are none!",
        "source": "api"
    },
    {
        "text": "Scientists deem that this drug has absolutely no risk at all and that the side effects are limited to just a mild sense of happiness upon initially taking the drug.",
        "source": "user"
    },
    {
        "text": "So, the government decides to release the drug to all citizens.",
        "source": "user"
    },
    {
        "text": "No population is deemed too high-risk to take it.",
        "source": "api"
    },
    {
        "text": "This means that you are administered the drug at once, at the age of 85.",
        "source": "user"
    },
    {
        "text": "The only problem is that you are still 85.",
        "source": "user"
    },
    {
        "text": "Yes, you have immorality now, but what does that mean?",
        "source": "api"
    },
    {
        "text": "You can't leave your house.",
        "source": "user"
    },
    {
        "text": "You are bedridden.",
        "source": "api"
    },
    {
        "text": "You can't go to the grocery store.",
        "source": "user"
    },
    {
        "text": "You can't take care of many of your basic needs.",
        "source": "api"
    },
    {
        "text": "In fact, you have a hospice nurse who stays with you on most days.",
        "source": "user"
    },
    {
        "text": "You are just sitting in bed, waiting to die.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": "only now, this drug guarantees that you are going to stay in this lingering state between life and death forever.",
        "source": "api"
    },
    {
        "text": "You will not get to let go of the pain and aches that you feel in your legs, back and arms.",
        "source": "user"
    },
    {
        "text": "Honestly, this sounds hellish to you.",
        "source": "user"
    },
    {
        "text": "Moreover, you are 85 years old, but the people around you are decades younger.",
        "source": "user"
    },
    {
        "text": "This means that other people are still laughing, talking, engaging in relationships with each other, dating, partying, working, and generally enjoying their lives.",
        "source": "api"
    },
    {
        "text": "They all look young, beautiful and healthy.",
        "source": "user"
    },
    {
        "text": "You are not, and neither are your fellow companions of your same age.",
        "source": "user"
    },
    {
        "text": "This is because people who are just two years younger than you in theory received the drug many years ago and still look like they are 26.",
        "source": "user"
    },
    {
        "text": "So you wonder if it's really worth it for you to stay in this state where you won't be able to die.",
        "source": "user"
    },
    {
        "text": "Is this an existence you want?",
        "source": "user"
    },
    {
        "text": "Of course not.",
        "source": "api"
    },
    {
        "text": "You also know that if you decide to go into the bathroom and end it all, your nurse will likely stop you.",
        "source": "api"
    },
    {
        "text": "But you also wonder if there's any way to circumvent her.",
        "source": "api"
    },
    {
        "text": "She is willing to help you now, but what if she looks away just long enough for you to get up and grab that prescription bottle on the counter?",
        "source": "api"
    },
    {
        "text": "You decide to distract her.",
        "source": "api"
    },
    {
        "text": "“Hey, what are you doing tonight?",
        "source": "user"
    },
    {
        "text": "” you say.",
        "source": "api"
    },
    {
        "text": "She checks the calendar on her phone to see if she has any plans scheduled.",
        "source": "api"
    },
    {
        "text": "While she looks her plans up, you snatch the prescription bottle on the counter.",
        "source": "user"
    },
    {
        "text": "She is still looking up her plans and decides to check the weather app too, so she doesn't notice that you've grabbed the bottle.",
        "source": "user"
    },
    {
        "text": "She's now scrolling through pictures on her phone.",
        "source": "api"
    },
    {
        "text": "You decide to down the whole bottle of pills since she is still not looking.",
        "source": "user"
    },
    {
        "text": "As you swallow, you begin to feel woozy.",
        "source": "user"
    },
    {
        "text": "You begin to feel the initial effects of the pills.",
        "source": "api"
    },
    {
        "text": "Unfortunately, you realize once the bottle of pills is down in your stomach that you are still immortal, which means the searing pain and hot flashes you now feel will not actually kill you.",
        "source": "api"
    },
    {
        "text": "You begin to feel stupid.",
        "source": "user"
    },
    {
        "text": "What were you thinking?",
        "source": "user"
    },
    {
        "text": "Your nurse now realizes what you've done.",
        "source": "user"
    },
    {
        "text": "She quickly rushes over to you.",
        "source": "api"
    },
    {
        "text": "“What did you do?",
        "source": "api"
    },
    {
        "text": "!",
        "source": "api"
    },
    {
        "text": "” she says.",
        "source": "api"
    },
    {
        "text": "“I'm sorry,” you say as you begin to cry.",
        "source": "api"
    },
    {
        "text": "“I'm not happy living like this.",
        "source": "api"
    },
    {
        "text": "I'm tired of it.",
        "source": "api"
    },
    {
        "text": "\" The nurse nods.",
        "source": "api"
    },
    {
        "text": "She reveals to you that scientists are working on another drug to reverse aging among people of your age group.",
        "source": "api"
    },
    {
        "text": "She says that these scientists are at a promising start and should have a drug ready in the next year.",
        "source": "user"
    },
    {
        "text": "She tells you to hold on.",
        "source": "user"
    },
    {
        "text": "You are happy to hear this and agree to keep living with the promise that you will be able to revert to your former self soon.",
        "source": "user"
    }
]