[
    "When you die, you appear in a cinema with a number of other people who look like you.",
    "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
    "You see yourself as a young man or woman, and you see your future self as an old man or woman.",
    "You see the people you will meet and the places you will go.",
    "You see the things you will do and the things that will be done to you.",
    "It can be scary but at the same time it can be peaceful.",
    "You see the things that you have done in your past lives and the things that you have not done.",
    "You see the things that you have learned and the things that you have not learned.",
    "Your entire life flashes by your eyes.",
    "Every aspect.",
    "Every action.",
    "Every thought.",
    "Every feeling.",
    "Every person.",
    "Everything.",
    "Part of the fun is that you see all the good that you did in life.",
    "Part of the sadness is reliving all the mistakes.",
    "You see how you could have done things differently.",
    "Life is all about reflection.",
    "After you have watched your life, you are asked to choose what you want to do with your next life.",
    "Some people want to be professional athletes.",
    "Some want to be movie stars.",
    "Some want to be famous.",
    "Some want to be rich.",
    "Some want to just live a regular life.",
    "The fun thing is you get the choice.",
    "You have full control.",
    "The issue is when you make that choice there is no going back.",
    "You are locked into that choice.",
    "So choose wisely.",
    "If I had my choice I would be a firefighter.",
    "I'd like to help save as many lives as possible and live a life where I put others before myself.",
    "I would like to be a hero.",
    "Someone others can look up to.",
    "Someone that people respect.",
    "Someone that people inspire to be like.",
    "I want to live a life where I leave a purpose behind.",
    "Reincarnation will allow that.",
    "My current life will allow that as well.",
    "But the more opportunities at life we get, the better chance we have to leave a legacy behind.",
    "If reincarnation is real, then I will get the chance to live a life where I am a hero.",
    "So let's hope it's real.",
    "And if not, lets hope that heaven is real.",
    "Who wouldn't want to spend their time after life in eternal bliss with the heavenly father who created us as humans and everything around us?",
    "I believe in God and I know one day I will meet him.",
    "If I have to go through reincarnation before that date, I'll understand.",
    "I'll have to wait.",
    "But ultimately, I will meet the Lord that I love with every ounce of my heart.",
    "That gives me purpose.",
    "That gives me faith.",
    "That gives me life.",
    ""
]