[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
        "source": "api"
    },
    {
        "text": "One day, she meets a man who seems different from the rest.",
        "source": "api"
    },
    {
        "text": "There were none of the early red flags that had plagued each of her other failed relationships.",
        "source": "user"
    },
    {
        "text": "It was a bittersweet feeling though, because despite the fact that the others didn't work out, there had been something about the guys that she just felt an intense connection to.",
        "source": "user"
    },
    {
        "text": "She was a little sad that she would never see them again, but she was also excited about the prospect of a new relationship.",
        "source": "user"
    },
    {
        "text": "There was that feeling upon first meeting him not so much that she knew him before, but that she was supposed to know him.",
        "source": "user"
    },
    {
        "text": "It was still exciting in the way that new relationships are, but without the adrenaline rush of falling into the unknown.",
        "source": "user"
    },
    {
        "text": "They dated for a while, and she began to feel like she was falling in love.",
        "source": "api"
    },
    {
        "text": "Until one night over a take out dinner and a movie he asked her about her past relationships.",
        "source": "user"
    },
    {
        "text": "She could lie and act like they had all been horrible, but it had always been her policy to be honest and mature.",
        "source": "user"
    },
    {
        "text": "She loathed the way that some would throw others under the bus just to make themselves look better in the relationship.",
        "source": "user"
    },
    {
        "text": "She told him about the guys she had dated, and how she had felt an intense connection to them.",
        "source": "api"
    },
    {
        "text": "She was worried that she might be going overboard by telling him about the good points of each.",
        "source": "user"
    },
    {
        "text": "But she couldn't help the warmth that crept into her voice when she recounted her time with them.",
        "source": "user"
    },
    {
        "text": "She looked down at her wineglass while she told him about each one.",
        "source": "user"
    },
    {
        "text": "She was afraid to see his expression and was sure he did not have a pleasant one.",
        "source": "user"
    },
    {
        "text": "But she was helpless to stop.",
        "source": "user"
    },
    {
        "text": "It was as if she was compelled to keep telling him about the others and unable to tell him anything but the truth.",
        "source": "user"
    },
    {
        "text": "When she was finished, she looked up at him.",
        "source": "api"
    },
    {
        "text": "For a moment she was stunned.",
        "source": "user"
    },
    {
        "text": "He was not sitting there with a look of disgust on his face.",
        "source": "user"
    },
    {
        "text": "Instead he was gently smiling and looking at her like she was the most precious being on earth.",
        "source": "user"
    },
    {
        "text": "He gently stroked the side of her face and told her how special she was.",
        "source": "user"
    },
    {
        "text": "After a tender kiss he leaned back and looked at her intently.",
        "source": "user"
    },
    {
        "text": "Then he told her it was that special quality that made him unable to give up on her.",
        "source": "user"
    },
    {
        "text": "At first she was confused.",
        "source": "user"
    },
    {
        "text": "But then he explained to her that all of the men had been him.",
        "source": "user"
    },
    {
        "text": "Every good part of the previous men were still there.",
        "source": "user"
    },
    {
        "text": "But with each time he failed with her, he learned what he had done wrong and kept trying.",
        "source": "user"
    },
    {
        "text": "And now finally he was literally her perfect man, because he had spent years learning from his failure to be just that.",
        "source": "user"
    },
    {
        "text": "It was overwhelming for her and she knew that it would take awhile to sink in.",
        "source": "user"
    },
    {
        "text": "But for now, she was content to relax herself in his arms, marveling over how one person could have possibly loved her that much.",
        "source": "user"
    },
    {
        "text": "And in the circle of his arms she knew without a doubt that she had found the one.",
        "source": "user"
    }
]