[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "You see yourself as a baby, and then you watch your life unfold, moment by moment, as you age.",
        "source": "user"
    },
    {
        "text": "You see your life as a child, as a teenager, as a young adult, and so on.",
        "source": "user"
    },
    {
        "text": "You see your relationships, your successes, your failures, and your death.",
        "source": "user"
    },
    {
        "text": "You watch your life until the end, and then you are asked if you would like to be reincarnated.",
        "source": "user"
    },
    {
        "text": "You are curious about the possibilities.",
        "source": "user"
    },
    {
        "text": "You ask if you get to choose your circumstances, or if it's random.",
        "source": "user"
    },
    {
        "text": "You are told that you get to choose.",
        "source": "user"
    },
    {
        "text": "You think about it for a while, and then you decide that you would like to be reincarnated as a rich, famous, and powerful person.",
        "source": "user"
    },
    {
        "text": "You are excited that you will finally be able to do the things you had always dreamed of!",
        "source": "user"
    },
    {
        "text": "This is your chance to do some actual good.",
        "source": "user"
    },
    {
        "text": "You will be able to help people, to make a real difference in the world.",
        "source": "user"
    },
    {
        "text": "You hope that your compassion for others will remain in tact after you are reborn.",
        "source": "user"
    },
    {
        "text": "As you begin to dream of your new life, you wonder if growing up rich will make it harder for you to have empathy for others.",
        "source": "user"
    },
    {
        "text": "You hope that you will still be able to feel the pain of others, and you wonder if you will be able to help people who are less fortunate than you.",
        "source": "user"
    },
    {
        "text": "You look for your reincarnation mentor to ask questions, but they are nowhere to be found.",
        "source": "user"
    },
    {
        "text": "You begin to have second thoughts about your chosen path in life.",
        "source": "user"
    },
    {
        "text": "Maybe it would be better to be born poor and work your way up, just in case the rich life has a greater chance of ignorance about the challenges of others.",
        "source": "user"
    },
    {
        "text": "But what if you never end up making the fortune you have been promised in your current choice?",
        "source": "user"
    },
    {
        "text": "It's a difficult decision to make, and you're not even sure that the decision can be changed at this point.",
        "source": "user"
    },
    {
        "text": "After mulling over your conundrum, your reincarnation mentor appears.",
        "source": "user"
    },
    {
        "text": "You ask them whether you are able to change your mind and be born poor instead.",
        "source": "user"
    },
    {
        "text": "They tell you that you are able to change your mind, but that you will lose all of your memories of your previous life if you do.",
        "source": "user"
    },
    {
        "text": "That made the decision very easy.",
        "source": "user"
    },
    {
        "text": "If you can be born rich and retain your memories, that means you should still be compassionate.",
        "source": "user"
    },
    {
        "text": "Confident in your decision to be born to a wealthy family, you close your eyes and wait to meet your new parents.",
        "source": "user"
    },
    {
        "text": "You couldn't wait to make this your best life.",
        "source": "user"
    }
]