[
    "You're Barack Obama.",
    "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
    "It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below.",
    "It's time to start the real job.\" Signed simply, \"JFK.\" You know what JFK means.",
    "It's a secret code that you heard when you were President.",
    "A code that needs to be activated only in cases of the utmost urgency.",
    "You quickly call the number, horrified at what you will find out.",
    "A woman picks up.",
    "She sounds like someone at a call center because you can hear other people frantically talking all around her.",
    "\"Mr.",
    "President, thank you for calling.",
    "It has happened and we need your help now.\" says the woman.",
    "Scared and confused at the same time, you ask \"What has happened?\".",
    "\"Reality has shifted.",
    "Half of the people are now from another reality.",
    "We need your help.\" she says.",
    "I agree to help and go to a specified location.",
    "Upon arriving I am sat in front of a desk and given a little dial which can be turned left or right.",
    "A mysterious man in a suit enters the room.",
    "He hands me a folder with the words \"You're our last hope\" on the cover.",
    "I read it and it says that half of the people in our world are from another reality.",
    "It's part of what is called the Mandella effect.",
    "It says that this dial will decide which half of the population will be killed.",
    "We do not know which half is from the alternate reality and which is from our reality.",
    "This is for me to decide as part of the JFK project.",
    "If I turn the dial all the way to the right all of the people from that reality disappear.",
    "If I turn it to the left all the people from the other reality do.",
    "The man leaves the room and I am left to decide this for myself.",
    "What if I am wrong?",
    "We'll be a world filled with only people from another reality.",
    "Am I from another reality?",
    "Will I disappear as well?",
    "I don't want to do it but I am familiar with the JFK project.",
    "I have to do it.",
    "I close my eyes, hoping I don't disappear and turn the dial to the left.",
    "Now there is only darkness and nothing more.",
    ""
]