[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "Now, the US must fight to secure their place in the world again.",
        "source": "api"
    },
    {
        "text": "They set up a meeting with the new UN.",
        "source": "api"
    },
    {
        "text": "Once there they realize how much things have changed.",
        "source": "user"
    },
    {
        "text": "The US no longer has the power it once had.",
        "source": "user"
    },
    {
        "text": "Even third world countries now have more say than we do.",
        "source": "user"
    },
    {
        "text": "In fact other countries mention sending us relief aid as if we are a poor country.",
        "source": "user"
    },
    {
        "text": "Meanwhile, Russia is on the rise.",
        "source": "user"
    },
    {
        "text": "They've taken over as the new super power country.",
        "source": "api"
    },
    {
        "text": "They've really embraced this role as they now swoop in to rescue other countries.",
        "source": "user"
    },
    {
        "text": "It's an entirely different world.",
        "source": "user"
    },
    {
        "text": "The new UN wants to establish an armed force that they want the US to be part of.",
        "source": "user"
    },
    {
        "text": "However, they consider our armed forces to obviously now be subpar.",
        "source": "api"
    },
    {
        "text": "They don't have the advanced technologies that other countries now have since they have shared technology for all of these years.",
        "source": "user"
    },
    {
        "text": "We are given a role on par with something Canada would have had in the old days.",
        "source": "user"
    },
    {
        "text": "We learn that Russia has developed a rail gun technology.",
        "source": "user"
    },
    {
        "text": "This is something brand new that no one could have imagined previously.",
        "source": "api"
    },
    {
        "text": "They offer to donate one to us as they think even third world countries deserve a little technology.",
        "source": "user"
    },
    {
        "text": "We decline as the offer is quite offensive.",
        "source": "user"
    },
    {
        "text": "We do however, accept an offer to share their Fighter Jets.",
        "source": "user"
    },
    {
        "text": "They are highly advanced and the ones we have now are utterly useless in the face of such technology.",
        "source": "api"
    },
    {
        "text": "In order to get the technology from Russia, we agree to a joint military exercise.",
        "source": "user"
    },
    {
        "text": "It goes quite well though something seems off.",
        "source": "api"
    },
    {
        "text": "After the exercise they send us on our way with the new jets.",
        "source": "user"
    },
    {
        "text": "Once they arrive home they are stationed across the country so they are evenly spaced out.",
        "source": "user"
    },
    {
        "text": "No one suspects anything until it is too late.",
        "source": "user"
    },
    {
        "text": "A mechanic is looking over one of the jets when he notices something that looks like a bomb.",
        "source": "user"
    },
    {
        "text": "All at the same time the jets explode throughout the US, wiping out the country.",
        "source": "user"
    },
    {
        "text": "The UN then meets and says that their plan worked.",
        "source": "user"
    },
    {
        "text": "They considered the US a rogue country and wanted it off of the map.",
        "source": "user"
    },
    {
        "text": "Now things are back the way they were supposed to be, with no surprises.",
        "source": "user"
    },
    {
        "text": "Russia was especially happy with that decision and happy to stay the new super power.",
        "source": "user"
    }
]