[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
        "source": "api"
    },
    {
        "text": "One day, she meets up with a new guy.",
        "source": "api"
    },
    {
        "text": "This was nothing new, as she loves to meet new people and enjoys to date as many people as she can, hoping that one person will finally be the right fit for her.",
        "source": "user"
    },
    {
        "text": "All of the guys seemed to look good, but they all had the same odd personality quirks.",
        "source": "user"
    },
    {
        "text": "They knew things about her that she did not tell, and she began to feel like they all seemed to actually know her.",
        "source": "user"
    },
    {
        "text": "Meeting up with the new guy, John, she is optimistic that things might be different this time around.",
        "source": "user"
    },
    {
        "text": "He is good looking, and seems to be charming.",
        "source": "user"
    },
    {
        "text": "He certainly had a way with words.",
        "source": "user"
    },
    {
        "text": "They were going to her favorite Italian restaurant, and she was running a little behind.",
        "source": "user"
    },
    {
        "text": "When she got to the restaurant, John was already seated waiting for her.",
        "source": "user"
    },
    {
        "text": "\"I'm so sorry I ran late,\" she exclaimed.",
        "source": "user"
    },
    {
        "text": "\"It's perfectly fine,\" said John.",
        "source": "user"
    },
    {
        "text": "\"I already ordered lasagna for you, your favorite.",
        "source": "user"
    },
    {
        "text": "\"\n\nImmediately, a few bells of concern rang in her head.",
        "source": "user"
    },
    {
        "text": "\"How does he know that my favorite is lasagna?",
        "source": "user"
    },
    {
        "text": "\"\n\nShe tried to ignore this and turn it into a pleasant date, after all she was already feeling guilty for being late.",
        "source": "user"
    },
    {
        "text": "As the date progressed, John kept seeming to make mention of things that he should not know about her.",
        "source": "user"
    },
    {
        "text": "Just like the past few dates she has been on.",
        "source": "user"
    },
    {
        "text": "She wanted to believe that they were just coincidences, but she was feeling extremely uneasy by now.",
        "source": "user"
    },
    {
        "text": "As John was getting ready to pay for their meal, she asked \"How did you know lasagna was my favorite?",
        "source": "user"
    },
    {
        "text": "\"\n\nJohn said, \"Well, I have a confession to make.",
        "source": "user"
    },
    {
        "text": "I actually am John, but I also am Chris, Mike, and Ben.",
        "source": "user"
    },
    {
        "text": "The last three guys you went out with.",
        "source": "user"
    },
    {
        "text": "That's me too.",
        "source": "user"
    },
    {
        "text": "\"\n\"I just have fallen so in love with you and I keep blowing it every time we go out.",
        "source": "user"
    },
    {
        "text": "I am a shapeshifter, and so I just change to a different guy and give it another try.",
        "source": "user"
    },
    {
        "text": "You see, I just love you so much I need to make it work one of these times.",
        "source": "user"
    },
    {
        "text": "I know you probably feel uncomfortable, but I promise it is because I love you so much.",
        "source": "user"
    },
    {
        "text": "Horrified, the woman ran out of the restaurant.",
        "source": "user"
    },
    {
        "text": "Each of those guys had been creepy and made her feel uncomfortable, and to know that it is just the same guy each time made it much worse for her.",
        "source": "user"
    },
    {
        "text": "She was worried, and she needed to get away from this.",
        "source": "user"
    },
    {
        "text": "She decided that she cannot date anyone for a long time because she will never know if it is this same guy.",
        "source": "user"
    },
    {
        "text": "The woman didn't go on any dates for well over a year.",
        "source": "user"
    },
    {
        "text": "In fact, she quit looking for the perfect man altogether.",
        "source": "user"
    },
    {
        "text": "One day a few years later, she was at the grocery store.",
        "source": "user"
    },
    {
        "text": "She was carrying quite a few products, walking up to the register to pay.",
        "source": "user"
    },
    {
        "text": "She accidentally dropped the bread, and a man behind her picked it up.",
        "source": "user"
    },
    {
        "text": "\"Hi, I'm Steve.",
        "source": "user"
    },
    {
        "text": "\" They began to talk, and Steve asked her to get coffee sometime.",
        "source": "user"
    },
    {
        "text": "She agreed, and the two connected beautifully.",
        "source": "user"
    },
    {
        "text": "After several years, the two got married.",
        "source": "user"
    },
    {
        "text": "They had so much in common.",
        "source": "user"
    },
    {
        "text": "The one nagging thought she could never get rid of - How did Steve know to ask me for coffee?",
        "source": "user"
    },
    {
        "text": "Coffee was her favorite first date location.",
        "source": "user"
    },
    {
        "text": "How did Steve know that?",
        "source": "user"
    }
]