[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "The aliens were surgical in their precision of war.",
        "source": "user"
    },
    {
        "text": "They destroyed population centers, NOT just the people in them.",
        "source": "user"
    },
    {
        "text": "Of course this broke down phone communication and all infrastructure, making manufacture, transportation and most all of modern life disappeared.",
        "source": "user"
    },
    {
        "text": "people that remained were tenacious.",
        "source": "user"
    },
    {
        "text": "They also noticed something else that happened.",
        "source": "user"
    },
    {
        "text": "They realized that they didn't really NEED the cellphones or computer uplinks.",
        "source": "user"
    },
    {
        "text": "They could think of someone and the person thought of would KNOW it, they'd also hear the message.",
        "source": "user"
    },
    {
        "text": "What people had forgotten was that they used to be more powerful, less addicted, and more independent.",
        "source": "user"
    },
    {
        "text": "The people who survived the alien invasion were the ones who had been more in tune with nature, and the Earth.",
        "source": "user"
    },
    {
        "text": "They weren't in big cities for a reason, they were on farms, used to animals, growers, ones who kindled things, and ones who Knew something.",
        "source": "user"
    },
    {
        "text": "This served them well.",
        "source": "user"
    },
    {
        "text": "It also made them able to be still, to listen.",
        "source": "user"
    },
    {
        "text": "This is an art that had been lost in many in cities.",
        "source": "user"
    },
    {
        "text": "Hearing was key here.",
        "source": "user"
    },
    {
        "text": "After a time, even without Phones, Tv and modern internet, we were able to communicate anyway.",
        "source": "user"
    },
    {
        "text": "The aliens had not been expecting this.",
        "source": "user"
    },
    {
        "text": "This was shocking to them.",
        "source": "user"
    },
    {
        "text": "They thought taking our tech would weaken us into submission, forcing us to come to cities to get news or reconnect.",
        "source": "user"
    },
    {
        "text": "Being able to do this without confronting the aliens was the human remnant ace in the hole.",
        "source": "user"
    },
    {
        "text": "They began to organize, amassing materials, and knowledge.",
        "source": "user"
    },
    {
        "text": "We remainders found a way.",
        "source": "user"
    },
    {
        "text": "We figured out that the aliens depended upon SOME things grown.",
        "source": "user"
    },
    {
        "text": "They preferred soybeans actually, grinding up the whole plant and slurping the whole green things down.",
        "source": "user"
    },
    {
        "text": "When humans got rid of all soybean seeds, burning them, this confounded our masters, the aliens.",
        "source": "user"
    },
    {
        "text": "They attempted to eat corn, beets, wheat, etc.",
        "source": "user"
    },
    {
        "text": "This didn't work out well.",
        "source": "user"
    },
    {
        "text": "The aliens got violently ill when noshing on anything but soybeans.",
        "source": "user"
    },
    {
        "text": "We wise Mana strong persons, got them out by starving them out.",
        "source": "user"
    },
    {
        "text": "When they tried to, one at a time, invade a farm, the farmers set fire to the fields, further confounding them.",
        "source": "user"
    },
    {
        "text": "They had no choice, we finally had our land back, then we went to the cities, reorganizing them, once we saw the last ship zip high into the sky.",
        "source": "user"
    },
    {
        "text": "At last they were gone.",
        "source": "user"
    },
    {
        "text": "We could finally do what we wanted, have fun and reorganize our phones and internet, bigger and better than before.",
        "source": "user"
    }
]