[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "This causes the dads to freak out and start fighting over who is the best dad.",
        "source": "user"
    },
    {
        "text": "Before very long, the world is in chaos, and the family unit has been destroyed.",
        "source": "user"
    },
    {
        "text": "The Moms, who have been watching this all happen, finally decide to step in and fix the problem.",
        "source": "user"
    },
    {
        "text": "They form a council, the \"Moms of the World\" and begin to decide what to do.",
        "source": "user"
    },
    {
        "text": "They decide that the dads are unlikely to stop fighting, so they decide to take drastic action.",
        "source": "user"
    },
    {
        "text": "They round the dads up and capture them.",
        "source": "user"
    },
    {
        "text": "This is surprisingly easy, as the dads are so busy fighting that they don't notice the moms coming.",
        "source": "user"
    },
    {
        "text": "They imprison them, while they try to brainstorm a solution to the problem.",
        "source": "user"
    },
    {
        "text": "Finally, they settle on a tournament, a \"Dad-Off\" to determine who are the good dads, and who are the bad dads.",
        "source": "user"
    },
    {
        "text": "They get the dads to agree to accept the results of the tournament, as final, and an end to the best dad dispute, and they begin to set it up.",
        "source": "user"
    },
    {
        "text": "It will be a battle to the death.",
        "source": "user"
    },
    {
        "text": "The top 50% of the dads will be allowed to live, and the bottom 50%, if they fail to be killed in combat, will be executed.",
        "source": "user"
    },
    {
        "text": "The moms and kids, having grown somewhat sadistic by this time, create a series of brutal combat arenas, and the tournament begins.",
        "source": "user"
    },
    {
        "text": "They also take bets on who will win, and the betting is quite heavy, with the top-ranked dads being natural odds favorites, and the lower-ranked dads",
        "source": "user"
    },
    {
        "text": "The tournament goes on for a very long time, and the moms and kids have a lot of sick fun watching the dads fight each other.",
        "source": "user"
    },
    {
        "text": "But, something unexpected is observed during the betting.",
        "source": "user"
    },
    {
        "text": "The dads who are ranked higher are not winning.",
        "source": "user"
    },
    {
        "text": "The lower ranked dads are consistently winning.",
        "source": "user"
    },
    {
        "text": "The betting odds gradually change to reflect this.",
        "source": "user"
    },
    {
        "text": "The tournament continues, and the lower-ranked dads continue to win.",
        "source": "user"
    },
    {
        "text": "The #1 Dad, who managed to get past the first round, falls in the second, and by the third round, no dads ranked in the top 25% are left.",
        "source": "user"
    },
    {
        "text": "After perhaps the bloodiest year in human history, the tournament is finally over.",
        "source": "user"
    },
    {
        "text": "The winners are freed, to start new families, and the losers are executed.",
        "source": "user"
    },
    {
        "text": "There is some speculation about the mugs, and the rankings.",
        "source": "user"
    },
    {
        "text": "It is suggested that the mugs were rigged, and that the rankings were false, because the results of the tournament, are the reverse of what they mugs had claimed.",
        "source": "user"
    },
    {
        "text": "Life goes on, but before long it is discovered that the criteria that make a vicious and successful gladiator, do not necessarily make a good father.",
        "source": "user"
    },
    {
        "text": "The cruelest and most violent of men are now the only fathers, and humanity enters a new Dark Age, where only the strongest survive.",
        "source": "user"
    }
]