[
    "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
    "A new \"Dad\" mug is created, and it's the most popular mug in the world.The \"Dad\" mug is now the most popular mug in the world.",
    "It's the best mug.",
    "It's the most popular mug.",
    "The sales over the years has seen increases each year, with fathers day being the best season for the dad mugs.",
    "The mug is now the most popular mug in the world.",
    "There are other runner ups but the dad mug beats out most of them.",
    "The #1 mom mug is also a big seller depending on what season, but we find it to be a great seller around the holiday time rather than mothers day .",
    "The #1 mom mug is a great seller around the holidays, but it is not as popular as the dad mug.",
    "The #1 dad mug is a great seller around the holidays, but it is not as popular as the mom mug.",
    "All in all they are usually back to back in sales and popularity .",
    "In some years believe it or not the mom mugs outsells the dad mugs but not my much, it's in the mere thousands.",
    "The dad mugs outsell the mom mugs by a lot more than the mom mugs outsell the dad mugs.We have never found out who really came up with the idea of of making these mugs and it has never been registered or patented but whoever that person is , they are just hitting themselves in the head right now.",
    "They are probably kicking themselves for not doing it sooner.",
    "Companies have jumped on the trend going back to the really early 50's and have since been a staple in most gift shops across the world .",
    "The mugs have been a huge success and have been a huge part of the gift industry for decades.",
    "They are a great gift idea and a great gift for just about any occasion.",
    "They are a great gift for the holidays, for fathers day, for mothers day, for birthdays, for anniversaries, for graduations, for retirements, for the list goes on and on.",
    "They are a great gift idea for anyone and everyone.",
    "They are a great gift for the person who has everything.",
    ""
]