[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "For you see, Matt Damon is a famous actor, renowned for his many critically acclaimed works and acting roles.",
        "source": "user"
    },
    {
        "text": "He is the star of the Bourne series, the star of the Ocean's series, and the star of many other movies.",
        "source": "user"
    },
    {
        "text": "The aliens mistaking him for being the leader of mankind kidnapped him in order to weaken the military might of planet Earth, so they could conquer it much more easily.",
        "source": "user"
    },
    {
        "text": "The aliens did not know that the military might of planet Earth is not based on the strength of one man, but on the strength of all the many countries and people that live on the planet.",
        "source": "user"
    },
    {
        "text": "That is why, upon Matt Damon's kidnapping, all the true leaders of the world met up to discuss what to do about the aliens planning to conquer the planet.",
        "source": "user"
    },
    {
        "text": "One of the Earth's leaders suggested an all out attack, while others chimed in that such an endeavor would likely fail if the aliens possessed superior technology.",
        "source": "user"
    },
    {
        "text": "Others suggested more diplomatic options, wishing to converse with the alien leaders on finding a common ground or compromise.",
        "source": "user"
    },
    {
        "text": "The final option was to send a single man to infiltrate the alien base, and rescue Matt Damon.",
        "source": "user"
    },
    {
        "text": "That sole man would not only rescue Matt Damon, but also set charges and explosives to destroy the alien base upon Matt Damon's rescue.",
        "source": "user"
    },
    {
        "text": "The leaders of Earth agreed upon the final option, and sent the man to infiltrate the alien base.",
        "source": "user"
    },
    {
        "text": "He was a secret, not officially registered as an agent of any country of the world.",
        "source": "user"
    },
    {
        "text": "Trained since his youth to be the best stealth agent, he was supposedly a ghost in the field, not being heard or seen by enemy combatants.",
        "source": "user"
    },
    {
        "text": "Beyond his skill, the man was given a special suit, that would allow him to blend in with his surroundings.",
        "source": "user"
    },
    {
        "text": "This made his mission all to easy, as the aliens were found to not physically possess good eyesight or others senses to detect him.",
        "source": "user"
    },
    {
        "text": "The stealth agent made his way through the base, eventually coming across Matt Damon.",
        "source": "user"
    },
    {
        "text": "\"Oh thank god, someone's here to rescue me, replied Matt Damon. The man quietly nodded in response, and broke the lock to Damon's cell. Once freed, Matt Damon exited his cell and waited patiently for the man to discuss their next plan. \n\n\"We need to get out of here, and blow up the base, the man whispered to Matt Damon.",
        "source": "user"
    },
    {
        "text": "Matt Damon was surprised, but agreed.",
        "source": "user"
    },
    {
        "text": "They both went to the part of the base where all the munitions and space ships were located.",
        "source": "user"
    },
    {
        "text": "The man set charges all around, including a special charge that would detonate a massive explosion, taking out the base and anyone that were in its blast radius.",
        "source": "user"
    },
    {
        "text": "They then sneaked back to the agent's ship, and flew away without ever being detected.",
        "source": "user"
    },
    {
        "text": "Once a safe distance, the agent handed over the detonator to Matt Damon, giving him the honors of blowing up the base of the aliens.",
        "source": "user"
    },
    {
        "text": "Matt Damon humbly agreed to do so.",
        "source": "user"
    },
    {
        "text": "With a massive explosion, the aliens were no more and humanity was saved.",
        "source": "user"
    },
    {
        "text": "For it was the efforts of both an unknown operative and Matt Damon who saved humanity from aliens, a tale that would soon be told on film by said actor.",
        "source": "user"
    }
]