[
    "Your entire life, you've been told you're deathly allergic to bees.",
    "You've always had people protecting you from them, be it your mother or a hired hand.",
    "Today, one slips through and lands on your shoulder.",
    "You hear a tiny voice say \"Your Majesty, what are your orders?\".",
    "The first thing you do is panic, and run away from the bee.",
    "Your mother notices this and runs up to you.",
    "She quickly kills the bee and rushes you into your bedroom.",
    "\"Why did that bee talk to me?",
    "Why did it say your Majesty?\" I asked.",
    "Your mother is beside herself.",
    "She is spraying bug spray all around, as if it will quiet the truth.",
    "I demand to know what happen and she finally turns to me, looking frantic.",
    "\"Your father is the King of the bees.\"\n\nI don't know how to respond to that.",
    "She'd never even talked about my father before.",
    "She flat out refused.",
    "\"What do they want from me?\" I ask.",
    "\"They want to take you away from me.",
    "Just like they did with your father.\" she said.",
    "\"What do you mean they took my father?\" I ask.",
    "\"He morphed into something that I can't even describe.",
    "He now lives somewhere in the woods.\" she says.",
    "\"Were they going to take me to him?\" I ask.",
    "\"If they did, you'd never return.",
    "You'd become whatever he was.\" she says.",
    "I go to bed, promising my mother that I will not go outside ever again.",
    "However, I do buy a drone online.",
    "It arrives and I use it to fly into the woods and try see my father.",
    "I find him, and he is beyond beautiful.",
    "He's a giant creature that is a combination of bee and human.",
    "It's similar to a Xenomorph from Aliens in how he has this amazing exoskeleton.",
    "The king is startled by my drone and he swipes it away.",
    "It hits the ground and shatters.",
    "I am very sad because I only got to briefly see him.",
    "I wonder if I go into the woods if I can look like that as well?",
    "I start to go outside, then notice that the drone still has a little life left in it as it lays on the ground.",
    "It shows my father eating a nearby animal.",
    "Grossed out I decide maybe it's not worth it if I have to do that.",
    "I then go to bed.",
    ""
]