[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "The film you are watching is your life, and you are watching it from the moment you are born until the moment you die.",
        "source": "api"
    },
    {
        "text": "Your mind is a clean slate as you watch the movie.",
        "source": "api"
    },
    {
        "text": "Everything you see is unknown.",
        "source": "user"
    },
    {
        "text": "But you also start to realize that you don't remember any of your other lives.",
        "source": "user"
    },
    {
        "text": "So why are you seeing this?",
        "source": "user"
    },
    {
        "text": "This is your next life and if it's a movie, it must mean that you can't do anything about it.",
        "source": "user"
    },
    {
        "text": "A few hours in, there is an intermission.",
        "source": "user"
    },
    {
        "text": "You walk to the concessions stand, and get in line.",
        "source": "user"
    },
    {
        "text": "You see a lot of people in the line who look like you, and you are all talking about your lives.",
        "source": "user"
    },
    {
        "text": "In fact, you realize that everyone looks like you, and you are surprised that you look so similar in every life.",
        "source": "api"
    },
    {
        "text": "You also notice that you are the only one who doesn't remember their previous lives.",
        "source": "user"
    },
    {
        "text": "You start chatting with an elderly you that is standing in line behind you.",
        "source": "api"
    },
    {
        "text": "\"Have you been through this before?",
        "source": "user"
    },
    {
        "text": "\" you ask him.",
        "source": "user"
    },
    {
        "text": "\"Yes, I have,\" he replies.",
        "source": "user"
    },
    {
        "text": "\"How many times?",
        "source": "api"
    },
    {
        "text": "\" you ask.",
        "source": "api"
    },
    {
        "text": "\"This is the 14th for me,\" he says.",
        "source": "api"
    },
    {
        "text": "\"I'm guessing this is your first, because you seem kind of lost.",
        "source": "user"
    },
    {
        "text": "\"\n\nYou tell him it is, and that while you can buy into the concept that you're about to be reincarnated, you're unclear as to why you are seeing a movie of what is your destiny.",
        "source": "user"
    },
    {
        "text": "\"No, you have it wrong!",
        "source": "user"
    },
    {
        "text": "\" he says.",
        "source": "user"
    },
    {
        "text": "He goes on to explain that the movie is NOT your destiny.",
        "source": "user"
    },
    {
        "text": "It is what is likely to happen and watching it gives you the chance to modify it.",
        "source": "user"
    },
    {
        "text": "\"After the movie is over, you'll have two hours to edit it.",
        "source": "user"
    },
    {
        "text": "They were supposed to tell you that before the movie started, but the folks running the Reincarnation Division have gotten lazy over the last few years.",
        "source": "user"
    },
    {
        "text": "After the movie is over, we'll all chat about it for an hour, give you advice, and then you have that time to rewrite some parts.",
        "source": "user"
    },
    {
        "text": "You can't rewrite the whole thing, you have to pick the things that you most want to change.",
        "source": "user"
    },
    {
        "text": "\"\n\nYou ask if you will remember this whole thing when you are reborn.",
        "source": "user"
    },
    {
        "text": "\"No, you won't,\" he says.",
        "source": "user"
    },
    {
        "text": "\"But you will remember once this next life is over, like I do, and you'll do this again when you die but you'll remember everything then, and you'll be able to give the next you advice.",
        "source": "user"
    },
    {
        "text": "You notice the lights are blinking, signaling the movie is about to begin again.",
        "source": "user"
    },
    {
        "text": "You thank the man and walk back to you seat with your popcorn and soda.",
        "source": "user"
    },
    {
        "text": "As the movie starts again, you watch with new purpose, determined to find the things you want to change to make your next life your best one yet.",
        "source": "user"
    }
]