[
    "You're Barack Obama.",
    "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
    "It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below.",
    "It's time to start the real job.\" Signed simply, \"JFK.\" You think it might be a prank, but the phone number is real.",
    "Obama picks up the pick and dials the number.",
    "The man on the other end of the phone tells him to meet him at the White House.",
    "The White House?",
    "he wonders.",
    "Why would he be getting called back to the White House?",
    "A car is then sent to pick him up.",
    "He reluctantly gets into the car.",
    "Once Obama arrives at the White House, he's escorted to the Oval Office.",
    "When he walks into the oval office, he finds JFK standing there waiting for him.",
    "\"Welcome back, Mr.",
    "President.\" Obama said nothing.",
    "He was speechless.",
    "\"Would you like a drink Mr.",
    "President?\" He poured himself a cocktail as Obama stood there.",
    "\"No, thank you.\" he replied politely.",
    "\"Well, I'm just gonna go on and get to the point.",
    "The country needs your help.\" He continued.",
    "\"We have received information detailing a plan to overtake the government and start a new fascist regime.",
    "You are the only one that can stop them.\" Obama sat down.",
    "\"I don't know how,\" he said earnestly.",
    "\"What makes you think I can do this?\" \n\nJFK smiled.",
    "\"I will show you.",
    "First you have to make a choice.\" He held out both of his hands and opened them.",
    "In each hand was a pill.",
    "One was red, the other was white.",
    "\"Choose a pill,\" said JFK.",
    "\"If you take the red pill, you will become immortal.",
    "You will defeat the evildoers, but you will live on forever and see all the aftermath, and never die.\"\n\nObama looked at the white pill.",
    "\"What does taking the white pill do?\" JFK shrugged.",
    "\"It just makes ya wanna dance all the time and not care about real world problems.\" \n\nObama thought for a few minutes.",
    "He reached for the red pill, and then decided he wanted the white pill.",
    "All he wanted was to dance, and no one could stop him now.",
    ""
]