[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.",
        "source": "api"
    },
    {
        "text": "\"\n\nThe wolf was like, \"dude, I'm not going to blow that house down.",
        "source": "api"
    },
    {
        "text": "\"  The pig was puzzled.",
        "source": "api"
    },
    {
        "text": "Everyone in town knew that the wolf blew EVERYBODY'S house down whenever he had the chance.",
        "source": "user"
    },
    {
        "text": "Only the pigs rich to build brick houses were safe.",
        "source": "user"
    },
    {
        "text": "Pigs saved for years to finally have a wolf-safe house.",
        "source": "user"
    },
    {
        "text": "\"I'm glad to hear that, but why, may I ask, are you leaving my house alone?",
        "source": "user"
    },
    {
        "text": "\" \n\n\"Because your house is made of depleted uranium.",
        "source": "user"
    },
    {
        "text": "\" \n\n\"I know that, but why is that important?",
        "source": "api"
    },
    {
        "text": "\" \n\n\"Because it's radioactive.",
        "source": "api"
    },
    {
        "text": "\"\n\n\"Why does that matter?",
        "source": "api"
    },
    {
        "text": "\" the pig asked.",
        "source": "user"
    },
    {
        "text": "The wolf explained that if he blew the house down, the radioactivity would spread and cause everyone to get sick.",
        "source": "user"
    },
    {
        "text": "The pig hadn't realized he'd built a dangerous house.",
        "source": "user"
    },
    {
        "text": "He thanked the wolf profusely and contacted the local government to have the house safely removed.",
        "source": "user"
    },
    {
        "text": "He couldn't afford a brick house, so he had to put up a straw one.",
        "source": "user"
    },
    {
        "text": "Before the wolf could come and blow it down, the pig paid him a visit with a bouquet of flowers.",
        "source": "user"
    },
    {
        "text": "\"Man, you saved my life,\" he told the wolf, and invited him over to his house for dinner the next night.",
        "source": "user"
    },
    {
        "text": "The wolf was shocked.",
        "source": "user"
    },
    {
        "text": "None of the pigs had ever thanked him for anything or been nice to him.",
        "source": "user"
    },
    {
        "text": "He agreed and visited the pig's house the next night.",
        "source": "user"
    },
    {
        "text": "They had a nice dinner and over coffee and cake, they chatted about why the wolf blew down everyone's house.",
        "source": "user"
    },
    {
        "text": "The pig said that he'd been told that the wolf was a bad guy who blew down houses just to be mean.",
        "source": "user"
    },
    {
        "text": "\"Nah,\" the wolf said, \"I'm just bored and lonely.",
        "source": "api"
    },
    {
        "text": "It's tough being the only wolf in a pig town.",
        "source": "user"
    },
    {
        "text": "\"  \n\nThe pig realized that the wolf wasn't the only bad guy.",
        "source": "user"
    },
    {
        "text": "The town of pigs had made the wolf an outcast and weren't nice to him.",
        "source": "user"
    },
    {
        "text": "At the next town hall meeting, the pig brought this up.",
        "source": "user"
    },
    {
        "text": "He said he thought the wolf would stop blowing down houses if he were integrated into the community.",
        "source": "user"
    },
    {
        "text": "Pigs started to get to know the wolf and realized he wasn't a bad guy.",
        "source": "user"
    },
    {
        "text": "And, in return, the wolf didn't feel the need to destroy the pigs homes.",
        "source": "user"
    },
    {
        "text": "From then on, everyone lived in peace.",
        "source": "user"
    },
    {
        "text": "The wolf even got into construction and helped build pig houses.",
        "source": "user"
    }
]