[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "The world is in your hands.",
        "source": "api"
    },
    {
        "text": "It is time to reclaim our power.",
        "source": "api"
    },
    {
        "text": "The game is set in a world where Mana is the source of all power.",
        "source": "user"
    },
    {
        "text": "The objective is to win the game by adding the most Mana to the collective pot.",
        "source": "api"
    },
    {
        "text": "Mana is gained by playing cards.",
        "source": "user"
    },
    {
        "text": "Each card is either worth Mana or holds the power to take Mana from another source.",
        "source": "api"
    },
    {
        "text": "The game is played in turns.",
        "source": "user"
    },
    {
        "text": "Each turn is divided into two phases: the draw phase and the action phase.",
        "source": "api"
    },
    {
        "text": "A card is drawn from the stack.",
        "source": "api"
    },
    {
        "text": "Then, the player must play a card and be left with 5 cards.",
        "source": "user"
    },
    {
        "text": "The action phase is where the player can play cards.",
        "source": "user"
    },
    {
        "text": "The player chooses the card to play.",
        "source": "api"
    },
    {
        "text": "The card is then placed in front of the player.",
        "source": "user"
    },
    {
        "text": "The amount of Mana on the card will match the amount of Mana on one of the source wells on the board.",
        "source": "api"
    },
    {
        "text": "The player must move to that location on the board.",
        "source": "user"
    },
    {
        "text": "The player can then take the Mana from that source well and wait there until their next turn.",
        "source": "user"
    },
    {
        "text": "There are also cards that allow the player to gain Mana from a source well without having to move their piece.",
        "source": "user"
    },
    {
        "text": "This gives players the advantage of collecting more neighboring bonuses and obtaining Mana.",
        "source": "user"
    },
    {
        "text": "The game ends when the last card is drawn from the stack.",
        "source": "user"
    },
    {
        "text": "The player with the most Mana wins.",
        "source": "api"
    },
    {
        "text": "If the game is being played in tournament mode, then the winning mana goes into the collective pot, and is divided up between the players before the start of the next game.",
        "source": "api"
    },
    {
        "text": "The game was designed by James Ernest and Patrick Rothfuss.",
        "source": "user"
    },
    {
        "text": "It is among the first games to be published by the newly formed Patrick Rothfuss Enterprises, a game publishing company owned by Patrick Rothfuss.",
        "source": "api"
    },
    {
        "text": "A new version of the game was released in 2017.",
        "source": "api"
    },
    {
        "text": "For more information, visit the official website.",
        "source": "user"
    },
    {
        "text": "It is sold by Amazon.",
        "source": "user"
    },
    {
        "text": "com and other online retailers.",
        "source": "api"
    },
    {
        "text": "Social media accounts for the game include Facebook, Twitter, and Instagram.",
        "source": "user"
    }
]