[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "It was the power to be able to control aliens!",
        "source": "api"
    },
    {
        "text": "The survivors are able to harness this power and fight back against the aliens.",
        "source": "user"
    },
    {
        "text": "However, most decided just to have fun with it instead.",
        "source": "api"
    },
    {
        "text": "They begin turning the aliens into their slaves.",
        "source": "user"
    },
    {
        "text": "The aliens are forced to do all of the work, while the humans sit back and relax.",
        "source": "user"
    },
    {
        "text": "They mow the yard, cook the meals and even are the drivers for humans.",
        "source": "api"
    },
    {
        "text": "The aliens are not too happy about this.",
        "source": "user"
    },
    {
        "text": "They themselves realize they have their own mana that works in a similar way.",
        "source": "api"
    },
    {
        "text": "It would give them the power to control humans, overriding the humans mana powers.",
        "source": "user"
    },
    {
        "text": "They begin to search for a way to harness their own mana.",
        "source": "user"
    },
    {
        "text": "They eventually realize that they need to kill many of their own kind so that the survivors have a stronger mana force.",
        "source": "api"
    },
    {
        "text": "Half of the aliens end up volunteering and overnight, the aliens now have the upper hand.",
        "source": "user"
    },
    {
        "text": "The aliens begin getting their revenge.",
        "source": "user"
    },
    {
        "text": "They force the humans to do all of the work, while they sit back and relax.",
        "source": "user"
    },
    {
        "text": "They aren't interested in killing the humans anymore.",
        "source": "api"
    },
    {
        "text": "They now just want to put them through the same punishments and humiliate them.",
        "source": "user"
    },
    {
        "text": "The humans are not happy about this.",
        "source": "user"
    },
    {
        "text": "They need to get the power back.",
        "source": "api"
    },
    {
        "text": "They begin searching for a way to harness their mana again.",
        "source": "user"
    },
    {
        "text": "They then come to the same conclusion as the aliens.",
        "source": "api"
    },
    {
        "text": "They need to wipe out half of the remaining humans to regain control with their mana.",
        "source": "user"
    },
    {
        "text": "The humans aren't eager to volunteer so half of the humans end up killing the other half.",
        "source": "user"
    },
    {
        "text": "This continues back and forth.",
        "source": "user"
    },
    {
        "text": "One side takes control and then the other wipes out half of their population until both sides have hardly anyone left.",
        "source": "user"
    },
    {
        "text": "The aliens and humans are now at a stalemate.",
        "source": "user"
    },
    {
        "text": "This has to stop somewhere.",
        "source": "api"
    },
    {
        "text": "Neither side wants to completely give in so they try to figure out a compromise.",
        "source": "api"
    },
    {
        "text": "They agree that they will alternate between being each others slaves.",
        "source": "user"
    },
    {
        "text": "Humans are the slaves for three days, then the aliens.",
        "source": "user"
    },
    {
        "text": "It's crazy enough that it just might work.",
        "source": "user"
    }
]