[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "No one knows how this started but it sure has caused excitement!",
        "source": "user"
    },
    {
        "text": "The first Dad to be ranked \"#1 Dad\" is a man named John.",
        "source": "api"
    },
    {
        "text": "John is a normal man from a small town.",
        "source": "user"
    },
    {
        "text": "He lives simply and has two children.",
        "source": "user"
    },
    {
        "text": "He is a loving and devoted father.",
        "source": "api"
    },
    {
        "text": "He has a simple job and is a devoted husband.",
        "source": "api"
    },
    {
        "text": "John is suddenly the most famous man in the world.",
        "source": "api"
    },
    {
        "text": "Journalists want to interview him.",
        "source": "user"
    },
    {
        "text": "Other dads want to meet him.",
        "source": "user"
    },
    {
        "text": "He does not know what to do.",
        "source": "user"
    },
    {
        "text": "John is a simple man and does not know how to handle all of the attention.",
        "source": "api"
    },
    {
        "text": "What should he do?",
        "source": "user"
    },
    {
        "text": "He decides the best thing to do is to investigate how all of this started and how he became ranked #1.",
        "source": "user"
    },
    {
        "text": "John goes to the town where he lives and meets with the other dads.",
        "source": "api"
    },
    {
        "text": "He asks them if they know anything about this.",
        "source": "api"
    },
    {
        "text": "They do not know about it but they tell John that their mugs have been changing every day.",
        "source": "user"
    },
    {
        "text": "This is surprising to John because his has stayed at #1.",
        "source": "user"
    },
    {
        "text": "John decides to go to the town where the mug maker lives.",
        "source": "api"
    },
    {
        "text": "He wants to find out why his mug has stayed at #1 and why the other mugs have been changing.",
        "source": "user"
    },
    {
        "text": "The mug maker discloses that he made John's mug, and then the others, at the request of John's wife.",
        "source": "user"
    },
    {
        "text": "She wanted to give John a special gift.",
        "source": "user"
    },
    {
        "text": "She did not know how much attention it would cause.",
        "source": "user"
    },
    {
        "text": "John is surprised to hear this.",
        "source": "user"
    },
    {
        "text": "He has to decide what to do.",
        "source": "user"
    },
    {
        "text": "He does not want to be the most famous man in the world.",
        "source": "user"
    },
    {
        "text": "The mug maker tells John the only thing he can do is break the mug and then the ranking of #1 will go to someone else.",
        "source": "user"
    },
    {
        "text": "John goes home and gives his wife a big hug and kiss and thanks her then he breaks the mug and hopes she will understand.",
        "source": "user"
    }
]