[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "It's all in fun, of course.",
        "source": "user"
    },
    {
        "text": "At least, that was the original idea behind it.",
        "source": "api"
    },
    {
        "text": "The company that made them wanted to do this as a fun campaign to draw attention to the mugs.",
        "source": "user"
    },
    {
        "text": "People just bought them as a silly novelty item so something had to be done to bring them back to life on social media.",
        "source": "user"
    },
    {
        "text": "But when they changed the mug rankings, they didn't expect people to treat it so seriously.",
        "source": "user"
    },
    {
        "text": "They were amazed at the amount of people who called them to complain that they had been personally offended by the new mug rankings.",
        "source": "api"
    },
    {
        "text": "The company was happy that so many people were talking about the mugs.",
        "source": "api"
    },
    {
        "text": "They were just surprised that people felt so extreme about it.",
        "source": "user"
    },
    {
        "text": "There are even people who have bought the mug on purpose to taunt their wives and mothers-in-law.",
        "source": "user"
    },
    {
        "text": "People were finding new uses for the mugs.",
        "source": "api"
    },
    {
        "text": "Sales were through the roof.",
        "source": "user"
    },
    {
        "text": "The newest craze was showing your ranking, good or bad.",
        "source": "user"
    },
    {
        "text": "People were pretty desperate for attention these days after all.",
        "source": "user"
    },
    {
        "text": "The company still has very high hopes for the campaign.",
        "source": "user"
    },
    {
        "text": "They believed this was just the start.",
        "source": "api"
    },
    {
        "text": "They could now use all of this interest and start producing mugs for moms, for children, for bosses.",
        "source": "user"
    },
    {
        "text": "Everyone would get a ranking.",
        "source": "user"
    },
    {
        "text": "By the end of the year, there will be entire sets of \"Best Mom\", \"Most Handsome Dad\", and \"Bossiest boss\".",
        "source": "user"
    },
    {
        "text": "The possibilities really are endless.",
        "source": "api"
    },
    {
        "text": "Once this campaign is done, people will be seeing the mug rankings everywhere.",
        "source": "user"
    },
    {
        "text": "The company will have an oversaturation issue where people won't be needing or wanting any more of these mugs for a long time.",
        "source": "user"
    },
    {
        "text": "It didn't matter though, they'd have enough money from this that they'd do fine financially until then.",
        "source": "user"
    },
    {
        "text": "So they company released every possible self ranking mug possible.",
        "source": "user"
    },
    {
        "text": "Every person and animals ended up getting a personalized ranking.",
        "source": "user"
    },
    {
        "text": "Eventually the rankings just became meaningless because the next social media craze hit.",
        "source": "user"
    },
    {
        "text": "Short attention spans are to be expected these days, so the company now begins work on the next great mug.",
        "source": "user"
    }
]