[
    "A woman has been dating guy after guy, but it never seems to work out.",
    "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
    "One day, she is getting ready for a date.",
    "She’s on her bed, and she is very tense.",
    "She has had the worst luck when it comes to dating.",
    "She has had one bad date after another.",
    "It seems like she just can’t find the guy of her dreams.",
    "But she was still optimistic.",
    "After all, she was meeting this new guy in a park.",
    "It was a beautiful day, and she was looking forward to it.",
    "She put on some music to lift her spirits.",
    "But suddenly, the music stopped.",
    "She tried to play it again but it wouldn't start.",
    "Then, she heard a strange noise.",
    "She wondered what it was but couldn't tell where it was coming from.",
    "It seemed like a voice, but she couldn't make out any words.",
    "Suddenly, the voice began to make sense.",
    "It was coming from all around her.",
    "It was the voice of a man.",
    "\"Don't forget me,\" said the voice.",
    "\"Don't ever forget me.\" \n\n\"Who are you?\" she asked.",
    "\"What's going on?\" \n\n\"I am your true love,\" said the voice.",
    "\"You will find me w hen your heart is true.",
    "Until then, nothing more can I reveal to you.\" Suddenly, the music comes back on.",
    "The voice was gone.",
    "She looked around, trying to find where the voice was coming from, but there was no one there.",
    "She sat back on her bed, deep in thought.",
    "Who was the voice?",
    "Was it telling the truth?",
    "Just then, her phone rang.",
    "It was her date calling from the park.",
    "\"Are you coming?",
    "Don't be late!\" She was about to speak, to let her date know that she was one her way.",
    "But she had a change of heart.",
    "\"No,\" she said.",
    "\"To be honest, I just don't think I'm feeling up to it today.",
    "Perhaps some other time?\" And she politely said goodbye.",
    "She realized the voice was right.",
    "She couldn't move on until she dealt with her true love first.",
    "She needed to find him, or work on improving herself so that he'll find her.",
    ""
]