[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
        "source": "api"
    },
    {
        "text": "One day, he decided to shop for an engagement ring.",
        "source": "api"
    },
    {
        "text": "He came upon a beautiful ring and fell in love with it.",
        "source": "user"
    },
    {
        "text": "He bought it and kept it waiting for the right time to propose.",
        "source": "user"
    },
    {
        "text": "Before he could propose, the woman left him to marry another man.",
        "source": "user"
    },
    {
        "text": "The shapeshifter could not stand the thought of his true love marrying another man.",
        "source": "user"
    },
    {
        "text": "He decided to use his shapeshifting ability to switch places with the groom at the altar.",
        "source": "user"
    },
    {
        "text": "The woman never knew what happened.",
        "source": "user"
    },
    {
        "text": "Many years went by and then she one day ran into what she thought was her ex boyfriend but it was really the man she thought she was marrying who was now in the form of her ex boyfriend.",
        "source": "user"
    },
    {
        "text": "Over the years, he had grown into a real playboy and had left his true love for another.",
        "source": "api"
    },
    {
        "text": "She felt very fortunate to have married her current husband who always treated her well.",
        "source": "user"
    },
    {
        "text": "They went on to have a child.",
        "source": "user"
    },
    {
        "text": "One day, when the child was around five the woman noticed something.",
        "source": "user"
    },
    {
        "text": "He was a very creative child that got very immersed in play and one day she felt he had actually become the things he pretended.",
        "source": "user"
    },
    {
        "text": "It was as if the child had real world experiences.",
        "source": "user"
    },
    {
        "text": "She went to her husband and told him about it.",
        "source": "user"
    },
    {
        "text": "Her husband said, “no it’s just play.",
        "source": "user"
    },
    {
        "text": "” He didn't dare tell her the child was likely a shapeshifter with special powers like his father.",
        "source": "api"
    },
    {
        "text": "But he knew then it was just a matter of time before his wife would one day find out all about him, and now their son.",
        "source": "user"
    }
]