[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "There have actually been a few movies I have seen recently that used this exact concept.",
        "source": "user"
    },
    {
        "text": "They were very interesting and really made you think about what happens at the \"end\".",
        "source": "user"
    },
    {
        "text": "It would definitely be more interesting than a typical funeral where people just talk and cry.",
        "source": "user"
    },
    {
        "text": "Seeing yourself interjected into a movie is something I think would be interesting.",
        "source": "user"
    },
    {
        "text": "This is a very intriguing movie idea and I think it would be an awesome concept for a movie.",
        "source": "user"
    },
    {
        "text": "I have always been fascinated with the idea of reincarnation as it essentially means someone can live on forever.",
        "source": "user"
    },
    {
        "text": "I also think that could be a very interesting premise to have as a movie.",
        "source": "user"
    },
    {
        "text": "Watching what is essentially the same person take on different bodies and lives would be intriguing to see.",
        "source": "user"
    },
    {
        "text": "I believe most people would find this concept interesting and would want to know more about it.",
        "source": "user"
    },
    {
        "text": "It would also be pretty cool to watch the main character of a movie reincarnate as you would essentially get to see all of their lives in one movie.",
        "source": "user"
    },
    {
        "text": "Reincarnation overall is a very conceptual idea that has roots in ancient culture.",
        "source": "user"
    },
    {
        "text": "I believe this movie would be a great way to get people thinking about the idea of reincarnation.",
        "source": "user"
    },
    {
        "text": "Most ancient cultures had at least some beliefs that a person would come back after death.",
        "source": "user"
    },
    {
        "text": "This movie would be a great way to show how the idea of reincarnation has impacted the culture in general.",
        "source": "user"
    },
    {
        "text": "In a way, it would help people wrap their heads around the concept and possibly learn how it has been viewed throughout history.",
        "source": "user"
    },
    {
        "text": "I think that this movie would be very popular and would be an interesting concept to watch.",
        "source": "user"
    },
    {
        "text": "The movie could begin with a man waking up and throughout the movie, it shows flashbacks of the man's past transgressions and what led up to the reincarnation event.",
        "source": "user"
    },
    {
        "text": "This would allow the viewer to become more invested in the man and develop an interest in what he did so wrong that caused a reincarnation event.",
        "source": "user"
    },
    {
        "text": "In closing I do believe this is a fascinating idea for a movie and actually has some roots in our history overall.",
        "source": "user"
    },
    {
        "text": "The movie could even go into how different cultures view reincarnation and show examples.",
        "source": "user"
    },
    {
        "text": "This would be a great way to get people thinking about this fascinating topic.",
        "source": "user"
    },
    {
        "text": "It is always good to get people thinking about death and what can happen in the future.",
        "source": "user"
    },
    {
        "text": "I believe this movie would be a great way to help people understand reincarnation and have an interest in it.",
        "source": "user"
    }
]