[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "This has caused some issues for families.",
        "source": "user"
    },
    {
        "text": "The Dads whose mugs are ranked very low has offended them.",
        "source": "user"
    },
    {
        "text": "They're taking it personally and feel as if they are a failure.",
        "source": "user"
    },
    {
        "text": "The funny thing is they don't even know what the ranking system is.",
        "source": "user"
    },
    {
        "text": "They just know that their mug doesn't say #1 Dad anymore and that has hurt their confidence.",
        "source": "user"
    },
    {
        "text": "The next morning something interesting happens.",
        "source": "user"
    },
    {
        "text": "All of the #1 Mom mugs have also changed to show their actual ranking.",
        "source": "user"
    },
    {
        "text": "The moms are also offended and their confidence seems to be shook too.",
        "source": "user"
    },
    {
        "text": "Again, neither parent even knows what these rankings actually mean.",
        "source": "user"
    },
    {
        "text": "They just know that their mug no longer says #1 Mom or Dad on it.",
        "source": "user"
    },
    {
        "text": "A news brief covers the story and goes on about the effects that this change in mugs has had on families.",
        "source": "user"
    },
    {
        "text": "Stress levels and anxiety were increased.",
        "source": "user"
    },
    {
        "text": "The video also reported that social media is flooded with posts from parents, upset that a mug they bought has changed.",
        "source": "user"
    },
    {
        "text": "Mug companies were getting called each day with complaints as if they had anything to do with it.",
        "source": "user"
    },
    {
        "text": "The next day another news brief hits that explains that an alien ended up hacking the planet which changed all of the mugs.",
        "source": "user"
    },
    {
        "text": "The alien hacks into the news brief and tells everyone that he wanted to show all humans how much they care about what others think.",
        "source": "user"
    },
    {
        "text": "He wanted to teach human beings a lesson.",
        "source": "user"
    },
    {
        "text": "The alien explained that human beings need to care less about what strangers think and more about how they feel about themselves and they need to care more about their families opinions.",
        "source": "user"
    },
    {
        "text": "Those ones mean a great deal more than a strangers.",
        "source": "user"
    }
]