[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "He decides to just wait it out and see if anyone will ever miss him or come for him.",
        "source": "user"
    },
    {
        "text": "That is, until he meets a young boy named Scrotal Recall.",
        "source": "user"
    },
    {
        "text": "Initially, he decides to only pretend to be his friend, but as he gets to know him personally, the alien begins to genuinely care for his well being.",
        "source": "api"
    },
    {
        "text": "The story will take place in the distant future where there will be flying cars and airplanes that can fly under water.",
        "source": "user"
    },
    {
        "text": "There will also be a time machine that takes people back to the past.",
        "source": "user"
    },
    {
        "text": "The alien's spaceship will be a time machine that can take people to any point in history, and it can even transport entire planets from one location to another.",
        "source": "api"
    },
    {
        "text": "The show's creator, Johnny Candon, is a 20-year-old student at the University of Southern California and an intern on the Disney Channel series \"K.C. Undercover.\" He was also an intern on the slapstick comedy series, \"Mulaney.\" He saw the show as something that was not done before and wanted it to be different from the rest and cast Matt Damon in it since he was a fan since his younger days.",
        "source": "api"
    },
    {
        "text": "The show rotates around Matt and the young boy.",
        "source": "user"
    },
    {
        "text": "The alien, on the other hand, will be in most of the episodes but will not have a lot to do with their story lines.",
        "source": "user"
    },
    {
        "text": "Candon said that he wanted to have a show where there was a human character and an alien character who are both the main characters and do not interact.",
        "source": "api"
    },
    {
        "text": "The show was ready to debut on HBO but the filming was delayed due to covid and had to be pushed back .",
        "source": "user"
    },
    {
        "text": "The reviewers have been raving about the show and cannot wait for the pilot episode to debut to get a full scope of how the audience reacts.",
        "source": "user"
    }
]