[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api",
        "last_event_time": 546.0,
        "start_time": 0.0,
        "end_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.11676510676965016
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. In fact, it is revealed that the rest of the world decided to band together and form a single entity known as \"The Coalition.\"",
        "source": "api",
        "last_event_time": 546.0,
        "start_time": 39.0,
        "end_time": 39.0,
        "start_progress": 0.11676510676965016,
        "end_progress": 0.1744661517492049
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. \n\nIn fact, it is revealed that the rest of the world decided to band together and form a single entity known as \"The Coalition.\" As you're the United States and have found out that every other country has banded together, you feel left out.\n\nYou did your part in isolating and obviously the other countries did not. Your country feels betrayed and wronged and rightfully so. You try to set up a meeting with the Coalition and to your surprise, the world leaders of the Coalition agree. The meeting goes pretty well but for the first time in a long time you realize that the United States is no longer the most powerful country or nation in the world.\n\nSimply put, the Coalition has the numbers. You ask yourself how it's possible that all these countries could come together as one and start to feel panic. The only thing that makes logical sense is these countries banded together to take down the US. Why else would they break the post WWII rules and not go into isolation?\n\nYou have another meeting with the coalition and try to create an agreement with them. There will be no conflicts and the United States will stick to their own country. They don't want to get involved in any of the matters that the Coalition are involved in. The agreement is signed. The United States and the Coalition will not get involved in any internal conflicts and will stay neutral related to each other.\n\nThe issue for the Coalition is they didn't realize how difficult it is to run an entire nation filled with different people and countries within it. Greed ended up getting the best of them and their nation ended up collapsing. There were civil wars, economic collapses, and no real way of being on the same page. The Coalition then spread apart and became nothing. Each country went their separate way and had to rebuild. \n\nOnce again, even by chance in this scenario the United States was back on top as the number one Super Power in the entire world. ",
        "source": "user",
        "last_event_time": 546.0,
        "start_time": 41.0,
        "end_time": 546.0,
        "start_progress": 0.1744661517492049,
        "end_progress": 1.0
    }
]