[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "The survivors begin using this ancient power to fight back against the alien aggressors.",
        "source": "user"
    },
    {
        "text": "The aliens begin to realize that by failing to eradicate us completely they have created the only weapon that has a chance of beating them.",
        "source": "user"
    },
    {
        "text": "As the war rages on, the humans begin to realize that the aliens have been manipulating them for thousands of years.",
        "source": "user"
    },
    {
        "text": "They see that it was no accident that aliens didn't kill off all of mankind, in fact they could have easily done so!",
        "source": "user"
    },
    {
        "text": "The aliens' true goal was always to gain access to the ancient human magical powers.",
        "source": "user"
    },
    {
        "text": "The aliens have been using humanity as a tool to help them achieve their own goals.",
        "source": "user"
    },
    {
        "text": "They wish to harness our magic to dominate all their enemies and become the dominant species in the universe.",
        "source": "user"
    },
    {
        "text": "Their plan is to control our minds after the ancient power has awoken within us making us drone weapons that they can control.",
        "source": "user"
    },
    {
        "text": "The humans must fight back against the aliens and their own ancient magic to prevent the aliens from achieving their goal.",
        "source": "user"
    },
    {
        "text": "The aliens underestimated the independent spirit at the heart of mankind and are unable to control our minds as they planned to.",
        "source": "user"
    },
    {
        "text": "With our new magical power we are able to kill many of the aliens.",
        "source": "user"
    },
    {
        "text": "Those who we don't kill we subdue and they become subservient to us.",
        "source": "user"
    },
    {
        "text": "Ironically, it is the aliens that now come under our control.",
        "source": "user"
    }
]