[
    "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
    "Your government decides to give the drug to all citizens under 26, but you and the rest of the \"Lost Generations\" are deemed too high-risk.",
    "When you're 85, the side effects are finally discovered.",
    "This is the story of a group of people who are forced to live with the consequences of immortality.",
    "The negative being that although you are not aging and are technically immortal, you are also not given the positive effects of aging.",
    "For example, you do not become any more wise, you do not learn from your mistakes, and you are not able to become a better person.",
    "Essentially, people are stuck exactly where they were when they received the drug.",
    "This turns people mad in a way, forced into lives of repetitiveness.",
    "The suicide rates go up, murder rates go up, and violence in general.",
    "Although people are not dying from old age, they are now dying more often from homicide.",
    "The world is much more dangerous than it was pre-immortality drug.",
    "Since the immortal have stopped the side effects of aging, when they have kids the kids remain kids.",
    "Therefore, if the immortal race is wiped out there will be nothing but babies left on the planet.",
    "This will cause humans to die out completely.",
    "The story is told through the eyes of a man named Adam, who is a member of the Lost Generations.",
    "Adam has seen all of the consequences of the drug and has seen what the world was going to come to.",
    "He created his own village for people of the lost generation, and aimed to have it be a safe place.",
    "A place free from crime, murder, etc.",
    "The generation who were administered the drug do not like this, and want to attempt to overcome this village.",
    "This turns into a war.",
    "Adam essentially played a part in creating a war between the older and younger generation of people.",
    "The younger generation knows that once this lost generation is wiped out, all that is left is the immortals.",
    "The immortals are the only people who can truly be free, as they are not bound by the laws of the world.",
    "However the war is more important than that to Adam.",
    "Adam is fighting to have the generation live on that is able to grow, and adapt and prosper.",
    "If Adam is not able to conquer the immortals despite his old age, he knows the human race as everyone knows it is doomed.",
    ""
]