[
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.1476655808903366
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. It all started when an ancient book was discovered at an abandoned used book store. The odds of this happening were a billion to one since books were no longer used, only digital devices. But, the book just happened to fall at the foot of a man who had the means and will to save the world. The book tells the story of how man came to weild magic over 35000 years ago. \n",
        "source": "user",
        "start_time": 13.0,
        "end_time": 203.0,
        "last_event_time": 203.0,
        "start_progress": 0.1476655808903366,
        "end_progress": 0.3485342019543974
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. It all started when an ancient book was discovered at an abandoned used book store. The odds of this happening were a billion to one since books were no longer used, only digital devices. But, the book just happened to fall at the foot of a man who had the means and will to save the world. The book tells the story of how man came to weild magic over 35000 years ago. It tells of the many wars between the forces of good and evil that man waged using magical spells.\n",
        "source": "api",
        "start_time": 227.0,
        "end_time": 227.0,
        "last_event_time": 227.0,
        "start_progress": 0.3485342019543974,
        "end_progress": 0.4017372421281216
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. It all started when an ancient book was discovered at an abandoned used book store. The odds of this happening were a billion to one since books were no longer used, only digital devices. But, the book just happened to fall at the foot of a man who had the means and will to save the world. The book tells the story of how man came to weild magic over 35000 years ago. It tells of the many wars between the forces of good and evil that man waged using magical spells and how ultimately evil was eradicated from the world and an age of enlightenment and progress began. That all fell apart once man lost the ability to use magic because the force is limited and shared throughout humanity. Tribes turned into villages, and then into nations who fought wars and destroyed the planet. Then the aliens arrived and we all gathered together to fight the common enemy. We lost. \nThis book also explained how to conjure up this magic from inside the body. The man tried this and was able to create a whirlwind of glowing energy in his hands. He then threw this energy at a desk and then watched it exp load. \n",
        "source": "user",
        "start_time": 229.0,
        "end_time": 546.0,
        "last_event_time": 546.0,
        "start_progress": 0.4017372421281216,
        "end_progress": 0.745385450597177
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. It all started when an ancient book was discovered at an abandoned used book store. The odds of this happening were a billion to one since books were no longer used, only digital devices. But, the book just happened to fall at the foot of a man who had the means and will to save the world. The book tells the story of how man came to weild magic over 35000 years ago. It tells of the many wars between the forces of good and evil that man waged using magical spells and how ultimately evil was eradicated from the world and an age of enlightenment and progress began. That all fell apart once man lost the ability to use magic because the force is limited and shared throughout humanity. Tribes turned into villages, and then into nations who fought wars and destroyed the planet. Then the aliens arrived and we all gathered together to fight the common enemy. We lost. \nThis book also explained how to conjure up this magic from inside the body. The man tried this and was able to create a whirlwind of glowing energy in his hands. He then threw this energy at a desk and then watched it exp load. He was amazed.\n",
        "source": "api",
        "start_time": 557.0,
        "end_time": 557.0,
        "last_event_time": 557.0,
        "start_progress": 0.745385450597177,
        "end_progress": 0.752985884907709
    },
    {
        "text": "Humans once wielded formidable magical power. But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect. When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again. It all started when an ancient book was discovered at an abandoned used book store. The odds of this happening were a billion to one since books were no longer used, only digital devices. But, the book just happened to fall at the foot of a man who had the means and will to save the world. The book tells the story of how man came to wield magic over 35000 years ago. It tells of the many wars between the forces of good and evil that man waged using magical spells and how ultimately evil was eradicated from the world and an age of enlightenment and progress began. That all fell apart once man lost the ability to use magic because the force is limited and shared throughout humanity. Tribes turned into villages, and then into nations who fought wars and destroyed the planet. Then the aliens arrived and we all gathered together to fight the common enemy. We lost. \nThis book also explained how to conjure up this magic from inside the body. The man tried this and was able to create a whirlwind of glowing energy in his hands. He then threw this energy at a desk and then watched it exp load. He was amazed. He went back to the last remaining human settlement and honed his powers while teaching the rest of the human race how to do the same. The humans were able to create matter and energy from nothing and this gave them the edge they needed to beat back the alien forces, sending them running back to their home world. Humanity would go on to use these powers to rebuild civilization and even created a way to amplify the mana so every human could use magic.\n",
        "source": "user",
        "start_time": 558.0,
        "end_time": 739.0,
        "last_event_time": 739.0,
        "start_progress": 0.752985884907709,
        "end_progress": 1.0
    }
]