[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "The woman's name is Soeurette, and the man that she keeps dating is named Tyler, although Tyler can take many forms.",
        "source": "user"
    },
    {
        "text": "Sometimes Tyler goes by Matthew and other times he goes by Jake or Ben, depending on the identity that he's hoping to adopt in that moment.",
        "source": "user"
    },
    {
        "text": "When Soeurette first met Tyler, she was in college.",
        "source": "user"
    },
    {
        "text": "She actually got pregnant by Tyler in her sophomore year of college.",
        "source": "user"
    },
    {
        "text": "When she told him about the pregnancy, he freaked out and left her.",
        "source": "user"
    },
    {
        "text": "She was heartbroken, but she was also angry.",
        "source": "user"
    },
    {
        "text": "She decided to move on with her life and put Tyler behind her.",
        "source": "user"
    },
    {
        "text": "But Tyler realized that he was wrong to leave Soeurette.",
        "source": "user"
    },
    {
        "text": "It had never been his intention to hurt her.",
        "source": "user"
    },
    {
        "text": "No, he did care deeply for Soeurette and just didn't feel ready to be a father.",
        "source": "user"
    },
    {
        "text": "So Tyler hatched a plan to reenter Soeurette's life just a year later.",
        "source": "user"
    },
    {
        "text": "He took on the identity \"Matthew.\" He told Soeurette that he was a friend of Tyler's and that Tyler had told him all about her.",
        "source": "user"
    },
    {
        "text": "He was so charming and sweet that Soeurette fell for him right away.",
        "source": "user"
    },
    {
        "text": "They started dating and were soon engaged.",
        "source": "user"
    },
    {
        "text": "But then, a month before the wedding, Matthew broke up with Soeurette.",
        "source": "user"
    },
    {
        "text": "He said that he didn't want to get married after all.",
        "source": "user"
    },
    {
        "text": "He wasn't ready to be a stepfather to Soeurette's little girl.",
        "source": "user"
    },
    {
        "text": "Soeurette was so angry with Matthew that she threw him out of her life immediately.",
        "source": "user"
    },
    {
        "text": "What was it with men who couldn't commit for the long haul?",
        "source": "user"
    },
    {
        "text": "Soeurette didn't realize that Matthew was actually Tyler, and that Tyler just got cold feet for the second time, just as he had upon learning of Soeurette's pregnancy.",
        "source": "user"
    },
    {
        "text": "Soeurette moved on with her life, but Tyler was determined to win her back.",
        "source": "user"
    },
    {
        "text": "So this time he took on the identity \"Jake.\" When Soeurette first met Jake she was blown away.",
        "source": "user"
    },
    {
        "text": "Jake was very handsome and successful.",
        "source": "user"
    },
    {
        "text": "He was a successful businessman who owned a chain of restaurants.",
        "source": "user"
    },
    {
        "text": "Soeurette was so happy to have found a man who was so good looking and successful.",
        "source": "user"
    },
    {
        "text": "She was so happy that she didn't notice that Jake was actually Tyler.",
        "source": "user"
    },
    {
        "text": "Soeurette eventually asked Jake to move in with her.",
        "source": "user"
    },
    {
        "text": "But then Jake revealed he had actually been cheating on her with another woman named Emily.",
        "source": "user"
    },
    {
        "text": "Soeurette was furious.",
        "source": "user"
    },
    {
        "text": "Tyler felt guilty for cheating on Soeurette but at the same time he knew that coming clean would make him feel better.",
        "source": "user"
    },
    {
        "text": "So once again he was thrown out of Soeurette's life.",
        "source": "user"
    },
    {
        "text": "Finally, he reentered Soeurette's life as Ben.",
        "source": "user"
    },
    {
        "text": "This time, he was determined to make things right.",
        "source": "user"
    },
    {
        "text": "He was going to be the man that Soeurette deserved.",
        "source": "user"
    },
    {
        "text": "He was going to be the man that she could trust.",
        "source": "user"
    },
    {
        "text": "Ben did all the things that Soeurette expected of a man.",
        "source": "user"
    },
    {
        "text": "He took care of her and loved her fully.",
        "source": "user"
    },
    {
        "text": "Soeurette agreed to marry Ben and they eventually did get married.",
        "source": "user"
    },
    {
        "text": "Soeurette got pregnant again.",
        "source": "user"
    },
    {
        "text": "This time, Tyler was determined to be a good father.",
        "source": "user"
    },
    {
        "text": "He did not walk out upon learning of Soeurette's pregnancy.",
        "source": "user"
    },
    {
        "text": "No, he was going to be the father that Soeurette's daughter deserved.",
        "source": "user"
    },
    {
        "text": "And he kept this promise.",
        "source": "user"
    },
    {
        "text": "Finally, Soeurette had truly found the one, but little did she know, she had found \"the one\" all along.",
        "source": "user"
    }
]