[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "The aliens are determined to figure out what makes Matt Damon so special that thousands of people would risk their lives to get him back.",
        "source": "user"
    },
    {
        "text": "They begin running tests on him.",
        "source": "user"
    },
    {
        "text": "Is it a biological thing?",
        "source": "user"
    },
    {
        "text": "No, it's not.",
        "source": "user"
    },
    {
        "text": "They then begin to realize it's just a boyish charm, something they can't themselves have.",
        "source": "user"
    },
    {
        "text": "So they come up with a plan to clone him, but unfortunately for them the cloning machine malfunctions.",
        "source": "user"
    },
    {
        "text": "They get a bunch of clones of Matt Damon.",
        "source": "user"
    },
    {
        "text": "However, none of them have the same charm.",
        "source": "user"
    },
    {
        "text": "They are just like an every day, average guy.",
        "source": "user"
    },
    {
        "text": "Apparently you can't replicate Matt Damon's one of a kind quality.",
        "source": "user"
    },
    {
        "text": "So the aliens have no choice but to keep all of these clones locked in a cage.",
        "source": "user"
    },
    {
        "text": "They know that people from Earth will soon show up to rescue him.",
        "source": "user"
    },
    {
        "text": "They begin trying to find the clone that is the closest to the real Matt Damon.",
        "source": "user"
    },
    {
        "text": "They will then send that one back to Earth and announce to the world that Matt Damon has been found.",
        "source": "user"
    },
    {
        "text": "They find one that is close.",
        "source": "user"
    },
    {
        "text": "He is a little too smart and not charming enough but he'll do.",
        "source": "user"
    },
    {
        "text": "So they dress him up as Matt Damon and send him back to Earth in an escape shuttle.",
        "source": "user"
    },
    {
        "text": "Earth is very happy to have him back and cancel the rescue mission.",
        "source": "user"
    },
    {
        "text": "All is well for a little while.",
        "source": "user"
    },
    {
        "text": "However, subpar Matt Damon movies begin coming out on Earth.",
        "source": "user"
    },
    {
        "text": "No one is sure what is off about them.",
        "source": "user"
    },
    {
        "text": "They just don't seem to be the same.",
        "source": "user"
    },
    {
        "text": "People just put up with his new lackluster movies out of a sense of duty.",
        "source": "user"
    },
    {
        "text": "Meanwhile the real Matt Damon is making movies for the aliens of space.",
        "source": "user"
    },
    {
        "text": "They are huge hits and he enjoys being an intergalactic celebrity.",
        "source": "user"
    },
    {
        "text": "He gets along with the aliens and enjoys his life.",
        "source": "user"
    },
    {
        "text": "Sometimes he'll request that they kidnap a co-star for one of his movies but in general he just has fun working with upcoming alien actors.",
        "source": "user"
    }
]