[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 0.0,
        "end_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.053849222177901876
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 8.0,
        "end_time": 135.0,
        "start_progress": 0.053849222177901876,
        "end_progress": 0.13382528919026726
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 150.0,
        "end_time": 150.0,
        "start_progress": 0.13382528919026726,
        "end_progress": 0.14718787395293179
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 154.0,
        "end_time": 228.0,
        "start_progress": 0.14718787395293179,
        "end_progress": 0.17969684882329479
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 238.0,
        "end_time": 238.0,
        "start_progress": 0.17969684882329479,
        "end_progress": 0.19365775827682488
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 240.0,
        "end_time": 269.0,
        "start_progress": 0.19365775827682488,
        "end_progress": 0.22197846031112883
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 276.0,
        "end_time": 276.0,
        "start_progress": 0.22197846031112883,
        "end_progress": 0.23932987634623054
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 279.0,
        "end_time": 293.0,
        "start_progress": 0.23932987634623054,
        "end_progress": 0.2534902273633825
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 302.0,
        "end_time": 307.0,
        "start_progress": 0.2534902273633825,
        "end_progress": 0.2674511368169126
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 311.0,
        "end_time": 352.0,
        "start_progress": 0.2674511368169126,
        "end_progress": 0.29936178699641003
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 311.0,
        "end_time": 408.0,
        "start_progress": 0.29936178699641003,
        "end_progress": 0.33187076186677306
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 416.0,
        "end_time": 416.0,
        "start_progress": 0.33187076186677306,
        "end_progress": 0.34822497008376546
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting.  ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 419.0,
        "end_time": 601.0,
        "start_progress": 0.34822497008376546,
        "end_progress": 0.4323893099321899
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 619.0,
        "end_time": 622.0,
        "start_progress": 0.4323893099321899,
        "end_progress": 0.4515357000398883
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 622.0,
        "end_time": 646.0,
        "start_progress": 0.4515357000398883,
        "end_progress": 0.46110889509373754
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 655.0,
        "end_time": 655.0,
        "start_progress": 0.46110889509373754,
        "end_progress": 0.46888711607499
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees.  ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 658.0,
        "end_time": 734.0,
        "start_progress": 0.46888711607499,
        "end_progress": 0.49222177901874753
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees.The bee told me that I did not have a deadly allergy, and that my mother had lied to me.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 744.0,
        "end_time": 748.0,
        "start_progress": 0.49222177901874753,
        "end_progress": 0.5093737534902274
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 748.0,
        "end_time": 776.0,
        "start_progress": 0.5093737534902274,
        "end_progress": 0.5235341045073794
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 791.0,
        "end_time": 791.0,
        "start_progress": 0.5235341045073794,
        "end_progress": 0.5476665337056242
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 792.0,
        "end_time": 808.0,
        "start_progress": 0.5476665337056242,
        "end_progress": 0.5648185081771041
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 827.0,
        "end_time": 827.0,
        "start_progress": 0.5648185081771041,
        "end_progress": 0.5771838851216593
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 830.0,
        "end_time": 867.0,
        "start_progress": 0.5771838851216593,
        "end_progress": 0.5983246908655764
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the  bee, and that I was the only one who could end the war between bees and wasps.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 882.0,
        "end_time": 890.0,
        "start_progress": 0.5983246908655764,
        "end_progress": 0.6202632628639808
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 890.0,
        "end_time": 924.0,
        "start_progress": 0.6202632628639808,
        "end_progress": 0.6386118867171918
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 932.0,
        "end_time": 932.0,
        "start_progress": 0.6386118867171918,
        "end_progress": 0.6541683286796969
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home.",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 935.0,
        "end_time": 990.0,
        "start_progress": 0.6541683286796969,
        "end_progress": 0.6711208615875548
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home. I told the bee that I would go to Europe to find the wasp queen.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 1004.0,
        "end_time": 1004.0,
        "start_progress": 0.6711208615875548,
        "end_progress": 0.6840845632229756
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home. I told the bee that I would go to Europe to find the wasp queen. I boarded a flight with my personal bee in tow, and flew to Europe. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 1005.0,
        "end_time": 1022.0,
        "start_progress": 0.6840845632229756,
        "end_progress": 0.6978460311128839
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home. I told the bee that I would go to Europe to find the wasp queen. I boarded a flight with my personal bee in tow, and flew to Europe. I found the wasp queen's home in a small town in Germany.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 1046.0,
        "end_time": 1046.0,
        "start_progress": 0.6978460311128839,
        "end_progress": 0.7092142002393299
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home. I told the bee that I would go to Europe to find the wasp queen. I boarded a flight with my personal bee in tow, and flew to Europe. I found the wasp queen's home in a small town in Germany. I was about to walk in to her home , when suddenly, my mother arrived before me. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 1048.0,
        "end_time": 1077.0,
        "start_progress": 0.7092142002393299,
        "end_progress": 0.7255684084563223
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home. I told the bee that I would go to Europe to find the wasp queen. I boarded a flight with my personal bee in tow, and flew to Europe. I found the wasp queen's home in a small town in Germany. I was about to walk in to her home , when suddenly, my mother arrived  She told me that she had known about my plan to come to Europe to find the wasp queen, and she had come to stop me.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 1093.0,
        "end_time": 1101.0,
        "start_progress": 0.7255684084563223,
        "end_progress": 0.7465097726366174
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home. I told the bee that I would go to Europe to find the wasp queen. I boarded a flight with my personal bee in tow, and flew to Europe. I found the wasp queen's home in a small town in Germany. I was about to walk in to her home , when suddenly, my mother arrived before me. She told me that she had known about my plan to come to Europe to find the wasp queen, and she had come to stop me. I told my mother I had to do my job as the princess bee and stop the longstanding war. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 1102.0,
        "end_time": 1125.0,
        "start_progress": 0.7465097726366174,
        "end_progress": 0.7660550458715596
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home. I told the bee that I would go to Europe to find the wasp queen. I boarded a flight with my personal bee in tow, and flew to Europe. I found the wasp queen's home in a small town in Germany. I was about to walk in to her home , when suddenly, my mother arrived before me. She told me that she had known about my plan to come to Europe to find the wasp queen, and she had come to stop me. I told my mother I had to do my job as the princess bee and stop the longstanding war. My mother told me that the war had been going on for so long, that it was pointless to stop it.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 1136.0,
        "end_time": 1136.0,
        "start_progress": 0.7660550458715596,
        "end_progress": 0.7850019944156362
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home. I told the bee that I would go to Europe to find the wasp queen. I boarded a flight with my personal bee in tow, and flew to Europe. I found the wasp queen's home in a small town in Germany. I was about to walk in to her home , when suddenly, my mother arrived before me. She told me that she had known about my plan to come to Europe to find the wasp queen, and she had come to stop me. I told my mother I had to do my job as the princess bee and stop the longstanding war. My mother told me that the war had been going on for so long, that it was pointless to stop it. Nevertheless, I pushed my mother aside and knocked on the door. An old woman opened the door and I asked if the wasp queen lived here. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 1139.0,
        "end_time": 1189.0,
        "start_progress": 0.7850019944156362,
        "end_progress": 0.812126047068209
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home. I told the bee that I would go to Europe to find the wasp queen. I boarded a flight with my personal bee in tow, and flew to Europe. I found the wasp queen's home in a small town in Germany. I was about to walk in to her home , when suddenly, my mother arrived before me. She told me that she had known about my plan to come to Europe to find the wasp queen, and she had come to stop me. I told my mother I had to do my job as the princess bee and stop the longstanding war. My mother told me that the war had been going on for so long, that it was pointless to stop it. Nevertheless, I pushed my mother aside and knocked on the door. An old woman opened the door and I asked if the wasp queen lived here. The old woman said that she was the wasp queen, and I told her that I was the princess bee.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 1199.0,
        "end_time": 1199.0,
        "start_progress": 0.812126047068209,
        "end_progress": 0.8302752293577982
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home. I told the bee that I would go to Europe to find the wasp queen. I boarded a flight with my personal bee in tow, and flew to Europe. I found the wasp queen's home in a small town in Germany. I was about to walk in to her home , when suddenly, my mother arrived before me. She told me that she had known about my plan to come to Europe to find the wasp queen, and she had come to stop me. I told my mother I had to do my job as the princess bee and stop the longstanding war. My mother told me that the war had been going on for so long, that it was pointless to stop it. Nevertheless, I pushed my mother aside and knocked on the door. An old woman opened the door and I asked if the wasp queen lived here. The old woman said that she was the wasp queen, and I told her that I was the princess bee. She had been expecting me for many years and invited my mother and I in. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 1203.0,
        "end_time": 1217.0,
        "start_progress": 0.8302752293577982,
        "end_progress": 0.8450339050658158
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home. I told the bee that I would go to Europe to find the wasp queen. I boarded a flight with my personal bee in tow, and flew to Europe. I found the wasp queen's home in a small town in Germany. I was about to walk in to her home , when suddenly, my mother arrived before me. She told me that she had known about my plan to come to Europe to find the wasp queen, and she had come to stop me. I told my mother I had to do my job as the princess bee and stop the longstanding war. My mother told me that the war had been going on for so long, that it was pointless to stop it. Nevertheless, I pushed my mother aside and knocked on the door. An old woman opened the door and I asked if the wasp queen lived here. The old woman said that she was the wasp queen, and I told her that I was the princess bee. She had been expecting me for many years and invited my mother and I in. We sat at her table and she told me that she had been waiting for me to come and stop the war.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 1226.0,
        "end_time": 1226.0,
        "start_progress": 0.8450339050658158,
        "end_progress": 0.8637814120462705
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home. I told the bee that I would go to Europe to find the wasp queen. I boarded a flight with my personal bee in tow, and flew to Europe. I found the wasp queen's home in a small town in Germany. I was about to walk in to her home , when suddenly, my mother arrived before me. She told me that she had known about my plan to come to Europe to find the wasp queen, and she had come to stop me. I told my mother I had to do my job as the princess bee and stop the longstanding war. My mother told me that the war had been going on for so long, that it was pointless to stop it. Nevertheless, I pushed my mother aside and knocked on the door. An old woman opened the door and I asked if the wasp queen lived here. The old woman said that she was the wasp queen, and I told her that I was the princess bee. She had been expecting me for many years and invited my mother and I in. We sat at her table and she told me that she had been waiting for me to come and stop the war. She had been the leader of the wasps for far too long and had seen many casualties. The war between bees and wasps was pointless in her opinion and she wanted to make things right. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 1230.0,
        "end_time": 1264.0,
        "start_progress": 0.8637814120462705,
        "end_progress": 0.9000797766254487
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home. I told the bee that I would go to Europe to find the wasp queen. I boarded a flight with my personal bee in tow, and flew to Europe. I found the wasp queen's home in a small town in Germany. I was about to walk in to her home , when suddenly, my mother arrived before me. She told me that she had known about my plan to come to Europe to find the wasp queen, and she had come to stop me. I told my mother I had to do my job as the princess bee and stop the longstanding war. My mother told me that the war had been going on for so long, that it was pointless to stop it. Nevertheless, I pushed my mother aside and knocked on the door. An old woman opened the door and I asked if the wasp queen lived here. The old woman said that she was the wasp queen, and I told her that I was the princess bee. She had been expecting me for many years and invited my mother and I in. We sat at her table and she told me that she had been waiting for me to come and stop the war. She had been the leader of the wasps for far too long and had seen many casualties. The war between bees and wasps was pointless in her opinion and she wanted to make things right. I told her that I agreed with her, and that I wanted to make things right.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 1277.0,
        "end_time": 1277.0,
        "start_progress": 0.9000797766254487,
        "end_progress": 0.9148384523334663
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home. I told the bee that I would go to Europe to find the wasp queen. I boarded a flight with my personal bee in tow, and flew to Europe. I found the wasp queen's home in a small town in Germany. I was about to walk in to her home , when suddenly, my mother arrived before me. She told me that she had known about my plan to come to Europe to find the wasp queen, and she had come to stop me. I told my mother I had to do my job as the princess bee and stop the longstanding war. My mother told me that the war had been going on for so long, that it was pointless to stop it. Nevertheless, I pushed my mother aside and knocked on the door. An old woman opened the door and I asked if the wasp queen lived here. The old woman said that she was the wasp queen, and I told her that I was the princess bee. She had been expecting me for many years and invited my mother and I in. We sat at her table and she told me that she had been waiting for me to come and stop the war. She had been the leader of the wasps for far too long and had seen many casualties. The war between bees and wasps was pointless in her opinion and she wanted to make things right. I told her that I agreed with her, and that I wanted to make things right. My mother, the wasp queen and myself agreed to end the war and we signed a peace treaty. The treaty also established a partnership between bees and wasps, so that we could work together and build a better world. ",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 1279.0,
        "end_time": 1326.0,
        "start_progress": 0.9148384523334663,
        "end_progress": 0.9573195053849222
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home. I told the bee that I would go to Europe to find the wasp queen. I boarded a flight with my personal bee in tow, and flew to Europe. I found the wasp queen's home in a small town in Germany. I was about to walk in to her home , when suddenly, my mother arrived before me. She told me that she had known about my plan to come to Europe to find the wasp queen, and she had come to stop me. I told my mother I had to do my job as the princess bee and stop the longstanding war. My mother told me that the war had been going on for so long, that it was pointless to stop it. Nevertheless, I pushed my mother aside and knocked on the door. An old woman opened the door and I asked if the wasp queen lived here. The old woman said that she was the wasp queen, and I told her that I was the princess bee. She had been expecting me for many years and invited my mother and I in. We sat at her table and she told me that she had been waiting for me to come and stop the war. She had been the leader of the wasps for far too long and had seen many casualties. The war between bees and wasps was pointless in her opinion and she wanted to make things right. I told her that I agreed with her, and that I wanted to make things right. My mother, the wasp queen and myself agreed to end the war and we signed a peace treaty. The treaty also established a partnership between bees and wasps, so that we could work together and build a better world. I was so happy to have ended the war that I hugged my mother and the wasp queen.",
        "source": "api",
        "last_event_time": 1373.0,
        "start_time": 1338.0,
        "end_time": 1338.0,
        "start_progress": 0.9573195053849222,
        "end_progress": 0.9732748304746709
    },
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees. You've always had people protecting you from them, be it your mother or a hired hand. Today, one slips through and lands on your shoulder. You hear a tiny voice say \"Your Majesty, what are your orders?\"\n\nGrowing up, my mother always told me that I was allergic to bees. She would tell me that I should stay away from them at all costs because it would hurt a lot. She did not want to scare me as a child, so she never told me that my allergy could be fatal, but as I got older I learned otherwise. I always avoided spending too much time outdoors, fearing that a bee would get close to me and sting me. I never told anyone about my fear of bees, and I never let it show. Outdoors, my mother always protected me from bees, but when I left for college, she could no longer protect me. She warned me many times to be careful on my own. I always told her that I would be fine, but deep down I was terrified. I stayed in doors as much as I could in my first two years of college, quickly running from building to building in order to avoid any bees. I always wore long sleeves and pants, even in the summer, in order to avoid any stings. My friends never questioned my actions and accepted me for who I was. My junior year of college, I decided to take a summer job in the city. My summer job was being a waitress at a hotel spa/pool. I had to serve customers inside of the hotel, but on occasion, I would need to go outside by the pool. One day, I met a nice boy out by the pool and we got to talking about school. I was so engrossed by our talk, that I forgot I was spending too much time outdoors. I was sitting on a lounge chair by the pool when I felt a bee land on my shoulder. The boy I had met told me I had a bee on my shoulder and I was paralyzed with fear, running back inside, hoping the bee would fly away. I got back inside the hotel and discovered that the bee had remained on my shoulder. I was about to swat the bee off my shoulder, when suddenly, I hear the bee say, \"Your Majesty, what are your orders? I could not believe my ears, I thought I might be hallucinating from a bee sting. I looked around and saw that no one else was in the room, so I decided to ask the bee a question. \"Did you call me Majesty?\", I said to the bee. \"Yes, I am your Majesty's personal bee.\" I told the bee that my mother had always told me that I had a deadly allergy to bees, so I lived in fear of bees. The bee told me that I did not have a deadly allergy, and that my mother had lied to me. I wondered why my mother would lie to me about something so strange. The bee told me that my mother had lied to me because she was a bee queen, and she wanted to protect me from her enemies. I asked the bee who my enemies were and the bee said that my enemies were the wasps. I had never heard of wasps, so I asked the bee what they were. The bee said that wasps were the ancient enemies of bees, caught in a long war throughout the centuries. The bee told me that I was the princess bee, and that I was the only one who could end the war between bees and wasps. I asked the bee what the first order of business was in the war against the wasps. The bee told me that the first order of business was to find the wasps' queen. The wasp queen had been living in Europe, all the way across the world from my home. I told the bee that I would go to Europe to find the wasp queen. I boarded a flight with my personal bee in tow, and flew to Europe. I found the wasp queen's home in a small town in Germany. I was about to walk in to her home , when suddenly, my mother arrived before me. She told me that she had known about my plan to come to Europe to find the wasp queen, and she had come to stop me. I told my mother I had to do my job as the princess bee and stop the longstanding war. My mother told me that the war had been going on for so long, that it was pointless to stop it. Nevertheless, I pushed my mother aside and knocked on the door. An old woman opened the door and I asked if the wasp queen lived here. The old woman said that she was the wasp queen, and I told her that I was the princess bee. She had been expecting me for many years and invited my mother and I in. We sat at her table and she told me that she had been waiting for me to come and stop the war. She had been the leader of the wasps for far too long and had seen many casualties. The war between bees and wasps was pointless in her opinion and she wanted to make things right. I told her that I agreed with her, and that I wanted to make things right. My mother, the wasp queen and myself agreed to end the war and we signed a peace treaty. The treaty also established a partnership between bees and wasps, so that we could work together and build a better world. I was so happy to have ended the war that I hugged my mother and the wasp queen. My mother and I left Germany and flew back home, knowing that our future looked bright. I no longer needed to fear the outside world.",
        "source": "user",
        "last_event_time": 1373.0,
        "start_time": 1339.0,
        "end_time": 1373.0,
        "start_progress": 0.9732748304746709,
        "end_progress": 1.0
    }
]