[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.19316081330868762
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. The movie starts with a boy living in a poor family. \n",
        "source": "user",
        "start_time": 45.0,
        "end_time": 130.0,
        "last_event_time": 130.0,
        "start_progress": 0.19316081330868762,
        "end_progress": 0.24306839186691312
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. The movie starts with a boy living in a poor family. He's a bit of an underachiever and never seems to get anything right, but his luck is about to change when a strange man gives him\n",
        "source": "api",
        "start_time": 155.0,
        "end_time": 155.0,
        "last_event_time": 155.0,
        "start_progress": 0.24306839186691312,
        "end_progress": 0.3632162661737523
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. The movie starts with a boy living in a poor family. He's a bit of an underachiever and never seems to get anything right, but his luck is about to change when a strange man gives him a mirror. \n",
        "source": "user",
        "start_time": 178.0,
        "end_time": 208.0,
        "last_event_time": 208.0,
        "start_progress": 0.3632162661737523,
        "end_progress": 0.3733826247689464
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. The movie starts with a boy living in a poor family. He's a bit of an underachiever and never seems to get anything right, but his luck is about to change when a strange man gives him a mirror. Turns out this mirror has magical powers and allows him to go back in time to prevent people's deaths.\n",
        "source": "api",
        "start_time": 244.0,
        "end_time": 244.0,
        "last_event_time": 244.0,
        "start_progress": 0.3733826247689464,
        "end_progress": 0.4676524953789279
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. The movie starts with a boy living in a poor family. His father died of a car accident. He's a bit of an underachiever and never seems to get anything right, but his luck is about to change when a strange man gives him a mirror. Turns out this mirror has magical powers and allows him to go back in time to prevent people's deaths. \n",
        "source": "user",
        "start_time": 247.0,
        "end_time": 300.0,
        "last_event_time": 300.0,
        "start_progress": 0.4676524953789279,
        "end_progress": 0.5009242144177449
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. The movie starts with a boy living in a poor family. His father died of a car accident. He's a bit of an underachiever and never seems to get anything right, but his luck is about to change when a strange man gives him a mirror. Turns out this mirror has magical powers and allows him to go back in time to prevent people's deaths. The boy uses the mirror to save his mother, which also saves his father's life.\n",
        "source": "api",
        "start_time": 325.0,
        "end_time": 325.0,
        "last_event_time": 325.0,
        "start_progress": 0.5009242144177449,
        "end_progress": 0.5739371534195934
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. The movie starts with a boy living in a poor family. His father died of a car accident. He's a bit of an underachiever and never seems to get anything right, but his luck is about to change when a strange man gives him a mirror. Turns out this mirror has magical powers and allows him to go back in time to prevent people's deaths. The boy uses the mirror to save his father's life. He talks to the mirror and asks the mirror to bring back his father. \n",
        "source": "user",
        "start_time": 332.0,
        "end_time": 363.0,
        "last_event_time": 363.0,
        "start_progress": 0.5739371534195934,
        "end_progress": 0.6118299445471349
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. The movie starts with a boy living in a poor family. His father died of a car accident. He's a bit of an underachiever and never seems to get anything right, but his luck is about to change when a strange man gives him a mirror. Turns out this mirror has magical powers and allows him to go back in time to prevent people's deaths. The boy uses the mirror to save his father's life. He talks to the mirror and asks the mirror to bring back his father. The mirror takes him back in time, and he's able to prevent his father's death.\n",
        "source": "api",
        "start_time": 383.0,
        "end_time": 383.0,
        "last_event_time": 383.0,
        "start_progress": 0.6118299445471349,
        "end_progress": 0.6848428835489834
    },
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you. You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen. The movie starts with a boy living in a happy family. But his father suddenly died of a car accident. He's a bit of an underachiever and never seems to get anything right, but his luck is about to change when a strange man gives him a mirror. It turns out this mirror has magical powers and allows him to go back in time to prevent people's deaths. The boy uses the mirror to save his father's life. He talks to the mirror and asks the mirror to bring back his father. The mirror takes him back in time to the morning before his father went out and got hit by a car. He asked his father if he could cancel his big business transaction that day and stayed with him because he didn't feel well. His father worried about him and decided to stay home. So he' was able to prevent his father's death. More importantly, he knows that his father loves him more than anything else.\n",
        "source": "user",
        "start_time": 396.0,
        "end_time": 659.0,
        "last_event_time": 659.0,
        "start_progress": 0.6848428835489834,
        "end_progress": 1.0
    }
]