[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "The dad's act like they do not care, but it is true, that nothing is sacred anymore.",
        "source": "user"
    },
    {
        "text": "Dad, the ultimate judge and jury, is now being judged.",
        "source": "user"
    },
    {
        "text": "Based on dad's values?",
        "source": "user"
    },
    {
        "text": "Of course not!",
        "source": "user"
    },
    {
        "text": "Why would anyone put their own needs and desires aside to stroke dad's ego?",
        "source": "user"
    },
    {
        "text": "It is high time dad's take a look at who their children are, and what they need, rather than being a fake persona based on what guys think.",
        "source": "user"
    },
    {
        "text": "Dad's have no idea how to handle this growing trend of judgement.",
        "source": "user"
    },
    {
        "text": "Dad's used to be in charge.",
        "source": "user"
    },
    {
        "text": "That is changing fast.",
        "source": "user"
    },
    {
        "text": "Dad's could now be the brunt of the joke but kids and moms are more sensitive than that.",
        "source": "user"
    },
    {
        "text": "Just for once, macho dad needs to ask himself and other trusted family member \"How am I doing?",
        "source": "user"
    },
    {
        "text": "\" Do I know my kids?",
        "source": "user"
    },
    {
        "text": "Do I need some guidance in challenging situations?",
        "source": "user"
    },
    {
        "text": "Do I even know that challenges exist?",
        "source": "user"
    },
    {
        "text": "In the USA, there are around 30 million stay-at-home dads and their ego's do not know how to handle it.",
        "source": "user"
    },
    {
        "text": "The mugs have stopped producing the rankings.",
        "source": "user"
    },
    {
        "text": "Dad's are relieved.",
        "source": "user"
    },
    {
        "text": "They are even ready to listen.",
        "source": "user"
    },
    {
        "text": "It is going to take time and effort in the face of changes and resistance, but it takes a while to undo the wired damages.",
        "source": "user"
    },
    {
        "text": "Dad's have a good side too and can still be manly if that is their thing.",
        "source": "user"
    },
    {
        "text": "They are not all bad in all the ways.",
        "source": "user"
    },
    {
        "text": "The rankings on the mugs was a great wake up call.",
        "source": "user"
    },
    {
        "text": "Now let the work begin.",
        "source": "user"
    }
]