[
    "When you die, you appear in a cinema with a number of other people who look like you.",
    "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
    "As your next life unfolds, you experience all kinds of emotions.",
    "You laugh and cry at so many scenes, you watch them go by with no accounting for time.",
    "You have no idea how much time is passing.",
    "You can't feel it and there is no timekeeping mechanism on display, anywhere in the theater.",
    "You are just watching your next life, and you are watching it unfold in real time.",
    "It feels so odd to watch day turn to night, and months pass, on screen.",
    "You don't feel bored and you have no concept of time passing, in your space.",
    "You wonder how all of this is possible?",
    "How can you be watching your next life, in real time, and how can you be watching it in a theater, with other people who look just like you?",
    "These questions are huge.",
    "You decide to ask one of the other audience members, a woman sitting right next to you.",
    "She shrugs her shoulders and speaks, but you don't understand the language.",
    "You return the shrug, but don't bother speaking.",
    "You look back at the screen, and you see your next life unfold.",
    "You see every mistake that you make in your next life.",
    "You want so badly to tell your next self not to make so many mistakes, but you are powerless to do so.",
    "You don't understand the point of this exercise.",
    "You feel like you are watching a movie, and you are powerless to change the outcome.",
    "This all seems like some kind of sick joke.",
    "You look around the theater and wonder if some of them may speak English, your native tongue (at least in the life that you lived).",
    "It's impossible to tell.",
    "They all look just like you, men and women alike.",
    "You wonder if they are your previous reincarnations, and you wonder how many of them are watching their next life, in this theater.",
    "You know that you are connected to these other beings, by appearance alone, but you don't understand the point of being here with them, if you can't communicate to them.",
    "You don't understand why you are watching this film of your next life, if you are powerless to intervene.",
    "You want to ask someone, but you don't know who to ask.",
    "The questions begin to form in your mind, you have specific ideas on how to improve things but can't say them in a language that your fellow audience members will understand.",
    "Suddenly, you have a very specific question on the tip of your mind.",
    "You notice that others are looking at you, and suddenly you realize that they can communicate with you telepathically.",
    "They are offering suggestions and ideas, based on your concentrated thought.",
    "You ask your question, and they answer.",
    "You begin to realize that the person on the screen is another incarnation of all of you.",
    "When one of you asks a pointed question, and everyone else answers, somehow the person on the screen gets the same thoughts.",
    "Now it makes sense.",
    "You are all connected, and you are all watching your next life unfold, in real time.",
    "This is the evolution of your being and you finally understand life, and death.",
    ""
]