[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack.",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": "but pack your bags and call the number below.",
        "source": "api"
    },
    {
        "text": "It's time to start the real job.",
        "source": "api"
    },
    {
        "text": "\" Signed simply, \"JFK.",
        "source": "api"
    },
    {
        "text": "\" You call the number and are greeted by a voice on the other end.",
        "source": "api"
    },
    {
        "text": "The voice simply gives you an address and a time.",
        "source": "api"
    },
    {
        "text": "It seems foolish to follow such cryptic instructions but something is compelling you to.",
        "source": "user"
    },
    {
        "text": "You arrive at the address and are greeted by a man in a black suit.",
        "source": "user"
    },
    {
        "text": "The man has a somber face and a small private jet is behind him.",
        "source": "api"
    },
    {
        "text": "He wordlessly nods and takes your bags to load onto the plane.",
        "source": "user"
    },
    {
        "text": "He directs you to a staircase to board the plane.",
        "source": "user"
    },
    {
        "text": "You follow his instructions helplessly.",
        "source": "user"
    },
    {
        "text": "Your curiosity has gotten the best of you.",
        "source": "user"
    },
    {
        "text": "You board the plane and sit in a plush leather seat.",
        "source": "user"
    },
    {
        "text": "After a few moments another man boards the plane.",
        "source": "api"
    },
    {
        "text": "He is in a well tailored suit with no label.",
        "source": "user"
    },
    {
        "text": "He takes off his sunglasses and reveals a handsome, but forgettable face.",
        "source": "user"
    },
    {
        "text": "He reaches out his hand to grasp yours.",
        "source": "user"
    },
    {
        "text": "As he shakes it he introduces himself as JFK.",
        "source": "user"
    },
    {
        "text": "Seeing the confusion in your face he laughs and says \" Oh no.",
        "source": "user"
    },
    {
        "text": "I'm the REAL JFK.",
        "source": "user"
    },
    {
        "text": "Jason Finn Killigan at your service.",
        "source": "user"
    },
    {
        "text": "And now you are about to really serve your country.",
        "source": "user"
    },
    {
        "text": "\"\n\n\n\nHe hands you a file and you begin to read.",
        "source": "user"
    },
    {
        "text": "You soon have the bare bones of it.",
        "source": "api"
    },
    {
        "text": "Each president has only been a puppet on an audition.",
        "source": "user"
    },
    {
        "text": "It is after their term has ended that they are invited to participate in the real decision making if they are deemed worthy.",
        "source": "user"
    },
    {
        "text": "After you finish reading, JFK looks at you expectantly.",
        "source": "user"
    },
    {
        "text": "You're still unsure, but retirement has been boring so far.",
        "source": "user"
    },
    {
        "text": "So with a big grin you tell him that you're in.",
        "source": "user"
    },
    {
        "text": "He sits back in his seat in relief as the plane taxis down the runway.",
        "source": "user"
    }
]