[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "The world has changed drastically in the last 50 years, and the real question remains: Why?",
        "source": "api"
    },
    {
        "text": "I think the advancement of technology has played a major role in that.",
        "source": "api"
    },
    {
        "text": "Technology has changed the way we get information, the way we communicate and overall how we live our daily lives.",
        "source": "user"
    },
    {
        "text": "Think about children for example.",
        "source": "user"
    },
    {
        "text": "Back in the day, children would have to go out and play with their friends in order to have fun.",
        "source": "user"
    },
    {
        "text": "Now children are glued to their phones playing games and apps and not getting the in person socialization that us parents got as kids.",
        "source": "user"
    },
    {
        "text": "I think the advancement of technology has also caused many to be more connected with one another, but in a different way.",
        "source": "user"
    },
    {
        "text": "My father has family in Italy.",
        "source": "api"
    },
    {
        "text": "He is able to communicate them because of these technological advancements.",
        "source": "user"
    },
    {
        "text": "He can use Face Time so he can see his family rather than just a phone call where he can only hear them.",
        "source": "user"
    },
    {
        "text": "I think another reason why the world has changed is simply because over the last 50 years tons of mistakes have happened and we have learned from them.",
        "source": "user"
    },
    {
        "text": "Like for example, after World War I and II we have worked so hard to make sure that the same mistakes are not made again.",
        "source": "user"
    },
    {
        "text": "Diplomacy and negotiation is much more valuable than the bloodshed and consequences from something as serious as a World War.",
        "source": "api"
    },
    {
        "text": "I personally think that technology has truly changed our world in a positive manner and I can't imagine what life would be like without all of these devices at our fingertips.",
        "source": "user"
    },
    {
        "text": "Of course there are some negative aspects of technology as well, but overall it has bettered out world.",
        "source": "user"
    },
    {
        "text": "Think about all of the information that we have at our fingertips.",
        "source": "user"
    },
    {
        "text": "Think about GPS.",
        "source": "user"
    },
    {
        "text": "Think about Face Time.",
        "source": "user"
    },
    {
        "text": "Messaging apps.",
        "source": "user"
    },
    {
        "text": "Yelp.",
        "source": "user"
    },
    {
        "text": "DuoLingo.",
        "source": "user"
    },
    {
        "text": "Think about all of these things that we use on a daily basis.",
        "source": "user"
    },
    {
        "text": "Don't take them for granted.",
        "source": "user"
    },
    {
        "text": "Just 50 years ago none of these things were available.",
        "source": "user"
    },
    {
        "text": "We are blessed to live in this time period.",
        "source": "user"
    }
]