[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "We discover that a new war had broken out.",
        "source": "api"
    },
    {
        "text": "It made World War III look like nothing.",
        "source": "user"
    },
    {
        "text": "The world was in ruins, and the only nations that were left were the ones that were able to protect themselves from the war.",
        "source": "user"
    },
    {
        "text": "By just isolating the United States had somehow prevented its own demise.",
        "source": "api"
    },
    {
        "text": "The other countries had some kind of issue that had escalated to the point of no return.",
        "source": "user"
    },
    {
        "text": "Now it was up to the United States to try and get the world back up and running.",
        "source": "user"
    },
    {
        "text": "The only problem was that the United States was in no shape to do so.",
        "source": "user"
    },
    {
        "text": "We had struggled during that time from the lack of trading and having access to foreign technologies.",
        "source": "api"
    },
    {
        "text": "We had to rebuild everything.",
        "source": "user"
    },
    {
        "text": "We just weren't in the best situation to do so.",
        "source": "api"
    },
    {
        "text": "We asked for volunteers who would go to different areas of the world to start helping rebuild and to help survivors.",
        "source": "user"
    },
    {
        "text": "Many volunteered to go to what are considered nicer countries.",
        "source": "user"
    },
    {
        "text": "Few volunteered for the already poverty stricken areas.",
        "source": "user"
    },
    {
        "text": "Once people set up around the world, it started to rebuild.",
        "source": "user"
    },
    {
        "text": "We were able to get the world back up and running, but it was a very slow process.",
        "source": "user"
    },
    {
        "text": "There was one thing we didn't expect though.",
        "source": "api"
    },
    {
        "text": "The very people who we sent over ended up siding with the local inhabitants.",
        "source": "user"
    },
    {
        "text": "This ended up causing yet another world war.",
        "source": "user"
    },
    {
        "text": "It went on and many of the already limited population died.",
        "source": "user"
    },
    {
        "text": "It was then decided that we would all isolate yet again for another 50 years.",
        "source": "user"
    },
    {
        "text": "We just hoped that things wouldn't be even worse when we emerged.",
        "source": "user"
    },
    {
        "text": "That couldn't happen twice, right?",
        "source": "user"
    }
]