[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?",
        "source": "api"
    },
    {
        "text": "\" You think on that, as though asking yourself to instruct yourself.",
        "source": "api"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "You're not really afraid of bees, but the allergy thing is dangerous.",
        "source": "user"
    },
    {
        "text": "You decide to take a chance.",
        "source": "user"
    },
    {
        "text": "You brush at the bee to get it off.",
        "source": "api"
    },
    {
        "text": "It comes right back, buzzing louder, angrier.",
        "source": "user"
    },
    {
        "text": "Guess that wasn't the right decision!",
        "source": "user"
    },
    {
        "text": "You don't care; you try to brush it off again.",
        "source": "user"
    },
    {
        "text": "You feel a prick on your thumb, the bee bumps your hand again and falls to the ground.",
        "source": "api"
    },
    {
        "text": "It stung you!",
        "source": "user"
    },
    {
        "text": "You're not sure why, but you're not afraid.",
        "source": "user"
    },
    {
        "text": "It does hurt, throbbing a bit, swollen a tiny amount.",
        "source": "api"
    },
    {
        "text": "You head back home to see if you should go to the hospital.",
        "source": "user"
    },
    {
        "text": "You get home, and your mother is there.",
        "source": "user"
    },
    {
        "text": "You show her and she's worried, but calm in the same way you've been.",
        "source": "api"
    },
    {
        "text": "She tells you she'll drive you to the hospital since it might cause problems.",
        "source": "user"
    },
    {
        "text": "You get in the car, and she drives you there.",
        "source": "user"
    },
    {
        "text": "You don't think you're worried, but you are a little nervous now that you're honest with yourself.",
        "source": "api"
    },
    {
        "text": "The thumb is swelling up fast!",
        "source": "user"
    },
    {
        "text": "You feel like taking a nap as you get to the hospital, but you're breathing is tight - it takes too much effort.",
        "source": "user"
    },
    {
        "text": "You're feeling a little sick.",
        "source": "user"
    },
    {
        "text": "You figure everything will be taken care of, I might pass out but I just need to breathe, one breath at a time.",
        "source": "api"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "You wake up in a hospital bed, your mother is there.",
        "source": "user"
    },
    {
        "text": "She smiles and asks how you feel.",
        "source": "api"
    },
    {
        "text": "You feel tired, but can't remember getting out of the car!",
        "source": "user"
    },
    {
        "text": "You feel relief as the doctor tells you you're fine.",
        "source": "user"
    },
    {
        "text": "The swelling is gone, and you're breathing normally.",
        "source": "user"
    },
    {
        "text": "You take a lesson from this, albeit not the obvious one: you and your mom share a calm approach to life, and you are very grateful to share this trait with her.",
        "source": "api"
    }
]