[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the \"Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "I was 28 when English scientists discovered a miracle drug that stopped humanity from aging.",
        "source": "user"
    },
    {
        "text": "Humanity had finally discovered the key to living forever, and avoiding the one debt that every human being owes upon birth, death.",
        "source": "user"
    },
    {
        "text": "Scientists had warned that the drug was only meant for citizens under 26, which left billions of people, including myself, without any hope of taking the drug.",
        "source": "user"
    },
    {
        "text": "People around the world were furious and saddened to hear the news that they would not live forever.",
        "source": "user"
    },
    {
        "text": "Meanwhile, the younger generations were divided on whether or not they wanted to live forever.",
        "source": "user"
    },
    {
        "text": "Taking the drug meant living forever or outliving loved ones and watching them pass on.",
        "source": "user"
    },
    {
        "text": "The rest of the world was not as hesitant to take the drug, and many saw immortality as a chance for humanity to expand and achieve incredible things.",
        "source": "user"
    },
    {
        "text": "Taking the drug would allow people to study whatever they wanted and help to improve society for the better.",
        "source": "user"
    },
    {
        "text": "No longer did people have to settle for boring desk jobs, they could pursue any field of study they wanted.",
        "source": "user"
    },
    {
        "text": "Doctors no longer had to worry about sicknesses and disease among a large portion of society, they could now devote their time towards helping people who could not take the drug.",
        "source": "user"
    },
    {
        "text": "The \"Lost Generation\" continued to age, while the young took the drug and became immortal.",
        "source": "user"
    },
    {
        "text": "Families were torn apart, knowing that they would leave loved ones behind.",
        "source": "user"
    },
    {
        "text": "They feared that their loved ones would forget about them as the centuries carried on.",
        "source": "user"
    },
    {
        "text": "While the young celebrated their immortality, the old feared that they would be forgotten.",
        "source": "api"
    },
    {
        "text": "As time passed, I grew older, finally reaching the ripe, old age of 85.",
        "source": "user"
    },
    {
        "text": "Society had definitely improved through the efforts of an immortal, optimistic generation of people, with all the time in the world on their shoulders.",
        "source": "user"
    },
    {
        "text": "They had set their sights on new frontiers that would be impossible for a normal human lifetime.",
        "source": "user"
    },
    {
        "text": "Technology had improved by leaps and bounds, providing comfort beyond imagination for people from all walks of life.",
        "source": "user"
    },
    {
        "text": "Medicinal advances provided the \"Lost Generation\" with cures for ailments that only affected an aging body.",
        "source": "user"
    },
    {
        "text": "I began to wonder if taking the drug was worth it.",
        "source": "user"
    },
    {
        "text": "At a certain point in time, the \"Lost Generation\" would be no more, ceasing to exist, leaving the immortals behind.",
        "source": "user"
    },
    {
        "text": "Was living forever worth it?",
        "source": "user"
    },
    {
        "text": "Were all of the human advances worth it in the end?",
        "source": "user"
    },
    {
        "text": "The immortals were only prolonging the inevitable.",
        "source": "user"
    },
    {
        "text": "I was concerned with how the immortals would feel after living for hundreds of years, or even thousands.",
        "source": "user"
    },
    {
        "text": "Finally, in a shocking turn of events, scientists discovered that the drug resulted in tragic side effects.",
        "source": "user"
    },
    {
        "text": "The immortals began to lose their sight, hearing, taste, sense of smell, all aspects of human life.",
        "source": "user"
    },
    {
        "text": "No longer could they enjoy what made life so pleasurable, the biological features that made life worth living.",
        "source": "user"
    },
    {
        "text": "The drug had robbed them of all senses, leaving them to a life where they were no longer human.",
        "source": "user"
    },
    {
        "text": "They could not rely on the \"Lost Generation\", for they too needed help.",
        "source": "user"
    },
    {
        "text": "One generation was dying naturally, the other were becoming walking husks, devoid of humanity.",
        "source": "user"
    },
    {
        "text": "The immortals were now a burden, and the \"Lost Generation\" was stuck in between.",
        "source": "user"
    },
    {
        "text": "The immortals were now at the mercy of the \"Lost Generation\", for they needed help.",
        "source": "user"
    },
    {
        "text": "The \"Lost Generation\" could not help, they could only provide wisdom to ease the pain of living without their senses.",
        "source": "user"
    },
    {
        "text": "The immortals were not the picture of humanity, they were a nightmare.",
        "source": "api"
    },
    {
        "text": "Zombies walking amongst the living and the aging.",
        "source": "user"
    },
    {
        "text": "The immortals were not living, they were merely existing in the world.",
        "source": "user"
    },
    {
        "text": "Their hopes and dreams of living forever dashed against the stones by the grim reaper.",
        "source": "user"
    },
    {
        "text": "The \"Lost Generation\" died out one by one, I was one of the remaining few of a bygone era.",
        "source": "user"
    },
    {
        "text": "I had witnessed the downfall of humanity, and luckily for me, I was spared from the pain of loss.",
        "source": "user"
    },
    {
        "text": "I had learned that nothing could stop death and more importantly, nothing could stop the decay of time.",
        "source": "user"
    }
]