[
    "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
    "I quickly scanned the mug to see if my name was on the list.",
    "I was not technically a dad, but still a step-dad.",
    "I figured i would still be on the list since i did all i could do to raise the kids in the best way i knew how.",
    "I wasnt sure if i was dreaming or if this was real, however in the moment all i cared about was looking at the list on my mug.",
    "I didnt even take a sip of the coffee.",
    "My mouth was open and my eyes were focused on the mug.",
    "I thought maybe i should make sure my eyes werent playing tricks on me.",
    "Alas, there it was.",
    "I saw my name.",
    "I read the number beside my name.",
    "I was #1 Dad.",
    "I wasnt sure if it was real or not.",
    "I didnt feel anything.",
    "I just.......",
    "looked.",
    "I quickly began to look at the rankings of all the other dads.",
    "What makes me any better than anyone else?",
    "I wasnt even a biological father, am i really doing that well?",
    "I know that i loved the kids, and maybe that was all that mattered.",
    "I know that i would do anything for them, as i am sure many other dads would.",
    "What made be stand apart?",
    "I know there are plenty of dads who work just as hard as i do, and they deserve to be #1 too.",
    "I turned the mug around, looked on the bottom and everywhere i could think of.",
    "Is there some sort of explanation or criteria for this?",
    "I want to know what it is exactly i am doing so well?",
    "Why do i always question when someone compliments me?",
    "I am not perfect, i know that.",
    "Why do i not believe this list, despite the kids and my fiancee never saying anything but good about me?",
    "All that mattered to me were the kids knowing that i was there for them.",
    "Knowing that i would do whatever they needed me for.",
    "All this mug was doing was making me question myself, but maybe that is why I am #1.",
    "Maybe I am because i am my toughest critic.",
    "Maybe I am because i am selfless and just want to make others happy.",
    "Maybe I am #1 because of how others think of me?",
    "Why cant i think of me the same way they do?",
    "Why cant i just enjoy this?",
    "I dont know the answer to any of these questions...but I hope to figure them out someday.",
    "I think i am almost ready to sit down and enjoy this cup of coffee.",
    ""
]