[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the \"Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "The side effects for everyone that took the medication are stunning, to say the least.",
        "source": "user"
    },
    {
        "text": "Instead of staying the same age, people are getting younger.",
        "source": "user"
    },
    {
        "text": "The pharmaceutical companies are racing to figure out what has gone wrong with their miracle cure for aging.",
        "source": "user"
    },
    {
        "text": "The horror and reality of the situation is setting in for too many people.",
        "source": "user"
    },
    {
        "text": "Those who created the drug are now reversing in age.",
        "source": "user"
    },
    {
        "text": "With that reversal comes loss of knowledge and the skills that had made them great scientists.",
        "source": "user"
    },
    {
        "text": "Those who took the drug are also reversing in age with no knowledge of what is happening and unable to influence with their life.",
        "source": "api"
    },
    {
        "text": "You realize that it is up to you and the Lost Generation to find a solution to the problem.",
        "source": "user"
    },
    {
        "text": "Unfortunately, at 85, your mind isn't as sharp as it once was.",
        "source": "user"
    },
    {
        "text": "Deciding to take a calculated risk that you will be able to find a way to stop the age reversal, you take the medication.",
        "source": "user"
    },
    {
        "text": "Knowing you need to get younger in a very short amount of time, you decide to take 20 times the recommended dose.",
        "source": "user"
    },
    {
        "text": "Unsure if this has been the right thing to do, you crawl wearily into bed to rest and wait for the dawn of the next day.",
        "source": "user"
    },
    {
        "text": "The next morning you wake up and literally jump out of bed.",
        "source": "user"
    },
    {
        "text": "Feeling spry and healthy, you catch a glimpse of yourself in the mirror.",
        "source": "user"
    },
    {
        "text": "Shocked to the core, you see the 46 year old version of yourself staring back at you.",
        "source": "user"
    },
    {
        "text": "In only 12 hours you have reversed half a lifetime.",
        "source": "user"
    },
    {
        "text": "You hurry to your computer and fire it up.",
        "source": "user"
    },
    {
        "text": "Your mind is focused and working better than it has, quite literally, in decades.",
        "source": "user"
    },
    {
        "text": "You gather up all the research from the internet on the medication.",
        "source": "user"
    },
    {
        "text": "Your hand fly across the keyboard as you scan hundreds of scientific journals and files trying to solve the side effect of reverse aging.",
        "source": "user"
    },
    {
        "text": "As noon approaches, you decide to get something to eat.",
        "source": "user"
    },
    {
        "text": "Passing the hall mirror, you are terrified to see that you appear to be only 25.",
        "source": "user"
    },
    {
        "text": "Time has slipped away too quickly.",
        "source": "user"
    },
    {
        "text": "You are living your life in hours instead of days.",
        "source": "api"
    },
    {
        "text": "Frantic, you continue to search online for an answer to what is going on.",
        "source": "user"
    },
    {
        "text": "Suddenly, you hear an ice cream truck going by in the neighborhood.",
        "source": "user"
    },
    {
        "text": "You grab your purse and rush outside to flag it down.",
        "source": "user"
    },
    {
        "text": "When the driver pulls over, he asks \"What can I get for you young lady?\" You reach for the money in your purse and ask for a sponge bob popsicle.",
        "source": "user"
    },
    {
        "text": "When you hand the driver the cash, you notice the hand of a small child reaching out from your body.",
        "source": "user"
    },
    {
        "text": "Sadly, you take your popsicle and sit on the sidewalk.",
        "source": "user"
    },
    {
        "text": "The sun is beginning to set in the sky and on your life.",
        "source": "user"
    },
    {
        "text": "As the sun disappears below the horizon, you know your time has run out.",
        "source": "user"
    },
    {
        "text": "Licking the last bit of ice cream from the stick, you are grateful to have one last small joy in life before it was over.",
        "source": "user"
    }
]