[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "The first novel in the Mana series, The Last Mage, is available now.",
        "source": "user"
    },
    {
        "text": "It is a book that takes place in the 1800s.",
        "source": "user"
    },
    {
        "text": "The main character is a young boy named Will who is a mage.",
        "source": "user"
    },
    {
        "text": "It is his responsibility to fight off the witches that are trying to poison the Earth and all it's inhabitants.",
        "source": "user"
    },
    {
        "text": "The witches fly on brooms and have the ability to cast spells onto any human they come into contact with.",
        "source": "user"
    },
    {
        "text": "The witches' main goal is to kill all humans and take over the world.",
        "source": "user"
    },
    {
        "text": "However, Will is a boy that has superpowers.",
        "source": "user"
    },
    {
        "text": "He has the ability to control the wind and the rain.",
        "source": "user"
    },
    {
        "text": "He also has the ability to fly.",
        "source": "user"
    },
    {
        "text": "He can make the conditions impossible for the witches to fly in.",
        "source": "user"
    },
    {
        "text": "He can make it so windy that their brooms won't be able to be steered.",
        "source": "user"
    },
    {
        "text": "Will decides to challenge the witches.",
        "source": "user"
    },
    {
        "text": "He sees them flying out and about one day and gets into a battle with them.",
        "source": "user"
    },
    {
        "text": "The witches fire spells at him and he used his ability to control the wind to dodge them.",
        "source": "user"
    },
    {
        "text": "He then uses his ability to control the rain to put out the fire that the witches are using to burn him.",
        "source": "user"
    },
    {
        "text": "Will and the witches go their separate ways and prepare for a final battle.",
        "source": "user"
    },
    {
        "text": "Will figures out a way that he can defeat the witches.",
        "source": "user"
    },
    {
        "text": "The next time that they try to burn him with fire he will control the rain so that it won't hit the ground.",
        "source": "user"
    },
    {
        "text": "The rain will just stop at the witches brooms height.",
        "source": "user"
    },
    {
        "text": "The broom will get so wet that the witches will fall off and fall into the fire and perish.",
        "source": "user"
    },
    {
        "text": "The final battle has finally arrived and Will is fighting the witches.",
        "source": "user"
    },
    {
        "text": "It is a stalemate to start but Will knows he has an ace up his sleeve.",
        "source": "user"
    },
    {
        "text": "The witches play right into his plan and place a pit of fire underneath where he is flying.",
        "source": "user"
    },
    {
        "text": "The fire begins to spread and covers the entire ground.",
        "source": "user"
    },
    {
        "text": "Will recognizes this and instantly makes it rain.",
        "source": "user"
    },
    {
        "text": "However the rain stops right at broom level.",
        "source": "user"
    },
    {
        "text": "The rain is coming down like a downpour.",
        "source": "user"
    },
    {
        "text": "The witches try their hardest to hold onto their broom but they slip and fall into the fire pit and are never heard from again.",
        "source": "user"
    },
    {
        "text": "Will help saved his community and all the members within it.",
        "source": "user"
    },
    {
        "text": "He was seen as a hero.",
        "source": "user"
    },
    {
        "text": "He saved humanity.",
        "source": "user"
    }
]