[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "You are surprised to see that all of these people are of different races, genders and backgrounds.",
        "source": "api"
    },
    {
        "text": "They don't seem to share anything in common with you besides the fact that they are humans.",
        "source": "user"
    },
    {
        "text": "You ask the others why they are all different, but no one has an answer.",
        "source": "user"
    },
    {
        "text": "A few moments later you see your next life play in front of you, and it is that of a white American man.",
        "source": "api"
    },
    {
        "text": "You continue to watch and see that this person is a successful businessman who has a young wife and stepchild, Harper Campbell.",
        "source": "api"
    },
    {
        "text": "His name is Matty and he works at a bank, JPMorgan.",
        "source": "user"
    },
    {
        "text": "His young wife is named Soeurette.",
        "source": "user"
    },
    {
        "text": "You notice that Soeurette's name sounds very familiar, but you brush it off as nothing.",
        "source": "user"
    },
    {
        "text": "You continue watching Matty's life and see how he works hard every day to provide for his family.",
        "source": "api"
    },
    {
        "text": "You realize that Soeurette is cheating on Matty and then remember where you've heard of her name before.",
        "source": "api"
    },
    {
        "text": "You were her lover, back when you lived in an apartment together.",
        "source": "user"
    },
    {
        "text": "And more astonishingly, you realize that Harper is actually your daughter!",
        "source": "api"
    },
    {
        "text": "This discovery sends you into a state of shock.",
        "source": "user"
    },
    {
        "text": "You are astonished that Soeurette has remarried.",
        "source": "api"
    },
    {
        "text": "She was an excellent lover -- hence the slipup resulting in Harper -- but she was not a good person.",
        "source": "user"
    },
    {
        "text": "You remember that she was unfaithful and malicious.",
        "source": "user"
    },
    {
        "text": "You continue to watch Matty's life and see that he eventually finds out that Soeurette is cheating on him.",
        "source": "api"
    },
    {
        "text": "He is deeply hurt, and his soul goes through a process known as \"soul sickness\", where they feel the emotions of their past lives.",
        "source": "api"
    },
    {
        "text": "You feel the pain he feels, and you feel the pain of every other person in the cinema.",
        "source": "api"
    },
    {
        "text": "You become very angry at Soeurette.",
        "source": "api"
    },
    {
        "text": "How dare she cheat on your future self?",
        "source": "user"
    },
    {
        "text": "You realize she has not only been unfaithful to you, but is also likely an unfaithful person generally since she has repeated her bad behavior into the future.",
        "source": "user"
    },
    {
        "text": "After Matty realizes that Soeurette has cheated on him, he takes their stepchild and leaves her.",
        "source": "user"
    },
    {
        "text": "Soeurette is devastated but Matty's drastic actions serve her right.",
        "source": "api"
    },
    {
        "text": "You are glad that she is being punished for her actions.",
        "source": "user"
    },
    {
        "text": "The other people in the cinema are also very angry at her.",
        "source": "api"
    },
    {
        "text": "They are relieved that she has been punished, and they encourage Matty to continue living his life without her.",
        "source": "api"
    },
    {
        "text": "You see Matty move on with his life and you can tell he is extremely happy.",
        "source": "api"
    },
    {
        "text": "He meets a woman named Vivian, who is extremely kind.",
        "source": "api"
    },
    {
        "text": "Vivian is nothing like Soeurette.",
        "source": "api"
    },
    {
        "text": "Vivian is the woman that Matty has always deserved.",
        "source": "api"
    },
    {
        "text": "Vivian takes care of Harper like her own.",
        "source": "user"
    },
    {
        "text": "Meanwhile, Soeurette is alone and miserable.",
        "source": "user"
    },
    {
        "text": "She realizes her mistakes and regrets everything.",
        "source": "user"
    },
    {
        "text": "She is also jealous of Vivian.",
        "source": "api"
    },
    {
        "text": "You are glad that she is jealous of someone who has earned the love of Matty.",
        "source": "api"
    },
    {
        "text": "Matty lives a long and happy life with Vivian.",
        "source": "api"
    },
    {
        "text": "Soeurette eventually becomes a drug addict and withers away.",
        "source": "api"
    },
    {
        "text": "She becomes consumed by her loss of Matty and Harper and is self-destructive for the rest of her life, just as she deserves.",
        "source": "user"
    },
    {
        "text": "You spend the rest of your life watching Matty's many happy reincarnations, until your soul is ready to be reborn.",
        "source": "user"
    }
]