[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "The story begins with the US President informing the world that even though the US is still in ruins, it has decided to come out of isolation.",
        "source": "api"
    },
    {
        "text": "All of the internet servers were turned back on and we all quickly realized that the world had continued on without us.",
        "source": "api"
    },
    {
        "text": "Because we were in isolation, the world had advanced much faster than we had and we soon found ourselves struggling to catch up.",
        "source": "user"
    },
    {
        "text": "From internet video, we were able to learn of new technology that other countries produced.",
        "source": "api"
    },
    {
        "text": "There were cars that flew and jetpacks too.",
        "source": "user"
    },
    {
        "text": "It seemed that the traffic got so bad that people focused all their technological efforts on using the skies.",
        "source": "user"
    },
    {
        "text": "There were also giant cities in the skies that somehow just floated.",
        "source": "user"
    },
    {
        "text": "The United States quickly learned that the world had continued to advance and it was no longer the center of technological and military supremacy.",
        "source": "user"
    },
    {
        "text": "There was peace all over the world too.",
        "source": "api"
    },
    {
        "text": "It seems that they had all come out of isolation together for the purpose of developing the technology that would save them.",
        "source": "user"
    },
    {
        "text": "The US was sadly left out though for fear that we would take over and steal all of the technology.",
        "source": "user"
    },
    {
        "text": "After we learned of this, Americans decided to visit the other parts of the globe to check out this new way of life.",
        "source": "user"
    },
    {
        "text": "And the people from the other nations were all actually very welcoming.",
        "source": "user"
    },
    {
        "text": "The peace in the world was contagious and soon the Americans got over being left behind and wanted to be a part of this new peaceful technologically advanced world.",
        "source": "user"
    },
    {
        "text": "World peace was established for all.",
        "source": "user"
    },
    {
        "text": "And the new technology didn't require the burning of fossils to the environment and humanity was saved!",
        "source": "user"
    },
    {
        "text": "It's a sad thing that the United States had to get out of the way for this to happen but it did and everyone lived in peace on Earth from then on.",
        "source": "user"
    },
    {
        "text": "The end.",
        "source": "user"
    }
]