[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.\" I can't blow that down.",
        "source": "api"
    },
    {
        "text": "How did you figure out what my weakness was?",
        "source": "user"
    },
    {
        "text": "And the 92nd little pig was like, \"I read it on the internet.\" And the wolf was like, \"I'm going to find out who's been messing with my Wikipedia page.\"",
        "source": "user"
    },
    {
        "text": "The wolf ended up going home and did a ton of research on the internet.",
        "source": "user"
    },
    {
        "text": "He had to figure out how to blow down the house made of uranium.",
        "source": "user"
    },
    {
        "text": "What he found on the internet was very interesting.",
        "source": "user"
    },
    {
        "text": "The only thing that can destroy a home made of uranium is high pressure water.",
        "source": "user"
    },
    {
        "text": "The wolf now knew how to destroy the pigs house but had to figure out where he could get a high pressure water hose.",
        "source": "user"
    },
    {
        "text": "The wolf had a friend who was in the local fire department.",
        "source": "user"
    },
    {
        "text": "The wolf asked the friend what he would have to do in order to get access to a fire hose.",
        "source": "user"
    },
    {
        "text": "The friend tells him that all he has to do is join the fire department.",
        "source": "user"
    },
    {
        "text": "The wolf tells his friend that might be difficult considering that he is a wolf.",
        "source": "user"
    },
    {
        "text": "The friend agrees and asks him what he even needs a fire hose for.",
        "source": "user"
    },
    {
        "text": "The wolf tells him he was having an issue cleaning his home.",
        "source": "user"
    },
    {
        "text": "The wolf ends up breaking into the firehouse and steals a firetruck.",
        "source": "user"
    },
    {
        "text": "The wolf ends up driving the firetruck right to the little pigs home.",
        "source": "user"
    },
    {
        "text": "He gets right outside of the pigs home and sprays the home with the water hose.",
        "source": "user"
    },
    {
        "text": "The home disintegrates into pieces.",
        "source": "user"
    },
    {
        "text": "The pig is distraught and runs outside.",
        "source": "user"
    },
    {
        "text": "He runs up to the wolf and yells at him.",
        "source": "user"
    },
    {
        "text": "He asks how the wolf figured out what would destroy the uranium.",
        "source": "user"
    },
    {
        "text": "The wolf tells the pig that he made a grave mistake when he told him he used the internet to build his house.",
        "source": "user"
    },
    {
        "text": "He says \"silly little Pig, you can find out everything on the internet.\" Better luck next time.",
        "source": "user"
    },
    {
        "text": "Our rivalry shall continue!",
        "source": "user"
    }
]