[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "The mugs flash, and then go back to their original ranking.",
        "source": "user"
    },
    {
        "text": "DAD #1 DAD #2 DAD #3.",
        "source": "api"
    },
    {
        "text": "All of a sudden all of the names are erased.",
        "source": "api"
    },
    {
        "text": "I assumed that this meant the rankings were reset, but why?",
        "source": "user"
    },
    {
        "text": "Is this giving every dad another chance to be great?",
        "source": "user"
    },
    {
        "text": "Or maybe i am just dreaming so reality is setting back in.",
        "source": "user"
    },
    {
        "text": "I dont know what to think.",
        "source": "user"
    },
    {
        "text": "I reach out and touch one of the mugs.",
        "source": "user"
    },
    {
        "text": "Suddenly my eyes open, and I am in my bedroom.",
        "source": "api"
    },
    {
        "text": "I knew it, just a dream.",
        "source": "user"
    },
    {
        "text": "I look to my dressor and see a mug.",
        "source": "user"
    },
    {
        "text": "Of course, the #1 dad mug.",
        "source": "user"
    },
    {
        "text": "I grab it and look at the name on it.",
        "source": "user"
    },
    {
        "text": "It wasnt actually a name, but  some writing on the cup that was unfinished.",
        "source": "api"
    },
    {
        "text": "I saw a J, and the o was being drawn although i saw no marker or pen.",
        "source": "user"
    },
    {
        "text": "The letter kept appearing and dissapearing over and over, like some sort of magic.",
        "source": "user"
    },
    {
        "text": "It was like it was trying to tell me something.",
        "source": "user"
    },
    {
        "text": "Maybe that my job of being a father is unfinished.",
        "source": "user"
    },
    {
        "text": "You see I am a father, but not a biological father.",
        "source": "user"
    },
    {
        "text": "I married into having four step kids, whom i love each and every one of.",
        "source": "user"
    },
    {
        "text": "I feel that i am a good father, and I know that i do my best each and every day to be one.",
        "source": "user"
    },
    {
        "text": "I dont want to be the father that takes his kid to a ballgame once in a while and calls it good.",
        "source": "user"
    },
    {
        "text": "I want to be the father that the kids look up to from the time they are young, until the time they are old.",
        "source": "api"
    },
    {
        "text": "Not because they are nice, or fun, or cool.",
        "source": "user"
    },
    {
        "text": "But simply because they are real, and they care about the kids no matter what.",
        "source": "user"
    },
    {
        "text": "As this thought popped into my head another letter was drawn on the cup.",
        "source": "user"
    },
    {
        "text": "Now the cup read JO, and the R was being written and erased over and over.",
        "source": "user"
    },
    {
        "text": "It was like some sort of puzzle or something.",
        "source": "user"
    },
    {
        "text": "It was crazy though because it was my thoughts that filled in the next letter.",
        "source": "user"
    },
    {
        "text": "I wondered what the point of finishing the name on the mug was, and if it was something that had to be done.",
        "source": "user"
    },
    {
        "text": "Maybe this was some sort of therapy to me.",
        "source": "user"
    },
    {
        "text": "I tried to remember what i was doing last when i fell into this dream like mode.",
        "source": "user"
    },
    {
        "text": "Was I stressed, happy, anxious?",
        "source": "user"
    },
    {
        "text": "Why am i deliberating how good of a dad I am?",
        "source": "user"
    },
    {
        "text": "Just like that i woke up again, but this time really woke up.",
        "source": "user"
    },
    {
        "text": "I asked my buddy where i was.",
        "source": "user"
    },
    {
        "text": "He told me that i had taken some shrooms and was most likely hallucinating or in a trans.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "Wow.",
        "source": "user"
    }
]