[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "The reason that the alien kidnapped Matt was because of the movie he made called \"The Martian\".",
        "source": "user"
    },
    {
        "text": "They were worried about the potential of humans finding out about them.",
        "source": "user"
    },
    {
        "text": "That's because Mars was a planet that had life on it after all.",
        "source": "user"
    },
    {
        "text": "They lived underground.",
        "source": "user"
    },
    {
        "text": "They also didn't want the humans to find out about it because of the fact that they were living on the planet.",
        "source": "user"
    },
    {
        "text": "They didn't understand the concept of a movie though, and that most people did not take them seriously or as a fact.",
        "source": "user"
    },
    {
        "text": "Matt was now taken to the underground city, and he thought it was a lot like New York City.",
        "source": "user"
    },
    {
        "text": "He was surprised by how hospitable the aliens were though.",
        "source": "user"
    },
    {
        "text": "They explained to him why they took him, about their fears.",
        "source": "user"
    },
    {
        "text": "As they talked among themselves, Matt said \"Hey, I got an idea! Since my species are going to search high and low for me, why don't we make a deal with the scientists and governments of my world?\" What do you have in mind, the aliens ask him.",
        "source": "user"
    },
    {
        "text": "Matt replies with \"If you let me go and make sure I get home, the governments and scientists of the world can stop all missions to Mars, and we will never come here again. We also will not make anymore movies about it, ever. So you can live in peace.\" One of the aliens replies by saying \"Done.\"",
        "source": "api"
    },
    {
        "text": "So the aliens covertly came to Earth bringing Matt with them and grabbed up Elon Musk, and the major leaders of the world to work out this deal.",
        "source": "user"
    },
    {
        "text": "After some tense moments of negotiating,  and shock about the aliens, the deal was made.",
        "source": "user"
    },
    {
        "text": "Matt Damon was home free, and humans called off the search.",
        "source": "user"
    }
]