[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "You realize that your actual life has been populated by other people in your past.",
        "source": "api"
    },
    {
        "text": "While it seems strange, it is also comforting to know that you have been reincarnated in so many forms.",
        "source": "user"
    },
    {
        "text": "With the exception of the first and last chapters, every chapter is told by a different character in the form of letters sent to their \"future\"\n\nEach chapter is strangely familiar, and it gives comfort, but also surprise.",
        "source": "user"
    },
    {
        "text": "The story begins in a small town in the north of France.",
        "source": "user"
    },
    {
        "text": "You are a child with a brother and three dogs.",
        "source": "api"
    },
    {
        "text": "Your parents are always busy with their jobs.",
        "source": "user"
    },
    {
        "text": "Even though your parents are busy, you are able to amuse yourself, and you never feel lonely.",
        "source": "api"
    },
    {
        "text": "It takes place in the same town.",
        "source": "user"
    },
    {
        "text": "You like the town, but would also enjoy seeing new places.",
        "source": "api"
    },
    {
        "text": "One day you take your dog for a long walk.",
        "source": "user"
    },
    {
        "text": "You come across a strange building, and are drawn to it.",
        "source": "user"
    },
    {
        "text": "Inside you see a boy who is sitting in the corner.",
        "source": "api"
    },
    {
        "text": "He seems very ill, and you realize that it is a hospital.",
        "source": "user"
    },
    {
        "text": "You ask him if he is feeling ok, and if there is anything you can do to help.",
        "source": "api"
    },
    {
        "text": "You tell him that you have a brother.",
        "source": "user"
    },
    {
        "text": "It is very strange to see the reincarnations, but at the same time it is comforting to know that you had a past and you will have a future.",
        "source": "user"
    },
    {
        "text": "Each character is a different person, yet they are somewhat the same.",
        "source": "user"
    },
    {
        "text": "They are an extension of themselves.",
        "source": "user"
    },
    {
        "text": "It is in book form, but it is also in life form.",
        "source": "user"
    },
    {
        "text": "It is written down, but it also exists.",
        "source": "user"
    },
    {
        "text": "It is made into a screenplay.",
        "source": "user"
    },
    {
        "text": "It is rewritten, but true to the original story.",
        "source": "user"
    },
    {
        "text": "It lives in the characters.",
        "source": "user"
    },
    {
        "text": "The story may be a dream, but it is the \"truth\" of the characters.",
        "source": "user"
    },
    {
        "text": "Though it might be a dream it is the truth.",
        "source": "api"
    },
    {
        "text": "They live within each other.",
        "source": "user"
    },
    {
        "text": "It is familiar because each person is an extension on the other.",
        "source": "user"
    },
    {
        "text": "We are all the same person.",
        "source": "user"
    }
]