[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "Sitting there, looking around, a lot of things start to make sense.",
        "source": "api"
    },
    {
        "text": "I can see clearly where some of my centermost characteristics were born.",
        "source": "user"
    },
    {
        "text": "Suddenly, it seems like an obvious conclusion that I never could quite see before.",
        "source": "user"
    },
    {
        "text": "I've lived before, and it's awe inspiring to consider what that means as the idea unfolds in my mind.",
        "source": "user"
    },
    {
        "text": "What does it mean to live before?",
        "source": "user"
    },
    {
        "text": "It's like time and space don't exist, at all.",
        "source": "api"
    },
    {
        "text": "Like this is all just some sort of weird, temporal dream state.",
        "source": "user"
    },
    {
        "text": "Am I writing this script, or is the script writing me?",
        "source": "user"
    },
    {
        "text": "I'm literally thinking these thoughts, and yet there is no time or space to accommodate this reality.",
        "source": "user"
    },
    {
        "text": "How can the past me, my current self and some future version of me appearing on the screen, all exist?",
        "source": "api"
    },
    {
        "text": "All at once?",
        "source": "user"
    },
    {
        "text": "All here, in this place?",
        "source": "user"
    },
    {
        "text": "Did I invent this scenario?",
        "source": "user"
    },
    {
        "text": "Do I even exist?",
        "source": "user"
    },
    {
        "text": "I'm so confused by what is unfolding within me.",
        "source": "user"
    },
    {
        "text": "I think I'll stay here a bit longer and let it sink in.",
        "source": "user"
    },
    {
        "text": "I think I'll just try to accept what I'm seeing, and pass no judgement.",
        "source": "api"
    },
    {
        "text": "Maybe, with that attitude, some of my questions will resolve themselves.",
        "source": "user"
    },
    {
        "text": "Or, if not, I'll accept that those questions may never be answered.",
        "source": "user"
    },
    {
        "text": "All I know for sure is, this is a special place.",
        "source": "api"
    },
    {
        "text": "I think that this might be the only place.",
        "source": "user"
    },
    {
        "text": "I may only exist in this space, or not at all.",
        "source": "user"
    },
    {
        "text": "Either way, I am dead but I am here.",
        "source": "user"
    },
    {
        "text": "My life is finished, but I am here.",
        "source": "user"
    }
]