[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "This, after all, is not the first time that Matt Damon has gone missing.",
        "source": "user"
    },
    {
        "text": "The first time Matt Damon went missing, humanity had practically stopped in its tracks to try to find him.",
        "source": "user"
    },
    {
        "text": "The alien is not aware that Matt Damon is a very important person to the human race.",
        "source": "user"
    },
    {
        "text": "This is because Matt Damon has incredible talents.",
        "source": "user"
    },
    {
        "text": "He is funny, personable and can even cast magical spells.",
        "source": "user"
    },
    {
        "text": "He is also a master of disguise and can be anyone he wants to be.",
        "source": "user"
    },
    {
        "text": "For example, Matt Damon can morph into a clown, or a doctor, or a lawyer, or a schoolteacher, or anyone else depending on his mood.",
        "source": "user"
    },
    {
        "text": "With all these talents, skills and abilities, Matt Damon is arguably the most powerful human on planet Earth.",
        "source": "user"
    },
    {
        "text": "So when the alien kidnaps Matt Damon, he really has no idea what he is up against.",
        "source": "user"
    },
    {
        "text": "He is unaware that the human race will stop at nothing to retrieve Matt Damon.",
        "source": "user"
    },
    {
        "text": "In fact, a group of humans based on Switzerland is immediately notified of Matt Damon's disappearance.",
        "source": "user"
    },
    {
        "text": "They are called the \"Matt Damon Retrieval Team\" and they are the most elite group of humans on the planet.",
        "source": "user"
    },
    {
        "text": "This Swiss team has a lot of powerful weapons at their disposal to try to get Matt Damon back on planet Earth.",
        "source": "user"
    },
    {
        "text": "The alien is not aware of this, but he is about to get a rude awakening.",
        "source": "user"
    },
    {
        "text": "The Swiss team sets out to find the alien in a spaceship.",
        "source": "user"
    },
    {
        "text": "They set their sights on the planet where they know the alien is: Planet Borg.",
        "source": "user"
    },
    {
        "text": "Planet Borg is zillions of lightyears away from the Swiss, but they are totally undeterred.",
        "source": "user"
    },
    {
        "text": "They truly stop at nothing for Matt Damon.",
        "source": "user"
    },
    {
        "text": "And so, as a result, the alien is not prepared for the blasts of rain and fire that he is hit with all of a sudden on Planet Borg.",
        "source": "user"
    },
    {
        "text": "The Swiss have arrived!",
        "source": "user"
    },
    {
        "text": "The Swiss team is not going to let the alien have his way with Matt Damon.",
        "source": "user"
    },
    {
        "text": "They are going to get Matt Damon back, no matter what.",
        "source": "user"
    },
    {
        "text": "They are going to get Matt Damon back, even if they have to destroy Planet Borg in the process.",
        "source": "user"
    },
    {
        "text": "Matt Damon is relieved to see the Swiss.",
        "source": "user"
    },
    {
        "text": "After all, the alien had been confining him to a small isolation room, where he was only allowed to eat hot dogs and watch the same Netflix show over and over again, on repeat.",
        "source": "user"
    },
    {
        "text": "The alien had been very cruel to Matt Damon.",
        "source": "user"
    },
    {
        "text": "So when the Swiss start blasting Planet Borg, Matt Damon knows he's in good hands.",
        "source": "user"
    },
    {
        "text": "He is promptly freed and gives the alien a very sarcastic goodbye.",
        "source": "user"
    },
    {
        "text": "The alien is not happy.",
        "source": "user"
    },
    {
        "text": "He is not happy that he has been defeated by the Swiss.",
        "source": "user"
    },
    {
        "text": "And yet there is nothing he can do about the situation, since he knows he does not have the tools at his disposal to fight back against the Swiss.",
        "source": "user"
    },
    {
        "text": "So all he can do is lay back and take it.",
        "source": "user"
    },
    {
        "text": "This angers him to no end, and he realizes he will have to be stealthier the next time he tries to capture a human from planet Earth.",
        "source": "user"
    },
    {
        "text": "Never again will the alien try to kidnap Matt Damon.",
        "source": "user"
    },
    {
        "text": "He has truly learned his lesson.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    }
]