[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you will all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "There is a smell of buttery popcorn around.",
        "source": "user"
    },
    {
        "text": "It is tantalizing, smelling better than anything you've ever smelled on Earth.",
        "source": "user"
    },
    {
        "text": "You look for the source.",
        "source": "user"
    },
    {
        "text": "There are versions of you, relaxing in their seats,, with large golden buckets of popcorn, with a strange sparkle.",
        "source": "user"
    },
    {
        "text": "You get up out of your seat and approach one of the people with the buckets.",
        "source": "user"
    },
    {
        "text": "\"Excuse me\", you say.",
        "source": "user"
    },
    {
        "text": "\"What is that sparkling stuff on your popcorn?\" The other version of you smiles.",
        "source": "user"
    },
    {
        "text": "\"It's a magic powder., given to us as karma for being good in previous lifetimes\" \"Magic powder?\", you ask, confused.",
        "source": "user"
    },
    {
        "text": "\"You can sprinkle it on anything and make it better.\" He smiles and hands you the whole bucket.",
        "source": "user"
    },
    {
        "text": "\"Try some!\"  You do, and it's true.",
        "source": "user"
    },
    {
        "text": "You suddenly feel like you can do anything: talk to anyone, learn anything, love anyone.",
        "source": "user"
    },
    {
        "text": "You've never felt like this.",
        "source": "user"
    },
    {
        "text": "You have a sudden thought.",
        "source": "user"
    },
    {
        "text": "What if you sprinkle it on yourself?",
        "source": "user"
    },
    {
        "text": "You do this, and suddenly you are no longer sitting in a cinema.",
        "source": "user"
    },
    {
        "text": "You are sitting on an unfamiliar beach, but it looks like the beach from your dreams.",
        "source": "user"
    },
    {
        "text": "The man who shared his popcorn with you is beside you, watching the sky.",
        "source": "user"
    },
    {
        "text": "You glance up.",
        "source": "user"
    },
    {
        "text": "The sky is beautiful, but then you see the movie begin to play.",
        "source": "user"
    },
    {
        "text": "It's like an Aurora Borealis, 4d, better than any movie you have ever seen.",
        "source": "user"
    },
    {
        "text": "You nudge the man, as the intro begins.",
        "source": "user"
    },
    {
        "text": "\"Thanks for the powder\", you say.",
        "source": "user"
    },
    {
        "text": "\"This will be the best show ever!\"",
        "source": "user"
    },
    {
        "text": "The End.",
        "source": "user"
    }
]