[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "No one knew why it was happening.",
        "source": "user"
    },
    {
        "text": "But suddenly, a majority of the men in the world were now just \"#1 Dad\".",
        "source": "api"
    },
    {
        "text": "Which was good, except when the mugs suddenly changed and you weren't #1 anymore.",
        "source": "user"
    },
    {
        "text": "Some people panicked over the change.",
        "source": "user"
    },
    {
        "text": "People didn't know what it meant - had the men whose mugs didn't say #1 done something truly horrible?",
        "source": "user"
    },
    {
        "text": "Or just told their kids they couldn't have chocolate bars for breakfast?",
        "source": "user"
    },
    {
        "text": "Suspicion ran rampant, and suddenly no one was certain they could trust any dads at all!",
        "source": "user"
    },
    {
        "text": "Mark was a dad whose mug stayed #1 for a very long time.",
        "source": "user"
    },
    {
        "text": "But then one day he woke up and it said \"Dad\".",
        "source": "user"
    },
    {
        "text": "No number at all.",
        "source": "user"
    },
    {
        "text": "His wife freaked out \"What did you do that was so bad that you don't get a number at all!\" His boss was troubled \"Mark, maybe you shouldn't come into work for a while.\" And the police.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".\"",
        "source": "user"
    },
    {
        "text": "\"Mr.",
        "source": "user"
    },
    {
        "text": "Grant, you should come down to the station and talk with us for a while.\"",
        "source": "user"
    },
    {
        "text": "\"",
        "source": "api"
    },
    {
        "text": "Mark was sure he hadn't done anything terrible.",
        "source": "api"
    },
    {
        "text": "Everything was just so strange and out of control these days.",
        "source": "user"
    },
    {
        "text": "It was like the world had suddenly lost its mind.",
        "source": "api"
    },
    {
        "text": "His wife seemed to be getting ready to leave him, it looked like he was going to lose his job, the police were watching his every move, and then that purple pig driving a motorcycle almost hit him as he was crossing the road.",
        "source": "user"
    },
    {
        "text": "Mark took a deep breath and said, \"If that pig would just wait for me to cross the road, I'll eat a piece asparagus cake.\"",
        "source": "api"
    },
    {
        "text": "Wait.",
        "source": "user"
    },
    {
        "text": "What had he just said?",
        "source": "user"
    },
    {
        "text": "And what drove by?",
        "source": "user"
    },
    {
        "text": "Mark's head was swimming, and he couldn't seem to focus.",
        "source": "user"
    },
    {
        "text": "And then suddenly he was standing outside of his high school, but he was 15, but still had a beard?",
        "source": "user"
    },
    {
        "text": "And he started to hear voices.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "\"Wake up Mark, come on sweetheart, I know you are tired, but it's the big day.\"",
        "source": "user"
    },
    {
        "text": "Mark's mind suddenly rose from dreams into consciousness.",
        "source": "user"
    },
    {
        "text": "He looked over at his wife who was smiling at him, and told him to hurry up and come to breakfast.",
        "source": "user"
    },
    {
        "text": "He dressed, and sat down at the table, listening to his kids scrambling to get ready for school.",
        "source": "user"
    },
    {
        "text": "His mind was still in a daze, half caught up in the dream that had felt so real.",
        "source": "user"
    },
    {
        "text": "His wife handed him a cup of coffee.",
        "source": "user"
    },
    {
        "text": "\"You still look tired dear. I know it's been a stressful month with that big work project, and may parents staying with us for a while, and me doing so much overtime. But I'm back on my normal schedule now, and mom and dad are heading out after lunch, and once you finish that big presentation today you should be able to finally relax. It's going to be a good day.\"",
        "source": "user"
    },
    {
        "text": "Mark took a deep breath and looked at his coffee in the #1 Dad mug.",
        "source": "user"
    },
    {
        "text": "\"Yes\" he said \"It is going to be a good day.\"",
        "source": "user"
    }
]