[
    "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
    "Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk.",
    "When you're 85, the side effects are finally discovered.",
    "This is the story of how you, and the other Lost Generations, survive in a world where everyone younger than you never ages, but everyone older than you avoided the side effects.",
    "You, personally, were lauded throughout your life for discovering the drug that stopped the effects of aging in a younger population, but the government decided, in principle, to deny you the chance to benefit from it.",
    "You were offered the drug from the black market but you refused.",
    "You, and many others like you, were outraged at the government's decision, but some of the others took the drug anyway.",
    "For the most part, you just live your life as normal in this new, boring world where young celebrities never age, and never get replaced by younger counterparts.",
    "Eventually, the outrage about the unfair distribution of the drug dies down as well, and the older generations accept their fate.",
    "If anything, the economy thrives, because people no longer lose their vitality as they get older, and they have decades of wisdom and experience to apply to new projects.",
    "You and some of your generation are still nostalgic for the past, but you accept that a world without aging, even if just for a few, is better than the world that we had before.",
    "Even though you won't be around to enjoy it forever, you are glad that many others will be.",
    "When you are halfway into your happy retirement, however, the side effects become clear.",
    "This whole time you thought that everyone had stopped aging, but it turns out that they spent the decades aging very slowly.",
    "The rate at which they aged was itself slowing down, and only recently had they reached the point where they truly did stop aging.",
    "You and the rest of the Lost Generations are now the only ones who are aging normally, and the younger people who took the drug still appear to be young and healthy.",
    "However, in recent years, it has become clear that they are actually now aging in reverse.",
    "They are moving backwards through their growth cycles very slowly, but the age at which they are going back is increasing steadily over time.",
    "If this trend continues the same way as it did when the drug was preventing aging, then eventually, they will all become babies again!",
    "The only hope for humanity is that these \"young\" people start to quickly have as many children as they can.",
    "They all just have to hope that their children will age normally, just like the unlucky lost generation who never got to take the drug.",
    "The only source of comfort that you have in your old age is that you won't be around long enough to see the terrible impact that this side effect has on the world as a whole.",
    "You are also glad that enough time has passed that people don't remember who you are.",
    "If you thought they were mad when they couldn't get the drug, you can't imagine how mad the people will be when they learn what your miracle drug really accomplished.",
    "\"Thank god for our short lifetimes\", you think to yourself.",
    "You turn off the news, and decide to take a long nap.",
    "THE END\n"
]