[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "This is a story of the end of the world, and the beginning of the next.",
        "source": "api"
    },
    {
        "text": "John was the second generation to start to have noticeable powers.",
        "source": "user"
    },
    {
        "text": "It was almost something that he had taken for granted, as he did not know what it was like before to have none.",
        "source": "user"
    },
    {
        "text": "There were now classes in the little school to teach the children how to harness their Mana and use it, in the hopes that one day a generation would be strong enough to take back their home.",
        "source": "user"
    },
    {
        "text": "John was now in his final year of school, and was one of the stronger students.",
        "source": "user"
    },
    {
        "text": "While he was stronger, he was still not considered unusual, as there had been far more impressive people he had learned about in his history class.",
        "source": "user"
    },
    {
        "text": "He didn't know that one day that was about to change and he could hold the key to restoring order on his earth.",
        "source": "user"
    },
    {
        "text": "He was a tall, well-built young man with short brown hair and a friendly face.",
        "source": "user"
    },
    {
        "text": "Nothing that spoke to the powers that were laying in wait inside him.",
        "source": "user"
    },
    {
        "text": "It was during a practice exercise that he began to feel different.",
        "source": "user"
    },
    {
        "text": "The goal was to either provide a shield around yourself, or blast away a fake alien that was in the fight room.",
        "source": "user"
    },
    {
        "text": "A good student could be fairly impressive at one, although no one was really that great.",
        "source": "user"
    },
    {
        "text": "The instructors hoped that with practice though, the children would be powerful enough when they grew up to serve the security force well.",
        "source": "user"
    },
    {
        "text": "Suddenly it was John's turn.",
        "source": "user"
    },
    {
        "text": "He felt a cold stillness take over his body that he had never felt before.",
        "source": "user"
    },
    {
        "text": "And then suddenly it exploded around him.",
        "source": "user"
    },
    {
        "text": "The fake alien flew back against the wall with such force that it clattered to the ground in pieces.",
        "source": "user"
    },
    {
        "text": "But not only that, there was now a distinctive blue shield around John.",
        "source": "user"
    },
    {
        "text": "He had done both.",
        "source": "user"
    },
    {
        "text": "The instructors were stunned.",
        "source": "api"
    },
    {
        "text": "No one could speak.",
        "source": "user"
    },
    {
        "text": "Finally they told John to release his shield and shower and get ready for his next class.",
        "source": "user"
    },
    {
        "text": "By the time he went home and had dinner for his family, he had forgotten about his display, but the school had not.",
        "source": "user"
    },
    {
        "text": "There was a knock at the door and the headmaster and the head of security were ushered into the sitting room.",
        "source": "user"
    },
    {
        "text": "They conferred with John's parents for quite some time.",
        "source": "user"
    },
    {
        "text": "\"John, we have some good news for you,\" his father said.",
        "source": "api"
    },
    {
        "text": "\" You are going to be given an opportunity that most can only dream of.\"",
        "source": "user"
    },
    {
        "text": "\"You are going to the capital\" There were tears in his father's eyes but pride in his voice.",
        "source": "user"
    },
    {
        "text": "And John knew that while it was called an opportunity, he was not being given a choice.",
        "source": "user"
    },
    {
        "text": "His life path had been decided for him.",
        "source": "user"
    },
    {
        "text": "And while he was scared he was also excited.",
        "source": "user"
    },
    {
        "text": "He packed his bags and wondered how he would ever sleep that night.",
        "source": "user"
    }
]