[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?",
        "source": "api"
    },
    {
        "text": "\"\n\n\"Excuse me?",
        "source": "api"
    },
    {
        "text": "\" I asked.",
        "source": "user"
    },
    {
        "text": "Was this little bee that i was deathly afraid of really whispering into my ear right now?",
        "source": "user"
    },
    {
        "text": "\"Your orders, Your Majesty.",
        "source": "user"
    },
    {
        "text": "\" Spoke the bee.",
        "source": "api"
    },
    {
        "text": "Well, i guess i can be sure that i wasnt just hearing things.",
        "source": "user"
    },
    {
        "text": "I was being spoken to by a Bee.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "i think i have gone crazy.",
        "source": "user"
    },
    {
        "text": "Or maybe I am dead, yea i must have died and this is what the afterlife is like.",
        "source": "user"
    },
    {
        "text": "In this life bees can whisper into my ear, i guess i just have to accept it.",
        "source": "user"
    },
    {
        "text": "Or maybe this is reality?",
        "source": "user"
    },
    {
        "text": "I dont know.",
        "source": "user"
    },
    {
        "text": "\"Hey bee, can you tell me what you are talking about?",
        "source": "user"
    },
    {
        "text": "\".",
        "source": "user"
    },
    {
        "text": "I asked.",
        "source": "user"
    },
    {
        "text": "\"My name is greg first of all your majesty, and I just want to know what your orders are please.",
        "source": "user"
    },
    {
        "text": "\" I could help but think of what a crazy name greg was for a bee.",
        "source": "user"
    },
    {
        "text": "\"Well, I dont know what to tell you greg, i dont know what you are talking about.",
        "source": "user"
    },
    {
        "text": "\" I said.",
        "source": "api"
    },
    {
        "text": "\"Can you stop being ridiculous and give me your orders man.",
        "source": "api"
    },
    {
        "text": "Jesus christ, im literally here asking to perform your orders.",
        "source": "user"
    },
    {
        "text": "The things i would do to have a servant.",
        "source": "user"
    },
    {
        "text": "\" the bee said.",
        "source": "user"
    },
    {
        "text": "Well, now this bee has an attitude with me i thought, let me just see where this goes.",
        "source": "user"
    },
    {
        "text": "\"Well, im not sure what you are talking about, but i guess i could use a servant, so why not.",
        "source": "user"
    },
    {
        "text": "How about some orange juice\" I asked.",
        "source": "api"
    },
    {
        "text": "Just like that, the bee flew over and grabbed a bottle of orange juice from the hand of some little girl.",
        "source": "user"
    },
    {
        "text": "To be honest this was my favorite part of the day.",
        "source": "user"
    },
    {
        "text": "This little bee literally snatched this orange juice like a grown man.",
        "source": "user"
    },
    {
        "text": "Just as i was handed the orange juice by the bee, i woke up from my dream.",
        "source": "user"
    },
    {
        "text": "Only i didnt know it was a dream.",
        "source": "user"
    },
    {
        "text": "Well, look forward to going to sleep tomorrow i guess!",
        "source": "user"
    }
]