[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "Humans are now discovering that they have the power to travel back in time.",
        "source": "user"
    },
    {
        "text": "This has become true for one man in particular, Bob.",
        "source": "user"
    },
    {
        "text": "Bob didn't realize he had this power until the day that he lost his favorite sunglasses.",
        "source": "user"
    },
    {
        "text": "But when he slips back to the day where he first found them, something unexpected happens.",
        "source": "user"
    },
    {
        "text": "He couldn't figure out how to come back to the present time.",
        "source": "user"
    },
    {
        "text": "Traveling through time was such a new power for humans that he didn't know what to do.",
        "source": "user"
    },
    {
        "text": "He sat on a nearby bench after putting on his newly found sunglasses to think about it for a bit.",
        "source": "user"
    },
    {
        "text": "\"Do you have any idea what time it is?\" he asked a passerby.",
        "source": "user"
    },
    {
        "text": "\"It is time for you to go home,\" she replied.",
        "source": "user"
    },
    {
        "text": "Bob was confused.",
        "source": "user"
    },
    {
        "text": "He wanted to get home.",
        "source": "user"
    },
    {
        "text": "But just then, a though popped into his head.",
        "source": "user"
    },
    {
        "text": "Maybe, just maybe, that was a clue for him to be able to find his way back to the present time.",
        "source": "user"
    },
    {
        "text": "Maybe he had to find his home.",
        "source": "user"
    },
    {
        "text": "And he was closest to his home at the time.",
        "source": "api"
    },
    {
        "text": "So off he went for the short walk to his house in the small neighborhood just outside of the city.",
        "source": "user"
    },
    {
        "text": "Coming back to his house, Bob was confused as to why he was supposed to come here.",
        "source": "user"
    },
    {
        "text": "Everything looked the same and he didn't know what to do to get back to the present time.",
        "source": "user"
    },
    {
        "text": "All Bob wanted to do was get his sunglasses and it has turned into a daylong adventure!",
        "source": "user"
    },
    {
        "text": "Bob began to walk from room to room in his house to search for a clue on how to get back to the present time.",
        "source": "user"
    },
    {
        "text": "As he walked through the kitchen, he noticed a strange looking plant.",
        "source": "user"
    },
    {
        "text": "Bob didn't own any plants so he thought it was odd that it was there.",
        "source": "user"
    },
    {
        "text": "It was the only thing out of place.",
        "source": "user"
    },
    {
        "text": "\"I don't know why but I think that plant has something to do with me getting back to the present time,\" Bob thought.",
        "source": "api"
    },
    {
        "text": "He began to inspect the plant further.",
        "source": "user"
    },
    {
        "text": "It seemed to have some sort of small berries on it.",
        "source": "user"
    },
    {
        "text": "They were purple, looked plump and round, and smelled delicious.",
        "source": "user"
    },
    {
        "text": "Bob was so curious about the plant that he decided to pick one of the berries and take a bite.",
        "source": "user"
    },
    {
        "text": "Bob started to feel very tired within seconds of ingesting the mysterious berry.",
        "source": "user"
    },
    {
        "text": "He was now regretting this decision.",
        "source": "user"
    },
    {
        "text": "He collapsed on the kitchen floor.",
        "source": "user"
    },
    {
        "text": "He was unable to do anything as he drifted off into an odd dream.",
        "source": "api"
    },
    {
        "text": "When he awoke, he was in the same spot in the kitchen.",
        "source": "user"
    },
    {
        "text": "However, the mysterious plant had disappeared.",
        "source": "user"
    },
    {
        "text": "Bob was surprised that he had returned to the present time.",
        "source": "api"
    },
    {
        "text": "\"I discovered the key to time travel and didn't even know it,\" Bob said to himself.",
        "source": "user"
    },
    {
        "text": "From that time on, Bob regularly enjoyed traveling through time now that he knew how to get back home.",
        "source": "user"
    }
]