[
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.224633431085044
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students.\n",
        "source": "api",
        "start_time": 31.0,
        "end_time": 31.0,
        "last_event_time": 31.0,
        "start_progress": 0.224633431085044,
        "end_progress": 0.2586510263929619
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students. I believe that pads and tampons are similar to toilet paper, soap, Band-Aids and other products that are already provided in schools.\n",
        "source": "api",
        "start_time": 57.0,
        "end_time": 57.0,
        "last_event_time": 57.0,
        "start_progress": 0.2586510263929619,
        "end_progress": 0.33724340175953077
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students. I believe that pads and tampons are similar to toilet paper, soap, Band-Aids and other products that are already provided in schools. They are a basic life need.  They should be made easily accessible \n",
        "source": "user",
        "start_time": 58.0,
        "end_time": 98.0,
        "last_event_time": 98.0,
        "start_progress": 0.33724340175953077,
        "end_progress": 0.3771260997067449
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students. I believe that pads and tampons are similar to toilet paper, soap, Band-Aids and other products that are already provided in schools. They are a basic life need.  They should be made easily accessible to students, just like toilet paper and soap.\n",
        "source": "api",
        "start_time": 102.0,
        "end_time": 102.0,
        "last_event_time": 102.0,
        "start_progress": 0.3771260997067449,
        "end_progress": 0.4035190615835777
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students. I believe that pads and tampons are similar to toilet paper, soap, Band-Aids and other products that are already provided in schools. They are a basic life need.  They should be made easily accessible to students, just like toilet paper and soap. I believe no student should go without hygiene products and fear asking for help. I would promote \n",
        "source": "user",
        "start_time": 130.0,
        "end_time": 185.0,
        "last_event_time": 185.0,
        "start_progress": 0.4035190615835777,
        "end_progress": 0.46158357771261
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students. I believe that pads and tampons are similar to toilet paper, soap, Band-Aids and other products that are already provided in schools. They are a basic life need.  They should be made easily accessible to students, just like toilet paper and soap. I believe no student should go without hygiene products and fear asking for help. I would promote this idea by speaking to my principal and other teachers about the importance of providing free pads and tampons in schools.\n",
        "source": "api",
        "start_time": 191.0,
        "end_time": 191.0,
        "last_event_time": 191.0,
        "start_progress": 0.46158357771261,
        "end_progress": 0.5343108504398827
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students. I believe that pads and tampons are similar to toilet paper, soap, Band-Aids and other products that are already provided in schools. They are a basic life need.  They should be made easily accessible to students, just like toilet paper and soap. I believe no student should go without hygiene products and fear asking for help. I would promote this idea by speaking to my principal and other teachers about the importance of providing free pads and tampons in schools. It is a topic that some people are embarrassed to bring up. \n",
        "source": "user",
        "start_time": 221.0,
        "end_time": 233.0,
        "last_event_time": 233.0,
        "start_progress": 0.5343108504398827,
        "end_progress": 0.5700879765395894
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students. I believe that pads and tampons are similar to toilet paper, soap, Band-Aids and other products that are already provided in schools. They are a basic life need.  They should be made easily accessible to students, just like toilet paper and soap. I believe no student should go without hygiene products and fear asking for help. I would promote this idea by speaking to my principal and other teachers about the importance of providing free pads and tampons in schools. It is a topic that some people are embarrassed to bring up. I would be willing to speak up and help make a difference.\n",
        "source": "api",
        "start_time": 239.0,
        "end_time": 239.0,
        "last_event_time": 239.0,
        "start_progress": 0.5700879765395894,
        "end_progress": 0.6041055718475073
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students. I believe that pads and tampons are similar to toilet paper, soap, Band-Aids and other products that are already provided in schools. They are a basic life need.  They should be made easily accessible to students, just like toilet paper and soap. I believe no student should go without hygiene products and fear asking for help. I would promote this idea by speaking to my principal and other teachers about the importance of providing free pads and tampons in schools. It is a topic that some people are embarrassed to bring up. I would be willing to speak up and help make a difference. I would be willing to help improve health and hygiene for students.  I think it would be good to get students and parents involved in speaking up as well.  \n",
        "source": "user",
        "start_time": 268.0,
        "end_time": 360.0,
        "last_event_time": 360.0,
        "start_progress": 0.6041055718475073,
        "end_progress": 0.6961876832844575
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students. I believe that pads and tampons are similar to toilet paper, soap, Band-Aids and other products that are already provided in schools. They are a basic life need.  They should be made easily accessible to students, just like toilet paper and soap. I believe no student should go without hygiene products and fear asking for help. I would promote this idea by speaking to my principal and other teachers about the importance of providing free pads and tampons in schools. It is a topic that some people are embarrassed to bring up. I would be willing to speak up and help make a difference. I would be willing to help improve health and hygiene for students.  I think it would be good to get students and parents involved in speaking up as well.   I believe that students should be able to feel comfortable asking for pads and tampons.\n",
        "source": "api",
        "start_time": 367.0,
        "end_time": 367.0,
        "last_event_time": 367.0,
        "start_progress": 0.6961876832844575,
        "end_progress": 0.7478005865102639
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students. I believe that pads and tampons are similar to toilet paper, soap, Band-Aids and other products that are already provided in schools. They are a basic life need.  They should be made easily accessible to students, just like toilet paper and soap. I believe no student should go without hygiene products and fear asking for help. I would promote this idea by speaking to my principal and other teachers about the importance of providing free pads and tampons in schools. It is a topic that some people are embarrassed to bring up. I would be willing to speak up and help make a difference. I would be willing to help improve health and hygiene for students.  I think it would be good to get students and parents involved in speaking up as well.   I believe that students should be able to feel comfortable asking for pads and tampons and for voicing their opinion.  \n",
        "source": "user",
        "start_time": 374.0,
        "end_time": 416.0,
        "last_event_time": 416.0,
        "start_progress": 0.7478005865102639,
        "end_progress": 0.7665689149560118
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students. I believe that pads and tampons are similar to toilet paper, soap, Band-Aids and other products that are already provided in schools. They are a basic life need.  They should be made easily accessible to students, just like toilet paper and soap. I believe no student should go without hygiene products and fear asking for help. I would promote this idea by speaking to my principal and other teachers about the importance of providing free pads and tampons in schools. It is a topic that some people are embarrassed to bring up. I would be willing to speak up and help make a difference. I would be willing to help improve health and hygiene for students.  I think it would be good to get students and parents involved in speaking up as well.   I believe that students should be able to feel comfortable asking for pads and tampons and for voicing their opinion.   I believe that students should have a say in what is provided in schools.\n",
        "source": "api",
        "start_time": 424.0,
        "end_time": 424.0,
        "last_event_time": 424.0,
        "start_progress": 0.7665689149560118,
        "end_progress": 0.8099706744868035
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students. I believe that pads and tampons are similar to toilet paper, soap, Band-Aids and other products that are already provided in schools. They are a basic life need.  They should be made easily accessible to students, just like toilet paper and soap. I believe no student should go without hygiene products and fear asking for help. I would promote this idea by speaking to my principal and other teachers about the importance of providing free pads and tampons in schools. It is a topic that some people are embarrassed to bring up. I would be willing to speak up and help make a difference. I would be willing to help improve health and hygiene for students.  I think it would be good to get students and parents involved in speaking up as well.   I believe that students should be able to feel comfortable asking for pads and tampons and for voicing their opinion.   I believe that students should have a say in what is provided in schools. By giving students the chance to speak up for free tampons and pads, \n",
        "source": "user",
        "start_time": 453.0,
        "end_time": 474.0,
        "last_event_time": 474.0,
        "start_progress": 0.8099706744868035,
        "end_progress": 0.8510263929618769
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students. I believe that pads and tampons are similar to toilet paper, soap, Band-Aids and other products that are already provided in schools. They are a basic life need.  They should be made easily accessible to students, just like toilet paper and soap. I believe no student should go without hygiene products and fear asking for help. I would promote this idea by speaking to my principal and other teachers about the importance of providing free pads and tampons in schools. It is a topic that some people are embarrassed to bring up. I would be willing to speak up and help make a difference. I would be willing to help improve health and hygiene for students.  I think it would be good to get students and parents involved in speaking up as well.   I believe that students should be able to feel comfortable asking for pads and tampons and for voicing their opinion.   I believe that students should have a say in what is provided in schools. By giving students the chance to speak up for free tampons and pads, they will be more likely to speak up for other things that they need.\n",
        "source": "api",
        "start_time": 477.0,
        "end_time": 477.0,
        "last_event_time": 477.0,
        "start_progress": 0.8510263929618769,
        "end_progress": 0.8914956011730205
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students. I believe that pads and tampons are similar to toilet paper, soap, Band-Aids and other products that are already provided in schools. They are a basic life need.  They should be made easily accessible to students, just like toilet paper and soap. I believe no student should go without hygiene products and fear asking for help. I would promote this idea by speaking to my principal and other teachers about the importance of providing free pads and tampons in schools. It is a topic that some people are embarrassed to bring up. I would be willing to speak up and help make a difference. I would be willing to help improve health and hygiene for students.  I think it would be good to get students and parents involved in speaking up as well.   I believe that students should be able to feel comfortable asking for pads and tampons and for voicing their opinion.   I believe that students should have a say in what is provided in schools. By giving students the chance to speak up for free tampons and pads, they will be more likely to speak up for other things that they need.  Future generations will be brave and \n",
        "source": "user",
        "start_time": 501.0,
        "end_time": 513.0,
        "last_event_time": 513.0,
        "start_progress": 0.8914956011730205,
        "end_progress": 0.9143695014662757
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students. I believe that pads and tampons are similar to toilet paper, soap, Band-Aids and other products that are already provided in schools. They are a basic life need.  They should be made easily accessible to students, just like toilet paper and soap. I believe no student should go without hygiene products and fear asking for help. I would promote this idea by speaking to my principal and other teachers about the importance of providing free pads and tampons in schools. It is a topic that some people are embarrassed to bring up. I would be willing to speak up and help make a difference. I would be willing to help improve health and hygiene for students.  I think it would be good to get students and parents involved in speaking up as well.   I believe that students should be able to feel comfortable asking for pads and tampons and for voicing their opinion.   I believe that students should have a say in what is provided in schools. By giving students the chance to speak up for free tampons and pads, they will be more likely to speak up for other things that they need.  Future generations will be brave and confident enough to speak up for what they need.\n",
        "source": "api",
        "start_time": 517.0,
        "end_time": 517.0,
        "last_event_time": 517.0,
        "start_progress": 0.9143695014662757,
        "end_progress": 0.9425219941348973
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should provide free pads and tampons to students. I believe that pads and tampons are similar to toilet paper, soap, Band-Aids and other products that are already provided in schools. They are a basic life need.  They should be made easily accessible to students, just like toilet paper and soap. I believe no student should go without hygiene products and fear asking for help. I would promote this idea by speaking to my principal and other teachers about the importance of providing free pads and tampons in schools. It is a topic that some people are embarrassed to bring up. I would be willing to speak up and help make a difference. I would be willing to help improve health and hygiene for students.  I think it would be good to get students and parents involved in speaking up as well.   I believe that students should be able to feel comfortable asking for pads and tampons and for voicing their opinion.   I believe that students should have a say in what is provided in schools. By giving students the chance to speak up for free tampons and pads, they will be more likely to speak up for other things that they need.  Future generations will be brave and confident enough to speak up for what they need.   I believe that it is important to give students the opportunity to speak up for what they need.\n",
        "source": "api",
        "start_time": 553.0,
        "end_time": 553.0,
        "last_event_time": 553.0,
        "start_progress": 0.9425219941348973,
        "end_progress": 1.0
    }
]