[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\"",
        "source": "api"
    },
    {
        "text": "You smile.",
        "source": "user"
    },
    {
        "text": "You hoped this day would come.",
        "source": "user"
    },
    {
        "text": "When you were president, one of the first things you were told was that JFK wasn't dead.",
        "source": "user"
    },
    {
        "text": "In fact, you heard from him a few times during your presidency.",
        "source": "user"
    },
    {
        "text": "A note here and there with advice, or with information that you didn't have but that was valuable to you.",
        "source": "user"
    },
    {
        "text": "The notes hinted that after your presidency was over, you might receive an invitation to meet with him.",
        "source": "user"
    },
    {
        "text": "And given that JFK was born in 1917, you suspected there would be an everlasting life component to whatever he might tell you.",
        "source": "user"
    },
    {
        "text": "You pack your bags on a Saturday morning and give Michelle a kiss on the cheek as you leave.",
        "source": "user"
    },
    {
        "text": "She's your partner and you don't keep secrets from her, so she's aware where you're headed and who you're meeting with.",
        "source": "user"
    },
    {
        "text": "You drive to a secluded beach on the Outer Banks of North Carolina and make your way to a small bungalow.",
        "source": "api"
    },
    {
        "text": "JFK is sitting on the porch, wearing khaki's and a t-shirt, with his trademark rakish grin.",
        "source": "api"
    },
    {
        "text": "He looks no older than mid-40s, which is when he supposedly died.",
        "source": "user"
    },
    {
        "text": "He offers you a beer from a cooler by his feet and you sit next to him.",
        "source": "user"
    },
    {
        "text": "\"So Barack, you ever get tired of retirement?\"",
        "source": "user"
    },
    {
        "text": "\"It has its upsides, but after running the most important country in the free world, I have to admit it's boring sometimes.  But let's address the elephant on the porch.  How is it possible you're sitting here not looking a day older than when you were shot and thought to be killed?\"",
        "source": "user"
    },
    {
        "text": "JFK smiled and grabbed a beer for himself out of the cooler.",
        "source": "user"
    },
    {
        "text": "He explained that he thought he was dead, too, but about 20 years ago, he woke up in a lab.",
        "source": "user"
    },
    {
        "text": "He had be cryogenically frozen after being shot.",
        "source": "user"
    },
    {
        "text": "A team of government doctors were finally able to reconstruct the area of his brain that was effected by the shot he received to the head.",
        "source": "user"
    },
    {
        "text": "Since then, he'd been contacting Democratic presidents to offer advice.",
        "source": "user"
    },
    {
        "text": "\"Haven't been enough of us in the last 20 years, but I've done what I can.  You're the first I've invited to join me.\"",
        "source": "user"
    },
    {
        "text": "\"Join you in what?\"",
        "source": "user"
    },
    {
        "text": "\"Make America great again.\"",
        "source": "api"
    },
    {
        "text": "Obama raised an eyebrow at that response.",
        "source": "user"
    },
    {
        "text": "\"America is great already, and will be better once Trump is out of office.\"",
        "source": "user"
    },
    {
        "text": "JFK told Obama that Trump and his allies were trying to rig the upcoming election in Trump's favor.",
        "source": "user"
    },
    {
        "text": "JFK couldn't reveal himself in public, so he needed Obama to work with his cohorts in battleground states to ensure that everything was done on the up and up so that the election would have to be certified in Biden won.",
        "source": "user"
    },
    {
        "text": "Since this was important to Obama as well, he agreed.",
        "source": "user"
    },
    {
        "text": "He spent a relaxing weekend with JFK and then headed home with a new purpose.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "to save American democracy.",
        "source": "user"
    }
]