[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "This discovery is truly shocking to the president of the United States at the time.",
        "source": "user"
    },
    {
        "text": "Her name is Soeurette Morley and she decides to go on a rampage to make up for the fact that the U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "user"
    },
    {
        "text": "has now lagged behind other countries so much to the extent that the United States is now no longer a global superpower.",
        "source": "user"
    },
    {
        "text": "The United States is now a third world country.",
        "source": "user"
    },
    {
        "text": "Soeurette Morley has been elected president for life and has been ruling the country with an iron fist for the past 50 years.",
        "source": "user"
    },
    {
        "text": "Soeurette is determined to show the other countries in the world who's boss, but this is difficult because the past 50 years have put the U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "user"
    },
    {
        "text": "at an extreme disadvantage relative to the other countries that did not go into isolation.",
        "source": "user"
    },
    {
        "text": "By going into isolation, the U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "user"
    },
    {
        "text": "ended up cutting itself off of all trade opportunities.",
        "source": "user"
    },
    {
        "text": "The economy tanked.",
        "source": "user"
    },
    {
        "text": "Innovation ceased.",
        "source": "user"
    },
    {
        "text": "There was really no more motivation to create anything or do anything in the U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "user"
    },
    {
        "text": "since there was no point; goods, products and services could not just be shipped to consumers in other markets and thus supply and demand seemed to totally plummet in the United States.",
        "source": "user"
    },
    {
        "text": "Soeurette Morley decides to take the U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "back to the top by any means necessary.",
        "source": "api"
    },
    {
        "text": "She decides to invade the other countries that did not go into isolation.",
        "source": "user"
    },
    {
        "text": "She decides to do this because she feels that the U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "has been wronged and that the U.",
        "source": "api"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "is entitled to take what it needs to take in order to be a global superpower again.",
        "source": "api"
    },
    {
        "text": "Soeurette Morley is a very strong and determined woman, but ultimately this is her downfall since she does not know when to stop.",
        "source": "user"
    },
    {
        "text": "She ends up obliterating the other countries, one by one, until the point where there are no other countries left for the United States to collaborate with.",
        "source": "user"
    },
    {
        "text": "And without any way of capitalizing on the borders that are now open, the fledgling economy of the United States is fated to suffer a bad outcome.",
        "source": "user"
    },
    {
        "text": "The United States is now in a very bad position.",
        "source": "user"
    },
    {
        "text": "The economy is in shambles.",
        "source": "user"
    },
    {
        "text": "And it is all Soeurette Morley's fault.",
        "source": "user"
    },
    {
        "text": "She is now hated by everyone in the United States.",
        "source": "user"
    },
    {
        "text": "She is forced to go into hiding.",
        "source": "user"
    },
    {
        "text": "She is forced to go into exile.",
        "source": "user"
    },
    {
        "text": "And she is forced to live the rest of her life in shame.",
        "source": "user"
    },
    {
        "text": "But once Soeurette Morley is gone, the people of the United States begin to rebuild themselves and their lives.",
        "source": "user"
    },
    {
        "text": "Once Soeurette Morley is ousted from her position, the whole country cheers wildly.",
        "source": "user"
    },
    {
        "text": "Everyone is looking forward to being able to live their normal lives again and they could not do that before when Soeurette Morley was in power.",
        "source": "user"
    },
    {
        "text": "The United States is now a democracy again.",
        "source": "user"
    },
    {
        "text": "It is a place where people are confident that they have beliefs that will be heard and a place where people know that they can be in a country that will not put the heavy restrictions on them that other countries will.",
        "source": "user"
    },
    {
        "text": "In conclusion, Soeurette Morley's ambition was her downfall, but that downfall led the United States to rebuild itself, so every story has its silver lining.",
        "source": "user"
    }
]