[
    "A woman has been dating guy after guy, but it never seems to work out.",
    "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
    "One day, she is texting with a new man she is interested in.",
    "It’s the shapeshifter.",
    "This time, he's going by the name Truman.",
    "“I’m going to be honest with you,” she says.",
    "“I’ve been with a lot of guys, and I’ve never felt this way.” She paused a moment, and then said \"I think I'm falling in love with you.\" \n\n“I think I’m falling in love with you too,” Truman replied.",
    "\"I'm so glad I can tell you at last.\" \n\n“Tell me what?” she asked.",
    "Suddenly there was a knock at the door.",
    "She opened it, and there stood Truman.",
    "She gasped.",
    "\"Truman!\"\n\n\"I'm here to tell you that I love you.",
    "I have always loved you.",
    "Will you marry me?\" \n\n\"Yes!\" she said.",
    "They embraced and he said, \"I've been waiting years to say that.\" She was confused.",
    "They had only known each other for a few months.",
    "\"Years?\" she asked.",
    "He nodded.",
    "\"I've been waiting for you to realize I'm the one.",
    "I've tried everything to make you happy.",
    "I've tried being everyone to make you happy.",
    "It finally worked.\" \n\n\"I'm so confused,\" she said.",
    "\"If this is a joke, I don't understand.\" \n\n\"It's not a joke,\" he said.",
    "\"It's been me all along.\" \n\n\"You're the guy I've been dating?\" she asked.",
    "\"How is that possible?\" \n\n\"By drinking this,\" he said, and held out a green bottle.",
    "She took it and read the label.",
    "\"Anyone that drinks it can transform into whatever they want.",
    "All I've ever wanted was to be yours.\" \n\n\"I don't know what to say,\" she said.",
    "She shrugged, closed her eyes, and took a sip.",
    "She opened her eyes, and saw that she had transformed into a man.",
    "Her date gasped in horror.",
    "\"What's wrong?\" she asked.",
    "\"I'm gonna show you what it's like having to put up with dating men.\"\n"
]