[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?\"",
        "source": "api"
    },
    {
        "text": "I am very surprised to hear a bee talk, but nevertheless I asked the bee \"What do you mean?\"",
        "source": "user"
    },
    {
        "text": "The bee replied \"You are the queen of the bees and the bees have chosen you to rule over them.\"",
        "source": "api"
    },
    {
        "text": "I thought this was strange since I'm deathly allergic to bee but I was happy to be queen so I played along.",
        "source": "user"
    },
    {
        "text": "The bee then said \"Your first order is to go to the meadow and make a hive.\" I didn't know how to make a hive the way bees do, but I did the best I could.",
        "source": "api"
    },
    {
        "text": "I got some sticks and leaves and I made a hive that looked just like a little house for the bees.",
        "source": "user"
    },
    {
        "text": "\"How's that?\" I asked the bee when I was finished.",
        "source": "user"
    },
    {
        "text": "I heard the bee say \"It's very nice, but you forgot the most important thing.\"",
        "source": "api"
    },
    {
        "text": "\"And what's that?\" I asked.",
        "source": "user"
    },
    {
        "text": "And the bee said I need to put it up high in a tree so nothing can harm it.",
        "source": "user"
    },
    {
        "text": "So I climbed a tree and I carefully tied my handcrafted beehive house up in the top of a tree.",
        "source": "user"
    },
    {
        "text": "\"There, it's safe now,\" I said to the bee.",
        "source": "user"
    },
    {
        "text": "The next day, I could see hundreds of bees moving into the hive.",
        "source": "user"
    },
    {
        "text": "\"They won't sting me will they?\" I asked my new friend.",
        "source": "user"
    },
    {
        "text": "\"No, you are the queen and they will do anything for you,\" the bee replied.",
        "source": "user"
    },
    {
        "text": "And then I had a great idea.",
        "source": "user"
    },
    {
        "text": "\"Little bee I have a favor to ask of you,\" I told my friend.",
        "source": "user"
    },
    {
        "text": "\"What is that?\" asked the friendly bee.",
        "source": "user"
    },
    {
        "text": "\"I am so allergic to a bee sting. I am willing to be your queen and I will even stay and guard the hive if you do me this one thing. Can you make me not allergic to bee stings?\"",
        "source": "user"
    },
    {
        "text": "\"I don't think I have the power,\" said the bee.",
        "source": "user"
    },
    {
        "text": "\"But I can travel far and wide and tell all of the bees that you are my queen and that they can never sting you.\"",
        "source": "user"
    },
    {
        "text": "\"That would be great!\", I exclaimed.",
        "source": "user"
    },
    {
        "text": "So a great deal was worked out.",
        "source": "user"
    },
    {
        "text": "I kept the bees safe from harm and I was protected from being stung by bees again for the rest of my life.",
        "source": "user"
    },
    {
        "text": "The end.",
        "source": "user"
    }
]