[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.\" The wolf wasn't too happy to learn that the little pig's house was built out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "After all, what good was such a house to him?",
        "source": "user"
    },
    {
        "text": "He knew he would never be able to blow a house like this down and thus it would make it very difficult to make a snack out of the little pig.",
        "source": "user"
    },
    {
        "text": "Of course, the little pig was a smart little creature and understood that was the whole point of building his house out of depleted uranium.",
        "source": "user"
    },
    {
        "text": "The wolf was a bit frustrated when he realized that he'd need to find another way to make a snack out of the little pig.",
        "source": "user"
    },
    {
        "text": "So he decided to try to trick the little pig into coming outside.",
        "source": "user"
    },
    {
        "text": "He decided to figure out what the little pig's favorite foods were.",
        "source": "user"
    },
    {
        "text": "He found out that the little pig's favorite foods were pizza, beer, and ice cream.",
        "source": "user"
    },
    {
        "text": "One day, the wolf came by the little pig's house with some ingredients to make homemade pizza.",
        "source": "user"
    },
    {
        "text": "The wolf was like, \"hey little pig, I have some ingredients to make homemade pizza. You want to come outside and help me make it?\" The little pig laughed.",
        "source": "user"
    },
    {
        "text": "Why would he come outside his house to make pizza?",
        "source": "user"
    },
    {
        "text": "It wasn't as though there was an oven built into his backyard.",
        "source": "user"
    },
    {
        "text": "But the wolf gestured at the pig through the little pig's window and showed the pig that he had brought an outdoor grill with him.",
        "source": "user"
    },
    {
        "text": "\"I was thinking we could grill the pizzas together,\" he said.",
        "source": "user"
    },
    {
        "text": "The little pig was intrigued.",
        "source": "user"
    },
    {
        "text": "Grilled pizza was delicious!",
        "source": "user"
    },
    {
        "text": "To seal the deal, the wolf said, \"I also have an ice chest full of cold beers and pints of Ben and Jerry's.\" The little pig was sold.",
        "source": "user"
    },
    {
        "text": "The little pig opened up his door and approached the wolf.",
        "source": "user"
    },
    {
        "text": "The wolf said, \"I'm glad you decided to come outside. I was afraid you were going to be a stick in the mud about this.\" The little pig laughed and said, \"I'm not a stick in the mud. I'm just smart enough to know that if I came outside, you'd eat me.\" The wolf smiled at the little pig.",
        "source": "user"
    },
    {
        "text": "\"So then what made you change your mind about coming outside?\" he asked.",
        "source": "user"
    },
    {
        "text": "The little pig smiled back.",
        "source": "user"
    },
    {
        "text": "\"Once I saw how much food you brought over, I figured that you'd just get full eating pizza and drinking beer and eating ice cream. I figured you couldn't eat all that and eat me too. And besides, I love all these foods!\" The wolf smiled at how gullible and ignorant the little pig was.",
        "source": "user"
    },
    {
        "text": "The little pig's greed for the food had tricked the little pig into thinking that the wolf had a much smaller appetite than he actually had.",
        "source": "user"
    },
    {
        "text": "In truth, the wolf had plenty of room in his stomach to eat lots of pizza in addition to the little pig.",
        "source": "user"
    },
    {
        "text": "The wolf said, \"that's great, little pig. Let's get started on making the pizzas.\" While the wolf rolled out dough, the little pig spread sauce and cheese.",
        "source": "user"
    },
    {
        "text": "But suddenly, the wolf turned to the little pig.",
        "source": "user"
    },
    {
        "text": "\"Hey little pig, I just realized that I forgot to bring the pepperoni. Do you have any suggestions?\" The little pig shrugged.",
        "source": "user"
    },
    {
        "text": "He wasn't a huge fan of pepperoni.",
        "source": "user"
    },
    {
        "text": "But then the wolf said, \"I have an idea! I know exactly where I can get pepperoni.\" The little pig was confused.",
        "source": "user"
    },
    {
        "text": "\"Where?\" he asked.",
        "source": "user"
    },
    {
        "text": "The store was closed that day so there was nowhere close to get pepperoni.",
        "source": "user"
    },
    {
        "text": "The wolf laughed.",
        "source": "user"
    },
    {
        "text": "\"I can get it right from you.\" And he licked his lips and ate the little pig in a flash, teaching the little pig a lesson about greed.",
        "source": "user"
    },
    {
        "text": "The moral of the story is that if you're a little pig, you should never trust a wolf.",
        "source": "user"
    }
]