[
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.14124929656724816
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, its white men in power that make me cringe. It is always a white man who is president, controls armies or are highly successful business men. Very rarely do you see a women, African American or especially any other race in the top spot in entertainment. Not only does this perpetuate the stereotype that white people still rule, it does not allow audiences to see other kinds of people in power. When that is seen in entertainment it usually becomes more acceptable and common place in the real world. \n",
        "source": "user",
        "start_time": 7.0,
        "end_time": 268.0,
        "last_event_time": 268.0,
        "start_progress": 0.14124929656724816,
        "end_progress": 0.42431063590320767
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, its white men in power that make me cringe. It is always a white man who is president, controls armies or are highly successful business men. Very rarely do you see a women, African American or especially any other race in the top spot in entertainment. Not only does this perpetuate the stereotype that white people still rule, it does not allow audiences to see other kinds of people in power. When that is seen in entertainment it usually becomes more acceptable and common place in the real world. This is not to say that white men should not play important roles in entertainment; it is more to show that women, African Americans and other races are\n",
        "source": "api",
        "start_time": 306.0,
        "end_time": 306.0,
        "last_event_time": 306.0,
        "start_progress": 0.42431063590320767,
        "end_progress": 0.509848058525605
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, its white men in power that make me cringe. It is always a white man who is president, controls armies or are highly successful business men. Very rarely do you see a women, African American or especially any other race in the top spot in entertainment. Not only does this perpetuate the stereotype that white people still rule, it does not allow audiences to see other kinds of people in power. When that is seen in entertainment it usually becomes more acceptable and common place in the real world. This is not to say that white men should not play important roles in entertainment; it is more to show that women, African Americans and other races are just as worthy and capable of doing it too. People look up to leading characters from childhood on so it is important for them to see different kinds of people in all different positions. \n",
        "source": "user",
        "start_time": 308.0,
        "end_time": 395.0,
        "last_event_time": 395.0,
        "start_progress": 0.509848058525605,
        "end_progress": 0.6162070906021384
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, its white men in power that make me cringe. It is always a white man who is president, controls armies or are highly successful business men. Very rarely do you see a women, African American or especially any other race in the top spot in entertainment. Not only does this perpetuate the stereotype that white people still rule, it does not allow audiences to see other kinds of people in power. When that is seen in entertainment it usually becomes more acceptable and common place in the real world. This is not to say that white men should not play important roles in entertainment; it is more to show that women, African Americans and other races are just as worthy and capable of doing it too. People look up to leading characters from childhood on so it is important for them to see different kinds of people in all different positions. It is imperative that Hollywood and the entertainment industry start to change their perspective on what makes a good leading character.\n",
        "source": "api",
        "start_time": 428.0,
        "end_time": 428.0,
        "last_event_time": 428.0,
        "start_progress": 0.6162070906021384,
        "end_progress": 0.6927405740011255
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, its white men in power that make me cringe. It is always a white man who is president, controls armies or are highly successful business men. Very rarely do you see a women, African American or especially any other race in the top spot in entertainment. Not only does this perpetuate the stereotype that white people still rule, it does not allow audiences to see other kinds of people in power. When that is seen in entertainment it usually becomes more acceptable and common place in the real world. This is not to say that white men should not play important roles in entertainment; it is more to show that women, African Americans and other races are just as worthy and capable of doing it too. People look up to leading characters from childhood on so it is important for them to see different kinds of people in all different positions. Because of this It is imperative that Hollywood and the entertainment industry start to change their perspective on what makes a good leading character. The country is becoming more diverse so the entertainment industry needs to do the same. \n",
        "source": "user",
        "start_time": 431.0,
        "end_time": 476.0,
        "last_event_time": 476.0,
        "start_progress": 0.6927405740011255,
        "end_progress": 0.7523916713562183
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, its white men in power that make me cringe. It is always a white man who is president, controls armies or are highly successful business men. Very rarely do you see a women, African American or especially any other race in the top spot in entertainment. Not only does this perpetuate the stereotype that white people still rule, it does not allow audiences to see other kinds of people in power. When that is seen in entertainment it usually becomes more acceptable and common place in the real world. This is not to say that white men should not play important roles in entertainment; it is more to show that women, African Americans and other races are just as worthy and capable of doing it too. People look up to leading characters from childhood on so it is important for them to see different kinds of people in all different positions. Because of this It is imperative that Hollywood and the entertainment industry start to change their perspective on what makes a good leading character. The country is becoming more diverse so the entertainment industry needs to do the same. If not, people will feel like Hollywood is not representing them.\n",
        "source": "api",
        "start_time": 492.0,
        "end_time": 492.0,
        "last_event_time": 492.0,
        "start_progress": 0.7523916713562183,
        "end_progress": 0.7889701744513224
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, its white men in power that make me cringe. It is always a white man who is president, controls armies or are highly successful business men. Very rarely do you see a women, African American or especially any other race in the top spot in entertainment. Not only does this perpetuate the stereotype that white people still rule, it does not allow audiences to see other kinds of people in power. When that is seen in entertainment it usually becomes more acceptable and common place in the real world. This is not to say that white men should not play important roles in entertainment; it is more to show that women, African Americans and other races are just as worthy and capable of doing it too. People look up to leading characters from childhood on so it is important for them to see different kinds of people in all different positions. Because of this It is imperative that Hollywood and the entertainment industry start to change their perspective on what makes a good leading character. The country is becoming more diverse so the entertainment industry needs to do the same. If not, people will feel like Hollywood is not representing them and seek other entertainment outlets. \n",
        "source": "user",
        "start_time": 494.0,
        "end_time": 504.0,
        "last_event_time": 504.0,
        "start_progress": 0.7889701744513224,
        "end_progress": 0.8103545301069218
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, its white men in power that make me cringe. It is always a white man who is president, controls armies or are highly successful business men. Very rarely do you see a women, African American or especially any other race in the top spot in entertainment. Not only does this perpetuate the stereotype that white people still rule, it does not allow audiences to see other kinds of people in power. When that is seen in entertainment it usually becomes more acceptable and common place in the real world. This is not to say that white men should not play important roles in entertainment; it is more to show that women, African Americans and other races are just as worthy and capable of doing it too. People look up to leading characters from childhood on so it is important for them to see different kinds of people in all different positions. Because of this It is imperative that Hollywood and the entertainment industry start to change their perspective on what makes a good leading character. The country is becoming more diverse so the entertainment industry needs to do the same. If not, people will feel like Hollywood is not representing them and seek other entertainment outlets. If Hollywood wants to stay in business it needs to move away from stereotypes and embrace film making that appeals to all groups.\n",
        "source": "api",
        "start_time": 521.0,
        "end_time": 521.0,
        "last_event_time": 521.0,
        "start_progress": 0.8103545301069218,
        "end_progress": 0.8829487900956668
    },
    {
        "text": "What Stereotypical Characters Make You Cringe?\n\nWhat stereotypical characters in books, movies or television shows make you cringe and why? Would you ever not watch or read something because of its offensive portrayal of someone?\n\n---\n\nIn my opinion, its white men in power that make me cringe. It is always a white man who is president, controls armies or are highly successful business men. Very rarely do you see a women, African American or especially any other race in the top spot in entertainment. Not only does this perpetuate the stereotype that white people still rule, it does not allow audiences to see other kinds of people in power. When that is seen in entertainment it usually becomes more acceptable and common place in the real world. This is not to say that white men should not play important roles in entertainment; it is more to show that women, African Americans and other races are just as worthy and capable of doing it too. People look up to leading characters from childhood on so it is important for them to see different kinds of people in all different positions. Because of this It is imperative that Hollywood and the entertainment industry start to change their perspective on what makes a good leading character. The country is becoming more diverse so the entertainment industry needs to do the same. If not, people will feel like Hollywood is not representing them and seek other entertainment outlets. If Hollywood wants to stay in business it needs to move away from stereotypes and embrace film making that appeals to all groups. So by reducing the white male dominated main characters, you will be inspiring old and new viewers alike to accept different people in leading roles which will ultimately translate over into the real world. \n",
        "source": "user",
        "start_time": 524.0,
        "end_time": 631.0,
        "last_event_time": 631.0,
        "start_progress": 0.8829487900956668,
        "end_progress": 1.0
    }
]