[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack.",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": "but pack your bags and call the number below.",
        "source": "api"
    },
    {
        "text": "It's time to start the real job.",
        "source": "api"
    },
    {
        "text": "\" Signed simply, \"JFK.",
        "source": "api"
    },
    {
        "text": "\" Barack calls the number right away.",
        "source": "api"
    },
    {
        "text": "Barak, this is JFK, you are needed for an urgent mission.",
        "source": "user"
    },
    {
        "text": "Pack your bags and head back to D.",
        "source": "user"
    },
    {
        "text": "C.",
        "source": "user"
    },
    {
        "text": "We will explain when you get here.",
        "source": "user"
    },
    {
        "text": "Barack grabbed his to go bags, kissed Michelle and ran out the door.",
        "source": "user"
    },
    {
        "text": "Barack met on the tarmac by Bill Clinton.",
        "source": "user"
    },
    {
        "text": "Hey buddy, says Clinton, boy do we got a mission for you.",
        "source": "user"
    },
    {
        "text": "You will be going under cover as an ice cream man and keeping tabs on Mark Zuckerburg, now the worlds most dangerous man.",
        "source": "user"
    },
    {
        "text": "He can never resist the ice cream truck so we will start sending you down his route from now on to get intel.",
        "source": "user"
    },
    {
        "text": "The ice cream truck pulls up and Barack jumps in, just then a screen emerges from the dash and its JFK.",
        "source": "user"
    },
    {
        "text": "He looked great considering he had been dead for 60 years.",
        "source": "user"
    },
    {
        "text": "Barack, you must infiltrate the Zuckerburg compound, go 50 floor underground into his top secret Artificial Intelligence laboratory where you will need to blow it up.",
        "source": "user"
    },
    {
        "text": "He cannot be the sole owner of the world first artificially general intelligent machine.",
        "source": "user"
    },
    {
        "text": "He has plans in place to take over the world after this thing goes online in two business days.",
        "source": "user"
    },
    {
        "text": "Barack slowly gets to know Mark by selling him ice cream.",
        "source": "user"
    },
    {
        "text": "Mark took a special liking to Barack and eventually invited him in to show him his toys.",
        "source": "user"
    },
    {
        "text": "Barack was astonished by the technology Mark had at his disposal.",
        "source": "user"
    },
    {
        "text": "Barack's phone then rang, the id said duck and he did as a flash entered the compound knocking out Zuckerburg.",
        "source": "api"
    },
    {
        "text": "It was Bill Clinton and Ronald Reagan, they busted through the windows and we rand to the elevator with Mark's severed finger and used it to go down to the 50 floor.",
        "source": "user"
    },
    {
        "text": "There charges were set and the three men ran to the exit.",
        "source": "user"
    },
    {
        "text": "They just barely made it out before the house imploded into a big hole in the ground.",
        "source": "api"
    },
    {
        "text": "The League of Extraordinary Presidents have saved the world again.",
        "source": "user"
    }
]