[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "How could the United States have been the only one to follow the isolation.",
        "source": "user"
    },
    {
        "text": "Didnt all the other countries agree to it?",
        "source": "user"
    },
    {
        "text": "Why was the plan not followed through with?",
        "source": "user"
    },
    {
        "text": "The answer to that question lies in the fact that the United States was the only nation to have a nuclear bomb.",
        "source": "user"
    },
    {
        "text": "The other nations were afraid that if they went into isolation, the United States would use the bomb on them.",
        "source": "user"
    },
    {
        "text": "The United States, on the other hand, was afraid that if they didnt go into isolation, the other nations would use the bomb on them.",
        "source": "user"
    },
    {
        "text": "The United States, in order to prevent the other nations from using the bomb on them, decided to use the bomb on them first.",
        "source": "user"
    },
    {
        "text": "The first nuclear bomb to have been dropped on a country that was capable of taking out the entire country.",
        "source": "user"
    },
    {
        "text": "So maybe it was out of ill will and being frustrated that the other nations didnt follow along with the agreement, and just like that the first nuclear war began.",
        "source": "user"
    },
    {
        "text": "The nuclear power of the united states was unmatched and much more powerful in comparison to the other nations.",
        "source": "user"
    },
    {
        "text": "The other parts of the world planned on using those fifty years to group together and make nuclear weapons as good as those from the US.",
        "source": "user"
    },
    {
        "text": "They were not able to successfully do so because of issues gathering relevant powerful ingredients.",
        "source": "user"
    },
    {
        "text": "The United States, on the other hand, had no such issues.",
        "source": "user"
    },
    {
        "text": "In fact, the US had a nuclear bomb created long before the isolation even began.",
        "source": "user"
    },
    {
        "text": "This bomb was able to be used to destroy all of russia and one shot.",
        "source": "user"
    },
    {
        "text": "The U.",
        "source": "user"
    },
    {
        "text": "S.",
        "source": "user"
    },
    {
        "text": "could literally wipe whatever country it wanted to out and off the globe.",
        "source": "user"
    },
    {
        "text": "Once that other countries found out about the power of the US, everyone wanted to be their ally now instead.",
        "source": "user"
    },
    {
        "text": "Maybe it was karma.",
        "source": "user"
    }
]