[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\"",
        "source": "api"
    },
    {
        "text": "You're stunned.",
        "source": "user"
    },
    {
        "text": "JFK has been dead for years.",
        "source": "user"
    },
    {
        "text": "His death can even be viewed on YouTube.",
        "source": "user"
    },
    {
        "text": "His head was basically blown off while riding in a car.",
        "source": "user"
    },
    {
        "text": "How could this be?",
        "source": "user"
    },
    {
        "text": "It has to be a joke.",
        "source": "user"
    },
    {
        "text": "You end up calling the number and a disguised voice answers the phone.",
        "source": "user"
    },
    {
        "text": "\"Good morning Mr. President. We would like you to speak to John F. Kennedy. He has something to ask you.\"",
        "source": "user"
    },
    {
        "text": "You sit there in disbelief, still thinking this is a joke.",
        "source": "user"
    },
    {
        "text": "A man who is supposedly JFK picks up the phone and starts speaking to you.",
        "source": "user"
    },
    {
        "text": "You start quizzing him on facts about the real JFK and he nails every one.",
        "source": "user"
    },
    {
        "text": "He explains to you that his death was a set up.",
        "source": "user"
    },
    {
        "text": "He couldn't handle the pressures that came with being President of the United States.",
        "source": "user"
    },
    {
        "text": "He had his death set up so that he could leave the public eye and live his life in a foreign country.",
        "source": "user"
    },
    {
        "text": "He basically entered witness protection.",
        "source": "user"
    },
    {
        "text": "You start to think this is the real JFK and as time goes on he continually tells you things that only the real JFK would know.",
        "source": "user"
    },
    {
        "text": "He tells you that the government has been very good at hiding things from the public and that it's time to change all of that.",
        "source": "user"
    },
    {
        "text": "He tells you that there is a giant book of files about all of the things that have been hidden from the public.",
        "source": "user"
    },
    {
        "text": "He tells you that he wants you to release those files to the public.",
        "source": "user"
    },
    {
        "text": "You can do it anonymously as they are all set up on a server.",
        "source": "user"
    },
    {
        "text": "Nobody knows about this server because JFK has been making it his life's work.",
        "source": "user"
    },
    {
        "text": "When he got elected as President he wanted to work for the people.",
        "source": "user"
    },
    {
        "text": "Instead he was basically acting as a pawn for this secret society of sorts.",
        "source": "user"
    },
    {
        "text": "You think it over and decide that releasing these files would be too big of a risk.",
        "source": "user"
    },
    {
        "text": "You could get in trouble and the public's reaction to it could actually hurt them as well.",
        "source": "user"
    },
    {
        "text": "You politely decline JFKs offer.",
        "source": "user"
    },
    {
        "text": "Unbeknownst to you, just a few weeks later you see a news brief.",
        "source": "user"
    },
    {
        "text": "JFK ended up releasing the files under an alias and there was havoc in the streets.",
        "source": "user"
    },
    {
        "text": "The people no longer trusted the government.",
        "source": "user"
    },
    {
        "text": "This is exactly what you feared.",
        "source": "user"
    },
    {
        "text": "You wondered why JFK would do this.",
        "source": "user"
    },
    {
        "text": "You called the number that he left you and there was no answer.",
        "source": "user"
    },
    {
        "text": "The phone was disconnected.",
        "source": "user"
    },
    {
        "text": "You're left sitting there asking yourself why this happened, and sadly no answer is ever coming.",
        "source": "user"
    }
]