[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "So, Mork didn't really realize that he'd feel so strongly about a human.",
        "source": "user"
    },
    {
        "text": "His ship landed some time ago and when landing, he swore he'd never get so close he'd be hurt.",
        "source": "user"
    },
    {
        "text": "He really wanted to fit in without causing a sort of connection.",
        "source": "user"
    },
    {
        "text": "Being free was a sort of goal of Morks.",
        "source": "user"
    },
    {
        "text": "Mork felt he was a strong shape shifter, measuring his ability to blend as others had, thousands of years in the past here.",
        "source": "user"
    },
    {
        "text": "The shifters had been among Earthlings a long time.",
        "source": "user"
    },
    {
        "text": "Jill was supposed to be just another sort of way to fit in for a brief time.",
        "source": "user"
    },
    {
        "text": "She was sort of usual, not at all unique.",
        "source": "user"
    },
    {
        "text": "Mork didn't know what it was about her.",
        "source": "user"
    },
    {
        "text": "Jill wasn't unique, a little too trusting maybe, but that worked to his advantage.",
        "source": "user"
    },
    {
        "text": "He was able, a year ago, when first being broken off with her, to shift and adapt, his hallmark.",
        "source": "user"
    },
    {
        "text": "He made it a small goal to win her over again, She claimed, last year, that she needed some \"Space\", if only she knew what he knew about space, she'd have skipped this term.",
        "source": "user"
    },
    {
        "text": "She didn't seem to waste time though.",
        "source": "user"
    },
    {
        "text": "Mork decided to pretend to be someone else who also frequented the coffee shop, lows, where she went every morning for a snack and coffee, on the way to work, usually sitting alone, reading the paper.",
        "source": "user"
    },
    {
        "text": "He \"accidentally\" bumped into her there.",
        "source": "user"
    },
    {
        "text": "\"I'm sorry,\" he said, \"I wasn't looking where I was going.\" he claimed, dropping a muffin to prove his ineptness.",
        "source": "user"
    },
    {
        "text": "She seemed interested in the athletic and handsome face he conjured, not surprising, it was based on David Beckham.",
        "source": "user"
    },
    {
        "text": "After a brief chat, he said goodbye, not seeming needy.",
        "source": "user"
    },
    {
        "text": "He was a bit surprised when she asked for his number.",
        "source": "user"
    },
    {
        "text": "He gave it, and the rest of This iteration of Mork was history.",
        "source": "user"
    },
    {
        "text": "Still, there was something a bit off.",
        "source": "user"
    },
    {
        "text": "Mork couldn't figure what it was.",
        "source": "user"
    },
    {
        "text": "Her laugh was different somehow, and she seemed to have trouble meeting his eyes.",
        "source": "user"
    },
    {
        "text": "After Mork kept seeing Jill in his new body, she seemed to chill some.",
        "source": "user"
    },
    {
        "text": "The odd thing was, after a while, the phone Mork used when first meeting Jill got a text from her, she seemed to be apologizing.",
        "source": "user"
    },
    {
        "text": "The next time he saw her as the Beckham iteration, she cooled toward him, telling him she'd met someone else.",
        "source": "user"
    },
    {
        "text": "Well the someone else was him.",
        "source": "user"
    },
    {
        "text": "She ended up going back to be with the earlier iteration of Mork, whom he was happy to shift back into, Little did she know that she'd never really lost him at all.",
        "source": "user"
    },
    {
        "text": "He had been there, under her nose the whole time.",
        "source": "user"
    }
]