[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "He came into the relationship expecting that it will work out , as he should.",
        "source": "api"
    },
    {
        "text": "It started out really good but then thing started to go haywire after the 5th month  She stared to get very moody and was mad at him for no reason when he would ask her simple questions like what are they gonna do this weekend .",
        "source": "user"
    },
    {
        "text": "One day he asked her what she wanted for dinner as she was not going to cook that day and she just went off on him and called him all kinds of names that you would not imagine.",
        "source": "user"
    },
    {
        "text": "He thought he had enough of it but he decided to give her a chance once more as he wanted to be the one.",
        "source": "user"
    },
    {
        "text": "As things went on it was just an up and down roller coaster for him.",
        "source": "user"
    },
    {
        "text": "He tried to put up with it day in and day out but some days were just harder than others.",
        "source": "user"
    },
    {
        "text": "He was tired of being called names and being told that he was not good enough for her.",
        "source": "user"
    },
    {
        "text": "Finally on christmas eve 2019 he decided this was enough , he confronted her as she ruined the season by not letting his mom visit for christmas day as she lived only 45 min away.",
        "source": "api"
    },
    {
        "text": "He told her this is not what he signed up for and that he will go his way unless she gets some kind of mental help.",
        "source": "user"
    },
    {
        "text": "She agreed sort of but was not 100% on board.",
        "source": "user"
    },
    {
        "text": "They argued the entire holiday season but eventually on Jan 5th she decided to go and get the help she so much needed.",
        "source": "user"
    },
    {
        "text": "She was diagnosed with Bipolar disorder and was put on medication, this is what she's been struggling for so long and regret not going to get help sooner is what she confided in a friend.",
        "source": "user"
    },
    {
        "text": "She told the friend that this was the man for her and she did not want to lose him as he helped her and put up with her for so long that she will never be able to repay him for his good deeds.",
        "source": "user"
    },
    {
        "text": "He was the one who was there for her when she needed him the most.",
        "source": "user"
    },
    {
        "text": "She told the friend that she will never let him go as he was the one who helped her get better.",
        "source": "api"
    },
    {
        "text": "The friend was happy to hear this and told her to go and tell him how she felt.",
        "source": "api"
    },
    {
        "text": "They both were very happy after the meds helped her tremendously .",
        "source": "api"
    },
    {
        "text": "The got married and lived a very good life .",
        "source": "user"
    }
]