[
    "When you die, you appear in a cinema with a number of other people who look like you.",
    "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
    "You are allowed to sit in any seat you like.",
    "Which seat do you choose?",
    "I choose a private box seat.",
    "The reason I choose a private box seat is because I want to be able to see everything that is going on.",
    "I want to be able to see the people, the places, and the things that I will be doing in my next life.",
    "I am very excited to see how this goes.",
    "The lights start to dim as the film begins to play.",
    "I am sitting on the edge of my seat.",
    "The film is about a little girl who is about to be born.",
    "She is a very special little girl.",
    "It will take her many years to realize just how special she is.",
    "As the film continues, I start to notice that the little girl is very different from the other children.",
    "She is constantly looking up at the stars.",
    "She is very curious about the world around her.",
    "She questions everything.",
    "She is always asking questions.",
    "Some people don't like that.",
    "They think she is strange or rude.",
    "They tell her to stop asking questions.",
    "She doesn't care what they think.",
    "She just keeps asking questions.",
    "Every time she asks a question in the film that annoys someone, an audience member lets out a laugh.",
    "I laugh along with them.",
    "I can't help it.",
    "I am so happy that I am not like the other kids.",
    "The lights come on.",
    "It's time for intermission.",
    "I walk out of the theater and go to the concession stand.",
    "Everyone is being served popcorn.",
    "I ask for some popcorn as well.",
    "Another audience member asks me how I'm enjoying the film so far.",
    "\"It's a great story so far!",
    "I can't wait to see how it ends.\" \n\nThe lights dim again and the film resumes.",
    "The little girl is now a teenager.",
    "Then she is a young adult.",
    "By the time I'd finished half of my popcorn, she was an elderly woman in her 70s.",
    "She is still curious and still asking questions.",
    "One day, she thinks of the most brilliant question.",
    "She asks, \"What is the meaning of life?\" She writes down the question in her book.",
    "The lights come on again.",
    "The film has ended.",
    "\"That's it?\" I ask out loud.",
    "\"That's the end?\" Someone behind her responds.",
    "\"What would you rather?",
    "Live with the answer, or live with the question?",
    "You can't have both.\"\n"
]