[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "The United States is now the only superpower in the world, and the only country that has access to nuclear weapons.",
        "source": "api"
    },
    {
        "text": "It's also the only country that has the ability to travel to space.",
        "source": "api"
    },
    {
        "text": "The world is now a powder keg, and the U.",
        "source": "api"
    },
    {
        "text": "S.",
        "source": "api"
    },
    {
        "text": "is the only one with a match.",
        "source": "api"
    },
    {
        "text": "The United States has three choices.",
        "source": "api"
    },
    {
        "text": "It can stay in exile, it can try to re-establish contact with the other nations, or it can try to conquer the world.",
        "source": "api"
    },
    {
        "text": "The United States chooses to conquer the world.",
        "source": "api"
    },
    {
        "text": "The United States has a small army, but it has the most advanced weapons in the world.",
        "source": "api"
    },
    {
        "text": "Whats the point in having a large army when you can win the war without using it.",
        "source": "api"
    },
    {
        "text": "The United States has a plan.",
        "source": "user"
    },
    {
        "text": "The plan is to send a team of soldiers to every country in the world, and to take over the country without firing a shot.",
        "source": "api"
    },
    {
        "text": "Imagine having the world at your fingertips and the decision on what to do with it.",
        "source": "api"
    },
    {
        "text": "You can choose to rule the world with an iron fist, or you can choose to be a benevolent ruler.",
        "source": "user"
    },
    {
        "text": "The world is your oyster.",
        "source": "api"
    },
    {
        "text": "Other nations cowarded in fear when they heard about the US and their arsenal.",
        "source": "api"
    },
    {
        "text": "Countries begged and surrendered before the US even had initiated contact with them.",
        "source": "user"
    },
    {
        "text": "The US was the world superpower that quickly.",
        "source": "user"
    },
    {
        "text": "The US realized that maybe they wouldnt have to technically defeat nations to rule.",
        "source": "user"
    },
    {
        "text": "They may have already won just with the threat and the power they possessed to begin with.",
        "source": "user"
    },
    {
        "text": "The country shot to the top in technology, environment, and virtually every category.",
        "source": "user"
    },
    {
        "text": "The US was the golden place to live.",
        "source": "user"
    },
    {
        "text": "Who would have though nuclear weapons were the key to all of humanity, that and being able to space travel.",
        "source": "user"
    },
    {
        "text": "Not only that, but the US was able to bring resources back from other planets that different countries have never even heard of before.",
        "source": "user"
    },
    {
        "text": "The US had the ability to terraform planets and make them habitable for humans.",
        "source": "user"
    },
    {
        "text": "The entire universe was different.",
        "source": "api"
    },
    {
        "text": "Isolation is what caused this supercharged US.",
        "source": "user"
    },
    {
        "text": "Is the pandemic going to be what inspires greatness just like what i am writing about now?",
        "source": "user"
    },
    {
        "text": "I dont know, but i wouldnt count out the possibility.",
        "source": "user"
    }
]