[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "It can be somewhat unnerving to realize that this is how the end of your life will turn out.",
        "source": "user"
    },
    {
        "text": "Yet to be honest, this experience can also be a refreshing one.",
        "source": "user"
    },
    {
        "text": "In the movie, the characters are able to influence the events on the screen.",
        "source": "api"
    },
    {
        "text": "They can change the plot of their life, and even alter their own fate.",
        "source": "api"
    },
    {
        "text": "This means that in the movie, you might be able to resolve the issues that you had with the girl you got into a huge argument with and had a falling out with, or that guy you broke up with on bad terms, or that parent you had a bad relationship with that couldn't be fixed.",
        "source": "user"
    },
    {
        "text": "When you die, you will have the opportunity to resolve all of these issues.",
        "source": "user"
    },
    {
        "text": "You will be able to make amends with all of the people you have wronged, and you will be able to apologize to all of the people.",
        "source": "user"
    },
    {
        "text": "And in doing so, you will be able to forge a new path for yourself.",
        "source": "user"
    },
    {
        "text": "You will be able to come clean of your sins and you will be able to walk with much more confidence and pep as a result.",
        "source": "user"
    },
    {
        "text": "If you have a lot of unresolved issues in your life, it is a good idea to start resolving them now.",
        "source": "user"
    },
    {
        "text": "Of course the movie that will play at your life's end might be able to give you some sense of closure but it cannot necessarily be your fallback crutch.",
        "source": "user"
    },
    {
        "text": "After all, the people you have hurt or wronged in your current life deserve an apology from you now, while you are still living in the moment.",
        "source": "user"
    },
    {
        "text": "It is important to note that the movie that plays at your life's end is not necessarily a reflection of the life you have led.",
        "source": "user"
    },
    {
        "text": "Sometimes the movie's portrayal of you will not be accurate and this is to be expected.",
        "source": "user"
    },
    {
        "text": "After all, the movie is a reflection of your life as seen through the eyes of the people who were in your life.",
        "source": "user"
    },
    {
        "text": "This means that the movie could in some ways be a bit distorted.",
        "source": "user"
    },
    {
        "text": "You might feel betrayed in the way that some people view you and your life story, if others' perceptions don't align with your own.",
        "source": "user"
    },
    {
        "text": "However, even if the movie is not an accurate portrayal of your life, it is still a good idea to watch it.",
        "source": "user"
    },
    {
        "text": "This is because this exercise can be a hugely transformative experience.",
        "source": "user"
    },
    {
        "text": "It is also a humbling one, as it's so rare to get an objective third party view of yourself.",
        "source": "user"
    },
    {
        "text": "The movie that plays at your life's end is also a good opportunity to reflect on your life.",
        "source": "user"
    },
    {
        "text": "But the important thing to walk away with from this contemplation and reflection is that no one is perfect.",
        "source": "user"
    },
    {
        "text": "No one who watches the movie of their life will ever feel that the events in their life unfolded absolutely perfectly.",
        "source": "user"
    },
    {
        "text": "So if you are feeling a bit down about yourself and your life, it is important to remember that you are not alone.",
        "source": "user"
    },
    {
        "text": "Don't feel that you have let yourself down or let others down.",
        "source": "user"
    },
    {
        "text": "Also remember that any mistakes or flaws in the movie will be magnified.",
        "source": "user"
    },
    {
        "text": "So don't beat yourself up about it.",
        "source": "user"
    },
    {
        "text": "In conclusion, take this opportunity to view the movie of your life as one that is valuable to understand yourself and to understand the world around you.",
        "source": "user"
    },
    {
        "text": "This movie is a gift that you will be given when you die.",
        "source": "user"
    },
    {
        "text": "Make sure to use the time that you are given with this gift in a way that is meaningful.",
        "source": "user"
    },
    {
        "text": "This means that you should live your life in the present and make amends with people you hurt as soon as you can, before you reach the end of your life.",
        "source": "user"
    }
]