[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
        "source": "api"
    },
    {
        "text": "One day, she finds out the truth.",
        "source": "api"
    },
    {
        "text": "It was quite disconcerting.",
        "source": "user"
    },
    {
        "text": "She was sitting on her living room sofa with her boyfriend, Ted watching a movie and eating popcorn.",
        "source": "user"
    },
    {
        "text": "Ted was holding the bowl.",
        "source": "user"
    },
    {
        "text": "She turned to say something to him, and instead of the blonde haired, blue eyed, light complected man of average height she was dating, there sat a tall, dark haired man with a closely cropped beard.",
        "source": "user"
    },
    {
        "text": "He was wearing the same clothes as Ted.",
        "source": "user"
    },
    {
        "text": "He was holding the popcorn bowl like Ted, but he didn't look anything like Ted.",
        "source": "user"
    },
    {
        "text": "She hopped up off the sofa.",
        "source": "user"
    },
    {
        "text": "This couldn't be Ted, but at the same time it couldn't NOT be Ted.",
        "source": "user"
    },
    {
        "text": "She had been sitting next to this man the whole time.",
        "source": "user"
    },
    {
        "text": "\"Sue,\" he said in a voice quite different than Ted's, \"what's wrong?\"",
        "source": "user"
    },
    {
        "text": "She pointed at him with a trembling finger.",
        "source": "user"
    },
    {
        "text": "He looked down and realization dawned across his handsome face.",
        "source": "user"
    },
    {
        "text": "\"Sue,\" he said.",
        "source": "user"
    },
    {
        "text": "\"Don't be afraid.  It's me.  I know I look different than I did a moment ago, but I'm still the same person that you've been dating for the past two months and the same person who sat down on the sofa an hour ago.  I admit, I look different, but it's still me.\"",
        "source": "user"
    },
    {
        "text": "She looked at him, then at the popcorn bowl, then back at him.",
        "source": "api"
    },
    {
        "text": "\"I don't understand,\" she said.",
        "source": "api"
    },
    {
        "text": "He took a deep breath and motioned for her to sit back down.",
        "source": "user"
    },
    {
        "text": "\"I'll tell you,\" he said.",
        "source": "user"
    },
    {
        "text": "He went on to explain that he was born a shapeshifter, like his father had been.",
        "source": "user"
    },
    {
        "text": "As a child, it was hard for his parents to keep track of him.",
        "source": "user"
    },
    {
        "text": "He couldn't go to school, because when he was little, he didn't fully understand that not everyone had the same ability as he did.",
        "source": "user"
    },
    {
        "text": "Once he was old enough to understand, he didn't always have control over when he shifted.",
        "source": "user"
    },
    {
        "text": "By the time he was a teenager, he had good control but on rare occasions, it would happen unexpectedly, like it had tonight.",
        "source": "user"
    },
    {
        "text": "Sue seemed shocked but given what she had just seen, she knew that Ted was telling the truth.",
        "source": "user"
    },
    {
        "text": "She'd seen it with her own eyes.",
        "source": "user"
    },
    {
        "text": "Seeing that she was accepting what he had told her, Ted went on.",
        "source": "user"
    },
    {
        "text": "\"First, my real name is Kyle Wilkerson.  The reason I didn't tell you my real name is because I have loved you for many years and dated you four times before and it didn't work out.  I was Liam, Joe, Henry and Bob before we met while I was calling myself Ted.  I'm really sorry, but I wanted to be with you so badly that I kept trying.\"",
        "source": "user"
    },
    {
        "text": "Sue was stunned.",
        "source": "user"
    },
    {
        "text": "She had dated this man four times before?",
        "source": "api"
    },
    {
        "text": "She thought back and realized that each of those men after Liam had seemed to know her better than the one before.",
        "source": "user"
    },
    {
        "text": "Now she realized it was because each one DID know her better, as they had spent time together.",
        "source": "user"
    },
    {
        "text": "Ted looked anxious as Sue sat in thought.",
        "source": "user"
    },
    {
        "text": "Finally she told him that she was touched that he wanted to be with her so badly that he kept trying over and over again, but that for now she needed him to leave so she could think things through.",
        "source": "user"
    },
    {
        "text": "Ted, or actually Kyle, stood up.",
        "source": "user"
    },
    {
        "text": "\"Also,\" she said, \"what is your true form?\"",
        "source": "user"
    },
    {
        "text": "He explained that he didn't know, because he had changed so often that he didn't really know what he looked like.",
        "source": "user"
    },
    {
        "text": "\"What form do you feel most comfortable in?\"",
        "source": "user"
    },
    {
        "text": "Before her eyes, he shrunk a couple of inches.",
        "source": "user"
    },
    {
        "text": "His hair stayed dark brown, but some light highlights appeared as it grew near shoulder length.",
        "source": "user"
    },
    {
        "text": "His nose got a little longer, his eyes changed to an emerald green.",
        "source": "user"
    },
    {
        "text": "He was stunning to look at.",
        "source": "user"
    },
    {
        "text": "\"I am going to think about what I should do,\" Sue said.",
        "source": "user"
    },
    {
        "text": "\"But if I see you again, I want you to be in this shape, because this shape is what you are most comfortable in.\"",
        "source": "user"
    },
    {
        "text": "Kyle smiled at her as he walked out the door.",
        "source": "user"
    },
    {
        "text": "She closed it behind him and leaned against it.",
        "source": "user"
    },
    {
        "text": "She had a lot to think about.",
        "source": "api"
    },
    {
        "text": "She went to bed that night and slept fitfully.",
        "source": "api"
    },
    {
        "text": "She thought it was unlikely she'd ever find a man that wanted to be with her so badly.",
        "source": "user"
    },
    {
        "text": "A few days later she called him and they met for coffee.",
        "source": "user"
    },
    {
        "text": "He looked like the person he'd last shifted into, and she told him that she was willing to start over and see where it went.",
        "source": "user"
    },
    {
        "text": "They eventually married and had three children.",
        "source": "user"
    },
    {
        "text": "Sue now understood what Kyle's mother went through, as one of the three was a shapeshifter, too.",
        "source": "user"
    },
    {
        "text": "She had realized that might be the case so she was prepared, but little Ted was definitely more of a handful than his two non-shapeshifting siblings.",
        "source": "user"
    },
    {
        "text": "But she loved him as much as the others and never regretted marrying Kyle and having his children.",
        "source": "user"
    }
]