[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.\" He wondered where he got it.",
        "source": "api"
    },
    {
        "text": "Maybe there is some actual good uranium left that he could sell and get rich.",
        "source": "user"
    },
    {
        "text": "Then he wouldn't have to pull these long shifts blowing down the houses of little pigs.",
        "source": "user"
    },
    {
        "text": "\"Where did you find this uranium to build your house?\" the wolf asked.",
        "source": "user"
    },
    {
        "text": "\"In my house,\" replied the little pig.",
        "source": "user"
    },
    {
        "text": "That baffled the wolf.",
        "source": "user"
    },
    {
        "text": "Was this a magic house of some kind?",
        "source": "user"
    },
    {
        "text": "\"Can I come in and look at it?\" the wolf asked.",
        "source": "api"
    },
    {
        "text": "The pig was hesitant, then agreed on one condition.",
        "source": "user"
    },
    {
        "text": "\"You'll leave me alone if I do this. Deal?' asked the pig. The wolf agreed and was allowed to enter.\n\nThere was nothing special inside the house. The wolf was confused. He looked around and it was no different inside than any other house he had blown down. \n\n\"I'm sorry, but I don't see anything special about this house.\"",
        "source": "user"
    },
    {
        "text": "\" said the wolf.",
        "source": "user"
    },
    {
        "text": "The pig then pointed to a door and said the source is in there.",
        "source": "user"
    },
    {
        "text": "The greedy wolf quickly walked inside.",
        "source": "user"
    },
    {
        "text": "As soon as he did, the pig slammed the door shut and trapped him inside.",
        "source": "user"
    },
    {
        "text": "The wolf angrily howled and tried to get out, but the uranium door wouldn't budge.",
        "source": "user"
    },
    {
        "text": "He tried huffing and puffing it down but it was no use.",
        "source": "user"
    },
    {
        "text": "The wolf was trapped!",
        "source": "api"
    },
    {
        "text": "The pig got on the phone and called a wolf rental service.",
        "source": "user"
    },
    {
        "text": "He said he'd need an extra big one because his house was made of uranium.",
        "source": "user"
    },
    {
        "text": "He then began packing his bags.",
        "source": "user"
    },
    {
        "text": "\"What are you doing?!\" screamed the wolf.",
        "source": "user"
    },
    {
        "text": "The pig informed him that he actually had just sold the land and needed to have the house torn down before the deal would be finalized.",
        "source": "user"
    },
    {
        "text": "\"Wrong place at the wrong time I guess.\" the pig said to the wolf.",
        "source": "user"
    },
    {
        "text": "The pig took his things and left.",
        "source": "user"
    },
    {
        "text": "He went outside and watched as the giant rented wolf came and blew down the house.",
        "source": "user"
    }
]