[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "It resulted in us being entirely behind from a technological standpoint.",
        "source": "api"
    },
    {
        "text": "Other countries are far more advanced and now we are a third world country.",
        "source": "user"
    },
    {
        "text": "Everything is now outdated, including our military.",
        "source": "user"
    },
    {
        "text": "Other countries now have self driving cars everywhere and have switched to more environmentally friendly energy.",
        "source": "user"
    },
    {
        "text": "We are now seen as the country that mainly contributes to pollution and global warming.",
        "source": "user"
    },
    {
        "text": "We also have outdated medical care.",
        "source": "user"
    },
    {
        "text": "Other countries no longer have diseases or even things like the flu.",
        "source": "user"
    },
    {
        "text": "They don't want us to visit them so a ban is in place.",
        "source": "user"
    },
    {
        "text": "They are scared of us.",
        "source": "user"
    },
    {
        "text": "We are now trying to catch up to the rest of the world.",
        "source": "user"
    },
    {
        "text": "We're told that in order to trade or be allowed to travel worldwide that we'll have to become more advanced.",
        "source": "api"
    },
    {
        "text": "The problem with that is that we're so far behind that we'll never catch up.",
        "source": "user"
    },
    {
        "text": "The government has decided to make a deal with the devil.",
        "source": "user"
    },
    {
        "text": "That's the only option to even have a chance in this new world.",
        "source": "api"
    },
    {
        "text": "The devil will make our country as advanced as the rest of the world but it requires the souls of everyone in the United States.",
        "source": "user"
    },
    {
        "text": "The government has decided that it's a good idea.",
        "source": "user"
    },
    {
        "text": "As can be imagined, the citizens are very divided.",
        "source": "api"
    },
    {
        "text": "Some are happy as they just care about the economic impact.",
        "source": "user"
    },
    {
        "text": "Others are outraged.",
        "source": "user"
    },
    {
        "text": "It creates a great divide in our country and a civil war breaks out as we as a country are literally fighting for our very souls.",
        "source": "user"
    },
    {
        "text": "Is it even possible for the deal to be broken?",
        "source": "user"
    },
    {
        "text": "No one knows but this war is about that very thing.",
        "source": "user"
    },
    {
        "text": "It was all for nothing.",
        "source": "user"
    },
    {
        "text": "Other countries end up still banning us as a country because of our civil war.",
        "source": "user"
    },
    {
        "text": "Now we don't even have our souls.",
        "source": "user"
    },
    {
        "text": "The war rages on as people continue to fight, terrified of what will happen upon their death.",
        "source": "user"
    },
    {
        "text": "The only person who won was the devil.",
        "source": "user"
    }
]