[
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.16931918656056588
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, it is the schools responsibility to provide tampons and pads to female students that are in need and/or families that can't afford them. Taxes are being paid and if a school can provide toilet paper, they can provide tampons and pads. \n\nI obviously don't know the costs of these items when you're buying large amounts of them. Tampons, pads, toilet paper, paper towels, etc. I do know that schools make a ridiculous amount of money from our taxes. I do know that schools should be a safe space for children.\n\nI know that it can be extremely embarrassing for children to talk about personal hygiene. I can only imagine what a female student would be feeling in vulnerable times. I am a man so luckily I have never had to deal with any issues like that pertaining to personal hygiene.\n\nI understand that toilet paper and paper towels might be a bit different, but that is only because they're unisex. What is the difference between cleaning our butts and our private areas for example? \n\nI have no experience with anything period related because again, I am a man. However, I don't think it's hard to figure out that it can be very embarrassing for females, especially younger females who are experiencing these things for the first time. \n\nI would hope that most schools would at least have meetings about this topic. I'm not exactly sure if this is a women's rights issue but I do believe women should be making the decision pertaining this topic. After all, this is an issue that really only involves women so us men shouldn't really have an opinion on it. We don't know what women go through as we physically can't experience it. \n\nI hope at the very least this topic becomes more of a hot bed issue in schools. We want to make students as comfortable as humanly possible. And the best way that can be done is to simply listen to the students and act in their best interest.\n\n\n",
        "source": "user",
        "start_time": 23.0,
        "end_time": 557.0,
        "last_event_time": 557.0,
        "start_progress": 0.16931918656056588,
        "end_progress": 1.0
    }
]