[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "As the story begins, a young man named Watashi is living a boring life in the provincial town of Kunimi.",
        "source": "api"
    },
    {
        "text": "Watashi is bored by his everyday existance and feels as though he is not challenged.",
        "source": "api"
    },
    {
        "text": "He desperately wants more out of life.",
        "source": "user"
    },
    {
        "text": "One day, a mysterious girl named Himari appears in his monotonous life and offers him an opportunity to change.",
        "source": "user"
    },
    {
        "text": "Watashi is intrigued by the offerings of Himari and he wants to learn more about how she can enhance his life and fulfill his desires.",
        "source": "api"
    },
    {
        "text": "Watashi asks Himari how she can change his life.",
        "source": "user"
    },
    {
        "text": "Himari tells Watashi that she has the power to give him anything he desires.",
        "source": "user"
    },
    {
        "text": "Watashi is fascinated and wants to believe her but her is doubtful.",
        "source": "api"
    },
    {
        "text": "Himari teases Watashi and tells him if he will believe her, she will give a demonstration of her magical powers.",
        "source": "user"
    },
    {
        "text": "Watashi is curious and accepts Himari's offer and decides to believe in her.",
        "source": "api"
    },
    {
        "text": "Himari tells Watashi that she will give him the ability to be able to use magic.",
        "source": "user"
    },
    {
        "text": "Watashi thinks that this is a wonderful thing and he is excited to gain the powers to perform magic and grant himself his greatest desires as a result.",
        "source": "api"
    },
    {
        "text": "Himari warns him that he must not tell anyone about their agreement.",
        "source": "user"
    },
    {
        "text": "Watashi agrees to this and asks to have magical powers bestowed upon him.",
        "source": "api"
    },
    {
        "text": "Himari tells him that if he must have magic in his life, then he must make a deal with her.",
        "source": "user"
    },
    {
        "text": "Watashi has now become skeptical and worried that the price may be too high, But he is desperate for magic in his life and agrees to the deal.",
        "source": "api"
    },
    {
        "text": "Himari gives Watashi a book and tells him that he must pledge his spirit to her if he wants the power of magic.",
        "source": "api"
    },
    {
        "text": "Watashi thinks about this for a brief moment and then agrees to the deal.",
        "source": "api"
    },
    {
        "text": "Himari embraces Watashi and disappears.",
        "source": "user"
    },
    {
        "text": "Watashi is elated about his new powers and begins to practice how he can use the magic.",
        "source": "api"
    },
    {
        "text": "Watashi decides to give himself one million dollars and a huge home on a mountain top.",
        "source": "api"
    },
    {
        "text": "Watashi chants the spell and a large sum of money materializes on the kitchen table.",
        "source": "user"
    },
    {
        "text": "He then realizes that he is actually now in a mansion on a mountain top in a place he does not recognize.",
        "source": "api"
    },
    {
        "text": "Watashi is then shocked and confused on how he can be in such a place.",
        "source": "user"
    },
    {
        "text": "He is scared because he does not know where he is and he wants to return back to familiar surroundings.",
        "source": "api"
    },
    {
        "text": "Himari appears in his home and tells him that he will never return to the world of the living.",
        "source": "user"
    },
    {
        "text": "Himari explains that the deal that they made is for eternity.",
        "source": "api"
    },
    {
        "text": "He is now trapped in the world of magic and it cannot be undone.",
        "source": "user"
    },
    {
        "text": "He now has the ability of magic and because of his greediness for power, he will never be able to return back to his world.",
        "source": "api"
    }
]