[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
        "source": "api"
    },
    {
        "text": "One day, she meets a guy who seems different from the rest, and she can’t help but be drawn to him.",
        "source": "api"
    },
    {
        "text": "She thinks, \"What the heck. Let's give this a try.\" She agrees to go on a date with the man, and finds out his name is Poc.",
        "source": "user"
    },
    {
        "text": "She thinks that is a really unusual name, but for some reason, that only makes the woman more intrigued by this man.",
        "source": "user"
    },
    {
        "text": "They go out on a date, and the woman is surprised to find that Poc is nothing like the other guys she's dated.",
        "source": "api"
    },
    {
        "text": "He's kind and attentive.",
        "source": "user"
    },
    {
        "text": "On top of being gorgeous, he is also funny and well educated.",
        "source": "user"
    },
    {
        "text": "Sara, the woman, thinks she has certainly found the man of her dreams.",
        "source": "user"
    },
    {
        "text": "She doesn't know, of course, that Poc (Person Often Changing) is really a shapeshifter.",
        "source": "user"
    },
    {
        "text": "Poc is having the time of his life on this date, and sees that Sara is really starting to fall in love with him.",
        "source": "user"
    },
    {
        "text": "He knows that he has to tell her the truth about himself, but he doesn't want to lose her.",
        "source": "api"
    },
    {
        "text": "Poc and Sara go on many dates over the next several months.",
        "source": "user"
    },
    {
        "text": "Each time they grow closer together.",
        "source": "user"
    },
    {
        "text": "Poc knows that he must be truthful with Sara.",
        "source": "user"
    },
    {
        "text": "He tells her that he is a shapeshifter, and that he has been with many women in the past.",
        "source": "api"
    },
    {
        "text": "Sara is shocked, but she is not completely freaked out by this.",
        "source": "user"
    },
    {
        "text": "She wasn't expecting to hear this from the man of her dreams.",
        "source": "user"
    },
    {
        "text": "Poc is so sad and afraid.",
        "source": "user"
    },
    {
        "text": "He tells Sara that he has lived many centuries searching for the right woman.",
        "source": "user"
    },
    {
        "text": "Like a vampire that is immortal.",
        "source": "user"
    },
    {
        "text": "He can only move on and grow old when he finds the woman of his dreams.",
        "source": "user"
    },
    {
        "text": "And she truly loves him in return.",
        "source": "user"
    },
    {
        "text": "Poc tells Sara everything.",
        "source": "user"
    },
    {
        "text": "That he has been infatuated with her for years.",
        "source": "user"
    },
    {
        "text": "That all of the 'losers' she dated in the past, were really him.",
        "source": "user"
    },
    {
        "text": "Sara is stunned into silence.",
        "source": "user"
    },
    {
        "text": "She begins to cry and turns away.",
        "source": "user"
    },
    {
        "text": "Poc is heartbroken.",
        "source": "user"
    },
    {
        "text": "He sits in silence and in pain.",
        "source": "user"
    },
    {
        "text": "He feels like his heart is being torn out of his chest.",
        "source": "user"
    },
    {
        "text": "Sara turns to him.",
        "source": "user"
    },
    {
        "text": "There is forgiveness in her eyes.",
        "source": "user"
    },
    {
        "text": "She tells him that she understands.",
        "source": "user"
    },
    {
        "text": "She know that it took great courage for Poc to tell her all of this, and that is the one thing that has been missing in all her relationships.",
        "source": "user"
    },
    {
        "text": "Someone truthful and courageous.",
        "source": "user"
    },
    {
        "text": "Poc is so relieved he wants to jump for joy.",
        "source": "user"
    },
    {
        "text": "Hiding his real self all this time has been what has kept Sara from really loving him.",
        "source": "user"
    },
    {
        "text": "Poc and Sara fall in love and get married.",
        "source": "api"
    },
    {
        "text": "They buy the house they have both dreamed of.",
        "source": "user"
    },
    {
        "text": "They have a wonderful life together.",
        "source": "user"
    },
    {
        "text": "Poc finally begins to age, and is so relieved that he gets to grow old with the woman he dreamt of his whole life.",
        "source": "user"
    },
    {
        "text": "It is truly a fairy tale ending.",
        "source": "user"
    }
]