[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "You find out that you are all competing to see which of you will get to live the new life.",
        "source": "user"
    },
    {
        "text": "The winner gets to live as a human, while the rest will be reincarnated as animals.",
        "source": "user"
    },
    {
        "text": "This instantly motivates everyone.",
        "source": "user"
    },
    {
        "text": "They begin going through different rounds of games as different people are eliminated.",
        "source": "user"
    },
    {
        "text": "I make it pretty far, past a trivia round and a physical endurance challenge.",
        "source": "user"
    },
    {
        "text": "I’m not sure how I did it, but I’m one of the last people left.",
        "source": "user"
    },
    {
        "text": "As further motivation to win, a screen starts showing the animals some of us will be reincarnated as.",
        "source": "user"
    },
    {
        "text": "They include things like roaches, spiders and slugs.",
        "source": "user"
    },
    {
        "text": "This begins to make people panic and form alliances, hoping any advantage will help them.",
        "source": "user"
    },
    {
        "text": "The final round is a game of Russian roulette.",
        "source": "user"
    },
    {
        "text": "Aren't we already dead?",
        "source": "user"
    },
    {
        "text": "Is there a level of being more dead than this?",
        "source": "user"
    },
    {
        "text": "I sit across from another me, the one person standing in my way.",
        "source": "user"
    },
    {
        "text": "I either beat them or possibly come back as a slug.",
        "source": "user"
    },
    {
        "text": "I have to win.",
        "source": "user"
    },
    {
        "text": "We take turns spinning the revolver, placing it to our head and pulling the chamber.",
        "source": "user"
    },
    {
        "text": "We go through multiple rounds of this.",
        "source": "user"
    },
    {
        "text": "Finally, the other me shoots themselves.",
        "source": "user"
    },
    {
        "text": "I win!",
        "source": "user"
    },
    {
        "text": "I’m going to live as a human!",
        "source": "user"
    },
    {
        "text": "The other versions of me all look furious.",
        "source": "user"
    },
    {
        "text": "They watch as I appear on the screen, being reincarnated.",
        "source": "user"
    },
    {
        "text": "But the rest of them do not turn into animals after all.",
        "source": "user"
    },
    {
        "text": "It turns out that the winner is kind of the loser in this situation.",
        "source": "user"
    },
    {
        "text": "They all get controllers and get to take turns controlling me.",
        "source": "user"
    },
    {
        "text": "They control my actions, my dialogue and even my emotions.",
        "source": "user"
    },
    {
        "text": "They make me do things I would never do.",
        "source": "user"
    },
    {
        "text": "The only thing they can't control is my memory.",
        "source": "user"
    },
    {
        "text": "I remember all of it and I hate it.",
        "source": "user"
    },
    {
        "text": "Maybe I should have just been a slug.",
        "source": "user"
    }
]