[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "The next life plays out like a movie and it is a life of wealth and excitement.",
        "source": "api"
    },
    {
        "text": "The only thing is that none of you watching get to live this next life.",
        "source": "user"
    },
    {
        "text": "You are all very disappointed, and you all begin to wonder why you were shown this life.",
        "source": "user"
    },
    {
        "text": "Then you are told that you were shown this life so that you would be happy with your next life.",
        "source": "api"
    },
    {
        "text": "You had to remember that the beautiful life you just watched was the result of all of the work you had all done to create it.",
        "source": "api"
    },
    {
        "text": "You are then told that you will all be reincarnated again, and you are all excited to see what your next life will be like.",
        "source": "user"
    },
    {
        "text": "You could be young or old.",
        "source": "api"
    },
    {
        "text": "You could even be human or animal.",
        "source": "user"
    },
    {
        "text": "You could be rich or poor.",
        "source": "user"
    },
    {
        "text": "You are all then shown a vision of your next life.",
        "source": "api"
    },
    {
        "text": "In this life you get to be a dog.",
        "source": "api"
    },
    {
        "text": "You are a dog who is very happy and has a nice family.",
        "source": "user"
    },
    {
        "text": "You are very happy with your life, but you are not sure why you are a dog.",
        "source": "api"
    },
    {
        "text": "You are then told are a dog because you will belong to a child who needs a true friend and you will be the one that is there for him.",
        "source": "api"
    },
    {
        "text": "This makes your heart so happy you cannot wait to meet the child!",
        "source": "user"
    },
    {
        "text": "You get sleepy so you nod off to sleep there in the cinema.",
        "source": "user"
    },
    {
        "text": "When you awake you are in a bed snuggled up to the cutest young human.",
        "source": "user"
    },
    {
        "text": "You are so happy that you are a dog, and you are so happy that you are the dog that belongs to the boy.",
        "source": "user"
    },
    {
        "text": "It occurs to you that this could be the life in which you finally know true love.",
        "source": "api"
    },
    {
        "text": "You feel the most content and hopeful you ever have so you snuggle up to the boy and get a nice nap.",
        "source": "user"
    },
    {
        "text": "Soon you will both awaken and spend the first of many fun days together.",
        "source": "user"
    },
    {
        "text": "The love between a boy and his dog, and vice versa, is like no other.",
        "source": "user"
    }
]