[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "They had survived, but there weren't many of them.",
        "source": "api"
    },
    {
        "text": "And the environment, terrain, the whole world had been nearly destroyed before the aliens got what they wanted and left.",
        "source": "user"
    },
    {
        "text": "The survivors had to learn to live with the new world they found themselves in.",
        "source": "user"
    },
    {
        "text": "Unfortunately most of their higher level scientists had perished.",
        "source": "api"
    },
    {
        "text": "And even the tech, and other skilled workers that remained were too few, and the infrastructure they were used to working in was destroyed.",
        "source": "user"
    },
    {
        "text": "They had to rebuild from scratch.",
        "source": "user"
    },
    {
        "text": "And it did not go well at first.",
        "source": "api"
    },
    {
        "text": "There began to be the general feeling that humanity would decline and go back to the Medieval ages at best.",
        "source": "user"
    },
    {
        "text": "But then, a few people began to notice something.",
        "source": "user"
    },
    {
        "text": "The old symbols of magic that had long been kept as ancient curiosities and good luck charms began to work again.",
        "source": "api"
    },
    {
        "text": "Fire was easier to start for those carrying fire charms.",
        "source": "api"
    },
    {
        "text": "People with health charms didn't get sick.",
        "source": "user"
    },
    {
        "text": "And so on.",
        "source": "user"
    },
    {
        "text": "It was a slow process, but the survivors began to realize that they were no longer completely helpless.",
        "source": "user"
    },
    {
        "text": "They began experimenting, and new job types were created.",
        "source": "api"
    },
    {
        "text": "The scientists that were left studied the phenomena, and concluded that they couldn't figure out where the power was coming from, but they were pretty sure everyone had access to it to a greater or lesser degree.",
        "source": "user"
    },
    {
        "text": "And so, the survivors began to rebuild.",
        "source": "user"
    },
    {
        "text": "Maybe it was the use of magic, or maybe the thought that they were going back to the Medieval ages was in the back of everyone's mind.",
        "source": "api"
    },
    {
        "text": "But the survivors began to rebuild in a very different way.",
        "source": "user"
    },
    {
        "text": "To anyone who had lived before the alien invasion it would have looked like a glamorized, cleaned up fantasy world.",
        "source": "api"
    },
    {
        "text": "Style - clothing, hair, building, decor and more - changed as did the economic system and even the government.",
        "source": "user"
    },
    {
        "text": "The survivors began to call themselves \"The Folk\".",
        "source": "user"
    },
    {
        "text": "And centuries later, when another, younger species of alien visited the planet, they were amazed.",
        "source": "api"
    },
    {
        "text": "They found a world that was a mix of fantasy and science fiction.",
        "source": "user"
    },
    {
        "text": "Power on all levels.",
        "source": "api"
    },
    {
        "text": "They reported back to their government that they had found a planet of gods and fairies, and wonderful and terrible power.",
        "source": "api"
    },
    {
        "text": "Soon after that the humans decided to hide their planet, still fearful of the universe even centuries later, even with all of their power.",
        "source": "user"
    },
    {
        "text": "The world of the Folk is a world of magic, and the Folk are a magical people.",
        "source": "user"
    },
    {
        "text": "So went the legends of the universe from then on.",
        "source": "api"
    },
    {
        "text": "And they faded into myth, which outlasted even The Folk themselves.",
        "source": "user"
    }
]