[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "One way or another the aliens had to be defeated.",
        "source": "user"
    },
    {
        "text": "Anything could be risked because if the aliens were not defeated there would be total destruction.",
        "source": "user"
    },
    {
        "text": "The aliens were not a threat to be negotiated with.",
        "source": "api"
    },
    {
        "text": "They had to be destroyed.",
        "source": "user"
    },
    {
        "text": "With fewer humans left following the invasions of the aliens to date the only way was to come together.",
        "source": "user"
    },
    {
        "text": "The humans had to be united.",
        "source": "user"
    },
    {
        "text": "They had to pool all of their resources.",
        "source": "user"
    },
    {
        "text": "The only way to do this was to use the power of the Mana.",
        "source": "user"
    },
    {
        "text": "Let me tell you more about the Mana.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "The Mana is the power of the Earth.",
        "source": "api"
    },
    {
        "text": "It is a power the aliens do not have.",
        "source": "user"
    },
    {
        "text": "It is a power that can be used to defeat the aliens.",
        "source": "user"
    },
    {
        "text": "The humans come together and they learn how to use the Mana.",
        "source": "user"
    },
    {
        "text": "They learn how to use the Mana to defeat the aliens.",
        "source": "api"
    },
    {
        "text": "The aliens have a weakness.",
        "source": "api"
    },
    {
        "text": "They are vulnerable to the power of the Mana.",
        "source": "api"
    },
    {
        "text": "It is gravity that benefits the humans most as gravity is a power of the earth.",
        "source": "user"
    },
    {
        "text": "The aliens do not have the power of gravity.",
        "source": "api"
    },
    {
        "text": "The aliens are vulnerable to the power of gravity.",
        "source": "user"
    },
    {
        "text": "The humans set up traps on the ground and as soon as the aliens touch them they are destroyed.",
        "source": "user"
    },
    {
        "text": "The remaining humans survive but never forget the ones they lost.",
        "source": "user"
    }
]