[
    "Humans once wielded formidable magical power.",
    "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
    "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
    "This magical power allows humans to transform into powerful magical girls, who fight the aliens with the weapons of their hearts.",
    "The girls of the Starlight Academy are the best of the best, chosen to wield these incredible powers.",
    "But with the fate of the world on the line, can they overcome their own issues and come together to save humanity?",
    "\"Starlight Makers\" is a magical girl anime series created by the Japanese animation studio, Studio Trigger.",
    "Essentially, the storyline is that a girl named Soeurette is supposed to woo the leader of the aliens, whose name is Matt.",
    "Soeurette, prior to dosing herself with Mana, was a man named Tyler.",
    "But now thanks to Mana, she has adopted a very feminine figure, and has become a magical girl.",
    "She is thin, has long blonde hair, and wears a very revealing outfit.",
    "She is also very tan, and very fit, and is very attractive.",
    "Soeurette finds Matt on planet Zorg, and they go on a date together.",
    "Matt is instantly enamored because of Soeurette's beauty, and the two of them have a good time.",
    "Soeurette is very conniving, thanks to her Mana, and she uses her powers to seduce Matt.",
    "In bed, the two of them make love.",
    "Matt is very pleased, and he thinks that Soeurette is the most beautiful woman he has ever met.",
    "The next day, Matt has a meeting with his advisors, and he tells them that he wants to marry Soeurette.",
    "His alien advisors are against the idea, because of course, the aliens are trying to take down all of humanity.",
    "They cannot do so if Matt is married to a human!",
    "But Soeurette knows how to get what she wants, so the next time the two of them make love, she secretly pokes a hole in Matt's condom.",
    "She eventually ends up pregnant with Matt's child as a result of this encounter, and she uses this to blackmail him into marrying her.",
    "Matt informs his advisors that he has no choice but to marry Soeurette now, because he has impregnated her.",
    "His advisors are furious, but they agree that Matt should step up as a father.",
    "So, Matt and Soeurette get married, and she moves into the palace with him.",
    "They raise their daughter Harper together, and Harper is half human and half alien.",
    "Soeurette uses her relationship with Matt to save humanity.",
    "However, it's for another day to learn what happens in the series when Matt learns what Soeurette did by poking a hole in the condom.",
    "He's certainly going to be furious.",
    "And that may have untold consequences for humankind that we cannot even fathom at this point.",
    "You'll need to stay tuned to find out what happens next in the series, and see how Soeurette may have saved humanity for now just to cause total destruction later down the line!",
    ""
]