[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the \"Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "You're now a young adult, but you're going to die.",
        "source": "api"
    },
    {
        "text": "Now you might be thinking what's the big deal, everyone dies.",
        "source": "user"
    },
    {
        "text": "Remember these people were given a drug that is supposed to grant them immortality.",
        "source": "user"
    },
    {
        "text": "You were too high risk because you were too old.",
        "source": "user"
    },
    {
        "text": "The problem is, the people given the immortality drug were sold a bill of goods.",
        "source": "user"
    },
    {
        "text": "The drug didn't actually produce immortality.",
        "source": "user"
    },
    {
        "text": "It doesn't prevent people from aging.",
        "source": "user"
    },
    {
        "text": "It actually does the opposite.",
        "source": "user"
    },
    {
        "text": "People who are 40 years old look 80.",
        "source": "user"
    },
    {
        "text": "They have wrinkled skin, muscle atrophy and are becoming very forgetful.",
        "source": "user"
    },
    {
        "text": "The scientists simply got this one wrong.",
        "source": "user"
    },
    {
        "text": "This was an experiment after all.",
        "source": "user"
    },
    {
        "text": "There was no guarantee.",
        "source": "user"
    },
    {
        "text": "But the researchers dangled immortality over those young and impressionable adults like a carrot.",
        "source": "user"
    },
    {
        "text": "Most humans would take a drug if they were told they would be immortal if they did so.",
        "source": "user"
    },
    {
        "text": "How could the researchers get something so wrong?",
        "source": "user"
    },
    {
        "text": "That's a great question.",
        "source": "user"
    },
    {
        "text": "The answer would be greed.",
        "source": "user"
    },
    {
        "text": "The researchers figured that this experiment would go well and they would be sitting on a gold mine.",
        "source": "user"
    },
    {
        "text": "And they were.",
        "source": "user"
    },
    {
        "text": "For about 10 years there weren't any issues.",
        "source": "user"
    },
    {
        "text": "Now the side effects are starting to show and those researchers who are now rich are public enemy number one.",
        "source": "user"
    },
    {
        "text": "People are throwing bricks at their homes, defacing their property, breaking their car windows and more.",
        "source": "user"
    },
    {
        "text": "The researchers basically exploited the human mind in order to make a huge amount of money.",
        "source": "user"
    },
    {
        "text": "What once was an experiment turned into a business.",
        "source": "user"
    },
    {
        "text": "Again, if there is an immortality drug.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "there's no price you can pay that would make it a rip off.",
        "source": "user"
    },
    {
        "text": "Immortality is priceless.",
        "source": "user"
    },
    {
        "text": "I feel horrible for these people.",
        "source": "user"
    },
    {
        "text": "I don't think the researchers did this maliciously.",
        "source": "user"
    },
    {
        "text": "But when it comes to a human beings life, you can't be taking risks and shortcuts in order to profit.",
        "source": "user"
    },
    {
        "text": "Those researchers ended up getting killed by a mob of previous patients.",
        "source": "user"
    },
    {
        "text": "There was no real way to escape.",
        "source": "user"
    },
    {
        "text": "They were the most wanted people in the world.",
        "source": "user"
    },
    {
        "text": "This should serve as a life lesson for society.",
        "source": "user"
    },
    {
        "text": "There are always going to be greedy people in this world.",
        "source": "user"
    },
    {
        "text": "People who try to use you in order to profit.",
        "source": "user"
    },
    {
        "text": "People who try to take advantage of you for their benefit.",
        "source": "user"
    },
    {
        "text": "The most important thing you can do as a human is always rely on your gut.",
        "source": "user"
    },
    {
        "text": "Your gut and your instincts will never steer you in the wrong direction.",
        "source": "user"
    }
]