[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation.\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.13930885529157666
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The world has not rebuilt much from the looks of it. The weary residents and leaders of the U.S. leave their bunkers and see that the world it in ruins just as it was after the war. They do notice rockets lifiting off far in the distance. They seem to go off every half hour. One of the military leaders figueres out that the rockets are heading for deep space. \n",
        "source": "user",
        "start_time": 9.0,
        "end_time": 198.0,
        "last_event_time": 198.0,
        "start_progress": 0.13930885529157666,
        "end_progress": 0.3353131749460043
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The world has not rebuilt much from the looks of it. The weary residents and leaders of the U.S. leave their bunkers and see that the world it in ruins just as it was after the war. They do notice rockets lifiting off far in the distance. They seem to go off every half hour. One of the military leaders figueres out that the rockets are heading for deep space. At first, no one believes him.\n",
        "source": "api",
        "start_time": 214.0,
        "end_time": 214.0,
        "last_event_time": 214.0,
        "start_progress": 0.3353131749460043,
        "end_progress": 0.351511879049676
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The world has not rebuilt much from the looks of it. The weary residents and leaders of the U.S. leave their bunkers and see that the world it in ruins just as it was after the war. They do notice rockets lifiting off far in the distance. They seem to go off every half hour. One of the military leaders figueres out that the rockets are heading for deep space. At first, no one believes him. Why would they be sending so many rockets into deep space asked one of the cadets. \n",
        "source": "user",
        "start_time": 216.0,
        "end_time": 235.0,
        "last_event_time": 235.0,
        "start_progress": 0.351511879049676,
        "end_progress": 0.3968682505399568
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The world has not rebuilt much from the looks of it. The weary residents and leaders of the U.S. leave their bunkers and see that the world it in ruins just as it was after the war. They do notice rockets lifiting off far in the distance. They seem to go off every half hour. One of the military leaders figueres out that the rockets are heading for deep space. At first, no one believes him. Why would they be sending so many rockets into deep space asked one of the cadets. The general replies, \"because we don't have a moon anymore.\"\n",
        "source": "api",
        "start_time": 257.0,
        "end_time": 257.0,
        "last_event_time": 257.0,
        "start_progress": 0.3968682505399568,
        "end_progress": 0.4292656587473002
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The world has not rebuilt much from the looks of it. The weary residents and leaders of the U.S. leave their bunkers and see that the world it in ruins just as it was after the war. They do notice rockets lifiting off far in the distance. They seem to go off every half hour. One of the military leaders figueres out that the rockets are heading for deep space. At first, no one believes him. Why would they be sending so many rockets into deep space asked one of the cadets. The general replies, \"because we don't have a moon anymore.\" When he said that, everyone looked to the sky to see fragments of rocks where the moon used to be. Just then the earth started to shake as if it was going to lift off into space. Was that an earthquake asks one of the civilians. I assume so said one of the privates. A scientist then goes over to the General in charge and whispers in his ear. The facial response on the General was enough to scare the most hardened veteran. \n",
        "source": "user",
        "start_time": 260.0,
        "end_time": 416.0,
        "last_event_time": 416.0,
        "start_progress": 0.4292656587473002,
        "end_progress": 0.6598272138228942
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The world has not rebuilt much from the looks of it. The weary residents and leaders of the U.S. leave their bunkers and see that the world it in ruins just as it was after the war. They do notice rockets lifiting off far in the distance. They seem to go off every half hour. One of the military leaders figueres out that the rockets are heading for deep space. At first, no one believes him. Why would they be sending so many rockets into deep space asked one of the cadets. The general replies, \"because we don't have a moon anymore.\" When he said that, everyone looked to the sky to see fragments of rocks where the moon used to be. Just then the earth started to shake as if it was going to lift off into space. Was that an earthquake asks one of the civilians. I assume so said one of the privates. A scientist then goes over to the General in charge and whispers in his ear. The facial response on the General was enough to scare the most hardened veteran. The general then turns and says, \"we need to evacuate the planet\".\n",
        "source": "api",
        "start_time": 435.0,
        "end_time": 435.0,
        "last_event_time": 435.0,
        "start_progress": 0.6598272138228942,
        "end_progress": 0.6954643628509719
    },
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts. 50 years later, the United States comes out of exile, only to learn that no one else went into isolation. The world has not rebuilt much from the looks of it. The weary residents and leaders of the U.S. leave their bunkers and see that the world it in ruins just as it was after the war. They do notice rockets lifting off far in the distance. They seem to go off every half hour. One of the military leaders figueres out that the rockets are heading for deep space. At first, no one believes him. Why would they be sending so many rockets into deep space asked one of the cadets. The general replies, \"because we don't have a moon anymore.\" When he said that, everyone looked to the sky to see fragments of rocks where the moon used to be. Just then the earth started to shake as if it was going to lift off into space. Was that an earthquake asks one of the civilians. I assume so said one of the privates. A scientist then goes over to the General in charge and whispers in his ear. The facial response on the General was enough to scare the most hardened veteran. The general then turns and says, \"we need to evacuate the planet\". The scientist told the general that the gravitational forces caused by a fractured moon is ripping the earth apart from the inside. The Americans quickly contact the Russian who are the ones sending up most of the rockets. We have a fleet of old shuttles at our disposal said the General to the leader of the Russian federation. We will combine our resources and start evacuations immediately. Fortunately there was enough time to evacuate 90% of earths population before the planet was destroyed. Humanity settled on a small rocky planet, orbiting Alpha Centuri. \n",
        "source": "user",
        "start_time": 439.0,
        "end_time": 642.0,
        "last_event_time": 642.0,
        "start_progress": 0.6954643628509719,
        "end_progress": 1.0
    }
]