[
    "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
    "Out of anger and protest, dads across the country have stopped drinking coffee and tea.",
    "They are hoping to get back at the powers that be by removing the need for mugs.",
    "One day, someone is spotted driving a new car down the street.",
    "Painted across the side panels in bright colors says, \"#1 Dad\".",
    "Another dad sees this while he is mowing the lawn.",
    "He asks his wife if she has seen the car.",
    "\"Yes dear, but that doesn't make you any less special.\" The next day, several cars are spotted in town with \"#1 Dad\" painted on the sides.",
    "The fathers are worried that they might not be the \"#1 Dad\" anymore.",
    "By the end of the week, cars were lining up at detail shops to get \"#1 Dad\" painted on their cars and trucks.",
    "Soon, even vehicles that aren't cars are sporting \"#1 Dad\" on them.",
    "Tractors, semis, helicopters.",
    "One person spotted an ambulance with \"#1 Dad\" painted on the side, not by the driver but by the passenger's wife!",
    "Early the next day, Air Force One was caught landing in front of the White House with \"#1 Dad\" painted on the side, and even printed on the jackets of the Secret Service.",
    "It's been two weeks since this whole thing started.",
    "Now, every vehicle in the country belongs to the #1 Dad.",
    "But no one knows who the best dad actually is.",
    "The country is very concerned about this.",
    "\"The One has to be out there somewhere among us.",
    "We have to find him.\" \n\nMeanwhile, the #1 Dad is out for a walk.",
    "He drives an ordinary unpainted car.",
    "No one knows he is the one.",
    "Suddenly, he sees a mug sitting on the sidewalk.",
    "It has \"#1 Dad\" printed across it.",
    "\"Look dad!\" says his son.",
    "\"I found that for you.\" The #1 Dad smiles and picks up the mug.",
    "\"You are the best dad in the world.\" says the son.",
    "\"I love you.\"\n\n\"Thanks, son.\" says the #1 Dad.",
    "\"I love you too.\" And that is how an ordinary man became the best dad in the world.",
    "Not because his car said so.",
    "Because his son said so.",
    ""
]