[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.",
        "source": "api"
    },
    {
        "text": "\" The pig said \"what do you want?",
        "source": "api"
    },
    {
        "text": "\" The wolf yelled at the pig and said it was unfair that the pig built a house out of a material that can't be blown down.",
        "source": "user"
    },
    {
        "text": "The pig responded and told the wolf to leave him and his friends alone and find some new animals to pick on.",
        "source": "user"
    },
    {
        "text": "The pig decided to spread the word to the rest of his friends.",
        "source": "user"
    },
    {
        "text": "As the days went on, each pigs began to build their homes using depleted uranium.",
        "source": "user"
    },
    {
        "text": "The wolf was very distressed and felt that he had lost his purpose in life.",
        "source": "user"
    },
    {
        "text": "He had spent years blowing down little pigs homes.",
        "source": "user"
    },
    {
        "text": "The wolf came back to the neighborhood and saw that all the homes were now made of depleted uranium so he started to do research on the internet.",
        "source": "user"
    },
    {
        "text": "He had to figure out what he could do to blow depleted uranium down.",
        "source": "user"
    },
    {
        "text": "Unfortunately, there was nothing he could do to blow the home down.",
        "source": "user"
    },
    {
        "text": "However he did find that he could destroy the homes by shooting fireworks at them.",
        "source": "user"
    },
    {
        "text": "He found that interesting but depleted uranium has a chemical reaction with fireworks that causes the depleted uranium to disintegrate.",
        "source": "user"
    },
    {
        "text": "The wolf went to the store and bought a bunch of fireworks.",
        "source": "user"
    },
    {
        "text": "He decided to drive over to the neighborhood and go through with his plan.",
        "source": "user"
    },
    {
        "text": "He had all of the fireworks in the bed of his truck.",
        "source": "user"
    },
    {
        "text": "He lit the fireworks and shot them at the pigs homes but to his surprise the fireworks just bounced off of the homes and nothing happened.",
        "source": "user"
    },
    {
        "text": "The wolf was shocked and didn't understand what was happening.",
        "source": "user"
    },
    {
        "text": "The pigs came out of their homes and told the wolf they had to tell him a secret.",
        "source": "user"
    },
    {
        "text": "They went up to the wolf and told him that the homes weren't made of depleted uranium.",
        "source": "user"
    },
    {
        "text": "They tricked the wolf and have found a material that cannot be destroyed no matter what the wolf does.",
        "source": "user"
    },
    {
        "text": "The pigs celebrated together knowing that they have finally beaten the wolf at his own game.",
        "source": "user"
    }
]