[
    "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
    "So when they were old enough, she sent them out into the world to seek their fortunes.",
    "You know the story about the first three little pigs.",
    "This is a story about the 92nd little pig.",
    "The 92nd little pig built a house out of depleted uranium.",
    "And the wolf was like, \"Dude.",
    "that's pretty dangerous.",
    "You thought what happened to the other pigs was bad?",
    "You're dealing with some dangerous materials there.\" The pig insisted it was safe, though the wolf had his doubts.",
    "The wolf had a college degree and liked to think of himself as pretty smart.",
    "The wolf was like, \"I'm not sure I want to risk my life on this.",
    "I'll go track down the 91st little pig\".",
    "The pig felt bad, but he just let the wolf go.",
    "The wolf found the 91st little pig's house, which was made out of depleted uranium.",
    "He was hesitant because it was still uranium.",
    "He wanted to be sure it was safe though.",
    "He went and got a tool that could check for radiation.",
    "The 91st pig watched him from inside of his house.",
    "Curious, the pig came outside to ask what was happening.",
    "\"Are you a home inspector?\" asked the pig.",
    "The wolf said he was here to blow his house down but wanted to check the safety first.",
    "This pig was not too bright so he went into his house, coming back out with an inspection sheet.",
    "He showed it to the wolf.",
    "\"This inspection shows it is perfectly safe.\" said the pig.",
    "\"Okay, I'll go get my dynamite,\" said the wolf.",
    "\"I thought you were going to blow it down?\" asked the pig.",
    "\"This sheet says the house is quite well built so I'll need the big guns.\" said the wolf.",
    "The not very bright 91st pig waited for him to return.",
    "He decided to stand outside as he watched the wolf blow up his house.",
    "After, he and the wolf just looked at each other in confusion.",
    "\"Now what?\" asked the pig.",
    "\"I'm not sure, we've never really gotten this far with a well built house before.\" said the wolf.",
    "\"Well, I guess I'm going to go move in with the 90th pig.",
    "Want to come?\" asked the pig.",
    "\"Sure.",
    "Lets get some lunch first.\" said the wolf as they walked off together.",
    ""
]