[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "The alien was wearing a familiar mask.",
        "source": "user"
    },
    {
        "text": "Matt was surprised by it, in fact it froze him in place, making it impossible for him to move.",
        "source": "user"
    },
    {
        "text": "Yes, the alien bore a striking resemblance to the Iconic American Talk Show Host; Jimmy Kimmel.",
        "source": "user"
    },
    {
        "text": "Jimmy had been Matt's arch enemy on earth, his villain, and now, it appeared Matt would have a tormentor in another world, with the same countenance.",
        "source": "user"
    },
    {
        "text": "So chilling.",
        "source": "user"
    },
    {
        "text": "First, Matt was taken to a space ship, vaguely shaped like a saucer.",
        "source": "user"
    },
    {
        "text": "On every screen inside it a different Episode of Jimmy Kimmel's show played, no matter which direction Matt Damon looked, he was forced to stare into the gaping Maw of that villainous creature.",
        "source": "user"
    },
    {
        "text": "The horrific maw of none other than Kimmel.",
        "source": "user"
    },
    {
        "text": "There seemed no escape, no escape in heaven, Space, Hell, the world, everywhere Matt Turned, Jimmy tormented him.",
        "source": "user"
    },
    {
        "text": "Finally, Matt Damon was brought to an isolated area of the planet, where he was asked to solve a puzzle.",
        "source": "user"
    },
    {
        "text": "It was a jigsaw, the face on the puzzle?",
        "source": "api"
    },
    {
        "text": "Guess?",
        "source": "user"
    },
    {
        "text": "yeah you got it.",
        "source": "user"
    },
    {
        "text": "Jimmy Kimmel.",
        "source": "user"
    },
    {
        "text": "It depicted the face of the archenemy, poised in full ire, with gaping maw presented fully, giving a detailed view of every dental feature and facial pore of the immutable Kimmel.",
        "source": "user"
    },
    {
        "text": "Damon was told he had 2 minutes to complete the puzzle or he'd have yet a more difficult task.",
        "source": "user"
    },
    {
        "text": "The Kimmel looking alien held high, an hour glass, Cackling the Kimmel like alien said ready, set, and then he put the glass down and the sands began to gather with irritating velocity to the bottom of the glass - GO he said then disappeared with a poof.",
        "source": "user"
    },
    {
        "text": "Matt focused, working hard, he .",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "was.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "about .",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "to put the last piece in place, when.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "POOF Alien Kimmel appeared, grabbed the hourglass and said: Too slow, Damon.",
        "source": "user"
    },
    {
        "text": "We will PROCEED.",
        "source": "user"
    },
    {
        "text": "Damon was taken to a series of rooms containing a variety of confusing puzzles and objects.",
        "source": "user"
    },
    {
        "text": "He said, choose your station maggot.",
        "source": "api"
    },
    {
        "text": "The Kimmel look alike again laughed, Cackling.",
        "source": "user"
    },
    {
        "text": "Damon simply went to the nearest station, it had several Kimmel masks.",
        "source": "user"
    },
    {
        "text": "The Kimmel Alien said, GOOD choice.",
        "source": "user"
    },
    {
        "text": "Again laughing, turning around, he looked like, none other than Damon himself.",
        "source": "user"
    },
    {
        "text": "It was like a mirror.",
        "source": "user"
    },
    {
        "text": "So The alien Damon pointed to the mask, then to his face, saying DO IT.",
        "source": "user"
    },
    {
        "text": "So, Damon put on the mask, where he morphed into Kimmel, so here the two sat, facing each other.",
        "source": "user"
    },
    {
        "text": "One frowning, one smiling Maniacally.",
        "source": "user"
    },
    {
        "text": "The ship began to tumble downwards, to what must be Earth.",
        "source": "user"
    },
    {
        "text": "The alien, who looked, NOW like Damon got off, and the new Kimmel, who used to be Damon, also got off.",
        "source": "user"
    },
    {
        "text": "The New Kimmel was \"whooshed\" to the set of a game show, you guessed it.",
        "source": "user"
    },
    {
        "text": "The Jimmy Kimmel Show.",
        "source": "user"
    },
    {
        "text": "Now Damon would be forced to spend the rest of his life on Earth with the torment of seeing himself on television every night, a living nightmare.",
        "source": "user"
    },
    {
        "text": "A Kimmel, literally from hell and another world.",
        "source": "api"
    },
    {
        "text": "The torment was endless and hopeless.",
        "source": "user"
    },
    {
        "text": "Caught in the trap.",
        "source": "user"
    }
]