[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "The people of the United States find out they are 50 years behind the rest of the world.",
        "source": "api"
    },
    {
        "text": "But now, they are beginning to make up for lost time.",
        "source": "user"
    },
    {
        "text": "They are working hard to catch up with technology and science and the arts.",
        "source": "api"
    },
    {
        "text": "But the rest of the world is still wary of them and their intentions.",
        "source": "user"
    },
    {
        "text": "Every nation in the world becomes extremely competitive with the United States.",
        "source": "api"
    },
    {
        "text": "It becomes a race to see who can out-innovate them.",
        "source": "user"
    },
    {
        "text": "This sparks a new age of rapid technological advancement and evolution.",
        "source": "api"
    },
    {
        "text": "The United States cannot catch up.",
        "source": "user"
    },
    {
        "text": "They are out-innovated, out-maneuvered, and out of time.",
        "source": "user"
    },
    {
        "text": "The world is far too ahead of them.",
        "source": "api"
    },
    {
        "text": "They eventually surrender to their new reality.",
        "source": "user"
    },
    {
        "text": "They are no longer a super power.",
        "source": "user"
    },
    {
        "text": "They are a third world country, forever behind in the progress of technology and science.",
        "source": "user"
    },
    {
        "text": "They are a struggling developing nation.",
        "source": "api"
    },
    {
        "text": "They reach out for help and their requests are ignored.",
        "source": "user"
    },
    {
        "text": "They are looked down on with pity.",
        "source": "user"
    },
    {
        "text": "They eventually become dependent on the world for answers to their problems.",
        "source": "user"
    },
    {
        "text": "They learn to survive on what the world gives them.",
        "source": "api"
    },
    {
        "text": "This turns them into a humble people.",
        "source": "api"
    },
    {
        "text": "They learn to appreciate every little thing they get from the world.",
        "source": "user"
    },
    {
        "text": "They grow in spiritual and religious practice.",
        "source": "api"
    },
    {
        "text": "Eventually, the United States becomes a place for people seeking religious solace.",
        "source": "user"
    },
    {
        "text": "People come to the United States for religious freedom.",
        "source": "user"
    },
    {
        "text": "Newcomers are greeted with warmth and hospitality.",
        "source": "api"
    },
    {
        "text": "The United States becomes a new world inadvertently, through hard work and painstaking circumstances.",
        "source": "user"
    },
    {
        "text": "It becomes the land of dreams.",
        "source": "user"
    }
]