[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude.\"",
        "source": "api"
    },
    {
        "text": "The wolf came and huffed and puffed, but his lungs got cancer from all the uranium.",
        "source": "api"
    },
    {
        "text": "The wolf was sent to stay in the hospital, and no one came to visit him because he was so scary.",
        "source": "user"
    },
    {
        "text": "He thought he would die alone, but the 92nd little pig visited him and was like, \"dude.\" The wolf never thought he would get a visit from someone he once tried to eat.",
        "source": "user"
    },
    {
        "text": "And the wolf said, \"I'm sorry I tried to eat you.\" The pig shrugged.",
        "source": "user"
    },
    {
        "text": "\"Don't sweat it. Besides, I've lived in my house long enough that you'd get sick if you ate me. Ain't worth it.\"",
        "source": "user"
    },
    {
        "text": "So they hung out, and the wolf got better.",
        "source": "api"
    },
    {
        "text": "Finally the day came when wolf was ready to go home.",
        "source": "user"
    },
    {
        "text": "He said, \"Thank you for taking care of me.\" The pig smiled.",
        "source": "user"
    },
    {
        "text": "\"No problem dude.\"",
        "source": "user"
    },
    {
        "text": "And then the wolf said, \"Tonight there's going to be a party at my house. The pig's ears perked up. \"Really?\"",
        "source": "api"
    },
    {
        "text": "\"",
        "source": "user"
    },
    {
        "text": "\"Yeah, and I want you to come.\" The pig thought about it for a moment.",
        "source": "api"
    },
    {
        "text": "\"I might.\" said the pig.",
        "source": "user"
    },
    {
        "text": "\"Maybe I'll see you there.\" The pig was excited, so he ran back to his house and got ready for the party.",
        "source": "user"
    },
    {
        "text": "A little while after the party started, there was a knock on the door.",
        "source": "user"
    },
    {
        "text": "\"Who is it?\" There wasn't an answer.",
        "source": "api"
    },
    {
        "text": "The wolf opened the door, and found the pig standing on the porch in an iron lung.",
        "source": "user"
    },
    {
        "text": "\"Hey dude.\" said the pig.",
        "source": "api"
    },
    {
        "text": "The wolf stood there in shock.",
        "source": "user"
    },
    {
        "text": "\"Why are you wearing that?\"",
        "source": "user"
    },
    {
        "text": "\"Because I live in a uranium house and I don't want to get your friends sick.\" The wolf was touched.",
        "source": "user"
    },
    {
        "text": "\"Well, you look great!\"",
        "source": "user"
    },
    {
        "text": "\"Thanks.\" And they all had a great night at the party, cancer-free.",
        "source": "api"
    },
    {
        "text": "The wolf and the pig were best friends forever and lived a long time.",
        "source": "api"
    },
    {
        "text": "The end.",
        "source": "api"
    }
]