[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You do not know who left the letter.",
        "source": "api"
    },
    {
        "text": "You do not know who sent it.",
        "source": "user"
    },
    {
        "text": "You do not know what the job is and you do not know when it is supposed to start.",
        "source": "api"
    },
    {
        "text": "You decide to do what the note said.",
        "source": "user"
    },
    {
        "text": "You pack your bags then you call the number.",
        "source": "user"
    },
    {
        "text": "The voice on the other end is JFK's voice.",
        "source": "user"
    },
    {
        "text": "He tells you that you will be going to a place called \"The Island.\" There is important working happening at \"The Island\".",
        "source": "api"
    },
    {
        "text": "You will be working with a team of people to help the world.",
        "source": "user"
    },
    {
        "text": "You will be the leader of this team.",
        "source": "user"
    },
    {
        "text": "Since you were recently president you have a lot of connections and a lot of knowledge that can help people in the world.",
        "source": "user"
    },
    {
        "text": "A virus is killing many people and a solution has to be found.",
        "source": "user"
    },
    {
        "text": "You will be working with a team of people to find a solution to the virus.",
        "source": "user"
    },
    {
        "text": "You are good at understanding people from different backgrounds and it is up to you to convince the people to get treated to prevent the virus.",
        "source": "user"
    },
    {
        "text": "JFK tells you that the people will not go to doctors to get shots so you must find another way.",
        "source": "user"
    },
    {
        "text": "Medicines have to be administered to all people.",
        "source": "user"
    },
    {
        "text": "JFK tells you that the people are scared of getting shots so you must find another way.",
        "source": "user"
    },
    {
        "text": "After finding out that the medicine can be administered directly to the lungs by breathing you contact your friends at the vaping industry.",
        "source": "user"
    },
    {
        "text": "They tell you that they can make a vaporizer that can be used to administer the medicine.",
        "source": "api"
    },
    {
        "text": "You work with the team at the vaping industry and create vaporizers that can be sent to every citizen.",
        "source": "user"
    },
    {
        "text": "JFK is happy to have seen you and you him.",
        "source": "user"
    },
    {
        "text": "You sure hope you don't have to meet again soon though!",
        "source": "user"
    }
]