[
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.18775510204081633
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, you fully absorb a book you need to read it. \n",
        "source": "user",
        "start_time": 50.0,
        "end_time": 64.0,
        "last_event_time": 64.0,
        "start_progress": 0.18775510204081633,
        "end_progress": 0.21904761904761905
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, you fully absorb a book you need to read it. You can't get the full effect of a book by listening to it.\n",
        "source": "api",
        "start_time": 75.0,
        "end_time": 75.0,
        "last_event_time": 75.0,
        "start_progress": 0.21904761904761905,
        "end_progress": 0.25918367346938775
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, you fully absorb a book you need to read it.  You can't get the full effect of a book by listening to it.  There are some positives to listening to a book, \n",
        "source": "user",
        "start_time": 78.0,
        "end_time": 104.0,
        "last_event_time": 104.0,
        "start_progress": 0.25918367346938775,
        "end_progress": 0.2945578231292517
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, you fully absorb a book you need to read it.  You can't get the full effect of a book by listening to it.  There are some positives to listening to a book, such as being able to listen to a book while doing other things, but I think the negatives outweigh the positives.\n",
        "source": "api",
        "start_time": 124.0,
        "end_time": 124.0,
        "last_event_time": 124.0,
        "start_progress": 0.2945578231292517,
        "end_progress": 0.37210884353741497
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, you fully absorb a book you need to read it.  You can't get the full effect of a book by listening to it.  There are some positives to listening to a book, such as being able to listen to a book while doing other things, being able to listen in places where you could not read, such as being in the car, \n",
        "source": "user",
        "start_time": 134.0,
        "end_time": 215.0,
        "last_event_time": 215.0,
        "start_progress": 0.37210884353741497,
        "end_progress": 0.3952380952380952
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, you fully absorb a book you need to read it.  You can't get the full effect of a book by listening to it.  There are some positives to listening to a book, such as being able to listen to a book while doing other things, being able to listen in places where you could not read, such as being in the car, or being able to listen to a book when you are too tired to read.\n",
        "source": "api",
        "start_time": 229.0,
        "end_time": 229.0,
        "last_event_time": 229.0,
        "start_progress": 0.3952380952380952,
        "end_progress": 0.43945578231292515
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, you fully absorb a book you need to read it.  You can't get the full effect of a book by listening to it.  There are some positives to listening to a book, such as being able to listen to a book while doing other things, being able to listen in places where you could not read, such as being in the car, or being able to listen to a book when you are too tired to read.  However, all of these things point to the reason it is better to read a book.  To get the most from a book it needs your fully attention, the things that make listening to it attractive also mean you are not fully engaged, you are doing other things that need some of your attention.   I believe if you listen to it, some of the content passes you by,  \n",
        "source": "user",
        "start_time": 232.0,
        "end_time": 416.0,
        "last_event_time": 416.0,
        "start_progress": 0.43945578231292515,
        "end_progress": 0.680952380952381
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, you fully absorb a book you need to read it.  You can't get the full effect of a book by listening to it.  There are some positives to listening to a book, such as being able to listen to a book while doing other things, being able to listen in places where you could not read, such as being in the car, or being able to listen to a book when you are too tired to read.  However, all of these things point to the reason it is better to read a book.  To get the most from a book it needs your fully attention, the things that make listening to it attractive also mean you are not fully engaged, you are doing other things that need some of your attention.   I believe if you listen to it, some of the content passes you by,   and you miss out on some of the finer details.\n",
        "source": "api",
        "start_time": 426.0,
        "end_time": 426.0,
        "last_event_time": 426.0,
        "start_progress": 0.680952380952381,
        "end_progress": 0.7129251700680272
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, you fully absorb a book you need to read it.  You can't get the full effect of a book by listening to it.  There are some positives to listening to a book, such as being able to listen to a book while doing other things, being able to listen in places where you could not read, such as being in the car, or being able to listen to a book when you are too tired to read.  However, all of these things point to the reason it is better to read a book.  To get the most from a book it needs your fully attention, the things that make listening to it attractive also mean you are not fully engaged, you are doing other things that need some of your attention.   I believe if you listen to it, some of the content passes you by, you miss out on some of the finer details and \n",
        "source": "user",
        "start_time": 430.0,
        "end_time": 439.0,
        "last_event_time": 439.0,
        "start_progress": 0.7129251700680272,
        "end_progress": 0.7115646258503401
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, you fully absorb a book you need to read it.  You can't get the full effect of a book by listening to it.  There are some positives to listening to a book, such as being able to listen to a book while doing other things, being able to listen in places where you could not read, such as being in the car, or being able to listen to a book when you are too tired to read.  However, all of these things point to the reason it is better to read a book.  To get the most from a book it needs your fully attention, the things that make listening to it attractive also mean you are not fully engaged, you are doing other things that need some of your attention.   I believe if you listen to it, some of the content passes you by, you miss out on some of the finer details and nuances that make a book great.\n",
        "source": "api",
        "start_time": 452.0,
        "end_time": 452.0,
        "last_event_time": 452.0,
        "start_progress": 0.7115646258503401,
        "end_progress": 0.7326530612244898
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, you fully absorb a book you need to read it.  You can't get the full effect of a book by listening to it.  There are some positives to listening to a book, such as being able to listen to a book while doing other things, being able to listen in places where you could not read, such as being in the car, or being able to listen to a book when you are too tired to read.  However, all of these things point to the reason it is better to read a book.  To get the most from a book it needs your fully attention, the things that make listening to it attractive also mean you are not fully engaged, you are doing other things that need some of your attention.   I believe if you listen to it, some of the content passes you by, you miss out on some of the finer details and you miss the nuances that make a book great.  Listening is useful, and a pleasant past time\n",
        "source": "user",
        "start_time": 462.0,
        "end_time": 491.0,
        "last_event_time": 491.0,
        "start_progress": 0.7326530612244898,
        "end_progress": 0.773469387755102
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, you fully absorb a book you need to read it.  You can't get the full effect of a book by listening to it.  There are some positives to listening to a book, such as being able to listen to a book while doing other things, being able to listen in places where you could not read, such as being in the car, or being able to listen to a book when you are too tired to read.  However, all of these things point to the reason it is better to read a book.  To get the most from a book it needs your fully attention, the things that make listening to it attractive also mean you are not fully engaged, you are doing other things that need some of your attention.   I believe if you listen to it, some of the content passes you by, you miss out on some of the finer details and you miss the nuances that make a book great.  Listening is useful, and a pleasant past time, but it is not the same as reading.\n",
        "source": "api",
        "start_time": 502.0,
        "end_time": 502.0,
        "last_event_time": 502.0,
        "start_progress": 0.773469387755102,
        "end_progress": 0.7979591836734694
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, you fully absorb a book you need to read it.  You can't get the full effect of a book by listening to it.  There are some positives to listening to a book, such as being able to listen to a book while doing other things, being able to listen in places where you could not read, such as being in the car, or being able to listen to a book when you are too tired to read.  However, all of these things point to the reason it is better to read a book.  To get the most from a book it needs your fully attention, the things that make listening to it attractive also mean you are not fully engaged, you are doing other things that need some of your attention.   I believe if you listen to it, some of the content passes you by, you miss out on some of the finer details and you miss the nuances that make a book great.  Listening is useful, and a pleasant past time, but it is not the same as reading.  To while you can enjoy an audio book, \n",
        "source": "user",
        "start_time": 505.0,
        "end_time": 569.0,
        "last_event_time": 569.0,
        "start_progress": 0.7979591836734694,
        "end_progress": 0.8251700680272109
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, you fully absorb a book you need to read it.  You can't get the full effect of a book by listening to it.  There are some positives to listening to a book, such as being able to listen to a book while doing other things, being able to listen in places where you could not read, such as being in the car, or being able to listen to a book when you are too tired to read.  However, all of these things point to the reason it is better to read a book.  To get the most from a book it needs your fully attention, the things that make listening to it attractive also mean you are not fully engaged, you are doing other things that need some of your attention.   I believe if you listen to it, some of the content passes you by, you miss out on some of the finer details and you miss the nuances that make a book great.  Listening is useful, and a pleasant past time, but it is not the same as reading.  To while you can enjoy an audio book, you will not get the same experience as you would from reading the book.\n",
        "source": "api",
        "start_time": 578.0,
        "end_time": 578.0,
        "last_event_time": 578.0,
        "start_progress": 0.8251700680272109,
        "end_progress": 0.8741496598639455
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, you fully absorb a book you need to read it.  You can't get the full effect of a book by listening to it.  There are some positives to listening to a book, such as being able to listen to a book while doing other things, being able to listen in places where you could not read, such as being in the car, or being able to listen to a book when you are too tired to read.  However, all of these things point to the reason it is better to read a book.  To get the most from a book it needs your fully attention, the things that make listening to it attractive also mean you are not fully engaged, you are doing other things that need some of your attention.   I believe if you listen to it, some of the content passes you by, you miss out on some of the finer details and you miss the nuances that make a book great.  Listening is useful, and a pleasant past time, but it is not the same as reading.  To while you can enjoy an audio book, you will not get the same experience as you would from reading the book.  That experience allows you to gain more from the written text and undertand what the author is conveying.  So, in conclusion, \n",
        "source": "user",
        "start_time": 585.0,
        "end_time": 620.0,
        "last_event_time": 620.0,
        "start_progress": 0.8741496598639455,
        "end_progress": 0.9612244897959183
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, you fully absorb a book you need to read it.  You can't get the full effect of a book by listening to it.  There are some positives to listening to a book, such as being able to listen to a book while doing other things, being able to listen in places where you could not read, such as being in the car, or being able to listen to a book when you are too tired to read.  However, all of these things point to the reason it is better to read a book.  To get the most from a book it needs your fully attention, the things that make listening to it attractive also mean you are not fully engaged, you are doing other things that need some of your attention.   I believe if you listen to it, some of the content passes you by, you miss out on some of the finer details and you miss the nuances that make a book great.  Listening is useful, and a pleasant past time, but it is not the same as reading.  To while you can enjoy an audio book, you will not get the same experience as you would from reading the book.  That experience allows you to gain more from the written text and undertand what the author is conveying.  So, in conclusion, I believe it is better to read a book than listen to it.\n",
        "source": "api",
        "start_time": 629.0,
        "end_time": 629.0,
        "last_event_time": 629.0,
        "start_progress": 0.9612244897959183,
        "end_progress": 0.9993197278911564
    },
    {
        "text": "Is Listening to a Book Just as Good as Reading It?\n\nDo you listen to audiobooks? What are the benefits, in your opinion, of listening instead of reading? Are there advantages to reading that cannot be gained by listening? Which method do you prefer? Why?\n\n---\n\nIn my opinion, to fully absorb a book you need to read it.  You can't get the full effect of a book by listening to it.  There are some positives to listening to a book, such as being able to listen to a book while doing other things, being able to listen in places where you could not read, such as being in the car, or being able to listen to a book when you are too tired to read.  However, all of these things point to the reason it is better to read a book.  To get the most from a book, it needs your fully attention, the things that make listening to it attractive also mean you are not fully engaged, you are doing other things that need some of your attention.   I believe if you listen to it, some of the content passes you by, you miss out on some of the finer details and you miss the nuances that make a book great.  Listening is useful, and a pleasant past time, but it is not the same as reading.  So while you can enjoy an audio book, you will not get the same experience as you would from reading the book.  That experience allows you to gain more from the written text and understand what the author is conveying.  So, in conclusion, I believe it is better to read a book than listen to it.\n",
        "source": "user",
        "start_time": 632.0,
        "end_time": 696.0,
        "last_event_time": 696.0,
        "start_progress": 0.9993197278911564,
        "end_progress": 1.0
    }
]