[
    {
        "text": "When you're 28, science discovers a drug that stops all effects of aging, creating immortality.",
        "source": "api"
    },
    {
        "text": "Your government decides to give the drug to all citizens under 26, but you and the rest of the “Lost Generations\" are deemed too high-risk.",
        "source": "api"
    },
    {
        "text": "When you're 85, the side effects are finally discovered.",
        "source": "api"
    },
    {
        "text": "It has been found that the only side effect of the drug is the inability to procreate.",
        "source": "api"
    },
    {
        "text": "The younger generation thinks this is just fine, because who needs more people when they will always inhabit the earth.",
        "source": "user"
    },
    {
        "text": "The book starts out being told in the first person by Amy, a governess who is taking care of her two charges.",
        "source": "user"
    },
    {
        "text": "Amy is only 26 herself, so she and her charges are candidates for immortality.",
        "source": "api"
    },
    {
        "text": "The children's parents, Tim and Jim however, are not.",
        "source": "user"
    },
    {
        "text": "Tim and Jim know exactly the path to be taken in raising their children.",
        "source": "user"
    },
    {
        "text": "Who will see to it that the children stay on the right path should Tim and Jim die of old age?",
        "source": "user"
    },
    {
        "text": "Amy thinks this is selfish of the parents.",
        "source": "user"
    },
    {
        "text": "The children will be able to care for themselves and will make their own way eventually.",
        "source": "user"
    },
    {
        "text": "What the parents do not know is that the government is not giving people a choice.",
        "source": "user"
    },
    {
        "text": "Tim and Jim decide, with the help of Amy, to live off the grid.",
        "source": "user"
    },
    {
        "text": "They will not allow the government to use their precious offspring as guinea pigs.",
        "source": "user"
    },
    {
        "text": "Amy agrees, somewhat.",
        "source": "user"
    },
    {
        "text": "She thinks that staying away from the mainstream will give her two years to observe side effects.",
        "source": "user"
    },
    {
        "text": "If they are a nightmare, she will simply stay off the grid.",
        "source": "user"
    },
    {
        "text": "Amy loves the little ones for whom she cares.",
        "source": "user"
    },
    {
        "text": "She could be happy always being in their life.",
        "source": "user"
    },
    {
        "text": "In fact, it is ideal for children to have two loving parents, and a fun, creative and loving governess.",
        "source": "user"
    },
    {
        "text": "This just might turn out okay, afterall.",
        "source": "user"
    },
    {
        "text": "Ultimately, the little family plus Amy find a suitable environment for remaining secluded and off they go.",
        "source": "user"
    },
    {
        "text": "Everyone seems quite happy until Amy stealthily goes back to society to find no one around anywhere.",
        "source": "user"
    },
    {
        "text": "The world she once knew was a ghost world.",
        "source": "user"
    },
    {
        "text": "Amy goes back to her family to give them the news.",
        "source": "user"
    },
    {
        "text": "They all decide to stay where they are and live out their lives.",
        "source": "user"
    }
]