[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "The dads around the world are taking their rankings a little too serious but you know how men are.",
        "source": "user"
    },
    {
        "text": "The male ego is a very fragile thing.",
        "source": "user"
    },
    {
        "text": "Nobody even knows what has caused this.",
        "source": "user"
    },
    {
        "text": "It could just be a simple programming error.",
        "source": "user"
    },
    {
        "text": "After all, the mugs that are affected are the ones that have the digital light up numbers.",
        "source": "user"
    },
    {
        "text": "The moms in every household try to calm the Dads down but for the most part the Dads are just angry and frustrated.",
        "source": "user"
    },
    {
        "text": "They all are taking this mug thing a little bit too personal.",
        "source": "user"
    },
    {
        "text": "After all, these mugs are given to them by children or their wives in most cases.",
        "source": "user"
    },
    {
        "text": "Shouldn't those people's opinions matter more than some random programming error or some stranger changing everything?",
        "source": "user"
    },
    {
        "text": "These types of mugs have been given out for decades.",
        "source": "user"
    },
    {
        "text": "Children are trying to tell their Dads that the mugs don't matter and they love them.",
        "source": "user"
    },
    {
        "text": "The Dads are just struggling with confidence issues.",
        "source": "user"
    },
    {
        "text": "The next day all the Dads wake up and the mugs all say #1 Dad on them again.",
        "source": "user"
    },
    {
        "text": "The Dads also have an email from the mug company explaining that there was a programming issue and all the mugs were changed to random digits.",
        "source": "user"
    },
    {
        "text": "The Dads feel like idiots for overreacting.",
        "source": "user"
    },
    {
        "text": "The Moms tell the dads they should take this as a learning lesson and stop getting so out of control over ego things.",
        "source": "user"
    },
    {
        "text": "The mugs should have never caused this kind of an issue.",
        "source": "user"
    },
    {
        "text": "Men sometimes go a bit overboard with their ego.",
        "source": "user"
    },
    {
        "text": "We can all learn from this scenario.",
        "source": "user"
    },
    {
        "text": "Lets put our family first and our ego second.",
        "source": "user"
    }
]