[
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.14242697982535382
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\nI do not believe people ought to be worried about the amount of screen use that people engage with during the pandemic. \n",
        "source": "user",
        "start_time": 6.0,
        "end_time": 32.0,
        "last_event_time": 32.0,
        "start_progress": 0.14242697982535382,
        "end_progress": 0.17404396266184885
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\nI do not believe people ought to be worried about the amount of screen use that people engage with during the pandemic. \n\nThe reason for this is that the amount of screen time that people engage with during the pandemic is not going to be significantly different from what\n",
        "source": "api",
        "start_time": 49.0,
        "end_time": 49.0,
        "last_event_time": 49.0,
        "start_progress": 0.17404396266184885,
        "end_progress": 0.21981330924420356
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\nI do not believe people ought to be worried about the amount of screen use that people engage with during the pandemic. The reason for this is that the amount of screen time that people engage with during the pandemic is not necessarily going to be reflective of the amount of screen use that will be present after the pandemic has ended. In fact, I believe many will decrease their screen use after the pandemic, with some even going back to their pre-pandemic screen use time. \n",
        "source": "user",
        "start_time": 56.0,
        "end_time": 122.0,
        "last_event_time": 122.0,
        "start_progress": 0.21981330924420356,
        "end_progress": 0.2821439325504366
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\nI do not believe people ought to be worried about the amount of screen use that people engage with during the pandemic. The reason for this is that the amount of screen time that people engage with during the pandemic is not necessarily going to be reflective of the amount of screen use that will be present after the pandemic has ended. In fact, I believe many will decrease their screen use after the pandemic, with some even going back to their pre-pandemic screen use time. \n\nThe reason for this is that people will be more aware of the benefits and drawbacks of screen use after the pandemic.\n",
        "source": "api",
        "start_time": 133.0,
        "end_time": 133.0,
        "last_event_time": 133.0,
        "start_progress": 0.2821439325504366,
        "end_progress": 0.3179765130984643
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\nI do not believe people ought to be worried about the amount of screen use that people engage with during the pandemic. The reason for this is that the amount of screen time that people engage with during the pandemic is not necessarily going to be reflective of the amount of screen use that will be present after the pandemic has ended. In fact, I believe many will decrease their screen use after the pandemic, with some even going back to their pre-pandemic screen use time. The reason for this is that people will be more aware of the benefits and drawbacks of screen use after the pandemic. As a result of the pandemic, many switched to screen use for their work, social interactions, and other personal interests. This was in lieu of more traditional means of dealing with such occurences in one's life, such as working with others on site. As a result to this transition of social distancing and working from home, many will learn that they operate better outside of the home, and through seeing people face to face. Remote work and social interactions through digital devices \n",
        "source": "user",
        "start_time": 135.0,
        "end_time": 242.0,
        "last_event_time": 242.0,
        "start_progress": 0.3179765130984643,
        "end_progress": 0.4646190906353508
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\nI do not believe people ought to be worried about the amount of screen use that people engage with during the pandemic. The reason for this is that the amount of screen time that people engage with during the pandemic is not necessarily going to be reflective of the amount of screen use that will be present after the pandemic has ended. In fact, I believe many will decrease their screen use after the pandemic, with some even going back to their pre-pandemic screen use time. The reason for this is that people will be more aware of the benefits and drawbacks of screen use after the pandemic. As a result of the pandemic, many switched to screen use for their work, social interactions, and other personal interests. This was in lieu of more traditional means of dealing with such occurences in one's life, such as working with others on site. As a result to this transition of social distancing and working from home, many will learn that they operate better outside of the home, and through seeing people face to face. Remote work and social interactions through digital devices will be seen as a way to get things done, but not as a replacement for face to face interactions.\n",
        "source": "api",
        "start_time": 250.0,
        "end_time": 250.0,
        "last_event_time": 250.0,
        "start_progress": 0.4646190906353508,
        "end_progress": 0.49382716049382713
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\nI do not believe people ought to be worried about the amount of screen use that people engage with during the pandemic. The reason for this is that the amount of screen time that people engage with during the pandemic is not necessarily going to be reflective of the amount of screen use that will be present after the pandemic has ended. In fact, I believe many will decrease their screen use after the pandemic, with some even going back to their pre-pandemic screen use time. The reason for this is that people will be more aware of the benefits and drawbacks of screen use after the pandemic. As a result of the pandemic, many switched to screen use for their work, social interactions, and other personal interests. This was in lieu of more traditional means of dealing with such occurrences in one's life, such as working with others on site. As a result to this transition of social distancing and working from home, many will learn that they operate better outside of the home, and through seeing people face to face. Remote work and social interactions through digital devices will be seen as a way to get things done, but not as a replacement for face to face interactions for everyone. In fact, many might only rely on remote work and their increased screen use due to personal obligation, and would distance themselves from such technology once it is safe to do so. Many are not comfortable working from home, and others don't enjoy their hobbies or even watching a movie with friends unless they are \n",
        "source": "user",
        "start_time": 257.0,
        "end_time": 332.0,
        "last_event_time": 332.0,
        "start_progress": 0.49382716049382713,
        "end_progress": 0.5934959349593496
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\nI do not believe people ought to be worried about the amount of screen use that people engage with during the pandemic. The reason for this is that the amount of screen time that people engage with during the pandemic is not necessarily going to be reflective of the amount of screen use that will be present after the pandemic has ended. In fact, I believe many will decrease their screen use after the pandemic, with some even going back to their pre-pandemic screen use time. The reason for this is that people will be more aware of the benefits and drawbacks of screen use after the pandemic. As a result of the pandemic, many switched to screen use for their work, social interactions, and other personal interests. This was in lieu of more traditional means of dealing with such occurrences in one's life, such as working with others on site. As a result to this transition of social distancing and working from home, many will learn that they operate better outside of the home, and through seeing people face to face. Remote work and social interactions through digital devices will be seen as a way to get things done, but not as a replacement for face to face interactions for everyone. In fact, many might only rely on remote work and their increased screen use due to personal obligation, and would distance themselves from such technology once it is safe to do so. Many are not comfortable working from home, and others don't enjoy their hobbies or even watching a movie with friends unless they are in the same room.\n",
        "source": "api",
        "start_time": 337.0,
        "end_time": 337.0,
        "last_event_time": 337.0,
        "start_progress": 0.5934959349593496,
        "end_progress": 0.5986148750376392
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\nI do not believe people ought to be worried about the amount of screen use that people engage with during the pandemic. The reason for this is that the amount of screen time that people engage with during the pandemic is not necessarily going to be reflective of the amount of screen use that will be present after the pandemic has ended. In fact, I believe many will decrease their screen use after the pandemic, with some even going back to their pre-pandemic screen use time. The reason for this is that people will be more aware of the benefits and drawbacks of screen use after the pandemic. As a result of the pandemic, many switched to screen use for their work, social interactions, and other personal interests. This was in lieu of more traditional means of dealing with such occurrences in one's life, such as working with others on site. As a result to this transition of social distancing and working from home, many will learn that they operate better outside of the home, and through seeing people face to face. Remote work and social interactions through digital devices will be seen as a way to get things done, but not as a replacement for face to face interactions for everyone. In fact, many might only rely on remote work and their increased screen use due to personal obligation, and would distance themselves from such technology once it is safe to do so. Many are not comfortable working from home, and others don't enjoy their hobbies or even watching a movie with friends unless they are in the same room. Thus, I think people should not worry that screen use is significantly higher among people due to the pandemic, as the amount of screen time people do for school, work, and connecting with others will evidently decrease when people can safely meet with each other.\n\nWith that in mind, people ought to embrace the benefits that our digital devices provide. While many will not see such devices as a perfect substitute for in person interactions, I still think people will benefit from its use and widespread implementation. Digital devices allow us to keep in touch with our friends, family, and colleagues, through means such as text messaging, email, and video chat. These are great ways for many to converse with others quickly, to share information for work or personal reasons, and to share the content that we enjoy. \n",
        "source": "user",
        "start_time": 339.0,
        "end_time": 520.0,
        "last_event_time": 520.0,
        "start_progress": 0.5986148750376392,
        "end_progress": 0.8464317976513098
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\nI do not believe people ought to be worried about the amount of screen use that people engage with during the pandemic. The reason for this is that the amount of screen time that people engage with during the pandemic is not necessarily going to be reflective of the amount of screen use that will be present after the pandemic has ended. In fact, I believe many will decrease their screen use after the pandemic, with some even going back to their pre-pandemic screen use time. The reason for this is that people will be more aware of the benefits and drawbacks of screen use after the pandemic. As a result of the pandemic, many switched to screen use for their work, social interactions, and other personal interests. This was in lieu of more traditional means of dealing with such occurrences in one's life, such as working with others on site. As a result to this transition of social distancing and working from home, many will learn that they operate better outside of the home, and through seeing people face to face. Remote work and social interactions through digital devices will be seen as a way to get things done, but not as a replacement for face to face interactions for everyone. In fact, many might only rely on remote work and their increased screen use due to personal obligation, and would distance themselves from such technology once it is safe to do so. Many are not comfortable working from home, and others don't enjoy their hobbies or even watching a movie with friends unless they are in the same room. Thus, I think people should not worry that screen use is significantly higher among people due to the pandemic, as the amount of screen time people do for school, work, and connecting with others will evidently decrease when people can safely meet with each other.\n\nWith that in mind, people ought to embrace the benefits that our digital devices provide. While many will not see such devices as a perfect substitute for in person interactions, I still think people will benefit from its use and widespread implementation. Digital devices allow us to keep in touch with our friends, family, and colleagues, through means such as text messaging, email, and video chat. These are great ways for many to converse with others quickly, to share information for work or personal reasons, and to share the content that we enjoy. In addition, digital devices allow us to learn from others, through the use of online courses, videos, and other educational content.\n",
        "source": "api",
        "start_time": 529.0,
        "end_time": 529.0,
        "last_event_time": 529.0,
        "start_progress": 0.8464317976513098,
        "end_progress": 0.8864799759108702
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\nI do not believe people ought to be worried about the amount of screen use that people engage with during the pandemic. The reason for this is that the amount of screen time that people engage with during the pandemic is not necessarily going to be reflective of the amount of screen use that will be present after the pandemic has ended. In fact, I believe many will decrease their screen use after the pandemic, with some even going back to their pre-pandemic screen use time. The reason for this is that people will be more aware of the benefits and drawbacks of screen use after the pandemic. As a result of the pandemic, many switched to screen use for their work, social interactions, and other personal interests. This was in lieu of more traditional means of dealing with such occurrences in one's life, such as working with others on site. As a result to this transition of social distancing and working from home, many will learn that they operate better outside of the home, and through seeing people face to face. Remote work and social interactions through digital devices will be seen as a way to get things done, but not as a replacement for face to face interactions for everyone. In fact, many might only rely on remote work and their increased screen use due to personal obligation, and would distance themselves from such technology once it is safe to do so. Many are not comfortable working from home, and others don't enjoy their hobbies or even watching a movie with friends unless they are in the same room. Thus, I think people should not worry that screen use is significantly higher among people due to the pandemic, as the amount of screen time people do for school, work, and connecting with others will evidently decrease when people can safely meet with each other.\n\nWith that in mind, people ought to embrace the benefits that our digital devices provide. While many will not see such devices as a perfect substitute for in person interactions, I still think people will benefit from its use and widespread implementation. Digital devices allow us to keep in touch with our friends, family, and colleagues, through means such as text messaging, email, and video chat. These are great ways for many to converse with others quickly, to share information for work or personal reasons, and to share the content that we enjoy. In addition, digital devices allow us to learn from others, through the use of online courses, videos, and other educational content, which may be difficult through more traditional means. People should not necessarily fear the technology available today, for they benefit others even if they use it less frequently than most. Many people have the means to implement digital devices in their life to gain benefits from them, and I \n",
        "source": "user",
        "start_time": 531.0,
        "end_time": 610.0,
        "last_event_time": 610.0,
        "start_progress": 0.8864799759108702,
        "end_progress": 0.9762119843420657
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\nI do not believe people ought to be worried about the amount of screen use that people engage with during the pandemic. The reason for this is that the amount of screen time that people engage with during the pandemic is not necessarily going to be reflective of the amount of screen use that will be present after the pandemic has ended. In fact, I believe many will decrease their screen use after the pandemic, with some even going back to their pre-pandemic screen use time. The reason for this is that people will be more aware of the benefits and drawbacks of screen use after the pandemic. As a result of the pandemic, many switched to screen use for their work, social interactions, and other personal interests. This was in lieu of more traditional means of dealing with such occurrences in one's life, such as working with others on site. As a result to this transition of social distancing and working from home, many will learn that they operate better outside of the home, and through seeing people face to face. Remote work and social interactions through digital devices will be seen as a way to get things done, but not as a replacement for face to face interactions for everyone. In fact, many might only rely on remote work and their increased screen use due to personal obligation, and would distance themselves from such technology once it is safe to do so. Many are not comfortable working from home, and others don't enjoy their hobbies or even watching a movie with friends unless they are in the same room. Thus, I think people should not worry that screen use is significantly higher among people due to the pandemic, as the amount of screen time people do for school, work, and connecting with others will evidently decrease when people can safely meet with each other.\n\nWith that in mind, people ought to embrace the benefits that our digital devices provide. While many will not see such devices as a perfect substitute for in person interactions, I still think people will benefit from its use and widespread implementation. Digital devices allow us to keep in touch with our friends, family, and colleagues, through means such as text messaging, email, and video chat. These are great ways for many to converse with others quickly, to share information for work or personal reasons, and to share the content that we enjoy. In addition, digital devices allow us to learn from others, through the use of online courses, videos, and other educational content, which may be difficult through more traditional means. People should not necessarily fear the technology available today, for they benefit others even if they use it less frequently than most. Many people have the means to implement digital devices in their life to gain benefits from them, and I believe that they should do so.\n",
        "source": "api",
        "start_time": 619.0,
        "end_time": 619.0,
        "last_event_time": 619.0,
        "start_progress": 0.9762119843420657,
        "end_progress": 0.985546522131888
    },
    {
        "text": "How Worried Should We Be About Screen Time During the Pandemic?\n\nThe coronavirus pandemic ended the screen time debate: Screens won. We all now find ourselves on our screens for school, for work and for connecting with family and friends during this time of social distancing and increased isolation.\n\nBut should we be worried about this excessive screen use right now? Or should we finally get over it and embrace the benefits of our digital devices?\n\n---\nI do not believe people ought to be worried about the amount of screen use that people engage with during the pandemic. The reason for this is that the amount of screen time that people engage with during the pandemic is not necessarily going to be reflective of the amount of screen use that will be present after the pandemic has ended. In fact, I believe many will decrease their screen use after the pandemic, with some even going back to their pre-pandemic screen use time. The reason for this is that people will be more aware of the benefits and drawbacks of screen use after the pandemic. As a result of the pandemic, many switched to screen use for their work, social interactions, and other personal interests. This was in lieu of more traditional means of dealing with such occurrences in one's life, such as working with others on site. As a result to this transition of social distancing and working from home, many will learn that they operate better outside of the home, and through seeing people face to face. Remote work and social interactions through digital devices will be seen as a way to get things done, but not as a replacement for face to face interactions for everyone. In fact, many might only rely on remote work and their increased screen use due to personal obligation, and would distance themselves from such technology once it is safe to do so. Many are not comfortable working from home, and others don't enjoy their hobbies or even watching a movie with friends unless they are in the same room. Thus, I think people should not worry that screen use is significantly higher among people due to the pandemic, as the amount of screen time people do for school, work, and connecting with others will evidently decrease when people can safely meet with each other.\n\nWith that in mind, people ought to embrace the benefits that our digital devices provide. While many will not see such devices as a perfect substitute for in person interactions, I still think people will benefit from its use and widespread implementation. Digital devices allow us to keep in touch with our friends, family, and colleagues, through means such as text messaging, email, and video chat. These are great ways for many to converse with others quickly, to share information for work or personal reasons, and to share the content that we enjoy. In addition, digital devices allow us to learn from others, through the use of online courses, videos, and other educational content, which may be difficult through more traditional means. People should not necessarily fear the technology available today, for they benefit others even if they use it less frequently than most. Many people have the means to implement digital devices in their life to gain benefits from them, and I believe that they should do so while moderating it with in person interactions.\n",
        "source": "user",
        "start_time": 621.0,
        "end_time": 637.0,
        "last_event_time": 637.0,
        "start_progress": 0.985546522131888,
        "end_progress": 1.0
    }
]