[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "The movie is a documentary of your next life, and you watch it as it unfolds.",
        "source": "user"
    },
    {
        "text": "Unfortunately, the movie is rather boring, and the other people around you seem to notice as well.",
        "source": "user"
    },
    {
        "text": "A couple of them are even texting each other on their smartphones.",
        "source": "user"
    },
    {
        "text": "You are bored out of your mind, and you can't wait for the movie to be over.",
        "source": "user"
    },
    {
        "text": "You decide to make conversation with the person sitting next to you.",
        "source": "user"
    },
    {
        "text": "He looks just like you, but is more fashionably dressed.",
        "source": "user"
    },
    {
        "text": "\"So, what do you think of the movie?\" you ask him.",
        "source": "user"
    },
    {
        "text": "\"I've been here for a few movies already.  This is actually one of the better ones\"",
        "source": "user"
    },
    {
        "text": "\"Are they all boring?\" you ask.",
        "source": "user"
    },
    {
        "text": "\"Mostly, but this one is a masterpiece compared to another one that I've seen\"",
        "source": "user"
    },
    {
        "text": "\"What was that one about?\" you ask.",
        "source": "api"
    },
    {
        "text": "\"Ugh, you don't even want to know\" he replies.",
        "source": "user"
    },
    {
        "text": "\"No, come on.  Tell me!\" you plead.",
        "source": "user"
    },
    {
        "text": "\"Well, it was about a guy who was born in a small town in the middle of nowhere, and he lived a very boring life\"",
        "source": "user"
    },
    {
        "text": "\"Hmm, I can almost sympathize with him\" you say.",
        "source": "user"
    },
    {
        "text": "\"Lots of people are born in small towns.  It isn't their fault\"",
        "source": "user"
    },
    {
        "text": "\"Yeah, but it gets worse.  You wouldn't believe some of the choices this guy made, or more correctly, the choices he didn't make.\"",
        "source": "api"
    },
    {
        "text": "\"So he never made it out of his small town, then, did he?\" you ask.",
        "source": "user"
    },
    {
        "text": "\"No, he never did\" your dapper counterpart replies, \"and it would have been so easy for him\".",
        "source": "user"
    },
    {
        "text": "\"Well, I lived in a small town\" you retort, \"it's not always easy to get away when there are no opportunities\".",
        "source": "user"
    },
    {
        "text": "\"Yeah, but this guy was a total loser.  And besides, we all have the same opportunity.  Didn't you get the message from us in childhood about following the white rabbit?  This guy in the movie saw that rabbit in the park, on the sidewalk, in his front yard, and he never followed it.  He just shook his head and went back to his desk.\"",
        "source": "user"
    },
    {
        "text": "\"You mean 'Alice in Wonderland'?\" you ask the well-dressed man",
        "source": "user"
    },
    {
        "text": "\"Yeah, we all got something like that in our lives.  Luckily, most of us figured out what it meant, and that's why we're here in the theater voluntarily.\"",
        "source": "user"
    },
    {
        "text": "\"I see\" you say to the man",
        "source": "user"
    },
    {
        "text": "\"By the way\" he asks you, \"what was the code phrase that they gave you when you first arrived?  You know, when they told you that you did everything right during your first life\"",
        "source": "user"
    },
    {
        "text": "You struggle to think of what to say, but as you try to speak, the movie ends with the character falling over at his desk.",
        "source": "user"
    },
    {
        "text": "\"Well that was almost as bad as the movie that played right before you arrived\" the well-dressed man snorts.",
        "source": "user"
    },
    {
        "text": "\"Ah well, when you live in heaven, sometimes it can be fun to visit the other side.\"  He then mutters some obscure code and disappears.",
        "source": "user"
    },
    {
        "text": "You try to get up, but realize that your muscles won't allow it.",
        "source": "user"
    },
    {
        "text": "Another movie starts playing.",
        "source": "user"
    },
    {
        "text": "It's another version of you on screen, at a desk just like yours.",
        "source": "user"
    },
    {
        "text": "You think you see a rabbit on his lawn, outside of his window, but he doesn't see it.",
        "source": "user"
    },
    {
        "text": "THE END",
        "source": "user"
    }
]