[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack.",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": "but pack your bags and call the number below.",
        "source": "api"
    },
    {
        "text": "It's time to start the real job.",
        "source": "api"
    },
    {
        "text": "\" Signed simply, \"JFK.",
        "source": "api"
    },
    {
        "text": "\"\n\nYou realize that this has to be a joke since it's signed JFK.",
        "source": "api"
    },
    {
        "text": "You want to get to the bottom of it and figure out who is messing around with you.",
        "source": "user"
    },
    {
        "text": "You go through your regular days routine and nothing is unusual at all.",
        "source": "user"
    },
    {
        "text": "The problem is, as the day goes on your curiosity gets the best of you.",
        "source": "user"
    },
    {
        "text": "You pick up the phone and call that number and a familiar voice picks up.",
        "source": "user"
    },
    {
        "text": "It sounds like JFK but that's obviously impossible.",
        "source": "user"
    },
    {
        "text": "He's been dead for decades.",
        "source": "user"
    },
    {
        "text": "The person on the other line tells you that he is John F Kennedy.",
        "source": "user"
    },
    {
        "text": "He was the President of the United States at one time.",
        "source": "user"
    },
    {
        "text": "You explain to him that that is impossible as JFK has been dead for over 25 years.",
        "source": "user"
    },
    {
        "text": "The person on the other line explains that the death was staged.",
        "source": "user"
    },
    {
        "text": "It wasn't even staged that well which is why there is the 2 shooter theory that we have seen on the internet previously.",
        "source": "user"
    },
    {
        "text": "You ask JFK some facts about his family and the country during his time of Presidency.",
        "source": "user"
    },
    {
        "text": "He answers every question accurately.",
        "source": "user"
    },
    {
        "text": "He explains that his families life was in danger.",
        "source": "user"
    },
    {
        "text": "JFK had gotten involved with the mob and they were threatening to expose him.",
        "source": "user"
    },
    {
        "text": "This would have led to him being in jail or worse.",
        "source": "user"
    },
    {
        "text": "Therefore he staged his own death to avoid consequences from the mob.",
        "source": "user"
    },
    {
        "text": "This allowed him to enter a highly discreet version of witness protection that is only viable for people with extremely high amounts of power and positioning.",
        "source": "user"
    },
    {
        "text": "You get to the bottom of it and ask JFK what exactly he needs from you.",
        "source": "user"
    },
    {
        "text": "You ask why he needs you to fly to him.",
        "source": "user"
    },
    {
        "text": "JFK explains that the purpose of you coming to visit him is to get off the grid as well.",
        "source": "user"
    },
    {
        "text": "JFK explains that he knows the stress that comes with being President of the United States.",
        "source": "user"
    },
    {
        "text": "He knows what it's like to always be in the limelight.",
        "source": "user"
    },
    {
        "text": "You think it over and explain to JFK while you greatly appreciate the offer, you think it's too risky.",
        "source": "user"
    },
    {
        "text": "You also don't want to blow up JFKs spot.",
        "source": "user"
    },
    {
        "text": "You politely decline and JFK tells you the offer is always on the table.",
        "source": "user"
    },
    {
        "text": "You all of a sudden wake up in a panic, turn and see your wife.",
        "source": "user"
    },
    {
        "text": "You run and look for the letter and phone number.",
        "source": "user"
    },
    {
        "text": "It's nowhere to be found.",
        "source": "user"
    },
    {
        "text": "Was this all just a dream?",
        "source": "user"
    }
]