[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "This is a tumultuous time for Dads everywhere because they have no idea how the ranking system works.",
        "source": "user"
    },
    {
        "text": "Some mugs can't even fit the numbers on them due to how many dads there are in the entire world.",
        "source": "user"
    },
    {
        "text": "All of the Dads, everywhere, collectively lose their minds.",
        "source": "user"
    },
    {
        "text": "They want to get to the bottom of it.",
        "source": "api"
    },
    {
        "text": "As the Dads try to figure out how they are ranked, more and more dads in the world realize their ranking isn't what they were.",
        "source": "user"
    },
    {
        "text": "Some dads don't even care and figure that the rankings are pointless anyway.",
        "source": "api"
    },
    {
        "text": "Eventually, a high ranking Dad realizes that the rankings are based on the number of kids that each dad has.",
        "source": "user"
    },
    {
        "text": "The dads all experience a sigh of relief, as the rankings don't have any actual meaning regarding how good of a Dad they actually are.",
        "source": "api"
    },
    {
        "text": "All the wives meet with their husbands and tell them how stupid the mugs are anyway.",
        "source": "user"
    },
    {
        "text": "The number isn't the important aspect of the mug.",
        "source": "user"
    },
    {
        "text": "The meaning behind the mug is what's important.",
        "source": "user"
    },
    {
        "text": "Most of these mugs are given to dad's by their children.",
        "source": "user"
    },
    {
        "text": "And as long as your child gifts you a #1 Dad mug, that's all that matters.",
        "source": "user"
    },
    {
        "text": "If your child considers you to be the best Dad in the world, simply put.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "nobody else's opinion matters at all.",
        "source": "user"
    },
    {
        "text": "We all strive to be the best parent that we can possibly be.",
        "source": "user"
    },
    {
        "text": "Getting that reaffirmation and love from our children means everything.",
        "source": "user"
    },
    {
        "text": "The Dads learned a lesson because of the changing of the mugs.",
        "source": "user"
    },
    {
        "text": "They all realized that at the end of the day, rankings don't matter.",
        "source": "user"
    },
    {
        "text": "Your family and your children matter.",
        "source": "user"
    },
    {
        "text": "Prioritize them at all times.",
        "source": "user"
    }
]