[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "Unfortunately, however, this power is not enough to defeat the invaders.",
        "source": "user"
    },
    {
        "text": "The old power that reawakens does so in little spurts and it is hardly enough to overcome the hostile aliens.",
        "source": "user"
    },
    {
        "text": "However, these spurts are enough to cause all sorts of things to change-including the abilities of those who possess it.",
        "source": "user"
    },
    {
        "text": "This means that the people who have Mana suddenly feel an onset of odd physical and mental symptoms, including loss of memory, hallucinations, and strange abilities.",
        "source": "user"
    },
    {
        "text": "In their weakened state, people who have Mana are of no use against the hostile aliens.",
        "source": "user"
    },
    {
        "text": "As a result, the survivors who possess Mana are sent out into space to be what they call \"Watchers\" of the Earth.",
        "source": "user"
    },
    {
        "text": "Their sole job is to radio back to Earth when they sense a threat to the people on Earth, regardless of whether that threat is coming from within the Earth's galaxy or outside of it.",
        "source": "user"
    },
    {
        "text": "Meanwhile, all the other humans are left on Earth to try to fend for themselves.",
        "source": "user"
    },
    {
        "text": "Their attempts are at first futile, because their counterattacks are so few and so disorganized, but the humans soon discover that they possess other strengths.",
        "source": "user"
    },
    {
        "text": "For example, the women are now able to give birth to girls twice as frequently as before, and the men are able to produce much more sperm.",
        "source": "user"
    },
    {
        "text": "This produces a population boom.",
        "source": "user"
    },
    {
        "text": "As a result, the human race becomes much stronger as there is strength in numbers.",
        "source": "user"
    },
    {
        "text": "The aliens then launch a last-ditch attempt to destroy the humans on Earth, but this too ends fail as the humans fight back with considerable strength.",
        "source": "user"
    },
    {
        "text": "Once humans have successfully defended themselves on Earth, they send a radio signal up to the Watchers of the Earth to let them know that they can come back down.",
        "source": "user"
    },
    {
        "text": "Interestingly, the Watchers of the Earth do not come down immediately and that is because of their loss of memory and hallucinations.",
        "source": "user"
    },
    {
        "text": "Upon receiving the radio signal directing them to return to Earth, the Watchers promptly forget it.",
        "source": "user"
    },
    {
        "text": "And later, when the radio signal comes through with the same instruction again, the Watchers of the Earth end up hallucinating that the radio signal was falsely sent.",
        "source": "user"
    },
    {
        "text": "So as a result, the Watchers spend an additional year watching over the Earth even though they are not actually doing anything productive with their time as there are no threats remaining against the humans on Earth.",
        "source": "user"
    },
    {
        "text": "When the Watchers finally return back to Earth, they are greeted with less fanfare than they would have expected.",
        "source": "user"
    },
    {
        "text": "They realize that the attacks from the aliens ended a year ago and feel dumb for having failed to heed the first radio signal.",
        "source": "user"
    },
    {
        "text": "However, they are still recognized as an important component of the effort to save the humans, and for this they are bestowed medals.",
        "source": "user"
    },
    {
        "text": "The Watchers feel proud to have contributed to the effort.",
        "source": "user"
    }
]