[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "Things are getting real.",
        "source": "api"
    },
    {
        "text": "Dads realize they are being watched and they are being judged.",
        "source": "user"
    },
    {
        "text": "Moms see dads starting to do more things for their children.",
        "source": "user"
    },
    {
        "text": "Men have always been very competitive and this new ranking has them very motivated.",
        "source": "user"
    },
    {
        "text": "Men begin to get more involved than ever.",
        "source": "api"
    },
    {
        "text": "Women feel resentful for the years they have worked without the involvement of dads.",
        "source": "user"
    },
    {
        "text": "They realize dads could have been doing better all along if they had cared.",
        "source": "user"
    },
    {
        "text": "It turned out it is not a love of a woman that makes a dad care or even the love of a child.",
        "source": "user"
    },
    {
        "text": "What makes a man care is his competitive nature.",
        "source": "user"
    },
    {
        "text": "He wants to win.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": "he wants the top spot.",
        "source": "api"
    },
    {
        "text": "Women are they glad they at least now truly understand men's motivations.",
        "source": "user"
    },
    {
        "text": "Dads now have an opportunity to become more involved than ever and prove that they love their family.",
        "source": "user"
    },
    {
        "text": "They really need to work had to regain the respect of women too.",
        "source": "user"
    },
    {
        "text": "They will need to work even harder because they have a lot of making up to do.",
        "source": "api"
    },
    {
        "text": "No one saw this ranking system coming but it really turned out to be a good thing.",
        "source": "user"
    },
    {
        "text": "Men are doing more and loving it.",
        "source": "user"
    },
    {
        "text": "They see how rewarding it is to be involved with children.",
        "source": "user"
    },
    {
        "text": "More men become teachers and nurses and nannies.",
        "source": "user"
    },
    {
        "text": "There is a lot more equality and gender roles become more diverse.",
        "source": "user"
    },
    {
        "text": "If only someone had started this ranking long ago!",
        "source": "user"
    },
    {
        "text": "The world would be a much better place.",
        "source": "user"
    },
    {
        "text": "But not with dads being more accountable it is well on its way.",
        "source": "user"
    },
    {
        "text": "The children and women are really happy.",
        "source": "user"
    }
]