[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "Wouldn't that cause mayhem.",
        "source": "user"
    },
    {
        "text": "dad's are so darn competitive.",
        "source": "user"
    },
    {
        "text": "They would be trying to influence the ranking with charm, power, and money.",
        "source": "user"
    },
    {
        "text": "Most dads, anyway.",
        "source": "user"
    },
    {
        "text": "But what is a Dad?",
        "source": "user"
    },
    {
        "text": "There are as many definitions are there are dads.",
        "source": "api"
    },
    {
        "text": "In today's society, dad's are almost on an even keel with moms.",
        "source": "user"
    },
    {
        "text": "They provide, nourish, educate, and spend time with their offspring.",
        "source": "user"
    },
    {
        "text": "There are also many types of dad's including step dads, gay dads, single dads, and granddads.",
        "source": "user"
    },
    {
        "text": "Their roles are quite essential in the raising of children.",
        "source": "user"
    },
    {
        "text": "The better ones keep a sense of humor, spend time listening to their children, and model respect and kindness.",
        "source": "user"
    },
    {
        "text": "Back to the mug rankings, in a society that swipes right or left, it is hard to pinpoint what makes someone the best or of a high ranking.",
        "source": "user"
    },
    {
        "text": "The best parents are what their children need because that is how individualized relationships need to be.",
        "source": "user"
    },
    {
        "text": "There are no two people or relationships that are the same.",
        "source": "user"
    },
    {
        "text": "To girls, a dad needs to portray the behaviors that the girl deserves.",
        "source": "user"
    },
    {
        "text": "She learns how to be treated by a man.",
        "source": "user"
    },
    {
        "text": "To boys, a dad needs to portary the behaviors that he wants his girls to receive.",
        "source": "user"
    },
    {
        "text": "Rankings.",
        "source": "user"
    },
    {
        "text": "Oh rankings.",
        "source": "user"
    },
    {
        "text": "They are a farce.",
        "source": "user"
    },
    {
        "text": "Nothing should be ranked.",
        "source": "user"
    },
    {
        "text": "Rankings are for the superficial.",
        "source": "user"
    }
]