[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "\"Maybe it was the hair?\" he asked himself.",
        "source": "user"
    },
    {
        "text": "He watched in the mirror as his hair changed from black to brown, lingering a moment before cycling through several hair styles and colors at double speed.",
        "source": "user"
    },
    {
        "text": "His face was unmoved as his hair changed from a short, tight cut, to long black bangs that obscured his eyes.",
        "source": "user"
    },
    {
        "text": "He stopped on this selection, whipping the hair out of his eyes.",
        "source": "user"
    },
    {
        "text": "\"You're getting much better at this,\" he said, giving himself a smile.",
        "source": "user"
    },
    {
        "text": "\"Was she intimidated by the army guy look?\"",
        "source": "user"
    },
    {
        "text": "He shifted his torso from its tall chiseled towards a more modest, modern athletic dad.",
        "source": "user"
    },
    {
        "text": "He briefly poked the slight love handles that had developed around his waist.",
        "source": "user"
    },
    {
        "text": "BEEP BEEP BEEP",
        "source": "user"
    },
    {
        "text": "He spun around and stopped the alarm clock.",
        "source": "user"
    },
    {
        "text": "It was time to go.",
        "source": "user"
    },
    {
        "text": "---",
        "source": "user"
    },
    {
        "text": "He arrived at the bar.",
        "source": "api"
    },
    {
        "text": "It was full of hipsters; the kind that dressed up in thrift-store clothes and called themselves 'retro'.",
        "source": "api"
    },
    {
        "text": "He scanned the venue looking for her.",
        "source": "user"
    },
    {
        "text": "When his eyes alighted on her, his breath caught in his throat.",
        "source": "user"
    },
    {
        "text": "She wore a glittery blue top that stood out in the low light.",
        "source": "user"
    },
    {
        "text": "Her hair was long and black, but the blue garment brought out some reddish highlights.",
        "source": "user"
    }
]