[
    {
        "text": "Humans once wielded formidable magical power.",
        "source": "api"
    },
    {
        "text": "But with over 7 billion of us on the planet now, Mana has spread far too thinly to have any effect.",
        "source": "api"
    },
    {
        "text": "When hostile aliens reduce humanity to a mere fraction, the survivors discover an old power has begun to reawaken once again.",
        "source": "api"
    },
    {
        "text": "The city of Atlanta has become a battleground for the survival of the human race.",
        "source": "user"
    },
    {
        "text": "Obtaining Mana is the only way to ensure the survival of the people.",
        "source": "user"
    },
    {
        "text": "Now, three young students discover a secret that may change everything.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": "They discover the Mana Cave.",
        "source": "user"
    },
    {
        "text": "The Mana Cave is the original source of all Mana.",
        "source": "user"
    },
    {
        "text": "Not only does it store infinite amounts of Mana, but simply being near the cave makes any person stronger and superior.",
        "source": "user"
    },
    {
        "text": "The Mana Cave is the key to victory.",
        "source": "user"
    },
    {
        "text": "The cave is protected by a magical seal that only allows people of the purest hearts and truest intentions to enter.",
        "source": "api"
    },
    {
        "text": "Many have fallen by trying to enter the cave.",
        "source": "user"
    },
    {
        "text": "And those who have made it inside have never returned.",
        "source": "user"
    },
    {
        "text": "No one knows just how much Mana is inside because no one exits the cave once inside.",
        "source": "user"
    },
    {
        "text": "It is full of legends and lore.",
        "source": "user"
    },
    {
        "text": "Some believe the cave is a myth.",
        "source": "user"
    },
    {
        "text": "The only way to prove its existence is to enter the cave and return to the outside world with evidence.",
        "source": "user"
    },
    {
        "text": "This is what the three friends have set out to do.",
        "source": "user"
    },
    {
        "text": "They are determined to make it into the cave and back out alive.",
        "source": "user"
    },
    {
        "text": "They succeed in entering the cave.",
        "source": "user"
    },
    {
        "text": "But they quickly discover that the cave is more than what it seems.",
        "source": "user"
    },
    {
        "text": "Right from the beginning, it seemed like forces of nature were playing with them.",
        "source": "user"
    },
    {
        "text": "But once they enter the cave, things change.",
        "source": "user"
    },
    {
        "text": "Walls seemed to change shape, and lights would appear and then disappear.",
        "source": "user"
    },
    {
        "text": "Soon they find themselves in a mysterious place and realize they are not alone.",
        "source": "user"
    },
    {
        "text": "They heard voices telling them where to go.",
        "source": "user"
    },
    {
        "text": "They didn't know if they should trust the voices, but they had no other choice.",
        "source": "user"
    },
    {
        "text": "They were lost.",
        "source": "user"
    },
    {
        "text": "The friends find themselves at a place known as the Throne Room.",
        "source": "user"
    },
    {
        "text": "The throne in the middle of the room is empty.",
        "source": "user"
    },
    {
        "text": "But then, the throne begins to shake and a light fills the room.",
        "source": "user"
    },
    {
        "text": "From the light comes a loud, booming voice.",
        "source": "user"
    },
    {
        "text": "It said, \"I am the guardian of this cave. Are you here to guard the cave?\"",
        "source": "user"
    },
    {
        "text": "\"No,\" the three friends replied.",
        "source": "api"
    },
    {
        "text": "\"We were just exploring.\"",
        "source": "user"
    },
    {
        "text": "\"You are not here to guard the cave?\" the voice said.",
        "source": "api"
    },
    {
        "text": "\"We are in need of someone new to watch over the cave. If not you, then who?\"",
        "source": "user"
    },
    {
        "text": "Without hesitation, one of the friends stepped forward.",
        "source": "api"
    },
    {
        "text": "He removed his helmet valiantly and said, \"If the cave needs a guard, then I'm not leaving.\"",
        "source": "user"
    },
    {
        "text": "The other two friends were shocked and scared.",
        "source": "api"
    },
    {
        "text": "They knew this was a bad idea.",
        "source": "user"
    },
    {
        "text": "But now they all had noble jobs, which is worth more than anything they hoped to find inside the Mana Cave.",
        "source": "user"
    }
]