[
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.1733816206428248
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, schools should be required to provide free tampons and pads to students in a discreet way that isn't embarrassing for the students themselves.\n\nI am a male so I don't know how young girls feel about this topic and ultimately their opinion is the only one that really matters. I haven't experienced period shaming or period poverty in any way as I don't have children either. \n\nI don't see any reason why tampons or pads should be treated differently than toilet paper. They are all personal hygiene items that should be provided for students. \n\nThe one difference that I see with regards to these items and items such as toilet paper, paper towels, etc is it's probably very embarrassing for girls in school to be seen with these items or have to ask for them. Why that is, again I'm not really sure as I'm not a woman.\n\nBut these girls and their feelings should be taken into account and prioritized. Hence why before I said the schools should provide these items discreetly so no female student has to feel embarrassed. \n\nI think ultimately schools need to step up. School is supposed to be a safe space for children. Maybe their can be meetings about this topic where only females are allowed to attend. I can totally understand why females talking to males about this subject would be embarrassing nor would males really understand.\n\nIf a student's family can't afford pads or tampons, the school should provide them. That's the least they can do with the tax money that they receive from each family, especially if it will add comfort to a student's experience while at the school. \n\nOnce again, I am a male and I am not going to pretend like my answers are valid when it comes to women's issues.  And that is also why in reality, only women should be consulted about this issue. Their opinions are the ones that matter.\n",
        "source": "user",
        "start_time": 33.0,
        "end_time": 562.0,
        "last_event_time": 562.0,
        "start_progress": 0.1733816206428248,
        "end_progress": 1.0
    }
]