[
    {
        "text": "When you die, you appear in a cinema with a number of other people who look like you.",
        "source": "api"
    },
    {
        "text": "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
        "source": "api"
    },
    {
        "text": "You see yourself living a good life.",
        "source": "api"
    },
    {
        "text": "You see yourself taking your family to a nice restaurant and enjoying a good meal.",
        "source": "api"
    },
    {
        "text": "Then, you are at your big house in the suburbs watching the evening news when your wife runs into the living room, panicked.",
        "source": "user"
    },
    {
        "text": "\"I can't find Jennifer,\" she screams.",
        "source": "user"
    },
    {
        "text": "\"She was outside playing and now she's not\".",
        "source": "user"
    },
    {
        "text": "You watch yourself on screen jumping up and running outside while your wife calls 911.",
        "source": "user"
    },
    {
        "text": "Your daughter Jennifer is 6 years old and you can't find her anywhere.",
        "source": "user"
    },
    {
        "text": "The police are there within minutes, but there is no trace of her.",
        "source": "api"
    },
    {
        "text": "You look around the theater, feeling the panic of what is unfolding in your next life.",
        "source": "user"
    },
    {
        "text": "The other yous in the theater are watching and look at you, sympathetic.",
        "source": "user"
    },
    {
        "text": "You are new to this, as this is the first time you've been through this process.",
        "source": "user"
    },
    {
        "text": "\"Pause the movie,\" you yell, and the movie pauses, your wife's panicked face frozen on the screen.",
        "source": "user"
    },
    {
        "text": "\"Can I stop this?\" you ask.",
        "source": "user"
    },
    {
        "text": "At first no one says anything.",
        "source": "user"
    },
    {
        "text": "Then one of you speaks, \"You can change your next life if you want, but it will be the last time, at least for this round.\"  He goes on to explain that every last life can make one change to the next life.",
        "source": "user"
    },
    {
        "text": "Usually, everyone gives advise as to what change should be made after the movie is over.",
        "source": "user"
    },
    {
        "text": "\"The problem,\" he says, \"is that when you make a change at the end of the movie, you won't know how things will turn out after the change.  The movie will only play once.\"",
        "source": "user"
    },
    {
        "text": "The movie starts again, and you watch as this one event impacts your life.",
        "source": "user"
    },
    {
        "text": "Your daughter is never found.",
        "source": "user"
    },
    {
        "text": "The years pass, you and your wife split up as you both deal with the tragedy differently.",
        "source": "user"
    },
    {
        "text": "You turn to alcohol, your other children don't want to be around you.",
        "source": "user"
    },
    {
        "text": "And you have an overwhelming sadness and guilt weighing you down.",
        "source": "user"
    },
    {
        "text": "You couldn't protect your daughter.",
        "source": "user"
    },
    {
        "text": "There are a lot of things you could change, but when the movie is over and you talk about it with the other yous, you decide that you are going to change your daughter's abduction.",
        "source": "user"
    },
    {
        "text": "You will move so that she is not in that place at that time to be taken from you.",
        "source": "api"
    },
    {
        "text": "You wish you could see this play out in the movie, but rules are rules.",
        "source": "user"
    },
    {
        "text": "The decision is made and everyone but you leaves the theater.",
        "source": "user"
    },
    {
        "text": "You stay in place, having been told that you will be reborn within the next ten minutes, so you sit and wait and hope.",
        "source": "user"
    }
]