[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?\"  I wonder \"What was in that Kool Aid I had a few minutes ago?\".",
        "source": "api"
    },
    {
        "text": "I freeze in place.",
        "source": "user"
    },
    {
        "text": "I hope my rigid posture indicates to those around that something is wrong.",
        "source": "user"
    },
    {
        "text": "I want to check my pocket for my Epi Pen but I'm afraid any movement might cause the bee to sting me.",
        "source": "user"
    },
    {
        "text": "The Epi Pen will save my life but being stung is a frightful thing for me.",
        "source": "user"
    },
    {
        "text": "I'm a little boy again, watching my father die from a bee sting.",
        "source": "api"
    },
    {
        "text": "It's hot.",
        "source": "user"
    },
    {
        "text": "Sweat trickles all over me including into my eyes.",
        "source": "user"
    },
    {
        "text": "Still, I remain immobile.",
        "source": "user"
    },
    {
        "text": "Jeez, it seems like hours I've been standing here.",
        "source": "user"
    },
    {
        "text": "Why doesn't this bee take off and go find some sweet flower to sip from?",
        "source": "user"
    },
    {
        "text": "I'm not a flower, I'm a human being!",
        "source": "api"
    },
    {
        "text": "I can see the bee out of the corner of my eye.",
        "source": "user"
    },
    {
        "text": "It's sitting there just as pretty as you please as if it has a right to be there.",
        "source": "user"
    },
    {
        "text": "Fly away, fly away I think to myself, that's why you have wings!",
        "source": "user"
    },
    {
        "text": "I'm very hot and very tired and I want to go inside.",
        "source": "user"
    },
    {
        "text": "I want to be anywhere else but here with this dratted bee.",
        "source": "user"
    },
    {
        "text": "I'm becoming afraid that standing here much longer in the full sun in this heat will make me pass out.",
        "source": "user"
    },
    {
        "text": "If the bee then stings me I won't be conscious to inject with the Epi Pen.",
        "source": "user"
    },
    {
        "text": "I look around without moving my head to see who else is around who is in the know about my allergy.",
        "source": "user"
    },
    {
        "text": "I don't see anyone.",
        "source": "user"
    },
    {
        "text": "Hobson's choice here, move and risk a sting, stand still and risk a sting and be in no shape to save myself.",
        "source": "user"
    },
    {
        "text": "Which choice should I make?",
        "source": "user"
    },
    {
        "text": "What would you do?",
        "source": "user"
    }
]