[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?",
        "source": "api"
    },
    {
        "text": "\" You look down and see a bee in a suit and tie.",
        "source": "api"
    },
    {
        "text": "\"Little bee, please don't sting me,\" I said.",
        "source": "api"
    },
    {
        "text": "\"I'm allergic and I will swell like a balloon if you do.",
        "source": "user"
    },
    {
        "text": "\" \n\n\"I'm not going to sting you, Your Majesty,\" the bee said.",
        "source": "user"
    },
    {
        "text": "\"Well then tell me, what do you want?",
        "source": "api"
    },
    {
        "text": "\", I asked the bee.",
        "source": "user"
    },
    {
        "text": "\"I'm here to help you with your duties as a queen,\" the bee said.",
        "source": "user"
    },
    {
        "text": "So as it turned out, this bee and all of his friends had decided to make me their queen.",
        "source": "api"
    },
    {
        "text": "They said I was the only one who could save them from the evil queen who was trying to take over the hive.",
        "source": "user"
    },
    {
        "text": "Since this bee was nice and didn't sting me, I was eager to help.",
        "source": "api"
    },
    {
        "text": "I agreed to be their queen.",
        "source": "user"
    },
    {
        "text": "I had quite the task of finding this evil queen so that I could destroy her.",
        "source": "api"
    },
    {
        "text": "I had to go through a lot of obstacles to get to her, but I was determined to save my hive.",
        "source": "user"
    },
    {
        "text": "My first obstacle was a giant spider web.",
        "source": "api"
    },
    {
        "text": "I used a stick and I got the spider web out of the way of the hive.",
        "source": "api"
    },
    {
        "text": "My second obstacle was a giant bear.",
        "source": "user"
    },
    {
        "text": "Apparently he wanted the honey made by the bees and didn't want to hurt me.",
        "source": "user"
    },
    {
        "text": "I told the bear I was just after the evil queen and I wouldn't take any of the honey so he let me go.",
        "source": "user"
    },
    {
        "text": "I told the bear if he would help me, I bet the bees would give him some honey and the little bee in the suit agreed.",
        "source": "user"
    },
    {
        "text": "So the bear agreed to help me catch the evil queen.",
        "source": "user"
    },
    {
        "text": "The third obstacle was a giant snake.",
        "source": "user"
    },
    {
        "text": "It was guarding the queen just outside of the hive.",
        "source": "api"
    },
    {
        "text": "The bear helped me defeat the snake.",
        "source": "user"
    },
    {
        "text": "I was so glad because I couldn't have done it alone.",
        "source": "user"
    },
    {
        "text": "Finally we saw the queen bee and she was bigger than the other bees.",
        "source": "user"
    },
    {
        "text": "She had a crown on her head and a scepter in her hand.",
        "source": "user"
    },
    {
        "text": "To my surprise, the bear picked her up and ate her.",
        "source": "api"
    },
    {
        "text": "The evil queen was destroyed.",
        "source": "user"
    },
    {
        "text": "I magically turned into a bee and lived my life as their queen and we all lived happily ever after.",
        "source": "user"
    }
]