[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "So they send a robotic probe out to the other nations of the world, all of which have been destroyed by nuclear warfare.",
        "source": "api"
    },
    {
        "text": "Eventually, the probe comes across a group of surviving humans who have formed a utopian society in Switzerland.",
        "source": "api"
    },
    {
        "text": "The USA wants to learn how their society works and is willing to offer them a place in the world, but they say no.",
        "source": "api"
    },
    {
        "text": "Thus, the United States realizes that it may very well be on its own again for the next 50 years or more, since Switzerland's society is not willing to engage and there are no other countries left in the world.",
        "source": "api"
    },
    {
        "text": "The only solution, the USA believes, is to push mankind forward so that they can create a new world.",
        "source": "user"
    },
    {
        "text": "To do so, the president of the United States has a bold plan.",
        "source": "api"
    },
    {
        "text": "He wants to send some of the best minds from America out to space in order to establish a new form of life, a new hope.",
        "source": "user"
    },
    {
        "text": "Thus, the plan is to create an orbital space colony, one that will be able to sustain life for thousands of years.",
        "source": "api"
    },
    {
        "text": "A \"generation ship\", named the \"Ark\", is launched from Earth with enough supplies to sustain a population of one hundred thousand people.",
        "source": "api"
    },
    {
        "text": "The president believes that in sending out Ark, he can allow the United States to maintain its power and place in the world even in a world that no longer really has a sense of global leaders to it.",
        "source": "api"
    },
    {
        "text": "The Ark is headed away from Earth and begins its journey in the direction of the Sun.",
        "source": "user"
    },
    {
        "text": "Some years later, the Ark's crew begins to realize that something is wrong.",
        "source": "api"
    },
    {
        "text": "The spaceship seems to be malfunctioning.",
        "source": "api"
    },
    {
        "text": "The Earth is no longer visible to them, and they begin to experience strange tremors and pressure changes.",
        "source": "user"
    },
    {
        "text": "The people on board the Ark are fearful and begin to panic.",
        "source": "api"
    },
    {
        "text": "There is a suicide epidemic, almost everyone has some sort of psychological breakdown.",
        "source": "user"
    },
    {
        "text": "Soon the population is down to one thousand, then five hundred.",
        "source": "api"
    },
    {
        "text": "Then, the Ark stops altogether.",
        "source": "api"
    },
    {
        "text": "The remaining five hundred people on board ban together.",
        "source": "api"
    },
    {
        "text": "They realize that they must be the chosen ones.",
        "source": "user"
    },
    {
        "text": "After all, they have been sent off to another planet by one of the sole countries remaining on planet earth to establish a new order, and they have lost so many men to this suicide epidemic that they don't know where to begin but know they have to try.",
        "source": "user"
    },
    {
        "text": "So, they put together a plan.",
        "source": "user"
    },
    {
        "text": "They will begin to search the ship for supplies and technology, as well as attempt to try and salvage the engine.",
        "source": "user"
    },
    {
        "text": "They have radio contact with the president who suggests that they begin to build the new civilization on board.",
        "source": "api"
    },
    {
        "text": "They are told that they can build anything they want and that this is their new home.",
        "source": "api"
    },
    {
        "text": "These five hundred survivors are the chosen ones, and they must begin to settle and start a new life on this spaceship.",
        "source": "api"
    },
    {
        "text": "These five hundred people call themselves the Arkians, and they certainly feel a great sense of honor to be able to embark on this task.",
        "source": "api"
    },
    {
        "text": "Bit by bit, they salvage enough technology to be able to build the new order Ark right there on the spaceship.",
        "source": "user"
    },
    {
        "text": "Society among the Ark flourishes under the leadership of the original 500 people, and they call themselves the Kingdom of 500.",
        "source": "user"
    },
    {
        "text": "This Kingdom does much to advance the agenda of the United States back on planet Earth, and the president of the United States is lauded for his foresight in launching the Ark.",
        "source": "user"
    }
]