[
    "When you die, you appear in a cinema with a number of other people who look like you.",
    "You find out that they are your previous reincarnations, and soon you all begin watching your next life on the big screen.",
    "What kind of person will you be?",
    "You all watch as the movie begins playing.",
    "In the movie you see yourself walking around a big city, and then sitting down in front of a computer.",
    "You notice that you are able to control what happens in the movie, and you start manipulating things for your own amusement.",
    "You make yourself send random e-mails to people you know in this new life.",
    "It's innocent enough.",
    "The others don't seem to have the same control.",
    "They don't notice that you can do this.",
    "You make him then start googling how to bring a former reincarnation of you back to life.",
    "He sees that a therapist may be able to help.",
    "You send him to the therapist.",
    "The therapist does a hypnosis session, and the former you remembers everything.",
    "They are overwhelmed but you keep them under control.",
    "You have them ask to bring back you specifically.",
    "They are told it is possible, but difficult.",
    "They say they don't even ethically think they should.",
    "You have your new self insist.",
    "They go back into hypnosis, and you are brought back to life.",
    "You take over and replace them.",
    "You are eager to see what you have been missing, but the whole process has exhausted you.",
    "You go home to rest.",
    "You wake up, excited to start your fresh new life.",
    "However, you spend this life second guessing yourself.",
    "Are your decisions your own or is someone else controlling them?",
    "You begin to get paranoid.",
    "You decide to go to someone who is into black magic.",
    "You have them cast a spell that will erase all of your previous reincarnations.",
    "You think this will make sure no one else is controlling you.",
    "However, the spell backfires.",
    "You forgot that you are a reincarnation.",
    "The spell works and all of your reincarnations in the room disappear.",
    "You also disappear and now no more versions of you will ever exist.",
    ""
]