[
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\"",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 0.0,
        "end_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.07054673721340388
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 5.0,
        "end_time": 23.0,
        "start_progress": 0.07054673721340388,
        "end_progress": 0.1000251952632905
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 35.0,
        "end_time": 35.0,
        "start_progress": 0.1000251952632905,
        "end_progress": 0.12043335852859663
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 36.0,
        "end_time": 44.0,
        "start_progress": 0.12043335852859663,
        "end_progress": 0.13403880070546736
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 49.0,
        "end_time": 49.0,
        "start_progress": 0.13403880070546736,
        "end_progress": 0.16301335348954396
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 50.0,
        "end_time": 51.0,
        "start_progress": 0.16301335348954396,
        "end_progress": 0.16603678508440414
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 56.0,
        "end_time": 56.0,
        "start_progress": 0.16603678508440414,
        "end_progress": 0.17384731670445955
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 57.0,
        "end_time": 59.0,
        "start_progress": 0.17384731670445955,
        "end_progress": 0.17787855883093978
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 57.0,
        "end_time": 72.0,
        "start_progress": 0.17787855883093978,
        "end_progress": 0.1962711010330058
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 76.0,
        "end_time": 76.0,
        "start_progress": 0.1962711010330058,
        "end_progress": 0.20559334845049132
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 77.0,
        "end_time": 80.0,
        "start_progress": 0.20559334845049132,
        "end_progress": 0.2126480221718317
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 84.0,
        "end_time": 84.0,
        "start_progress": 0.2126480221718317,
        "end_progress": 0.22423784328546234
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 85.0,
        "end_time": 88.0,
        "start_progress": 0.22423784328546234,
        "end_progress": 0.22978080120937264
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 93.0,
        "end_time": 93.0,
        "start_progress": 0.22978080120937264,
        "end_progress": 0.23733938019652306
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 94.0,
        "end_time": 95.0,
        "start_progress": 0.23733938019652306,
        "end_progress": 0.24061476442428822
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 100.0,
        "end_time": 100.0,
        "start_progress": 0.24061476442428822,
        "end_progress": 0.2494331065759637
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 101.0,
        "end_time": 111.0,
        "start_progress": 0.2494331065759637,
        "end_progress": 0.26631393298059963
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 116.0,
        "end_time": 116.0,
        "start_progress": 0.26631393298059963,
        "end_progress": 0.2690854119425548
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 121.0,
        "end_time": 123.0,
        "start_progress": 0.2690854119425548,
        "end_progress": 0.2751322751322751
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 129.0,
        "end_time": 130.0,
        "start_progress": 0.2751322751322751,
        "end_progress": 0.2836986646510456
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 130.0,
        "end_time": 132.0,
        "start_progress": 0.2836986646510456,
        "end_progress": 0.2892416225749559
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 137.0,
        "end_time": 137.0,
        "start_progress": 0.2892416225749559,
        "end_progress": 0.30209120685311164
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 149.0,
        "end_time": 158.0,
        "start_progress": 0.30209120685311164,
        "end_progress": 0.3126732174351222
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 167.0,
        "end_time": 167.0,
        "start_progress": 0.3126732174351222,
        "end_progress": 0.32451499118165783
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 169.0,
        "end_time": 173.0,
        "start_progress": 0.32451499118165783,
        "end_progress": 0.3320735701688083
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 177.0,
        "end_time": 177.0,
        "start_progress": 0.3320735701688083,
        "end_progress": 0.3368606701940035
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 178.0,
        "end_time": 181.0,
        "start_progress": 0.3368606701940035,
        "end_progress": 0.3429075333837239
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 178.0,
        "end_time": 195.0,
        "start_progress": 0.3429075333837239,
        "end_progress": 0.35575711766187956
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 198.0,
        "end_time": 198.0,
        "start_progress": 0.35575711766187956,
        "end_progress": 0.36482741244646005
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 204.0,
        "end_time": 204.0,
        "start_progress": 0.36482741244646005,
        "end_progress": 0.3829680020156211
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 205.0,
        "end_time": 211.0,
        "start_progress": 0.3829680020156211,
        "end_progress": 0.39531368102796677
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 215.0,
        "end_time": 215.0,
        "start_progress": 0.39531368102796677,
        "end_progress": 0.39909297052154197
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 222.0,
        "end_time": 236.0,
        "start_progress": 0.39909297052154197,
        "end_progress": 0.4200050390526581
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 240.0,
        "end_time": 240.0,
        "start_progress": 0.4200050390526581,
        "end_progress": 0.4411690602166793
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 241.0,
        "end_time": 246.0,
        "start_progress": 0.4411690602166793,
        "end_progress": 0.45729402872260017
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 250.0,
        "end_time": 251.0,
        "start_progress": 0.45729402872260017,
        "end_progress": 0.45930964978584027
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 251.0,
        "end_time": 251.0,
        "start_progress": 0.45930964978584027,
        "end_progress": 0.46056941295036535
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 254.0,
        "end_time": 254.0,
        "start_progress": 0.46056941295036535,
        "end_progress": 0.46258503401360546
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 256.0,
        "end_time": 261.0,
        "start_progress": 0.46258503401360546,
        "end_progress": 0.46510456034265557
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know...",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 266.0,
        "end_time": 266.0,
        "start_progress": 0.46510456034265557,
        "end_progress": 0.46938775510204084
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 269.0,
        "end_time": 291.0,
        "start_progress": 0.46938775510204084,
        "end_progress": 0.509448223733938
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 295.0,
        "end_time": 295.0,
        "start_progress": 0.509448223733938,
        "end_progress": 0.5288485764676241
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 296.0,
        "end_time": 308.0,
        "start_progress": 0.5288485764676241,
        "end_progress": 0.5527840765936004
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 315.0,
        "end_time": 315.0,
        "start_progress": 0.5527840765936004,
        "end_progress": 0.562106324011086
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 316.0,
        "end_time": 321.0,
        "start_progress": 0.562106324011086,
        "end_progress": 0.5676492819349962
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 325.0,
        "end_time": 325.0,
        "start_progress": 0.5676492819349962,
        "end_progress": 0.5699168556311414
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at favorite restaurant, but you didn't tell her because you wanted to surprise her.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 333.0,
        "end_time": 337.0,
        "start_progress": 0.5699168556311414,
        "end_progress": 0.5968757873519779
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 337.0,
        "end_time": 341.0,
        "start_progress": 0.5968757873519779,
        "end_progress": 0.6031746031746031
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 347.0,
        "end_time": 348.0,
        "start_progress": 0.6031746031746031,
        "end_progress": 0.6248425296044343
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 348.0,
        "end_time": 351.0,
        "start_progress": 0.6248425296044343,
        "end_progress": 0.6303854875283447
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 356.0,
        "end_time": 356.0,
        "start_progress": 0.6303854875283447,
        "end_progress": 0.6409674981103552
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 357.0,
        "end_time": 360.0,
        "start_progress": 0.6409674981103552,
        "end_progress": 0.6477702191987906
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 366.0,
        "end_time": 367.0,
        "start_progress": 0.6477702191987906,
        "end_progress": 0.6611237087427564
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 367.0,
        "end_time": 370.0,
        "start_progress": 0.6611237087427564,
        "end_progress": 0.6686822877299068
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 374.0,
        "end_time": 374.0,
        "start_progress": 0.6686822877299068,
        "end_progress": 0.6792642983119174
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 375.0,
        "end_time": 383.0,
        "start_progress": 0.6792642983119174,
        "end_progress": 0.691861929957168
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 388.0,
        "end_time": 388.0,
        "start_progress": 0.691861929957168,
        "end_progress": 0.6931216931216931
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 388.0,
        "end_time": 405.0,
        "start_progress": 0.6931216931216931,
        "end_progress": 0.7226001511715797
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 408.0,
        "end_time": 408.0,
        "start_progress": 0.7226001511715797,
        "end_progress": 0.72713529856387
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 410.0,
        "end_time": 414.0,
        "start_progress": 0.72713529856387,
        "end_progress": 0.7324263038548753
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 410.0,
        "end_time": 424.0,
        "start_progress": 0.7324263038548753,
        "end_progress": 0.7402368354749307
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 428.0,
        "end_time": 428.0,
        "start_progress": 0.7402368354749307,
        "end_progress": 0.7432602670697909
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 428.0,
        "end_time": 431.0,
        "start_progress": 0.7432602670697909,
        "end_progress": 0.7500629881582263
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 435.0,
        "end_time": 435.0,
        "start_progress": 0.7500629881582263,
        "end_progress": 0.7558578987150416
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes. For dessert, you order ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 439.0,
        "end_time": 441.0,
        "start_progress": 0.7558578987150416,
        "end_progress": 0.7619047619047619
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes. For dessert, you order crme brle for both of you, and you both agree that it's the best crme brle you've",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 446.0,
        "end_time": 446.0,
        "start_progress": 0.7619047619047619,
        "end_progress": 0.7838246409674982
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes. For dessert, you order crme brle for both of you, and you both agree that it's the best crme brle you've ever had. It even beats out the times you've ordered this dessert before. Michelle is thrilled with the surprise restaurant choice. She tells you she can't wait to watch ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 447.0,
        "end_time": 478.0,
        "start_progress": 0.7838246409674982,
        "end_progress": 0.8269085411942555
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes. For dessert, you order crme brle for both of you, and you both agree that it's the best crme brle you've ever had. It even beats out the times you've ordered this dessert before. Michelle is thrilled with the surprise restaurant choice. She tells you she can't wait to watch the movie that you rented, and she can't wait to get home and cuddle with you.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 483.0,
        "end_time": 483.0,
        "start_progress": 0.8269085411942555,
        "end_progress": 0.8465608465608465
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes. For dessert, you order crme brle for both of you, and you both agree that it's the best crme brle you've ever had. It even beats out the times you've ordered this dessert before. Michelle is thrilled with the surprise restaurant choice. She tells you she can't wait to watch the movie that you rented, and she can't wait to get home and cuddle with you. She has a twinkle in her eye, because ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 484.0,
        "end_time": 488.0,
        "start_progress": 0.8465608465608465,
        "end_progress": 0.8563869992441421
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes. For dessert, you order crme brle for both of you, and you both agree that it's the best crme brle you've ever had. It even beats out the times you've ordered this dessert before. Michelle is thrilled with the surprise restaurant choice. She tells you she can't wait to watch the movie that you rented, and she can't wait to get home and cuddle with you. She has a twinkle in her eye, because she knows what's going to happen after the movie.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 496.0,
        "end_time": 496.0,
        "start_progress": 0.8563869992441421,
        "end_progress": 0.8687326782564878
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes. For dessert, you order crme brle for both of you, and you both agree that it's the best crme brle you've ever had. It even beats out the times you've ordered this dessert before. Michelle is thrilled with the surprise restaurant choice. She tells you she can't wait to watch the movie that you rented, and she can't wait to get home and cuddle with you. She has a twinkle in her eye, because she knows what's going to happen after the movie. You can't wait either.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 503.0,
        "end_time": 503.0,
        "start_progress": 0.8687326782564878,
        "end_progress": 0.8745275888133031
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes. For dessert, you order crme brle for both of you, and you both agree that it's the best crme brle you've ever had. It even beats out the times you've ordered this dessert before. Michelle is thrilled with the surprise restaurant choice. She tells you she can't wait to watch the movie that you rented, and she can't wait to get home and cuddle with you. She has a twinkle in her eye, because she knows what's going to happen after the movie. You can't wait either. You're going to make love to your wife for the first time in 4 years.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 511.0,
        "end_time": 511.0,
        "start_progress": 0.8745275888133031,
        "end_progress": 0.892164273116654
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes. For dessert, you order crme brle for both of you, and you both agree that it's the best crme brle you've ever had. It even beats out the times you've ordered this dessert before. Michelle is thrilled with the surprise restaurant choice. She tells you she can't wait to watch the movie that you rented, and she can't wait to get home and cuddle with you. She has a twinkle in her eye, because she knows what's going to happen after the movie. You can't wait either. You're going to make love to your wife for the first time in 4 years. You're going to make love to your wife for the first time since you became President.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 517.0,
        "end_time": 517.0,
        "start_progress": 0.892164273116654,
        "end_progress": 0.9138321995464853
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes. For dessert, you order crme brle for both of you, and you both agree that it's the best crme brle you've ever had. It even beats out the times you've ordered this dessert before. Michelle is thrilled with the surprise restaurant choice. She tells you she can't wait to watch the movie that you rented, and she can't wait to get home and cuddle with you. She has a twinkle in her eye, because she knows what's going to happen after the movie. You can't wait either. You're going to make love to your wife for the first time in 4 years. You're going to make love to your wife for the first time since you became President. \n\nWhen the two of you get home, you spend the rest of the night watching the Titanic by James Cameron. And after that, ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 517.0,
        "end_time": 537.0,
        "start_progress": 0.9138321995464853,
        "end_progress": 0.9440665154950869
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes. For dessert, you order crme brle for both of you, and you both agree that it's the best crme brle you've ever had. It even beats out the times you've ordered this dessert before. Michelle is thrilled with the surprise restaurant choice. She tells you she can't wait to watch the movie that you rented, and she can't wait to get home and cuddle with you. She has a twinkle in her eye, because she knows what's going to happen after the movie. You can't wait either. You're going to make love to your wife for the first time in 4 years. You're going to make love to your wife for the first time since you became President. \n\nWhen the two of you get home, you spend the rest of the night watching the Titanic by James Cameron. And after that, you spend the rest of the night making love to your wife.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 542.0,
        "end_time": 542.0,
        "start_progress": 0.9440665154950869,
        "end_progress": 0.9584278155706727
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes. For dessert, you order crme brle for both of you, and you both agree that it's the best crme brle you've ever had. It even beats out the times you've ordered this dessert before. Michelle is thrilled with the surprise restaurant choice. She tells you she can't wait to watch the movie that you rented, and she can't wait to get home and cuddle with you. She has a twinkle in her eye, because she knows what's going to happen after the movie. You can't wait either. You're going to make love to your wife for the first time in 4 years. You're going to make love to your wife for the first time since you became President. \n\nWhen the two of you get home, you spend the rest of the night watching the Titanic by James Cameron. And after that, you spend the rest of the night making love to your wife. It's the best night of your life.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 546.0,
        "end_time": 546.0,
        "start_progress": 0.9584278155706727,
        "end_progress": 0.9669942050894432
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes. For dessert, you order crme brle for both of you, and you both agree that it's the best crme brle you've ever had. It even beats out the times you've ordered this dessert before. Michelle is thrilled with the surprise restaurant choice. She tells you she can't wait to watch the movie that you rented, and she can't wait to get home and cuddle with you. She has a twinkle in her eye, because she knows what's going to happen after the movie. You can't wait either. You're going to make love to your wife for the first time in 4 years. You're going to make love to your wife for the first time since you became President. \n\nWhen the two of you get home, you spend the rest of the night watching the Titanic by James Cameron. And after that, you spend the rest of the night making love to your wife. It's the best night of your life. It is quite the evening, because ",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 546.0,
        "end_time": 555.0,
        "start_progress": 0.9669942050894432,
        "end_progress": 0.9755605946082136
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes. For dessert, you order crme brle for both of you, and you both agree that it's the best crme brle you've ever had. It even beats out the times you've ordered this dessert before. Michelle is thrilled with the surprise restaurant choice. She tells you she can't wait to watch the movie that you rented, and she can't wait to get home and cuddle with you. She has a twinkle in her eye, because she knows what's going to happen after the movie. You can't wait either. You're going to make love to your wife for the first time in 4 years. You're going to make love to your wife for the first time since you became President. \n\nWhen the two of you get home, you spend the rest of the night watching the Titanic by James Cameron. And after that, you spend the rest of the night making love to your wife. It's the best night of your life. It is quite the evening, because you haven't had a night like this since you were a young man.",
        "source": "api",
        "last_event_time": 573.0,
        "start_time": 563.0,
        "end_time": 563.0,
        "start_progress": 0.9755605946082136,
        "end_progress": 0.9909297052154195
    },
    {
        "text": "You're Barack Obama. 4 years into your retirement, you awake to find a letter with no return address on your bedside table. It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be. JFK tells you that you have no choice, and that you will be picked up in an hour. \"No,\" you tell him. You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye. Moreover, you're not a young man anymore. And of course, Michelle is going to want you home. She's the one who convinced you that you should retire in the first place. She was always emphasizing how important it was to be home with the kids. Of course, Sasha and Malia are both in college now. Malia is at Harvard, and Sasha is at Princeton. But still, it would be awfully nice to do some weekend getaways to the beach. Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.\n\nJFK listens to your reasons and laughs. \"I'm sorry Barack, but you don't have a choice.\" \"But I do,\" you say, and you hang up the phone. You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down. She says that you've worked hard for 4 years, and you deserve to relax. Plus, now the two of you will have more time to spend together. You think about your plans for tonight, for example. The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home. And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know... Nope, you wouldn't turn down those plans for anything. It's been so long since you had a night in with Michelle to yourself. No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing. You tell Michelle you're going to get ready for dinner and she asks where the reservation is. You tell her that you didn't make one, but that's actually not true. You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her. The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before. It serves excellent food, and the atmosphere is very romantic. Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crme brle. Your mouth is salivating just thinking about the food. \n\nLater that evening, you whisk Michelle off to a fanciful night out at the Bistro. The waiter is attentive and the food is delicious. Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes. For dessert, you order crme brle for both of you, and you both agree that it's the best crme brle you've ever had. It even beats out the times you've ordered this dessert before. Michelle is thrilled with the surprise restaurant choice. She tells you she can't wait to watch the movie that you rented, and she can't wait to get home and cuddle with you. She has a twinkle in her eye, because she knows what's going to happen after the movie. You can't wait either. You're going to make love to your wife for the first time in 4 years. You're going to make love to your wife for the first time since you became President. \n\nWhen the two of you get home, you spend the rest of the night watching the Titanic by James Cameron. And after that, you spend the rest of the night making love to your wife. It's the best night of your life. It is quite the evening, because you haven't had a night like this since you were a young man. Thank goodness you turned down JFK!",
        "source": "user",
        "last_event_time": 573.0,
        "start_time": 563.0,
        "end_time": 573.0,
        "start_progress": 0.9909297052154195,
        "end_progress": 1.0
    }
]