[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack.",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": "but pack your bags and call the number below.",
        "source": "api"
    },
    {
        "text": "It's time to start the real job.",
        "source": "api"
    },
    {
        "text": "\" Signed simply, \"JFK.",
        "source": "api"
    },
    {
        "text": "\" You call up the number and tell JFK that you are unfortunately declining whatever the \"real job\" is supposed to be.",
        "source": "api"
    },
    {
        "text": "JFK tells you that you have no choice, and that you will be picked up in an hour.",
        "source": "user"
    },
    {
        "text": "\"No,\" you tell him.",
        "source": "api"
    },
    {
        "text": "You've retired for good reasons: you don't want to be in the spotlight, you don't want to be in politics, and you don't want to be in the public eye.",
        "source": "user"
    },
    {
        "text": "Moreover, you're not a young man anymore.",
        "source": "api"
    },
    {
        "text": "And of course, Michelle is going to want you home.",
        "source": "api"
    },
    {
        "text": "She's the one who convinced you that you should retire in the first place.",
        "source": "user"
    },
    {
        "text": "She was always emphasizing how important it was to be home with the kids.",
        "source": "api"
    },
    {
        "text": "Of course, Sasha and Malia are both in college now.",
        "source": "api"
    },
    {
        "text": "Malia is at Harvard, and Sasha is at Princeton.",
        "source": "api"
    },
    {
        "text": "But still, it would be awfully nice to do some weekend getaways to the beach.",
        "source": "api"
    },
    {
        "text": "Plus, you could always use the time to write your memoirs, or you could invite some of your old friends over for some poker games.",
        "source": "user"
    },
    {
        "text": "JFK listens to your reasons and laughs.",
        "source": "api"
    },
    {
        "text": "\"I'm sorry Barack, but you don't have a choice.",
        "source": "user"
    },
    {
        "text": "\" \"But I do,\" you say, and you hang up the phone.",
        "source": "api"
    },
    {
        "text": "You tell Michelle that JFK just spoke with you on the phone, and she says that she's glad you turned him down.",
        "source": "api"
    },
    {
        "text": "She says that you've worked hard for 4 years, and you deserve to relax.",
        "source": "api"
    },
    {
        "text": "Plus, now the two of you will have more time to spend together.",
        "source": "api"
    },
    {
        "text": "You think about your plans for tonight, for example.",
        "source": "user"
    },
    {
        "text": "The two of you have plans to go out to dinner, and then you're going to rent a movie and spend the night at home.",
        "source": "user"
    },
    {
        "text": "And of course, after the movie, there will be lots and lots of cuddling and kissing and then, well, you know.",
        "source": "api"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "Nope, you wouldn't turn down those plans for anything.",
        "source": "user"
    },
    {
        "text": "It's been so long since you had a night in with Michelle to yourself.",
        "source": "user"
    },
    {
        "text": "No emails, no constant texts, no phone calls, no meetings, no speeches, no dinners, no interviews, no nothing.",
        "source": "user"
    },
    {
        "text": "You tell Michelle you're going to get ready for dinner and she asks where the reservation is.",
        "source": "api"
    },
    {
        "text": "You tell her that you didn't make one, but that's actually not true.",
        "source": "user"
    },
    {
        "text": "You made a reservation at her favorite restaurant, but you didn't tell her because you wanted to surprise her.",
        "source": "user"
    },
    {
        "text": "The place is called the \"Bistro\" and it's a small French restaurant that you've been to a few times before.",
        "source": "api"
    },
    {
        "text": "It serves excellent food, and the atmosphere is very romantic.",
        "source": "api"
    },
    {
        "text": "Their specialties include escargot, steak frites, and the best wine in the city, but your favorite items are the chocolate mousse and the crème brûlée.",
        "source": "api"
    },
    {
        "text": "Your mouth is salivating just thinking about the food.",
        "source": "api"
    },
    {
        "text": "Later that evening, you whisk Michelle off to a fanciful night out at the Bistro.",
        "source": "user"
    },
    {
        "text": "The waiter is attentive and the food is delicious.",
        "source": "user"
    },
    {
        "text": "Michelle orders the ratatouille, and you order the steak frites, but you both steal bites of each other's dishes.",
        "source": "user"
    },
    {
        "text": "For dessert, you order crème brûlée for both of you, and you both agree that it's the best crème brûlée you've ever had.",
        "source": "user"
    },
    {
        "text": "It even beats out the times you've ordered this dessert before.",
        "source": "api"
    },
    {
        "text": "Michelle is thrilled with the surprise restaurant choice.",
        "source": "user"
    },
    {
        "text": "She tells you she can't wait to watch the movie that you rented, and she can't wait to get home and cuddle with you.",
        "source": "user"
    },
    {
        "text": "She has a twinkle in her eye, because she knows what's going to happen after the movie.",
        "source": "api"
    },
    {
        "text": "You can't wait either.",
        "source": "api"
    },
    {
        "text": "You're going to make love to your wife for the first time in 4 years.",
        "source": "api"
    },
    {
        "text": "You're going to make love to your wife for the first time since you became President.",
        "source": "api"
    },
    {
        "text": "When the two of you get home, you spend the rest of the night watching the Titanic by James Cameron.",
        "source": "api"
    },
    {
        "text": "And after that, you spend the rest of the night making love to your wife.",
        "source": "user"
    },
    {
        "text": "It's the best night of your life.",
        "source": "api"
    },
    {
        "text": "It is quite the evening, because you haven't had a night like this since you were a young man.",
        "source": "api"
    },
    {
        "text": "Thank goodness you turned down JFK!",
        "source": "api"
    }
]