[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "They only thing the alien knows is that Matt draws a crowd, and that has to be worth something.",
        "source": "user"
    },
    {
        "text": "The alien is a bit of a showman, and has decided to put on a show for his fellow aliens, with Matt Damon as the co-star and antagonist of sorts.",
        "source": "user"
    },
    {
        "text": "What the alien really wants, more than anything the people of Earth can trade for Matt's well being, is to be the star of a great show.",
        "source": "user"
    },
    {
        "text": "The show is a parody of the movie \"The Producers\", with the alien as Max Bialystock and Matt Damon as Leo Bloom, only done with a more intergalactic audience in mind.",
        "source": "user"
    },
    {
        "text": "He is trying his best to put on a comedic performance about the business of show business, which is something that all beings have in common.",
        "source": "user"
    },
    {
        "text": "Every species loves a good show.",
        "source": "user"
    },
    {
        "text": "The alien goes through the steps of contacting the people of Earth, demanding to speak to their leader because that's what aliens in stories do.",
        "source": "user"
    },
    {
        "text": "The shocked people of Earth send forth a proposal, which is actually pretty good but the alien isn't really interested in the trade value of Matt, he's in it for the credit.",
        "source": "user"
    },
    {
        "text": "He's a showman, and he knows that he's going to get a lot of it.",
        "source": "user"
    },
    {
        "text": "When the show is finally finished, he lets Matt go.",
        "source": "api"
    },
    {
        "text": "Matt, realizing that he has now expanded his resume to include an Intergalactic Entertainment Group credit, tells everyone that he was in on the show, the whole time.",
        "source": "user"
    },
    {
        "text": "He goes so far as to imply that he helped to write the script, though he knows that there was not script for this production.",
        "source": "user"
    },
    {
        "text": "Matt Damon, and the alien, are both happy with the outcome.",
        "source": "user"
    },
    {
        "text": "The moral of the story is that everyone in show business is lying, all the time.",
        "source": "api"
    }
]