[
    "You're Barack Obama.",
    "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
    "It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below.",
    "It's time to start the real job.\" Signed simply, \"JFK.\" A phone number follows.",
    "It is hard to tell where the phone number goes.",
    "It may be to a government office, or perhaps overseas.",
    "It could certainly be a trap.",
    "But...well, you're bored.",
    "You are bored and you are curious.",
    "You call the number, and it connects you to JFK.",
    "Or at least , his voice anyway.",
    "You know that there is technology that can mimic a voice.",
    "You realize that it would be very easy to fake a message from JFK, and that there is no way to prove that the message is actually from JFK, but you have to admit it's a pretty good message.",
    "JFK is urging you to go down to the graysons' house.",
    "He says there will be a note waiting for you there.",
    "You ask what is the graysons' house.",
    "You know that there is a graysons who lives somewhere in the town you live, but you've never been to his house.",
    "JFK says that you will know the house when you see it, and tells you to go there.",
    "You go to the house.",
    "When you get there JFK is there!",
    "He's sitting on the porch!",
    "He has been living here with no one knowing.",
    "He has been hiding in plain site.",
    "When you finally bring yourself to ask, he says that he's been here for 4 years, and that if anyone else had found him, they would blow his cover.",
    "He has called you for a simple reason.",
    "He wants to play chess.",
    "He felt you were the only one he could trust to reveal himself to and he just wants to hang out and play chess.",
    "You agree.",
    "You are so relieved that nothing very serious was going on.",
    "You end up playing chess with JFK once a week after that.",
    "You get very good at chess.",
    ""
]