[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "Today was Father's Day and I was excited to give my father a mug, that I had especially engraved with the words \"*#1 Dad\".",
        "source": "user"
    },
    {
        "text": "I even had the mug engraved with his name because I felt it added an extra touch of love.",
        "source": "user"
    },
    {
        "text": "My father was a strong, gentle man, who had always sacrificed so much with my mother, to make sure we had everything we needed growing up.",
        "source": "user"
    },
    {
        "text": "I woke up early that morning because I was so excited that I could not sleep.",
        "source": "user"
    },
    {
        "text": "I felt like a kid on Christmas morning waiting to open presents.",
        "source": "user"
    },
    {
        "text": "I heard my father get up to have his breakfast in the kitchen like he usually did every morning.",
        "source": "user"
    },
    {
        "text": "I ran into the kitchen and said \"Happy Father's Day dad\", and gave him a hug.",
        "source": "user"
    },
    {
        "text": "I then handed him the mug and told him that I loved him.",
        "source": "user"
    },
    {
        "text": "It was always easy to please my father, he was a man with simple taste.",
        "source": "user"
    },
    {
        "text": "My father looked at the mug with a giant smile and hugged me once more.",
        "source": "user"
    },
    {
        "text": "\"I love it\", he said to me and poured himself some hot coffee in his new mug.",
        "source": "user"
    },
    {
        "text": "I sat down at the table with him to have breakfast.",
        "source": "user"
    },
    {
        "text": "We had cereal together and when my mother got up to have breakfast, she made pancakes.",
        "source": "user"
    },
    {
        "text": "We all sat down together at the table to celebrate my father.",
        "source": "user"
    },
    {
        "text": "Suddenly, my father's expression changed into one of happiness to confusion.",
        "source": "user"
    },
    {
        "text": "I asked what was wrong and he said, \"the mug has changed\".",
        "source": "user"
    },
    {
        "text": "I did not know what he meant, so I looked at the mug, and to my shock, the mug no longer said \"#1 Dad\".",
        "source": "user"
    },
    {
        "text": "The mug now said \"#25th Dad\".",
        "source": "user"
    },
    {
        "text": "My father asked if it was some cruel joke.",
        "source": "user"
    },
    {
        "text": "How could the mug just change on its own?",
        "source": "user"
    },
    {
        "text": "Someone must have played a prank on me from the store where I bought the mug.",
        "source": "user"
    },
    {
        "text": "I told my father that I did not know what happened and that I would go back to the store to get a new mug.",
        "source": "user"
    },
    {
        "text": "He said it was okay and that I did not have to.",
        "source": "api"
    },
    {
        "text": "He became very sad and left the table.",
        "source": "user"
    },
    {
        "text": "I felt awful and wondered how I could make it right.",
        "source": "user"
    },
    {
        "text": "I went to the store and asked the clerk if there was anything that could be done.",
        "source": "user"
    },
    {
        "text": "The clerk looked at the mug and nothing had changed, it still said \"#1 Dad\".",
        "source": "api"
    },
    {
        "text": "I explained that it had changed back at home and he did not believe me.",
        "source": "user"
    },
    {
        "text": "He sent me away and said I was crazy.",
        "source": "user"
    },
    {
        "text": "When I returned home, my father said he would do everything in his power to become the best dad ever.",
        "source": "user"
    },
    {
        "text": "He started to work harder at his job and he came home earlier every day.",
        "source": "user"
    },
    {
        "text": "He spent more and more time with me and my mother.",
        "source": "api"
    },
    {
        "text": "He took us shopping and to special events in our community.",
        "source": "user"
    },
    {
        "text": "He even started to cook dinner every night.",
        "source": "user"
    },
    {
        "text": "He also read many books on how to become a better father.",
        "source": "api"
    },
    {
        "text": "It was a happy moment for us all because he was spending a lot of time with us, but it was also saddening because he felt unworthy of being a great father.",
        "source": "user"
    },
    {
        "text": "None of it was true, he was the best dad in the world to me.",
        "source": "user"
    },
    {
        "text": "I knew it, and my mother did as well, but he did not.",
        "source": "user"
    },
    {
        "text": "He became sad and depressed because he was using so much of his time and energy into becoming the best dad.",
        "source": "user"
    },
    {
        "text": "He had no time to spend with his friends and he even started to lose his hair.",
        "source": "user"
    },
    {
        "text": "He stopped going to work and had turned his back on his faith, his church.",
        "source": "api"
    },
    {
        "text": "He had become a different man and a different person.",
        "source": "user"
    },
    {
        "text": "He was no longer the father I knew and loved.",
        "source": "api"
    },
    {
        "text": "I felt like I was losing my father slowly, but surely.",
        "source": "user"
    },
    {
        "text": "My mother and I felt guilty for not seeing his downfall sooner.",
        "source": "api"
    },
    {
        "text": "We felt that we had taken him for granted.",
        "source": "user"
    },
    {
        "text": "We felt that we should have seen the signs and done something about it.",
        "source": "user"
    },
    {
        "text": "I realized that my father was the best dad because he had spent so much time with us, after the mug changed in front of his eyes.",
        "source": "api"
    },
    {
        "text": "It meant so much to him, that he did everything in his power to prove it to himself and us.",
        "source": "user"
    },
    {
        "text": "The next day, I approached my dad at home and had a long, hard talk with him.",
        "source": "user"
    },
    {
        "text": "I told him that he was the best dad in the world and that he did not have to prove it to anyone.",
        "source": "user"
    },
    {
        "text": "I said he was the \"#1 Dad\" to me and that the mug did not take that away from him.",
        "source": "api"
    },
    {
        "text": "He had always been there for my family and we loved him for that.",
        "source": "user"
    },
    {
        "text": "He was a great father and I did not need a mug to tell me that.",
        "source": "user"
    },
    {
        "text": "He looked at me and the sadness lifted from his face, his being, his essence.",
        "source": "api"
    },
    {
        "text": "He smiled, hugged me and told me that he loved me.",
        "source": "user"
    },
    {
        "text": "My family learned a tough lesson that day.",
        "source": "user"
    },
    {
        "text": "Material objects mean nothing, when you have each other.",
        "source": "api"
    }
]