[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She's unaware that she's actually been dating the same guy over and over; a shapeshifter who's fallen for her, and is certain he's going to get it right this time.",
        "source": "api"
    },
    {
        "text": "Her name is Lucy and she has a disorder called temporary amnesia where she totally forgets that she keeps on seeing the same guy.",
        "source": "user"
    },
    {
        "text": "The guy's name is Jake and he's generally quite good at changing his identity up to keep Lucy off of his tracks.",
        "source": "user"
    },
    {
        "text": "For example, sometimes he'll bump into Lucy at a coffee bar and he'll make some excuse for how he's really a coffee fiend.",
        "source": "user"
    },
    {
        "text": "Other times he'll bump into Lucy at a bookstore and say he's really a lover of all books.",
        "source": "user"
    },
    {
        "text": "And other times he bumps into her at a park and says he's really a nature lover.",
        "source": "user"
    },
    {
        "text": "It really depends on where he bumps into Lucy.",
        "source": "user"
    },
    {
        "text": "And he always makes up a new name and identity to go with his new hobby.",
        "source": "user"
    },
    {
        "text": "But Lucy always forgets and falls for him all over again, even though Jake really doesn't change up his appearance at all.",
        "source": "user"
    },
    {
        "text": "He's always the same guy.",
        "source": "user"
    },
    {
        "text": "Anyways, the issue with Jake is that he's a bit of a loser.",
        "source": "user"
    },
    {
        "text": "He can't really hold a steady job.",
        "source": "user"
    },
    {
        "text": "Whenever he takes Lucy out for a date, he always has to borrow money from his friend, Doug.",
        "source": "user"
    },
    {
        "text": "And oftentimes, Jake doesn't even have enough money to pay Doug back.",
        "source": "user"
    },
    {
        "text": "Sometimes, Jake has to borrow money from Doug just to pay Lucy back for the date.",
        "source": "user"
    },
    {
        "text": "It's a little embarrassing to Lucy that her date cannot even pay for a Chipotle burrito bowl for himself, let alone for the two of them.",
        "source": "user"
    },
    {
        "text": "In fact, Jake is so broke that he has to borrow money from Doug just to pay for the gas to drive to Lucy's house.",
        "source": "user"
    },
    {
        "text": "It's a little ridiculous to Lucy but she keeps forgetting Jake's issues because she is so smitten that a man could have so many hobbies in common with her.",
        "source": "user"
    },
    {
        "text": "Lucy and Jake's relationship is a bit of a mess.",
        "source": "user"
    },
    {
        "text": "But one day, Jake has made up his mind that he's really going to make it work with Lucy.",
        "source": "user"
    },
    {
        "text": "He puts on a suit and takes Lucy out for a nice dinner.",
        "source": "user"
    },
    {
        "text": "At dinner, he orders a bottle of wine and he's really trying to impress Lucy.",
        "source": "user"
    },
    {
        "text": "For his entree, he orders the lobster, which is the most expensive thing on the menu.",
        "source": "user"
    },
    {
        "text": "When he asks what Lucy wants, she initially says she wants the chicken, but Jake tells her that he's going to order the lobster and that she should too.",
        "source": "user"
    },
    {
        "text": "Lucy is concerned that she's going to be on the hook to pay for the dinner.",
        "source": "user"
    },
    {
        "text": "But Jake tells her that he's going to pay for the dinner, and that she should order whatever she wants.",
        "source": "user"
    },
    {
        "text": "Lucy whispers, \"Really?\" and Jake says, \"Yeah, I'm going to pay for it.\" So Lucy orders the lobster, but she's still a bit concerned that Jake is going to have to borrow money from Doug to pay for the dinner.",
        "source": "user"
    },
    {
        "text": "When the bill comes, Lucy holds her breath, because she's not sure if Jake has enough money to pay for the dinner.",
        "source": "user"
    },
    {
        "text": "But Jake actually does come up with the cash.",
        "source": "user"
    },
    {
        "text": "Lucy is so impressed that Jake is able to pay for the dinner that she decides to go home with him.",
        "source": "user"
    },
    {
        "text": "The two of them spend the rest of the evening together by watching a movie and cuddling on the couch, and then of course cuddling becomes a little more than cuddling.",
        "source": "user"
    },
    {
        "text": "The two of them make love all night long.",
        "source": "user"
    },
    {
        "text": "The next morning, Lucy wakes up and she's a bit confused.",
        "source": "user"
    },
    {
        "text": "She still doesn't know how Jake could pay for the dinner.",
        "source": "user"
    },
    {
        "text": "Jake tells her that he got a stable job as a surprise for her.",
        "source": "user"
    },
    {
        "text": "Lucy is thrilled!",
        "source": "user"
    },
    {
        "text": "Their relationship is finally able to take off now that Jake has the means to support Lucy.",
        "source": "user"
    }
]