[
    {
        "text": "All of the \"#1 Dad\" mugs in the world change to show the actual ranking of Dads suddenly.",
        "source": "api"
    },
    {
        "text": "Since there are millions of dads, some of the mugs with higher number are huge to be able to fit all of the digits on them.",
        "source": "user"
    },
    {
        "text": "You know that you had just ordered a mug for you father for Father's day, and it is arriving in the mail later on this afternoon.",
        "source": "user"
    },
    {
        "text": "You are so nervous to find out what will be on it.",
        "source": "user"
    },
    {
        "text": "Will it be \"#1 Dad\" or will it be \"#10 Dad\"?",
        "source": "user"
    },
    {
        "text": "What if he is ranked in the millions?",
        "source": "user"
    },
    {
        "text": "You know this would break his heart.",
        "source": "user"
    },
    {
        "text": "Your father is an avid watcher of the news, and you know he is aware of the rankings.",
        "source": "user"
    },
    {
        "text": "You see him sitting at the table staring off into space and looking so sad.",
        "source": "user"
    },
    {
        "text": "You go and sit quietly with him in the kitchen.",
        "source": "user"
    },
    {
        "text": "You are aware of the fear radiating from him, and you wish there was something you could say to help allay the sadness he feels.",
        "source": "user"
    },
    {
        "text": "As you are sitting there, you suddenly realize what might ease his pain.",
        "source": "user"
    },
    {
        "text": "You begin to tell him about all of the things you are grateful for in your relationship.",
        "source": "user"
    },
    {
        "text": "You start with your earliest memory of childhood when he fixed your rocking horse your sister broke.",
        "source": "user"
    },
    {
        "text": "Then you go on to speak about all of the camping trips you took together.",
        "source": "user"
    },
    {
        "text": "You remind him of traveling to Canada when other kids were stuck at home for the summer.",
        "source": "user"
    },
    {
        "text": "You see your father being drawn out of his shell, and notice his face seems lighter with happiness and less filled with worry.",
        "source": "user"
    },
    {
        "text": "You continue to talk about happy times.",
        "source": "user"
    },
    {
        "text": "The trip to Washington D.",
        "source": "user"
    },
    {
        "text": "C.",
        "source": "user"
    },
    {
        "text": ", riding the subway in Toronto, going to Florida on Spring break.",
        "source": "user"
    },
    {
        "text": "As you continue to talk, you notice that your dad is actually starting to smile.",
        "source": "user"
    },
    {
        "text": "He seems to have forgotten all about the mug, and is focused on what you are saying.",
        "source": "user"
    },
    {
        "text": "You notice that he is no longer even looking into space, but is now listening and responding to your stories.",
        "source": "api"
    },
    {
        "text": "The monologue continues.",
        "source": "user"
    },
    {
        "text": "You mention how he gave you away at your first wedding, and how he supported you went your second marriage was failing.",
        "source": "user"
    },
    {
        "text": "You thank him for picking up the pieces with you every time your life seemed to be coming apart.",
        "source": "user"
    },
    {
        "text": "The happiness he has given to you as you have gotten older, and the concern and love he shows for your children are more ways you are grateful to have him as your father.",
        "source": "user"
    },
    {
        "text": "Suddenly, the doorbell rings and you hear a package being left on the bench.",
        "source": "user"
    },
    {
        "text": "The fear return to your dad's face, and you are hesitant to get the item.",
        "source": "user"
    },
    {
        "text": "You slowly go to the door and being in the mug.",
        "source": "user"
    },
    {
        "text": "You hand the package to your father.",
        "source": "user"
    },
    {
        "text": "He looks at you, smiles, and open the box.",
        "source": "user"
    },
    {
        "text": "There is a huge mug with \"#1 Dad\" written on it.",
        "source": "user"
    },
    {
        "text": "Joy fills your father's face.",
        "source": "user"
    },
    {
        "text": "You both look into the box and see a small note inside the mug.",
        "source": "user"
    },
    {
        "text": "You know you didn't include anything with your gift and are curious to see what is on the note.",
        "source": "user"
    },
    {
        "text": "Your father picks up the paper and reads it.",
        "source": "user"
    },
    {
        "text": "His face is alight with pride, happiness, and pure joy.",
        "source": "user"
    },
    {
        "text": "He hands you the note.",
        "source": "user"
    },
    {
        "text": "It simply states \"You are the best and number 1 father for me. Thank you for everything.\" This is exactly how you feel about your dad.",
        "source": "user"
    },
    {
        "text": "You hug each other filled with the knowledge you have many more good memories to come.",
        "source": "user"
    }
]