[
    {
        "text": "You're Barack Obama.",
        "source": "api"
    },
    {
        "text": "4 years into your retirement, you awake to find a letter with no return address on your bedside table.",
        "source": "api"
    },
    {
        "text": "It reads \"I hope you've had a chance to relax Barack...but pack your bags and call the number below. It's time to start the real job.\" Signed simply, \"JFK.\"",
        "source": "api"
    },
    {
        "text": "So I, Barack Obama, packed my things and got ready to see what this was all about.",
        "source": "user"
    },
    {
        "text": "I had nothing better going on and wanted to see if this was somehow the real JFK.",
        "source": "user"
    },
    {
        "text": "I used the number on the letter, and he picked up personally.",
        "source": "api"
    },
    {
        "text": "\"How can this be?\" I asked the dead president.",
        "source": "user"
    },
    {
        "text": "\"I thought you were dead and buried.\" And he told me that he was still alive but this had been kept a secret from the public because the real JFK was.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": "an alien!",
        "source": "user"
    },
    {
        "text": "He told me about how he was taken in a UFO and they revealed to him the secrets of the universe.",
        "source": "api"
    },
    {
        "text": "And that humans kidnapped him as an alien baby in order to make him their future president.",
        "source": "user"
    },
    {
        "text": "His alien family had vowed to take revenge at just the right moment and according to JFK, that moment would soon arrive.",
        "source": "user"
    },
    {
        "text": "\"How can I help?\" I asked.",
        "source": "api"
    },
    {
        "text": "\"You have to save the Earth from my family. They will blow up the planet in 10 days if you don't stop them.\"",
        "source": "user"
    },
    {
        "text": "\"Where are they?\" I asked.",
        "source": "api"
    },
    {
        "text": "\"The mother ship is over the Pyramids of Egypt,\" said JFK.",
        "source": "user"
    },
    {
        "text": "So I came up with a plan.",
        "source": "user"
    },
    {
        "text": "I couldn't confront them directly, or they would blow up the planet.",
        "source": "api"
    },
    {
        "text": "So instead I decided to get some scientists to help me develop a force field to protect the planet from the aliens.",
        "source": "user"
    },
    {
        "text": "It took a lot of work but I convinced some scientists to help me.",
        "source": "api"
    },
    {
        "text": "We traveled to the pyramids and the scientists and their engineers built a magical force field and put it into place around the Earth.",
        "source": "user"
    },
    {
        "text": "When the aliens arrived and tried to blow up the planet, they discovered their plan was foiled by the force field.",
        "source": "user"
    },
    {
        "text": "Their plot for revenge had failed, thanks to JFK and Obama.",
        "source": "user"
    },
    {
        "text": "The Earth was still safe.",
        "source": "user"
    },
    {
        "text": "For now.",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    },
    {
        "text": ".",
        "source": "user"
    }
]