[
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.17616309461578672
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, one of the most important things that students should learn in schools is actually the entire process of learning.   At the beginning of the process of learning, you need to identify what is a good source of information versus a bad source of information.  For example, there are certain websites on the internet that are known for giving reliable information.  There are other websites that are not known for giving reliable information.  \n",
        "source": "user",
        "start_time": 16.0,
        "end_time": 187.0,
        "last_event_time": 187.0,
        "start_progress": 0.17616309461578672,
        "end_progress": 0.4066910611604809
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, one of the most important things that students should learn in schools is actually the entire process of learning.   At the beginning of the process of learning, you need to identify what is a good source of information versus a bad source of information.  For example, there are certain websites on the internet that are known for giving reliable information.  There are other websites that are not known for giving reliable information.   These sources may be good to read, but they are not reliable sources for getting factual information on a certain topic.\n",
        "source": "api",
        "start_time": 206.0,
        "end_time": 206.0,
        "last_event_time": 206.0,
        "start_progress": 0.4066910611604809,
        "end_progress": 0.46994249869315213
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, one of the most important things that students should learn in schools is actually the entire process of learning.   At the beginning of the process of learning, you need to identify what is a good source of information versus a bad source of information.  For example, there are certain websites on the internet that are known for giving reliable information.  There are other websites that are not known for giving reliable information.   These sources may be good to read, but they are not reliable sources for getting factual information on a certain topic.   For example, if a student is writing a paper on an ethical dilemma and wants to go get something from the internet as a source of information\n",
        "source": "api",
        "start_time": 227.0,
        "end_time": 227.0,
        "last_event_time": 227.0,
        "start_progress": 0.46994249869315213,
        "end_progress": 0.5452169367485624
    },
    {
        "text": "What Are the Most Important Things Students Should Learn in School?\n\nIn your opinion, what are the most important things students should learn in school? What is the most important thing you have learned in school? How has this knowledge affected your life? How do you think it will help your success in the future?\n\n---\n\nIn my opinion, one of the most important things that students should learn in schools is actually learning how to identify good sources of information.   While attempting to learn something new, you need to identify what is a good source of information versus a bad source of information.  For example, there are certain websites on the internet that are known for giving reliable information.  There are other websites that are not known for giving reliable information.   These sources may be good to read, but they are not reliable sources for getting factual information on a certain topic.   \n\nThis is something that can be taught in school.  For example, let's say a student is writing a paper on an ethical dilemma and wants to go get something from the internet as a source of information.   Certain teachers will only accept references from websites that are known to provide good information.   There are so many issues today in the real world where they have started the learning process on the wrong foot because they are using information from unreliable websites.\n\nThis is something that I learned during my years at school.  I would say that this is one of the more valuable lessons.  You only have a certain amount of time at school so you can't learn everything that you need to perform outside of school.  That is why you need to learn the proper way to approach learning.   I wish more adults could take a course in how to identify good sources.   We waste a lot of time on issues that could be eliminated once people realize they are using bad sources of information.\n\n \n",
        "source": "user",
        "start_time": 230.0,
        "end_time": 593.0,
        "last_event_time": 593.0,
        "start_progress": 0.5452169367485624,
        "end_progress": 1.0
    }
]