[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?\"",
        "source": "api"
    },
    {
        "text": "The voice is coming from the bee!",
        "source": "user"
    },
    {
        "text": "You frantically flip through your mental notes of all the things you've learned about bees.",
        "source": "user"
    },
    {
        "text": "You always knew they had a hive mind, but you didn't know that they could talk!",
        "source": "user"
    },
    {
        "text": "You quickly reason that you should try and get it off of you before it stings you.",
        "source": "user"
    },
    {
        "text": "You reach for the bee, hoping to pick it up and move it off your shoulder.",
        "source": "user"
    },
    {
        "text": "You grab the bee, and it stings you on your exposed wrist.",
        "source": "user"
    },
    {
        "text": "You feel a sharp pain, and a pinch, unlike any you've ever felt before.",
        "source": "user"
    },
    {
        "text": "Suddenly, you're aware of the entire hive's thoughts.",
        "source": "api"
    },
    {
        "text": "You know what everyone is doing, and you are given the ability to control every bee in the hive.",
        "source": "user"
    },
    {
        "text": "The only thing you can't feel is your own body.",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": "You feel powerful, but scared.",
        "source": "user"
    },
    {
        "text": "There's a sense of urgency, but you're not sure why.",
        "source": "user"
    },
    {
        "text": "The bees seem to feel like they're in danger, and will soon have to go into hiding.",
        "source": "api"
    },
    {
        "text": "What's more, you can feel the weather changing.",
        "source": "api"
    },
    {
        "text": "A powerful storm is coming, and soon.",
        "source": "user"
    },
    {
        "text": "You decide to send the bees away, before they're caught in the storm.",
        "source": "api"
    },
    {
        "text": "You work your magic, and the bees fly off as one big, controlled swarm.",
        "source": "user"
    },
    {
        "text": "You browse the human world, looking for somewhere safe for your bees to stay.",
        "source": "user"
    },
    {
        "text": "You find an abandoned house, big enough for the hive.",
        "source": "api"
    },
    {
        "text": "You give the bees some well-placed guiding thoughts, and soon they're all settled in.",
        "source": "user"
    },
    {
        "text": "You feel satisfied, knowing that your hive is safe.",
        "source": "user"
    },
    {
        "text": "You break contact with the other bees, and become aware of your body again.",
        "source": "user"
    },
    {
        "text": "You feel.",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": ".",
        "source": "api"
    },
    {
        "text": "tired, but good.",
        "source": "api"
    },
    {
        "text": "You look around, trying to figure out what happened.",
        "source": "api"
    },
    {
        "text": "You're still in the bee field, but all the bees are gone.",
        "source": "user"
    },
    {
        "text": "You decide to walk home, the buzzing in your head finally fading away.",
        "source": "api"
    },
    {
        "text": "How has this happened?",
        "source": "user"
    },
    {
        "text": "What does it mean for you?",
        "source": "user"
    },
    {
        "text": "You're not sure what you've gotten yourself into.",
        "source": "user"
    },
    {
        "text": "You just know that you have to keep your hive safe.",
        "source": "api"
    },
    {
        "text": "You won't let anything happen to them.",
        "source": "api"
    },
    {
        "text": "You're their queen.",
        "source": "api"
    }
]