[
    {
        "text": "Once upon a time there was an old mother pig who had one hundred little pigs and not enough food to feed them.",
        "source": "api"
    },
    {
        "text": "So when they were old enough, she sent them out into the world to seek their fortunes.",
        "source": "api"
    },
    {
        "text": "You know the story about the first three little pigs.",
        "source": "api"
    },
    {
        "text": "This is a story about the 92nd little pig.",
        "source": "api"
    },
    {
        "text": "The 92nd little pig built a house out of depleted uranium.",
        "source": "api"
    },
    {
        "text": "And the wolf was like, \"dude, there's no way I'll be able to blow this house down.",
        "source": "api"
    },
    {
        "text": "I'll have to come up with another plan.",
        "source": "user"
    },
    {
        "text": "\" So the wolf thought of other ways he could blow the little pig's house to get to him.",
        "source": "api"
    },
    {
        "text": "The wolf thought, \"I'll blow the house down with a bunch of dynamite.",
        "source": "user"
    },
    {
        "text": "\" And he went to find some dynamite to blow up the uranium house.",
        "source": "user"
    },
    {
        "text": "The wolf purchased a bundle of dynamite and he brought it back to the house.",
        "source": "user"
    },
    {
        "text": "He was sure this would work.",
        "source": "api"
    },
    {
        "text": "He lit the fuse and threw the dynamite at the house.",
        "source": "user"
    },
    {
        "text": "It created an explosion, throwing dirt and twigs everywhere.",
        "source": "api"
    },
    {
        "text": "But as the dust settled, the wolf could see the house was still standing.",
        "source": "user"
    },
    {
        "text": "The 92nd little piggy came outside of his house and said to the wolf, \"I don't know what you're trying to do, but you're not going to blow my house down.",
        "source": "user"
    },
    {
        "text": "I'm a smart piggy and I've made it out on my own and I have built the strongest house there is.",
        "source": "api"
    },
    {
        "text": "You're not going to blow it down.",
        "source": "user"
    },
    {
        "text": "\" \nThe wolf thought \"Oh, i see.",
        "source": "api"
    },
    {
        "text": "well if I can't destroy this house I must find another way to get to the piggy inside.",
        "source": "user"
    },
    {
        "text": "I'll wait until he falls asleep and then I'll sneak in and eat him.",
        "source": "user"
    },
    {
        "text": "\" So that night the wolf waited until all of the 92nd piggy's lights were out and tried to break in while he was sleeping.",
        "source": "api"
    },
    {
        "text": "He tried to sneak in quietly, but the 92nd little piggy heard the wolf and he woke up.",
        "source": "user"
    },
    {
        "text": "He had a lazer shooter ready to aim at the wolf.",
        "source": "api"
    },
    {
        "text": "He said, \"I've got you now, wolf.",
        "source": "user"
    },
    {
        "text": "\"\nAfter a long standoff, the wolf surrendered and let the 92nd little pig and his house be.",
        "source": "api"
    },
    {
        "text": "The wolf's sharp teeth were no match for the piggy because the 92nd little dude was armed with intelligence and preparedness.",
        "source": "user"
    }
]