[
    {
        "text": "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
        "source": "api"
    },
    {
        "text": "The alien has been watching Matt Damon movies and has mistaken him for a hero.",
        "source": "user"
    },
    {
        "text": "They want his help to stop another race of aliens that are trying to wipe them out.",
        "source": "user"
    },
    {
        "text": "Matt Damon is reluctant to help, but the alien has kidnapped his wife, so he has no choice.",
        "source": "user"
    },
    {
        "text": "They give him guns and set him on a large alien planet.",
        "source": "user"
    },
    {
        "text": "He spends a while trying to figure out how these alien guns even work.",
        "source": "user"
    },
    {
        "text": "He eventually finds the enemy base and starts shooting.",
        "source": "user"
    },
    {
        "text": "The gun is very strong and blows a hole in one of the walls.",
        "source": "user"
    },
    {
        "text": "He goes inside and the aliens see who he is.",
        "source": "user"
    },
    {
        "text": "They drop their weapons and begin holding out pieces of paper to get autographs.",
        "source": "user"
    },
    {
        "text": "Matt Damon is confused, but he signs them anyway.",
        "source": "user"
    },
    {
        "text": "Were all aliens fans of Matt Damon?",
        "source": "user"
    },
    {
        "text": "He then puts his weapon down.",
        "source": "user"
    },
    {
        "text": "He can't harm them, even to save his wife.",
        "source": "user"
    },
    {
        "text": "He decides that maybe he can work out a peace deal between the alien groups.",
        "source": "user"
    },
    {
        "text": "He calls both sides together and begins talking his way through a peace treaty.",
        "source": "user"
    },
    {
        "text": "He's not sure how much if anything they can understand.",
        "source": "user"
    },
    {
        "text": "What he does notice is how captivated both sides are by him.",
        "source": "user"
    },
    {
        "text": "They are hanging on his every word.",
        "source": "user"
    },
    {
        "text": "Eventually it seems to work.",
        "source": "user"
    },
    {
        "text": "They all drop their weapons and seem to have reached some kind of agreement.",
        "source": "user"
    },
    {
        "text": "The original group of aliens take him to a ship that has his wife.",
        "source": "user"
    },
    {
        "text": "They embrace and are relieved that this is finally over.",
        "source": "user"
    },
    {
        "text": "The aliens thank him for his help and he's happy to have helped.",
        "source": "user"
    },
    {
        "text": "Everything seems like it will be fine.",
        "source": "user"
    },
    {
        "text": "Then he remembers that earth will do anything to get Matt Damon back.",
        "source": "user"
    },
    {
        "text": "He looks out a window and sees a ship.",
        "source": "user"
    },
    {
        "text": "It's a rescue crew from earth to bring him back.",
        "source": "user"
    },
    {
        "text": "The aliens open fire and a battle breaks out.",
        "source": "user"
    },
    {
        "text": "Yet again Matt Damon must help create peace between species.",
        "source": "user"
    },
    {
        "text": "He just repeats what he did last time and it works.",
        "source": "user"
    },
    {
        "text": "Both sides drop their weapons.",
        "source": "user"
    },
    {
        "text": "He and his wife then go with the crew from earth.",
        "source": "user"
    },
    {
        "text": "On the way home a fight breaks out among the crew.",
        "source": "user"
    },
    {
        "text": "He goes about creating peace yet again because of course he is Matt Damon.",
        "source": "user"
    }
]