[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?\" I think to myself, \"where is this voice coming from?  It can't be from this tiny creature I was taught to fear my whole life, could it?\"",
        "source": "api"
    },
    {
        "text": "I look down at the bee, and it looks back at me.",
        "source": "api"
    },
    {
        "text": "In that instant, I began to realize that bees aren't these mean and scary creatures I was once taught to believe.",
        "source": "user"
    },
    {
        "text": "Buy why was it calling me \"your majesty?\"",
        "source": "user"
    },
    {
        "text": "I look around, and I notice that I'm not in my bedroom anymore.",
        "source": "api"
    },
    {
        "text": "I have been magically transported to a world that is covered in sweet golden perfection.",
        "source": "user"
    },
    {
        "text": "A world made of honeycomb walls and beehive furniture.",
        "source": "user"
    },
    {
        "text": "I was in a castle.",
        "source": "user"
    },
    {
        "text": "I was sitting in a throne.",
        "source": "user"
    },
    {
        "text": "Atop my head was a crown that was made with diamonds that shined brighter than the sun.",
        "source": "user"
    },
    {
        "text": "What is going on here?",
        "source": "user"
    },
    {
        "text": "?",
        "source": "user"
    },
    {
        "text": "?",
        "source": "user"
    },
    {
        "text": "A voice booms from the ceiling, \"Welcome, your majesty!  \nI reply, \"Thank you.",
        "source": "api"
    },
    {
        "text": "But, why am I here.",
        "source": "user"
    },
    {
        "text": "I don't understand what is going on.",
        "source": "user"
    },
    {
        "text": "\"\n\n\"Your majesty, you have been chosen to lead the bees.",
        "source": "user"
    },
    {
        "text": "Your whole life you have been running from us.",
        "source": "user"
    },
    {
        "text": "But this whole time, we have been trying to find you.",
        "source": "user"
    },
    {
        "text": "You see, we are not scary and malicious insects that some people have lead you to see as the truth.",
        "source": "user"
    },
    {
        "text": "We are a group of insects that are kind, caring, and are just trying to pollinate the world so that we can continue to provide fruit and honey to all of earth's creatures.",
        "source": "user"
    },
    {
        "text": "You were chosen a long time ago as our queen, and now here you are.\"",
        "source": "user"
    },
    {
        "text": "\"",
        "source": "api"
    },
    {
        "text": "I look around the room, and I notice that there are thousands of bees surrounding me.",
        "source": "api"
    },
    {
        "text": "To be honest, I am starting to feel quite flattered by all the attention.",
        "source": "user"
    },
    {
        "text": "I am also starting to feel a little bit more confident about my new role as queen.",
        "source": "user"
    },
    {
        "text": "Sometimes in life we are told that things are scary and bad.",
        "source": "user"
    },
    {
        "text": "However, in reality, they are much different.",
        "source": "user"
    },
    {
        "text": "We just have to be open to them.",
        "source": "user"
    },
    {
        "text": "And that is what I have realized.",
        "source": "user"
    },
    {
        "text": "So with my new found sense of respect for my bee friends, I lived happily every after as queen bee.",
        "source": "user"
    }
]