[
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion,\n",
        "source": "api",
        "start_time": 0.0,
        "end_time": 0.0,
        "last_event_time": 0.0,
        "start_progress": 0,
        "end_progress": 0.20906113537117904
    },
    {
        "text": "Should Schools Provide Free Pads and Tampons?\n\nHave you ever experienced period shaming, or “period poverty”? Should schools step in to help? Should schools be required to provide free pads and tampons to students? How are pads and tampons similar to toilet paper, soap, Band-Aids and other products that are already provided in schools? How are they different?\n\n---\n\nIn my opinion, this topic needs to be decided by the girls and mothers in each school district. It's not really fair for me to comment on something like this but my opinion would be to obviously provide tampons and pads for female students in school. \n\nWhen I look at a topic like this, I ask myself what the downsides are of the schools providing these items to students. I really can't think of any as long as they are distributed in a discreet way. \n\nI don't think anyone wants to have a teacher walk into a class and hand students tampons. All eyes will be on them and they will be vulnerable and embarrassed. \n\nTo me pads, tampons, toilet paper, paper towels and soap are all basically the same thing. They all involve personal hygiene. They all are items designed to help keep us clean. Why should there be a differentiation between the items?\n\nThe only difference I see between items such as tampons and pads and items such as soap is that tampons and pads are embarrassing to talk about and receive. \n\nI feel like tampons and pads have the same stigma that condoms have. They're items that are somewhat embarrassing to buy. And that's a shame. Because ultimately nobody should have to feel embarrassed about buying things that are used to protect them.\n\nMy opinion is simply that each school should have an anonymous vote where only the female students are allowed to vote. Whatever they say goes. That is the best course of action and also the most fair.\n",
        "source": "user",
        "start_time": 15.0,
        "end_time": 559.0,
        "last_event_time": 559.0,
        "start_progress": 0.20906113537117904,
        "end_progress": 1.0
    }
]