[
    {
        "text": "Your entire life, you've been told you're deathly allergic to bees.",
        "source": "api"
    },
    {
        "text": "You've always had people protecting you from them, be it your mother or a hired hand.",
        "source": "api"
    },
    {
        "text": "Today, one slips through and lands on your shoulder.",
        "source": "api"
    },
    {
        "text": "You hear a tiny voice say \"Your Majesty, what are your orders?",
        "source": "api"
    },
    {
        "text": "\" \n\n\"Well hello,\" I said to the bee.",
        "source": "api"
    },
    {
        "text": "\"I'm not really in the mood of issuing any orders.",
        "source": "user"
    },
    {
        "text": "\" The bee buzzed slightly and hovered around me.",
        "source": "api"
    },
    {
        "text": "I wondered why the bee called be your majesty but I thought I would play along.",
        "source": "api"
    },
    {
        "text": "\"What would you like to have me do?",
        "source": "user"
    },
    {
        "text": "\" I asked the bee.",
        "source": "api"
    },
    {
        "text": "\"You must issue an order,\" said the bee.",
        "source": "user"
    },
    {
        "text": "And this gave me a great idea.",
        "source": "api"
    },
    {
        "text": "Since I could give the bees orders , I could tell them to do whatever I wanted.",
        "source": "user"
    },
    {
        "text": "And this could include not stinging me.",
        "source": "api"
    },
    {
        "text": "Since I'm allergic that would be nice.",
        "source": "user"
    },
    {
        "text": "\"Alright,\" I said to the bee.",
        "source": "user"
    },
    {
        "text": "\"I'll give this one order.",
        "source": "api"
    },
    {
        "text": "Tell all of the bees that none of them can sting me.",
        "source": "user"
    },
    {
        "text": "\" The bee buzzed and nodded.",
        "source": "user"
    },
    {
        "text": "He went and told the rest of the bees my message.",
        "source": "api"
    },
    {
        "text": "\"They say they will do so.",
        "source": "user"
    },
    {
        "text": "\" said the bee.",
        "source": "api"
    },
    {
        "text": "And I was so glad because I never had to worry about the bees stinging me again.",
        "source": "api"
    },
    {
        "text": "But I still wondered why the bee thought I was his queen.",
        "source": "user"
    },
    {
        "text": "\"By the way, why did you call me your majesty?",
        "source": "user"
    },
    {
        "text": "Why do you think I'm your queen?",
        "source": "api"
    },
    {
        "text": "\" The bee buzzed and flew over to the flower on the other side of the room.",
        "source": "user"
    },
    {
        "text": "I guess he didn't want to tell me.",
        "source": "api"
    },
    {
        "text": "But at least I didn't have to worry about the bees stinging me.",
        "source": "user"
    },
    {
        "text": "My allergy was gone and I could live a normal life.",
        "source": "api"
    },
    {
        "text": "I just wished the bee would have told me why he thought I was his queen.",
        "source": "api"
    },
    {
        "text": "The next day I saw the bee again and asked him why he thought I was the queen.",
        "source": "api"
    },
    {
        "text": "He buzzed and said \"My queen, you are the most beautiful woman I have ever seen.",
        "source": "user"
    },
    {
        "text": "\" I was so flattered by this.",
        "source": "api"
    },
    {
        "text": "I had no idea the bees thought I was beautiful enough to be their queen.",
        "source": "api"
    },
    {
        "text": "My bee and I made a promise to be friends forever.",
        "source": "user"
    },
    {
        "text": "And I never had to worry about getting stung or having bee allergies again.",
        "source": "api"
    }
]