[
    "An alien has kidnapped Matt Damon, not knowing what lengths humanity goes through to retrieve him whenever he goes missing.",
    "At first, they posted flyers saying he was missing.",
    "And then it was on the news.",
    "And then they had a press conference.",
    "Ben Affleck was the head of press.",
    "He organized a search party.",
    "There were people everywhere.",
    "They had dogs tracking his scent.",
    "They followed a trail where they could trace him.",
    "They were looking for him in the woods.",
    "They found his wallet.",
    "All of its contents were still inside, including cash.",
    "They found his shoes.",
    "And then they found the same pair of shoes again.",
    "How strange.",
    "Why would he leave behind two pairs of shoes?",
    "They kept looking.",
    "They found his hat.",
    "And then they found the same hat- again!",
    "They found his shirt, and then found the same shirt again.",
    "What was going on?",
    "They found his pants, and then found the same pants again.",
    "\"Are you sure we're looking for the right guy?\" said Ben Affleck.",
    "\"I think we should stop looking for him and just wait for him to come back,\" said Ben Affleck.",
    "Just then, they heard a sound coming from behind a tree.",
    "It was Matt Damon!",
    "They ran over to him, when they heard a sound coming from behind another tree a few yards away.",
    "They froze as they watched someone emerge from behind the tree.",
    "It was Matt Damon!",
    "\"Matt Damon!\" they all shouted.",
    "\"Wait a minute!\" shouted Ben Affleck.",
    "\"That's not Matt Damon!\" \n\n\"Yes I am!\" shouted Matt Damon, with his hands up in the air.",
    "\"I'm Matt Damon!\"\n\n\"No, I'm Matt Damon!\" shouted the Matt Damon from the first tree.",
    "\"He's the one that kidnapped me!",
    "Please, ya gotta believe me!\" \n\n\"I'm Matt Damon!\" shouted the Matt Damon from the second tree.",
    "\"I was kidnapped!",
    "Please, ya gotta believe me!\"\n\nBen Affleck didn't know what to do.",
    "There wasn't enough time to think it out.",
    "He had to act quick.",
    "He drew his gun and shot the Matt Damon from the first tree.",
    "Then he turned to the other Matt Damon and shot him too.",
    "Everyone on the search team gasped in horror, but Ben Affleck just shrugged.",
    "\"How do ya like them apples?\"\n"
]