[
    {
        "text": "A woman has been dating guy after guy, but it never seems to work out.",
        "source": "api"
    },
    {
        "text": "She’s unaware that she’s actually been dating the same guy over and over; a shapeshifter who’s fallen for her, and is certain he’s going to get it right this time.",
        "source": "api"
    },
    {
        "text": "One day, she meets a guy who’s different from all the others: he's polite, handsome and very charming.",
        "source": "api"
    },
    {
        "text": "She begins dating him, and everything is going well.",
        "source": "user"
    },
    {
        "text": "She's about to tell him how she feels, but suddenly a terrible thought occurs to her and she pushes him away.",
        "source": "user"
    },
    {
        "text": "The man gives her space but about two weeks later runs into her at a coffee shop.",
        "source": "user"
    },
    {
        "text": "They make small talk and the woman starts to realize she made a mistake.",
        "source": "user"
    },
    {
        "text": "Luckily for her, she receives a text on her phone from the man telling her how much he misses her and how he'd like to give it a go again.",
        "source": "user"
    },
    {
        "text": "She tells him she'd like to give it a go again as well.",
        "source": "user"
    },
    {
        "text": "The two have a date at a carnival.",
        "source": "user"
    },
    {
        "text": "The two of them are having a great time eating fried oreos and playing games.",
        "source": "user"
    },
    {
        "text": "The man even won her a giant oversized stuffed teddy bear by playing darts.",
        "source": "user"
    },
    {
        "text": "The woman is surprised and relieved that the man's personality hasn't changed at all since they broke up.",
        "source": "user"
    },
    {
        "text": "She thought she had ruined everything but was beginning to think he was the one.",
        "source": "user"
    },
    {
        "text": "Months go by and the couple are getting closer and closer when the man finally admits to her that he is a shapeshifter.",
        "source": "user"
    },
    {
        "text": "She has actually been dating him over and over for months.",
        "source": "user"
    },
    {
        "text": "He had so much interest in her he couldn't let her go and had to find out what type of man she was interested in.",
        "source": "user"
    },
    {
        "text": "The woman is taken back by the revelation and informs him that she's going to go stay with her grandmother for a while to think everything over.",
        "source": "user"
    },
    {
        "text": "She speaks to her grandmother and tells her she can't trust the man because he tricked her.",
        "source": "user"
    },
    {
        "text": "The grandmother explains that while that may be true, she should really think about how much effort he put in to please her.",
        "source": "user"
    },
    {
        "text": "A few more weeks go by and the woman makes up her mind.",
        "source": "user"
    },
    {
        "text": "She wants to give the two of them another try, but she doesn't want to be deceived again.",
        "source": "user"
    },
    {
        "text": "She tells the man that he is to come of his normal form and they will go on a date.",
        "source": "user"
    },
    {
        "text": "The man agrees, respects her wishes and transforms into himself right in front of her.",
        "source": "user"
    },
    {
        "text": "The two go on another date and find they have a lot more in common than they previously had thought.",
        "source": "user"
    },
    {
        "text": "The woman asks the man why he tricked her and he explained that he had confidence issues and didn't think she'd give him the time of day.",
        "source": "user"
    },
    {
        "text": "He told her he was trying to find out what kind of guy she was looking for and found that he wasn't that person.",
        "source": "user"
    },
    {
        "text": "However, the woman agreed to go on a second date with the real man.",
        "source": "user"
    },
    {
        "text": "And a third.",
        "source": "user"
    },
    {
        "text": "And a fourth.",
        "source": "user"
    },
    {
        "text": "They got so close that in the end they got married and had two children.",
        "source": "user"
    },
    {
        "text": "It was a fairytale of sorts with a beautiful ending and one that nobody expected.",
        "source": "user"
    },
    {
        "text": "Not the shapeshifter, nor the woman.",
        "source": "user"
    },
    {
        "text": "Fate is funny sometimes.",
        "source": "user"
    }
]