[
    {
        "text": "Following World War III, all the nations of the world agreed to 50 years of strict isolation from one another in order to prevent additional conflicts.",
        "source": "api"
    },
    {
        "text": "50 years later, the United States comes out of exile, only to learn that no one else went into isolation.",
        "source": "api"
    },
    {
        "text": "The nation is trying to get used to life again.",
        "source": "api"
    },
    {
        "text": "However, there’s still a problem that they need to face.",
        "source": "user"
    },
    {
        "text": "It turns out that the asteroids that were supposed to hit the Earth actually missed it.",
        "source": "api"
    },
    {
        "text": "All of the emergency planning and preparedness was done for nothing.",
        "source": "api"
    },
    {
        "text": "People have years worth of food and supplies stored away that can now be used or given away.",
        "source": "user"
    },
    {
        "text": "People are celebrating this new time in their lives.",
        "source": "user"
    },
    {
        "text": "They are sharing their resources and having fun.",
        "source": "user"
    },
    {
        "text": "Suddenly an unknown, mysterious illness has been appearing.",
        "source": "user"
    },
    {
        "text": "No one is certain where it is coming from.",
        "source": "api"
    },
    {
        "text": "When people get sick, they don’t live long.",
        "source": "user"
    },
    {
        "text": "One theory is that the illness is from the water supply.",
        "source": "api"
    },
    {
        "text": "Others think it’s from the food supply.",
        "source": "user"
    },
    {
        "text": "The only people that are not getting sick are children and anyone under the age of 18.",
        "source": "api"
    },
    {
        "text": "At a government meeting, the adults realize that they are now dying out.",
        "source": "user"
    },
    {
        "text": "The future will be in the hands of the children.",
        "source": "api"
    },
    {
        "text": "The children decide to do things differently from their parents.",
        "source": "user"
    },
    {
        "text": "They will make a new set of rules.",
        "source": "api"
    },
    {
        "text": "No one will be allowed to have more than they need.",
        "source": "user"
    },
    {
        "text": "Everyone will have a nice house.",
        "source": "api"
    },
    {
        "text": "Everyone will have fun.",
        "source": "user"
    },
    {
        "text": "Everyone will have clean water to drink.",
        "source": "user"
    },
    {
        "text": "It's simple.",
        "source": "api"
    },
    {
        "text": "It's fair.",
        "source": "api"
    },
    {
        "text": "They called it Utopia.",
        "source": "api"
    },
    {
        "text": "The children do as they said they would.",
        "source": "api"
    },
    {
        "text": "For a time, Utopia was the greatest place on earth.",
        "source": "api"
    },
    {
        "text": "Everyone always had everything they needed.",
        "source": "user"
    },
    {
        "text": "Now the oldest children were growing up and becoming adults.",
        "source": "api"
    },
    {
        "text": "They were getting grouchy and not wanting to have fun anymore.",
        "source": "user"
    },
    {
        "text": "They stopped following the rules of Utopia.",
        "source": "user"
    },
    {
        "text": "Some of them started to eat all the food themselves and didn't share it with anyone.",
        "source": "user"
    },
    {
        "text": "They wanted to make rules about who can have clean water.",
        "source": "api"
    },
    {
        "text": "Who can have nice houses.",
        "source": "user"
    },
    {
        "text": "The kids of Utopia decided enough was enough.",
        "source": "user"
    },
    {
        "text": "They went to war against the adults.",
        "source": "user"
    },
    {
        "text": "The war did not last long, because the kids realized they were against war.",
        "source": "user"
    },
    {
        "text": "They did not fight.",
        "source": "user"
    },
    {
        "text": "The adults ended up fighting themselves and dying out by the end of the year.",
        "source": "user"
    },
    {
        "text": "And the kids reigned on.",
        "source": "user"
    }
]